////////////////////////////////////////////////////////////////////////////////
// Содержит события форм, вызываемые на клиенте
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Выполняет переопределяемую команду
//
// Параметры:
//  Форма	- ФормаКлиентскогоПриложения - форма, в которой расположена команда
//  Команда	- КомандаФормы - команда формы
//  ДополнительныеПараметры	- Структура - дополнительные параметры.
//
Процедура ВыполнитьПереопределяемуюКоманду(Форма, Команда, ДополнительныеПараметры = Неопределено) Экспорт
	
	уатРаботаСРасширениямиКлиент.ВыполнитьПереопределяемуюКоманду(Форма, Команда, ДополнительныеПараметры);
	
КонецПроцедуры

// Процедура, вызываемая из одноименного обработчика события формы.
//
// Параметры:
//  Форма					- ФормаКлиентскогоПриложения - форма, из обработчика события которой происходит вызов процедуры.
//  ИмяСобытия				- Строка - идентификатор сообщения принимающей формой (см. метод Оповестить)
//	Параметр				- Произвольный - параметр сообщения (см. метод Оповестить)
//	Источник				- Произвольный - источник события (см. метод Оповестить)
//  ДополнительныеПараметры	- Структура - дополнительные параметры.
//
Процедура ОбработкаОповещения(Форма, ИмяСобытия, Параметр, Источник, ДополнительныеПараметры = Неопределено) Экспорт

	уатРаботаСРасширениямиКлиент.ОбработкаОповещения(Форма, ИмяСобытия, Параметр, Источник, ДополнительныеПараметры);
	
КонецПроцедуры

// Процедура, вызываемая из одноименного обработчика события формы.
//
// Параметры:
//  Форма					- ФормаКлиентскогоПриложения - форма, из обработчика события которой происходит вызов процедуры.
//  Отказ					- Булево - признак отказа от записи документа
//	ПараметрыЗаписи			- Структура - параметры записи (см. событие ПередЗаписью).
//
Процедура ПередЗаписью(Форма, Отказ, ПараметрыЗаписи) Экспорт
	
	уатРаботаСРасширениямиКлиент.ПередЗаписью(Форма, Отказ, ПараметрыЗаписи);
	
КонецПроцедуры

// Переопределяемая процедура, вызываемая из одноименного обработчика события формы.
//
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения - форма, из обработчика события которой происходит вызов процедуры.
//	ПараметрыЗаписи - Структура - параметры записи (см. событие ПослеЗаписи).
//
Процедура ПослеЗаписи(Форма, ПараметрыЗаписи) Экспорт
	
	уатРаботаСРасширениямиКлиент.ПослеЗаписи(Форма, ПараметрыЗаписи);
	
КонецПроцедуры

// Переопределяемая процедура, вызываемая из одноименного обработчика события формы.
//
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения - форма, из обработчика события которой происходит вызов процедуры.
//  Отказ	- Булево - признак отказа от открытия формы.
//
Процедура ПриОткрытии(Форма, Отказ) Экспорт  
	
	уатРаботаСРасширениямиКлиент.ПриОткрытии(Форма, Отказ); 
	
КонецПроцедуры


#Область СобытияЭлементовФорм

// Переопределяемая процедура, вызываемая из одноименного обработчика события элемента.
//
// Параметры:
//   Форма                   - ФормаКлиентскогоПриложения - форма, из которой происходит вызов процедуры.
//   Элемент                 - Произвольный     - элемент-источник события "При изменении".
//   ДополнительныеПараметры - Структура        - значения дополнительных параметров влияющих на обработку события.
//
Процедура ПриИзмененииЭлемента(Форма, Элемент, ДополнительныеПараметры = Неопределено) Экспорт
	
	уатРаботаСРасширениямиКлиент.ПриИзмененииЭлемента(Форма, Элемент, ДополнительныеПараметры);
	
КонецПроцедуры

// Переопределяемая процедура, вызываемая из одноименного обработчика события элемента.
//
// Параметры:
//  Форма					 - ФормаКлиентскогоПриложения - форма, из которой происходит вызов процедуры.
//  Элемент					 - Произвольный - элемент-источник события "При выборе элемента".
//  ВыбраннаяСтрока			 - Произвольный - значение выбранной строки.
//  Поле					 - ПолеФормы - Активное поле (колонка).
//  СтандартнаяОбработка	 - Булево - признак выполнения стандартной (системной) обработки события.
//  ДополнительныеПараметры	 - Структура - значения дополнительных параметров влияющих на обработку события.
//
Процедура ПриВыбореЭлемента(Форма, Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка, ДополнительныеПараметры = Неопределено) Экспорт
	
	
КонецПроцедуры

// Переопределяемая процедура, вызываемая из одноименного обработчика события элемента.
//
// Параметры:
//  Форма					 - ФормаКлиентскогоПриложения - форма, из которой происходит вызов процедуры.
//  Элемент					 - Произвольный     - элемент-источник события "При активизации ячейки".
//  ДополнительныеПараметры	 - Структура        - значения дополнительных параметров влияющих на обработку события.
//
Процедура ПриАктивизацииЯчейки(Форма, Элемент, ДополнительныеПараметры = Неопределено) Экспорт
	
	
КонецПроцедуры

// Переопределяемая процедура, вызываемая из одноименного обработчика события элемента.
//
// Параметры:
//  Форма					 - ФормаКлиентскогоПриложения - форма, из которой происходит вызов процедуры.
//  Элемент					 - Произвольный     - элемент-источник события "При активизации строки".
//  ДополнительныеПараметры	 - Структура        - значения дополнительных параметров влияющих на обработку события.
//
Процедура ПриАктивизацииСтроки(Форма, Элемент, ДополнительныеПараметры = Неопределено) Экспорт
	
	
КонецПроцедуры

// Переопределяемая процедура, вызываемая из одноименного обработчика события элемента.
//
// Параметры:
//  Форма					 - ФормаКлиентскогоПриложения - форма, из которой происходит вызов процедуры.
//  Элемент					 - Произвольный - элемент-источник события "При начале редактирования".
//  НоваяСтрока				 - Булево - признак редактирования новой строки. Имеет значение Истина, если строка была добавлена или скопирована.
//  Копирование				 - Булево - определяет режим копирования. Если установлено Истина, то происходит копирование строки.
//  ДополнительныеПараметры	 - Структура - значения дополнительных параметров влияющих на обработку события.
//
Процедура ПриНачалеРедактирования(Форма, Элемент, НоваяСтрока, Копирование, ДополнительныеПараметры = Неопределено) Экспорт
	
	
КонецПроцедуры

// Переопределяемая процедура, вызываемая из одноименного обработчика события элемента.
//
// Параметры:
//  Форма				 - ФормаКлиентскогоПриложения - форма, из которой происходит вызов процедуры.
//  Элемент				 - Произвольный - элемент-источник события "Начало выбора элемента".
//  ДанныеВыбора		 - СписокЗначений - в обработчике можно сформировать и передать в этом параметре данные для выбора.
//  СтандартнаяОбработка - Булево - признак выполнения стандартной (системной) обработки события.
//
Процедура НачалоВыбораЭлемента(Форма, Элемент, ДанныеВыбора, СтандартнаяОбработка) Экспорт
	
	
КонецПроцедуры
	
#КонецОбласти

#КонецОбласти
