#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Список") Тогда
		Если ТипЗнч(Параметры.Список) = Тип("СписокЗначений") Тогда
			Список = Параметры.Список;
		Иначе
			Список.Добавить(Параметры.Список);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	МассивТипов = Новый Массив();
	МассивТипов.Добавить(Тип("СправочникСсылка.уатТС"));
	МассивТипов.Добавить(Тип("СправочникСсылка.Сотрудники"));
	Элемент.ТекущийЭлемент.ОграничениеТипа = Новый ОписаниеТипов(МассивТипов);
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	УдалитьДубли();
	Закрыть(Список);
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УдалитьДубли()
	Таблица = Новый ТаблицаЗначений();
	Таблица.Колонки.Добавить("Элемент");
	Для Каждого ТекСтрока Из Список Цикл 
		Если ТекСтрока.Значение <> Неопределено Тогда
			Строка = Таблица.Добавить();
			Строка.Элемент = ТекСтрока.Значение;
		КонецЕсли;
	КонецЦикла;
	Таблица.Свернуть("Элемент");
	Список.ЗагрузитьЗначения(Таблица.ВыгрузитьКолонку("Элемент"));
КонецПроцедуры

#КонецОбласти
