
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если НЕ сфпСофтФонПроСервер.сфпИспользоватьСофтФон() Тогда
		сфпСофтФонПроКлиент.сфпОтключитьСофтФон();
		
	ИначеЕсли НЕ сфпСофтФонПроСервер.сфпПолучитьЗначениеНастройкиПользователя("сфпИспользоватьСофтФон") Тогда
		сфпСофтФонПроКлиент.сфпОтключитьСофтФон();
		
	Иначе	
		Если сфпПанельУправления = Неопределено Тогда
			сфпСофтФонПроКлиент.сфпПодключитьСофтФон();

		Иначе
			сфпСофтФонПроКлиент.сфпОтключитьСофтФон();
			сфпСофтФонПроКлиент.сфпПодключитьСофтФон();			
		КонецЕсли;				
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура();
	ОткрытьФорму("ОбщаяФорма.сфпТелефония", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

#КонецОбласти