#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Выполняет заполнение предопределенных элементов справочника
//
Процедура ЗаполнитьПредопределенныеДанные() Экспорт
	
	СпрОбъект = Справочники.уатВнешниеСистемы._1СЦСМ.ПолучитьОбъект();
	СпрОбъект.ТипВнешнейСистемы = Перечисления.уатТипыВнешнихСистем.СистемаМониторинга;
	СпрОбъект.Записать();
		
	СпрОбъект = Справочники.уатВнешниеСистемы.Omnicomm.ПолучитьОбъект();
	СпрОбъект.ТипВнешнейСистемы = Перечисления.уатТипыВнешнихСистем.СистемаМониторинга;
	СпрОбъект.Записать();

	СпрОбъект = Справочники.уатВнешниеСистемы.Wialon.ПолучитьОбъект();
	СпрОбъект.ТипВнешнейСистемы = Перечисления.уатТипыВнешнихСистем.СистемаМониторинга;
	СпрОбъект.Записать();

	СпрОбъект = Справочники.уатВнешниеСистемы.АвтоГРАФ.ПолучитьОбъект();
	СпрОбъект.ТипВнешнейСистемы = Перечисления.уатТипыВнешнихСистем.СистемаМониторинга;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатВнешниеСистемы.СКАУТ.ПолучитьОбъект();
	СпрОбъект.ТипВнешнейСистемы = Перечисления.уатТипыВнешнихСистем.СистемаМониторинга;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатВнешниеСистемы.Газпромнефть.ПолучитьОбъект();
	СпрОбъект.ТипВнешнейСистемы = Перечисления.уатТипыВнешнихСистем.ПроцессинговыйЦентр;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатВнешниеСистемы.Платон.ПолучитьОбъект();
	СпрОбъект.ТипВнешнейСистемы = Перечисления.уатТипыВнешнихСистем.СистемаВзиманияПлаты;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатВнешниеСистемы.ШтрафовНет.ПолучитьОбъект();
	СпрОбъект.ТипВнешнейСистемы = Перечисления.уатТипыВнешнихСистем.СервисШтрафов;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатВнешниеСистемы.Паркоматика.ПолучитьОбъект();
	СпрОбъект.ТипВнешнейСистемы = Перечисления.уатТипыВнешнихСистем.СервисПарковок;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатВнешниеСистемы.ППР.ПолучитьОбъект();
	СпрОбъект.ТипВнешнейСистемы = Перечисления.уатТипыВнешнихСистем.ПроцессинговыйЦентр;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатВнешниеСистемы.ЛукойлЛИКАРД.ПолучитьОбъект();
	СпрОбъект.ТипВнешнейСистемы = Перечисления.уатТипыВнешнихСистем.ПроцессинговыйЦентр;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатВнешниеСистемы.Роснефть.ПолучитьОбъект();
	СпрОбъект.ТипВнешнейСистемы = Перечисления.уатТипыВнешнихСистем.ПроцессинговыйЦентр;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатВнешниеСистемы.Автодор.ПолучитьОбъект();
	СпрОбъект.ТипВнешнейСистемы = Перечисления.уатТипыВнешнихСистем.СистемаВзиманияПлаты;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатВнешниеСистемы.СОГАЗ.ПолучитьОбъект();
	СпрОбъект.ТипВнешнейСистемы = Перечисления.уатТипыВнешнихСистем.СервисСтрахования;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатВнешниеСистемы.OSM.ПолучитьОбъект();
	СпрОбъект.ТипВнешнейСистемы = Перечисления.уатТипыВнешнихСистем.СервисГеоданных;
	СпрОбъект.Записать();

	СпрОбъект = Справочники.уатВнешниеСистемы.Яндекс.ПолучитьОбъект();
	СпрОбъект.ТипВнешнейСистемы = Перечисления.уатТипыВнешнихСистем.СервисГеоданных;
	СпрОбъект.Записать();

	СпрОбъект = Справочники.уатВнешниеСистемы.DaData.ПолучитьОбъект();
	СпрОбъект.ТипВнешнейСистемы = Перечисления.уатТипыВнешнихСистем.СервисГеоданных;
	СпрОбъект.Записать();

	
КонецПроцедуры

#КонецОбласти

#КонецЕсли