
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьДеревоПеревозчиков(Параметры.МаршрутныеЛисты);
	
	Если ДеревоПеревозчиков.ПолучитьЭлементы().Количество() > 1 Тогда
		Элементы.ГруппаПодсказкаМножественныйВыбор.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ДеревоПеревозчиков

&НаКлиенте
Процедура ДеревоПеревозчиковВыбранПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоПеревозчиков.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.Выбран = ТекущиеДанные.Выбран % 2;
	
	ПроставитьПометкиВниз(ТекущиеДанные);
	ПроставитьПометкиВверх(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьПеревозчиков(Команда)
	
	Результат = Новый Массив;
	СоответствиеМаршрутныхЛистов = Новый Соответствие;
	Для Каждого СтрокаМаршрутныйЛист Из ДеревоПеревозчиков.ПолучитьЭлементы() Цикл
		
		МассивПеревозчиков = Новый Массив;
		Для Каждого СтрокаПеревозчик Из СтрокаМаршрутныйЛист.ПолучитьЭлементы() Цикл
			Если СтрокаПеревозчик.Выбран = 1 Тогда
				МассивПеревозчиков.Добавить(СтрокаПеревозчик.Перевозчик);
			КонецЕсли;
		КонецЦикла;
		
		СоответствиеМаршрутныхЛистов.Вставить(СтрокаМаршрутныйЛист.МаршрутныйЛист, МассивПеревозчиков);
		
	КонецЦикла;
	
	Закрыть(СоответствиеМаршрутныхЛистов);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьТендеры(Команда)
	
	Для Каждого СтрокаМаршрутныйЛист Из ДеревоПеревозчиков.ПолучитьЭлементы() Цикл
		
		МассивПеревозчиков = Новый Массив;
		Для Каждого СтрокаПеревозчик Из СтрокаМаршрутныйЛист.ПолучитьЭлементы() Цикл
			Если СтрокаПеревозчик.Выбран = 1 Тогда
				МассивПеревозчиков.Добавить(СтрокаПеревозчик.Перевозчик);
			КонецЕсли;
		КонецЦикла;
		
		ПараметрыФормы = Новый Структура("Основание", СтрокаМаршрутныйЛист.МаршрутныйЛист);
		ПараметрыФормы.Вставить("Перевозчики", МассивПеревозчиков);
		ОткрытьФорму("Документ.уатТендер_уэ.ФормаОбъекта", ПараметрыФормы,, Истина);
		
	КонецЦикла;
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	Для Каждого СтрокаМаршрутныйЛист Из ДеревоПеревозчиков.ПолучитьЭлементы() Цикл
		СтрокаМаршрутныйЛист.Выбран = 1;
		Для Каждого СтрокаПеревозчик Из СтрокаМаршрутныйЛист.ПолучитьЭлементы() Цикл
			СтрокаПеревозчик.Выбран = 1;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметкиВсех(Команда)
	Для Каждого СтрокаМаршрутныйЛист Из ДеревоПеревозчиков.ПолучитьЭлементы() Цикл
		СтрокаМаршрутныйЛист.Выбран = 0;
		Для Каждого СтрокаПеревозчик Из СтрокаМаршрутныйЛист.ПолучитьЭлементы() Цикл
			СтрокаПеревозчик.Выбран = 0;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДеревоПеревозчиков(МаршрутныеЛисты)
	
	Если Параметры.Свойство("ОткрытьФормыТендеров") Тогда
		ОткрытьФормыТендеров = Параметры.ОткрытьФормыТендеров;
		Элементы.ДеревоПеревозчиковВыбратьПеревозчиков.Видимость = Ложь;
		Элементы.ДеревоПеревозчиковСоздатьТендеры.Видимость = Истина;
		Элементы.ДеревоПеревозчиковСоздатьТендеры.КнопкаПоУмолчанию = Истина;
	Иначе
		Элементы.ДеревоПеревозчиковСоздатьТендеры.Видимость = Ложь;
	КонецЕсли;
	
	ТаблицаМаршрутныхЛистовСПеревозчиками = уатОбщегоНазначения_проф.ПолучитьВозможныхПеревозчиковСУчетомПланов(МаршрутныеЛисты);
	
	Для Каждого ТекМаршрутныйЛист Из МаршрутныеЛисты Цикл
		
		СтрокаМаршрутныйЛист = ДеревоПеревозчиков.ПолучитьЭлементы().Добавить();
		СтрокаМаршрутныйЛист.МаршрутныйЛист = ТекМаршрутныйЛист;
		
		СтруктураОтбора = Новый Структура("МаршрутныйЛист", ТекМаршрутныйЛист);
		НайденныеСтроки = ТаблицаМаршрутныхЛистовСПеревозчиками.НайтиСтроки(СтруктураОтбора);
		Если НайденныеСтроки.Количество() > 0 Тогда
			СтрокаМаршрутныйЛист.ПланированиеРаботыТС = НайденныеСтроки[0].ПланированиеРаботыТС;
		КонецЕсли;
		
		Для Каждого ТекСтрока Из НайденныеСтроки Цикл
			СтрокаПеревозчик = СтрокаМаршрутныйЛист.ПолучитьЭлементы().Добавить();
			СтрокаПеревозчик.Перевозчик = ТекСтрока.Перевозчик;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроставитьПометкиВниз(ТекРодитель)
	
	Для Каждого ТекУзел Из ТекРодитель.ПолучитьЭлементы() Цикл
		ТекУзел.Выбран = ТекРодитель.Выбран;
		ПроставитьПометкиВниз(ТекУзел);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроставитьПометкиВверх(ТекЭлемент)
	
	ТекРодитель = ТекЭлемент.ПолучитьРодителя();
	Если ТекРодитель = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ВсеИстина = Истина;
	НеВсеЛожь = Ложь;
	Для Каждого ТекУзел Из ТекРодитель.ПолучитьЭлементы() Цикл
		ВсеИстина = ВсеИстина И (ТекУзел.Выбран = 1);
		НеВсеЛожь = НеВсеЛожь Или Булево(ТекУзел.Выбран);
	КонецЦикла;
	
	Если ВсеИстина Тогда
		ТекРодитель.Выбран = 1;
	ИначеЕсли НеВсеЛожь Тогда
		ТекРодитель.Выбран = 2;
	Иначе
		ТекРодитель.Выбран = 0;
	КонецЕсли;
	
	ПроставитьПометкиВверх(ТекРодитель);
	
КонецПроцедуры

#КонецОбласти
