
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ (Константы.уатИспользоватьOmnicomm.Получить()
			ИЛИ Константы.уатИспользоватьWialon.Получить()
			ИЛИ Константы.уатИспользоватьАвтоГРАФ.Получить()
			ИЛИ Константы.уатИспользоватьСКАУТ.Получить()
			ИЛИ Константы.уатИспользоватьЦСМ.Получить()) Тогда
			
		Если НЕ (Константы.уатИспользоватьМониторинг.Получить()
				И уатРаботаСРасширениями.ПСМ_ПроверитьПодключение()) Тогда
			ТекстСообщения = НСтр("en='Neither one of satellite monitoring system is not enabled.';ru='Ни одной из систем спутникового мониторинга не включено.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ДокументРезультат.АвтоМасштаб = Истина;
	
КонецПроцедуры

#КонецОбласти
