#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура - Зарегистрировать входящий звонок
//
// Параметры:
//  ПользовательКому		 - СправочникСсылка.Пользователи	 -  Пользователь, которому поступил звонок.
//  АбонентОтКого			 - СправочникСсылка.КонтактныеЛицаПартнеров, СправочникСсылка.Партнеры	 - от кого поступил звонок.
//  НомерТелефонаАбонента	 - Строка -  номер телефона.
//  
Процедура ЗарегистрироватьВходящийЗвонок(ПользовательКому, АбонентОтКого, НомерТелефонаАбонента) Экспорт
	
	ИдентификаторЗвонка = Новый УникальныйИдентификатор;
	
	Набор = СоздатьНаборЗаписей();
	Набор.Отбор.ПользовательКому.Установить(ПользовательКому);
	Набор.Отбор.ИдентификаторЗвонка.Установить(ИдентификаторЗвонка);
	
	ЗаписьНабора = Набор.Добавить();
	ЗаписьНабора.ПользовательКому		= ПользовательКому;
	ЗаписьНабора.ИдентификаторЗвонка	= ИдентификаторЗвонка;
	ЗаписьНабора.АбонентОтКого			= АбонентОтКого;
	ЗаписьНабора.ДатаЗвонка				= ТекущаяДатаСеанса();
	ЗаписьНабора.НомерТелефонаАбонента	= НомерТелефонаАбонента;
	
	Набор.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли