#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ВернутьПодрасделениеТСпоПУ(ПараметрыПоиска) Экспорт
	
	Подразделение = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
	
	НаборЗаписей = РегистрыСведений.GDS_СоответствиеТСиПУПодразделению.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Колонна.Установить(ПараметрыПоиска.Колонна);
	НаборЗаписей.Отбор.ТипТС.Установить(ПараметрыПоиска.ТипТС);
	
	Если ЗначениеЗаполнено(ПараметрыПоиска.ТипПрицепа) Тогда
		НаборЗаписей.Отбор.ТипПрицепа.Установить(ПараметрыПоиска.ТипПрицепа);
	КонецЕсли;
	
	НаборЗаписей.Отбор.ПУ.Установить(ПараметрыПоиска.ПУ);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() > 0 Тогда 
		Подразделение = НаборЗаписей[0].Подразделение;
	КонецЕсли;
	
	Возврат Подразделение;
	
КонецФункции

#КонецОбласти

#КонецЕсли