
#Область ОбработчикиСобытийФормы

// Процедура - обработчик события "ПриОткрытии" формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.НадписьМасштаб.Заголовок = НСтр("ru = 'Первоначальный масштаб :'; en = 'Original scale:'")+" "+Объект.Масштаб;
	Элементы.НадписьШирота.Заголовок  = НСтр("ru = 'Широта центра карты  :'; en = 'Latitude of the map center:'")+" "+Формат(Объект.Широта,"ЧЦ=10; ЧДЦ=5");
	Элементы.НадписьДолгота.Заголовок = НСтр("ru = 'Долгота центра карты :'; en = 'Longitude of the map center:'")+" "+Формат(Объект.Долгота,"ЧЦ=10; ЧДЦ=5");
	
КонецПроцедуры // ПриОткрытии()

#КонецОбласти

#Область ОбработчикиКомандФормы

// Процедура - обработчик команды "ЗадатьМестоположение".
//
&НаКлиенте
Процедура ЗадатьМестоположение(Команда)
	
	Если НЕ ItobОперативныйМониторингВызовСервера.ПроверитьДоступностьСервисаCsmSvc() Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Сервис CsmSvc недоступен! Установите службу CsmSvc или проверьте "
"настройки подключения к службе (Администрирование - ЦСМ: Настройки карты - Настройка карты).'; en = 'The CsmSvc service is unavailable! Install the CsmSvc service or check the service connection settings (Administration - CSM: Map Settings - Map Settings).'"));
		Возврат;
	
	КонецЕсли;
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Масштаб", Объект.Масштаб);
	ДопПараметры.Вставить("Широта",  Объект.Широта);
	ДопПараметры.Вставить("Долгота", Объект.Долгота);
	ООДопПараметры = Новый Структура;
	ООДопПараметры.Вставить("Объект", 	Объект);
	ООДопПараметры.Вставить("Элементы", Элементы);
	ОткрытьФорму("Справочник.ItobМестоположенияПоУмолчанию.Форма.ФормаОпределенияПоложения", ДопПараметры,,,,, 
				 Новый ОписаниеОповещения("ООФормаОпределенияПоложенияКнопкаОК", ItobОбщегоНазначенияКлиент, ООДопПараметры));
	
КонецПроцедуры
	
#КонецОбласти
