#Область СлужебныйПрограммныйИнтерфейс

Функция Типы() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("ИмяРеквизита", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(40)));
	
	Результат.Вставить("Строка", Новый ОписаниеТипов("Строка"));
	Результат.Вставить("Дата", Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	Результат.Вставить("Булево", Новый ОписаниеТипов("Булево"));
	Результат.Вставить("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3)));
	Результат.Вставить("ДенежнаяСумма", Метаданные.ОпределяемыеТипы.ДенежнаяСуммаНеотрицательная.Тип);
	Результат.Вставить("ДенежнаяСуммаЛюбогоЗнака", Метаданные.ОпределяемыеТипы.ДенежнаяСуммаЛюбогоЗнака.Тип);
	
	Результат.Вставить("Организация", Метаданные.ОпределяемыеТипы.ОрганизацияБРД.Тип);
	Результат.Вставить("Контрагент", Метаданные.ОпределяемыеТипы.КонтрагентБРД.Тип);
	Результат.Вставить("Договор", Метаданные.ОпределяемыеТипы.ДоговорыБРД.Тип);
	Результат.Вставить("Склад", Метаданные.ОпределяемыеТипы.СкладБРД.Тип);
	Результат.Вставить("БанковскиеСчета", Метаданные.ОпределяемыеТипы.БанковскиеСчетаБРД.Тип);
	Результат.Вставить("Номенклатура", Метаданные.ОпределяемыеТипы.НоменклатураБРД.Тип);
	Результат.Вставить("ХарактеристикаНоменклатуры", Метаданные.ОпределяемыеТипы.ХарактеристикаНоменклатурыБРД.Тип);
	Результат.Вставить("СтавкаНДС", Метаданные.ОпределяемыеТипы.СтавкаНДСБРД.Тип);
	Результат.Вставить("ДокументОснованиеКорректировки", Метаданные.ОпределяемыеТипы.ДокументОснованиеКорректировкиБРД.Тип);
	
	// К обощению
	Результат.Вставить("ЕдиницаИзмерения", Новый ОписаниеТипов("СправочникСсылка.КлассификаторЕдиницИзмерения"));
	Результат.Вставить("СтраныМира", Новый ОписаниеТипов("СправочникСсылка.СтраныМира"));
	Результат.Вставить("НомераГТД", Новый ОписаниеТипов("СправочникСсылка.НомераГТД"));
	Результат.Вставить("Банк", Новый ОписаниеТипов("СправочникСсылка.Банки"));
	Результат.Вставить("ВидСкидки", Новый ОписаниеТипов("Число"));
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоПоступлениеТоваровУслуг(ТипДокумента) Экспорт
	
	Возврат Метаданные.ОпределяемыеТипы.ПоступлениеТоваровУслугБРД.Тип.СодержитТип(ТипДокумента);
	
КонецФункции

Функция ЭтоРеализацияТоваровУслуг(ТипДокумента) Экспорт
	
	Возврат Метаданные.ОпределяемыеТипы.РеализацияТоваровУслугБРД.Тип.СодержитТип(ТипДокумента);
	
КонецФункции

Функция ЭтоСчетНаОплатуПокупателю(ТипДокумента) Экспорт
	
	Возврат Метаданные.ОпределяемыеТипы.СчетНаОплатуПокупателюБРД.Тип.СодержитТип(ТипДокумента);
	
КонецФункции

Функция ЭтоСчетНаОплатуПоставщика(ТипДокумента) Экспорт
	
	Возврат Метаданные.ОпределяемыеТипы.СчетНаОплатуПоставщикаБРД.Тип.СодержитТип(ТипДокумента);
	
КонецФункции

Функция ЭтоСчетФактураПолученный(ТипДокумента) Экспорт
	
	Возврат Метаданные.ОпределяемыеТипы.СчетФактураПолученныйБРД.Тип.СодержитТип(ТипДокумента);
	
КонецФункции

Функция ЭтоСчетФактураВыданный(ТипДокумента) Экспорт
	
	Возврат Метаданные.ОпределяемыеТипы.СчетФактураВыданныйБРД.Тип.СодержитТип(ТипДокумента);
	
КонецФункции

Функция ЭтоПлатежноеПоручение(ТипДокумента) Экспорт
	
	Возврат Метаданные.ОпределяемыеТипы.ПлатежноеПоручениеБРД.Тип.СодержитТип(ТипДокумента);
	
КонецФункции

Функция ЭтоАвансовыйОтчет(ТипДокумента) Экспорт
	
	Возврат Метаданные.ОпределяемыеТипы.АвансовыйОтчетБРД.Тип.СодержитТип(ТипДокумента);
	
КонецФункции

Функция ЭтоРасходыПредпринимателя(ТипДокумента) Экспорт
	
	Возврат Метаданные.ОпределяемыеТипы.РасходыПредпринимателяБРД.Тип.СодержитТип(ТипДокумента);
	
КонецФункции

Функция ЭтоПутевойЛист(ТипДокумента) Экспорт
	
	Возврат Метаданные.ОпределяемыеТипы.ПутевойЛистБРД.Тип.СодержитТип(ТипДокумента);
	
КонецФункции

#КонецОбласти
