#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

	
#Область ПрограммныйИнтерфейс

// Задает настройки размещения вариантов отчетов в панели отчетов.
// См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//
// Параметры:
//   Настройки - Коллекция - Используется для описания настроек отчетов и вариантов
//       см. описание к ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//   НастройкиОтчета - СтрокаДереваЗначений - Настройки размещения всех вариантов отчета.
//       См. ""Реквизиты для изменения"" функции ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "Установленные на ТС агрегаты");
	НастройкиВарианта.Описание = НСтр("en='Report is intended for analysis of car parts that installed on vehicle.';ru='Отчет предназначен для анализа агрегатов, установленных на ТС.'");
	НастройкиВарианта.ВидимостьПоУмолчанию = Истина;
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "Установленные на ТС агрегаты (по МОЛ)");
	НастройкиВарианта.Описание = НСтр("en='Report is intended for analysis of car parts installed on vehicle by responsible employee.';ru='Отчет предназначен для анализа агрегатов, установленных на ТС, по МОЛ.'");
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "Установленные на ТС агрегаты (по валюте отчета)");
	НастройкиВарианта.Описание = НСтр("en='Report is intended for analysis of car parts installed on vehicle by selected currency.';ru='Отчет предназначен для анализа агрегатов, установленных на ТС, по выбранной валюте.'");
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "Установленные на ТС агрегаты (по МОЛ и валюте отчета)");
	НастройкиВарианта.Описание = НСтр("en='Report is intended for analysis of car parts installed on vehicle by responsible employee and selected currency.';ru='Отчет предназначен для анализа агрегатов, установленных на ТС, по МОЛ и выбранной валюте.'");
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьСтоимостьАгрегата(ПоВалютеОтчета, ВалютаОтчета, Период, Знач ПервоначальнаяСтоимость, Знач ВалютаАгрегата) Экспорт 
	
	Если ПоВалютеОтчета Тогда                                      
		ВалютаАгрегата = ПолучитьВалютуАгрегата(ВалютаАгрегата, ПервоначальнаяСтоимость);
		
		ПервоначальнаяСтоимость = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ПервоначальнаяСтоимость,
			ВалютаАгрегата, ВалютаОтчета, Период, Период,,,,
			Новый Структура("БазоваяВалюта, ДатаКурса", ВалютаОтчета, Период));
		
		Возврат ПервоначальнаяСтоимость;
	КонецЕсли;
	
	Возврат ПервоначальнаяСтоимость;
	
КонецФункции // ПолучитьСтоимостьАгрегата()

Функция ПолучитьВалютуАгрегата(ВалютаАгрегата, ПервоначальнаяСтоимость) Экспорт 
	
	Если ВалютаАгрегата = Справочники.Валюты.ПустаяСсылка() И ПервоначальнаяСтоимость <> 0 Тогда 
		Если уатРаботаСМетаданными.уатЕстьКонстанта("ВалютаУправленческогоУчета") Тогда 
			Возврат Константы.ВалютаУправленческогоУчета.Получить(); 
		Иначе 
			Возврат Константы.ВалютаРегламентированногоУчета.Получить(); 
		КонецЕсли;
	Иначе 
		Возврат ВалютаАгрегата;
	КонецЕсли;
	
КонецФункции // ПолучитьВалютуАгрегата()

#КонецОбласти


#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	уатЗащищенныеФункцииСервер.уатОтчетОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти


#КонецЕсли