///////////////////////////////////////////////////////////////////////////////
// Модуль содержит методы формирования управленческой отчетности
///////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

#Область Прочее

// Возвращает названия перечисления Периодичность в разных склонениях
//
// Параметры
//	ЧислоПериодов - Число - количество периодов, определяет склонение
//	Периодичность - ссылка на значение перечисления "Периодичность"
//
// Возвращаемое значение:
//  ПериодПрописью - Строка - название периода в правильном склонении
//
Функция ПериодПрописью(ЧислоПериодов, Периодичность) Экспорт
	ПериодПрописью = "";
	ФорматнаяСтрока = "L = ru_RU";
	ПараметрыПредметаИсчиления = "";
	
	Если Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.День") Тогда
		ПараметрыПредметаИсчиления = НСтр("en='day, day, days, m';ru='день, дня, дней, м'");
		ПериодПрописью = ЧислоПрописью(ЧислоПериодов, ФорматнаяСтрока, ПараметрыПредметаИсчиления);
		
		Если Найти(ПериодПрописью, НСтр("en='day';ru='день'")) Тогда
			ПериодПрописью = НСтр("en='day';ru='день'");
		ИначеЕсли Найти(ПериодПрописью, НСтр("en='day';ru='дня'")) Тогда
			ПериодПрописью = НСтр("en='day';ru='дня'");
		ИначеЕсли Найти(ПериодПрописью, НСтр("en='days';ru='дней'")) Тогда
			ПериодПрописью = НСтр("en='days';ru='дней'");
		КонецЕсли;
	ИначеЕсли Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Неделя") Тогда
		ПараметрыПредметаИсчиления = НСтр("en='week, week, weeks, ';ru='неделя, недели, недель, ж'");
		ПериодПрописью = ЧислоПрописью(ЧислоПериодов, ФорматнаяСтрока, ПараметрыПредметаИсчиления);
		
		Если Найти(ПериодПрописью, НСтр("en='week';ru='неделя'")) Тогда
			ПериодПрописью = НСтр("en='week';ru='неделя'");
		ИначеЕсли Найти(ПериодПрописью, НСтр("en='weeks';ru='недели'")) Тогда
			ПериодПрописью = НСтр("en='weeks';ru='недели'");
		ИначеЕсли Найти(ПериодПрописью, НСтр("en='weeks';ru='недель'")) Тогда
			ПериодПрописью = НСтр("en='weeks';ru='недель'");
		КонецЕсли;
	ИначеЕсли Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Декада") Тогда
		ПараметрыПредметаИсчиления = НСтр("en='decade, decade, decades, ';ru='декада, декады, декад, ж'");
		ПериодПрописью = ЧислоПрописью(ЧислоПериодов, ФорматнаяСтрока, ПараметрыПредметаИсчиления);
		
		Если Найти(ПериодПрописью, НСтр("en='decade';ru='декада'")) Тогда
			ПериодПрописью = НСтр("en='decade';ru='декада'");
		ИначеЕсли Найти(ПериодПрописью, НСтр("en='decade';ru='декады'")) Тогда
			ПериодПрописью = НСтр("en='decade';ru='декады'");
		ИначеЕсли Найти(ПериодПрописью, НСтр("en='decades';ru='декад'")) Тогда
			ПериодПрописью = НСтр("en='decades';ru='декад'");
		КонецЕсли;
	ИначеЕсли Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Месяц") Тогда
		ПараметрыПредметаИсчиления = НСтр("en='month, month, months, m';ru='месяц, месяца, месяцев, м'");
		ПериодПрописью = ЧислоПрописью(ЧислоПериодов, ФорматнаяСтрока, ПараметрыПредметаИсчиления);
		
		Если Найти(ПериодПрописью, НСтр("en='months';ru='месяцев'")) Тогда
			ПериодПрописью = НСтр("en='months';ru='месяцев'");
		ИначеЕсли Найти(ПериодПрописью, НСтр("en='months';ru='месяца'")) Тогда
			ПериодПрописью = НСтр("en='months';ru='месяца'");
		ИначеЕсли Найти(ПериодПрописью, НСтр("en='month';ru='месяц'")) Тогда
			ПериодПрописью = НСтр("en='month';ru='месяц'");
		КонецЕсли;
	ИначеЕсли Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") Тогда
		ПараметрыПредметаИсчиления = НСтр("en='quarter, quarter, quarter, m';ru='квартал, квартала, кварталов, м'");
		ПериодПрописью = ЧислоПрописью(ЧислоПериодов, ФорматнаяСтрока, ПараметрыПредметаИсчиления);
		
		Если Найти(ПериодПрописью, НСтр("en='quarters';ru='кварталов'")) Тогда
			ПериодПрописью = НСтр("en='quarters';ru='кварталов'");
		ИначеЕсли Найти(ПериодПрописью, НСтр("en='quarter';ru='квартала'")) Тогда
			ПериодПрописью = НСтр("en='quarter';ru='квартала'");
		ИначеЕсли Найти(ПериодПрописью, НСтр("en='quarter';ru='квартал'")) Тогда
			ПериодПрописью = НСтр("en='quarter';ru='квартал'");
		КонецЕсли;
	ИначеЕсли Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Полугодие") Тогда
		ПараметрыПредметаИсчиления = НСтр("en='half a year, half a year, half a year, ';ru='полугодие, полугодия, полугодий, с'");
		ПериодПрописью = ЧислоПрописью(ЧислоПериодов, ФорматнаяСтрока, ПараметрыПредметаИсчиления);
		
		Если Найти(ПериодПрописью, НСтр("en='half a year';ru='полугодие'")) Тогда
			ПериодПрописью = НСтр("en='half a year';ru='полугодие'");
		ИначеЕсли Найти(ПериодПрописью, НСтр("en='half a year';ru='полугодия'")) Тогда
			ПериодПрописью = НСтр("en='half a year';ru='полугодия'");
		ИначеЕсли Найти(ПериодПрописью, НСтр("en='half a year';ru='полугодий'")) Тогда
			ПериодПрописью = НСтр("en='half a year';ru='полугодий'");
		КонецЕсли;
	ИначеЕсли Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Год") Тогда
		ПараметрыПредметаИсчиления = НСтр("en='year, years, years, m';ru='год, года, лет, м'");
		ПериодПрописью = ЧислоПрописью(ЧислоПериодов, ФорматнаяСтрока, ПараметрыПредметаИсчиления);
		
		Если Найти(ПериодПрописью, НСтр("en='year';ru='год'")) Тогда
			ПериодПрописью = НСтр("en='year';ru='год'");
		ИначеЕсли Найти(ПериодПрописью, НСтр("en='year';ru='года'")) Тогда
			ПериодПрописью = НСтр("en='year';ru='года'");
		ИначеЕсли Найти(ПериодПрописью, НСтр("en='years';ru='лет'")) Тогда
			ПериодПрописью = НСтр("en='years';ru='лет'");
		КонецЕсли;
	КонецЕсли;
	
	Возврат ПериодПрописью;
КонецФункции

// Возвращает слово в разных склонениях (в соответсвии с числом)
// Основное назначение - использование для склонения надписей единиц измерения в формах
// для различных числовых полей
//
// Параметры
//	Число - Число - число, определяет склонение
//	ЕдЧислоИменительный - Строка - единственное число именительный падеж
//	ЕдЧислоРодительный - Строка - единственное число родительный падеж
//	МнЧислоРодительный - Строка - множественное число родительный падеж
//	Пол - Строка - м – мужской род (ж – женский род, с - средний род); 
//
// Возвращаемое значение:
//  СловоПрописью - Строка - слово в правильном склонении
//
Функция ПолучитьСклонениеСлова(ЧислоДляСклонения, ЕдЧислоИменительный, ЕдЧислоРодительный, МнЧислоРодительный, Пол) Экспорт
	
	СловоПрописью = "";
	ФорматнаяСтрока = "L = ru_RU";
	ПараметрыПредметаИсчиления = ЕдЧислоИменительный + ", " + ЕдЧислоРодительный + ", " + МнЧислоРодительный + ", " + Пол;
	
	СловоПрописью = ЧислоПрописью(ЧислоДляСклонения, ФорматнаяСтрока, ПараметрыПредметаИсчиления);
	
	Если Найти(СловоПрописью, МнЧислоРодительный) Тогда
		СловоПрописью = МнЧислоРодительный;
	ИначеЕсли Найти(СловоПрописью, ЕдЧислоРодительный) Тогда
		СловоПрописью = ЕдЧислоРодительный;
	ИначеЕсли Найти(СловоПрописью, ЕдЧислоИменительный) Тогда
		СловоПрописью = ЕдЧислоИменительный;
	КонецЕсли;
	
	Возврат СловоПрописью;
	
КонецФункции

#КонецОбласти

#КонецОбласти
