
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	тблЗатраты = Расходы.Выгрузить().Скопировать();
	тблЗатраты.Колонки.Добавить("ВидЗатрат");
	тблЗатраты.Колонки.Добавить("Количество");
	Для Каждого ТекСтрока Из тблЗатраты Цикл
		ТекСтрока.ВидЗатрат = ТекСтрока.СтатьяРасходов.ВидЗатрат;
		ТекСтрока.Количество = 1;
	КонецЦикла;
	тблЗатраты.Свернуть("ВидЗатрат", "Количество");
	
	ТекстСообщения = "";
	Для Каждого ТекСтрока Из тблЗатраты Цикл
		Если ТекСтрока.Количество > 1 Тогда
			ТекстСообщения = ТекстСообщения + ", " + ТекСтрока.ВидЗатрат;
		КонецЕсли;
	КонецЦикла;
	Если ТекстСообщения <> "" Тогда
		ТекстНСТР = НСтр("en='In the tablular section there are 2 or more items of expenses by type of cost: %1! %2 There should be no more than one item for each type of expenses.';ru='В табличной части указаны 2 и более статьи расходов по виду затрат: %1! %2 Должно быть не более одной статьи по каждому виду затрат.'");
		ТекстНСТР = СтрШаблон(ТекстНСТР,Сред(ТекстСообщения, 3),Символы.ПС);
		уатОбщегоНазначенияСервер.СообщитьОбОшибке(ЭтотОбъект, ТекстНСТР ,,, "Модель", Отказ);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти