#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	уатЗащищенныеФункцииСервер.уатСправочникФормаСпискаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("НеДанныйСценарий") Тогда
		
		СсылкаНаДанныйСценарий = Параметры.НеДанныйСценарий;
		
		ОтборыСписковКлиентСервер.УстановитьЭлементОтбораСписка(
			Список, "Ссылка", СсылкаНаДанныйСценарий, ВидСравненияКомпоновкиДанных.НеРавно);
		
	КонецЕсли;
	
	Если Параметры.Свойство("РасчетФактическихДанныхПоДолгосрочномуПланировнию") Тогда
		РазделОбъемовПеревозок = Перечисления.уатРазделыПланирования.ОбъемыПеревозок;
		ОтборыСписковКлиентСервер.УстановитьЭлементОтбораСписка(
			Список, "Раздел", РазделОбъемовПеревозок, ВидСравненияКомпоновкиДанных.НеРавно);
	КонецЕсли;
	
	//МодификацияКонфигурацииПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	уатЗащищенныеФункцииКлиент.уатСправочникФормаСпискаПриОткрытии(Отказ, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
