
#Область ОбработчикиСобытийФормы

// Процедура - обработчик события "ПриОткрытии".
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ItobОбщегоНазначенияКлиент.УстановитьВидимостьСправочниковВодителиТС(ЭтотОбъект);
КонецПроцедуры

// Процедура - обработчик события "ПриСозданииНаСервере".
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ItobОбщегоНазначения.ОбработчикПриСозданииНаСервереСправочниковВодителиТС(Отказ, СтандартнаяОбработка, ЭтотОбъект);	
КонецПроцедуры

// Процедура - обработчик события "ПриЗаписиНаСервере".
//
&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ItobОбщегоНазначения.ОбработчикПриЗаписиНаСервереСправочниковВодителиТС(ЭтотОбъект, ТекущийОбъект.Объект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Процедура - обработчик команды "ВыбратьЦвет".
//
&НаКлиенте
Процедура ВыбратьЦвет(Команда)
	ДиалогВыбораЦвета = Новый ДиалогВыбораЦвета;
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ПодчиненныйОбъект", "ЦветМаршрутаНаКарте");
	ДопПараметры.Вставить("ЭтотОбъект", ЭтотОбъект);
	ДиалогВыбораЦвета.Цвет	= Элементы.КнопкаВыбратьЦвет.ЦветФона;
	ДиалогВыбораЦвета.Показать(Новый ОписаниеОповещения("ООВыбратьЦвет", ItobОбщегоНазначенияКлиент, ДопПараметры));
КонецПроцедуры

// Процедура - обработчик команды "ВыбратьЦветНадписи".
//
&НаКлиенте
Процедура ВыбратьЦветНадписи(Команда)
	ДиалогВыбораЦвета = Новый ДиалогВыбораЦвета;
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ПодчиненныйОбъект", "ЦветНадписиНаКарте");
	ДопПараметры.Вставить("ЭтотОбъект", ЭтотОбъект);
	ДиалогВыбораЦвета.Цвет	= Элементы.ВыбратьЦветНадписи.ЦветФона;
	ДиалогВыбораЦвета.Показать(Новый ОписаниеОповещения("ООВыбратьЦвет", ItobОбщегоНазначенияКлиент, ДопПараметры));
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИконкаНаКартеПриИзменении(Элемент)
	ItobОбщегоНазначенияКлиент.УстановитьВидимостьСправочниковВодителиТС(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ДополнительнаяИконкаНаКартеПриИзменении(Элемент)
	
	АдресДополнительнойИконки = ПолучитьНавигационнуюСсылку(ДополнительнаяИконкаНаКарте, "Иконка");
	
КонецПроцедуры

#КонецОбласти
