#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

	
#Область ПрограммныйИнтерфейс

// Задает настройки размещения вариантов отчетов в панели отчетов.
// См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//
// Параметры:
//   Настройки - Коллекция - Используется для описания настроек отчетов и вариантов
//       см. описание к ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//   НастройкиОтчета - СтрокаДереваЗначений - Настройки размещения всех вариантов отчета.
//       См. ""Реквизиты для изменения"" функции ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "Невыполненные ТО");
	НастройкиВарианта.Описание = НСтр("en='Report allows to get list of vehicles that do not have planned maintenance on date of report.';ru='Отчет позволяет получить список транспортных средств, у которых на дату отчета не выполнено плановое техническое обслуживание.'");
	НастройкиВарианта.ВидимостьПоУмолчанию = Истина;
	НастройкиВарианта.ГруппироватьПоОтчету = Ложь;
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "Планирование ТО");
	НастройкиВарианта.Описание = НСтр("en='Report provides a list of vehicles for which maintenance is necessary to be planned.';ru='Отчет позволяет получить список транспортных средств, для которых необходимо запланировать техническое обслуживание.'");
	НастройкиВарианта.ВидимостьПоУмолчанию = Истина;
	НастройкиВарианта.ГруппироватьПоОтчету = Ложь;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьПараметрДатаОкончания(ПериодОтчета, ПериодНаДату, РежимПланирования) Экспорт
	
	Если РежимПланирования Тогда 
		Возврат ПериодОтчета.ДатаОкончания;
	Иначе 
		Возврат ПериодНаДату;
	КонецЕсли;
	
КонецФункции // ПолучитьПараметрДатаОкончания()

#КонецОбласти


#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	уатЗащищенныеФункцииСервер.уатОтчетОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти


#КонецЕсли