#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьРаспознаваниеДокументов") Тогда
		ВызватьИсключение НСтр("ru = 'Функциональная опция ИспользоватьРаспознаваниеДокументов отключена.'; en = 'The ИспользоватьРаспознаваниеДокументов functional option is disabled.'");
	КонецЕсли;
	
	ПараметрыОтправки = РегистрыСведений.РаспознаваниеДокументовПоследнийОтправленныйЗамерВремени.ПолучитьПараметры();
	ДатаПоследнего = ПараметрыОтправки.ДатаПоследнего;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПоследнегоПриИзменении(Элемент)
	
	ПриИзмененииНаСервере(ДатаПоследнего);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ПриИзмененииНаСервере(ДатаПоследнего)
	
	РегистрыСведений.РаспознаваниеДокументовПоследнийОтправленныйЗамерВремени.ЗаписатьПараметры(
		ДатаПоследнего	);
	
КонецПроцедуры

#КонецОбласти