
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		ВызватьИсключение НСтр("ru = 'Не поддерживается в мобильном клиенте.'; en = 'Not supported in mobile client.'");
	КонецЕсли;

	Если Параметры.Свойство("МодельБюджетирования") Тогда
		Объект.МодельБюджетирования = Параметры.МодельБюджетирования;
	КонецЕсли;
	
	Группировки = "Вариант1";
	
	ТекущаяДата = ТекущаяДатаСеанса(); 
	НачалоПериода = ТекущаяДата;
	КонецПериода = ТекущаяДата;
	
	УправлениеФормой();
	
	Если Параметры.Свойство("СформироватьПриОткрытии")
		И Параметры.СформироватьПриОткрытии Тогда
		Элементы.ГруппаПанельНастроек.Видимость = Ложь;
		СформироватьНаСервере();
	КонецЕсли;
	
	УстановитьТекстПримечения();
	ЗаполнитьСведенияОЗадачах();
	
	Результат.ОтображатьЛегенду = Ложь;
	Результат.ОтображатьЗаголовок = Ложь;
	
	Результат.ОбластьПостроения.Право = 1;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	Если ЗначениеЗаполнено(Объект.МодельБюджетирования) Тогда
		Настройки.Удалить("Объект.МодельБюджетирования");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	УправлениеФормой();
	Если ЗначениеЗаполнено(Объект.МодельБюджетирования) Тогда
		ЗаполнитьСведенияОЗадачах();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПериодНачалоВыбораЗавершение", ЭтотОбъект);
	
	ОбщегоНазначенияУТКлиент.ВыбратьПериодИзСписка(
				ЭтотОбъект,
				Элемент,
				ВидПериода,
				НачалоПериода,
				ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте
Процедура ВидПериодаПриИзменении(Элемент)
	
	ПривестиЗначениеПериода(ВидПериода);
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровки, СтандартнаяОбработка, Дата)
	
	Если ТипЗнч(Расшифровки) = Тип("Строка") Тогда
		ПоказатьПредупреждение(, Расшифровки);
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = ТипЗнч(Расшифровки) <> Тип("Массив");
	Если Не СтандартнаяОбработка Тогда
		СписокРезультат = Новый СписокЗначений;
		Для Каждого Расшифровка из Расшифровки Цикл
			Если ТипЗнч(Расшифровка) = Тип("СписокЗначений") Тогда
				Для Каждого Элемент из Расшифровка Цикл
					ЗаполнитьЗначенияСвойств(СписокРезультат.Добавить(), Элемент);
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		Если СписокРезультат.Количество() = 1 Тогда
			ПоказатьЗначение(Новый ОписаниеОповещения("РезультатОбработкаРасшифровкиЗавершение2", ЭтотОбъект), СписокРезультат[0].Значение);
		ИначеЕсли СписокРезультат.Количество() Тогда
			ВыбранноеЗначение = Неопределено;

			СписокРезультат.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("РезультатОбработкаРасшифровкиЗавершение1", ЭтотОбъект), НСтр("en='Сведения о шаге процесса';ru='Сведения о шаге процесса'"));
		Иначе
			ТекстНСТР = НСтр("en='Нет данных для расшифровки!';ru='Нет данных для расшифровки!'");
			ПоказатьПредупреждение(,ТекстНСТР);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровкиЗавершение2(ДополнительныеПараметры) Экспорт
	Заглушка = Истина;
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровкиЗавершение1(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
    
    ВыбранноеЗначение = ВыбранныйЭлемент;
    Если ВыбранноеЗначение <> Неопределено Тогда
        ПоказатьЗначение(Новый ОписаниеОповещения("РезультатОбработкаРасшифровкиЗавершение", ЭтотОбъект), ВыбранноеЗначение.Значение);
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровкиЗавершение(ДополнительныеПараметры) Экспорт
	Заглушка = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТекущиеНевыполненныеЗадачиНажатие(Элемент)
	
	ФиксированныеНастройки = Новый НастройкиКомпоновкиДанных;
	
	ЭлементОтбора = ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("МодельБюджетирования");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Объект.МодельБюджетирования;
	ЭлементОтбора.Использование = Истина;
	
	Парам = Новый Структура;
	Парам.Вставить("КлючВарианта", "ТекущиеЗадачиРасшифровка");
	Парам.Вставить("СформироватьПриОткрытии", Истина);
	Парам.Вставить("ФиксированныеНастройки", ФиксированныеНастройки);
	Парам.Вставить("ВидимостьКомандВариантовОтчетов", Ложь);
	ОткрытьФорму("Отчет.ВыполнениеЗадачБюджетногоПроцесса.Форма", Парам);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаШаговБюджетногоПроцессаНажатие(Элемент)
	
	ПараметрыФормы = Новый Структура("Отбор", Новый Структура("Владелец", Объект.МодельБюджетирования));
	ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца", Истина);
	ОткрытьФорму("Справочник.ШагиБюджетныхПроцессов.Форма.ФормаСписка", ПараметрыФормы, ЭтотОбъект, Объект.МодельБюджетирования);
	
КонецПроцедуры

&НаКлиенте
Процедура МодельБюджетированияПриИзменении(Элемент)
	
	МодельБюджетированияПриИзмененииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипОтчетаПриИзменении(Элемент)
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппировкиПриИзменении(Элемент)
	
	ГруппировкиПриИзмененииСервер();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	Перем Ошибки;
	
	Отказ = Ложь;
	
	Если Не ЗначениеЗаполнено(Объект.МодельБюджетирования) Тогда
		
		ТекстНСТР = НСтр("en='Не указана модель бюджетирования';ru='Не указана модель бюджетирования'");
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,
			"МодельБюджетирования",
			ТекстНСТР, "");

		Отказ = Истина;
			
	КонецЕсли;
		
	Если Не ЗначениеЗаполнено(КонецПериода) Тогда
		
		ТекстНСТР = НСтр("en='Не указана дата окончания отчета';ru='Не указана дата окончания отчета'");
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,
			"ВидПериода",
			ТекстНСТР, "");
			
		Отказ = Истина;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Группировки) Тогда
		
		ТекстНСТР = НСтр("en='Не указаны группировки отчета';ru='Не указаны группировки отчета'");
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,
			"Группировки",
			ТекстНСТР, "");
			
		Отказ = Истина;
		
	КонецЕсли;
	
	Если не Отказ Тогда
		СформироватьНаСервере();
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПанельНастроек(Команда)
	
	Элементы.ГруппаПанельНастроек.Видимость = Не Элементы.ГруппаПанельНастроек.Видимость;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура МодельБюджетированияПриИзмененииСервер()
	
	ЗаполнитьСведенияОЗадачах();
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
Процедура ГруппировкиПриИзмененииСервер()
	
	УстановитьТекстПримечения();
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
Процедура УправлениеФормой()
	
	Модель = Объект.МодельБюджетирования;
	
	Если Группировки = "Вариант1" И ЗначениеЗаполнено(Модель) Тогда
		ПериодичностьПредставление = Строка(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Модель, "Периодичность"));
		НовыйВидПериода = Перечисления.ДоступныеПериодыОтчета[ПериодичностьПредставление];
		Если ВидПериода <> НовыйВидПериода Тогда
			ВидПериода = НовыйВидПериода;
			ПривестиЗначениеПериода(ВидПериода);
		КонецЕсли;
	КонецЕсли;
	
	Элементы.ВидПериода.Доступность = Группировки <> "Вариант1";
	Элементы.ПоказатьПланВыполненияПроцесса.Видимость = ТипОтчета > 0;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	
	ДопПараметры = Новый Структура();
	ДопПараметры.Вставить("ПланВыполнения", 		ПоказатьПланВыполненияПроцесса);
	ДопПараметры.Вставить("ФлагИсполнитель", 		ОтветственныйФлаг);
	ДопПараметры.Вставить("ЗначениеИсполнитель", 	ОтветственныйЗначение);
	
	Обработки.УправлениеБюджетнымПроцессом.ЗаполнитьДиаграмму(
													Объект.МодельБюджетирования, Результат, 
													НачалоПериода, КонецПериода, 
													ТипОтчета, Группировки, ДопПараметры);
	
	ЗаполнитьСведенияОЗадачах();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТекстПримечения()
	
	Если Группировки = "Вариант1" Тогда
		ТекстПримечания = НСтр("en='В отчете отображаются все задачи, период планирования которых "
"входит в период отчета. На диаграмму будут выведены задачи, "
"которые начинаются до периода планирования или заканчиваются после."
"Вариант отчета предназначен для обзора всех задач бюджетного процесса';ru='В отчете отображаются все задачи, период планирования которых "
"входит в период отчета. На диаграмму будут выведены задачи, "
"которые начинаются до периода планирования или заканчиваются после."
"Вариант отчета предназначен для обзора всех задач бюджетного процесса'");
	Иначе
		ТекстПримечания = НСтр("en='В отчете отображаются все задачи, период выполнения которых "
"входит в период отчета."
"Вариант отчета предназначен для контроля исполнения задач бюджетного процесса';ru='В отчете отображаются все задачи, период выполнения которых "
"входит в период отчета."
"Вариант отчета предназначен для контроля исполнения задач бюджетного процесса'");
	КонецЕсли;
	
	Элементы.ПримечаниеКВариантуОтчета.Заголовок = ТекстПримечания;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСведенияОЗадачах()
	
	Компановка = Отчеты.ВыполнениеЗадачБюджетногоПроцесса.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	Настройки = Новый НастройкиКомпоновкиДанных;
	
	ГруппировкаДетали = Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	ГруппировкаДетали.Использование = Истина;
	
	ВыбранноеПоле = ГруппировкаДетали.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПоле.Использование = Истина;
	ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("НеВыполнено");
	ВыбранноеПоле.Заголовок = "НеВыполнено";

 	ВыбранноеПоле = ГруппировкаДетали.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПоле.Использование = Истина;
	ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("Просроченные");
	ВыбранноеПоле.Заголовок = "Просроченные";
	
	Отбор = Настройки.Отбор;
	НовыйОтбор = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("МодельБюджетирования");
	НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	НовыйОтбор.ПравоеЗначение = Объект.МодельБюджетирования;
	НовыйОтбор.Использование = Истина;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Макет = КомпоновщикМакета.Выполнить(Компановка, Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(Макет);
	ПроцессорКомпоновки.Сбросить();
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	Таблица = Новый ТаблицаЗначений;
	ПроцессорВывода.УстановитьОбъект(Таблица);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	ШаблонЗаголовка = НСтр("en='Выполняется задач: %1, из них просрочено: %2';ru='Выполняется задач: %1, из них просрочено: %2'");
	
	Элементы.ТекущиеНевыполненныеЗадачи.Заголовок = 
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонЗаголовка, Таблица.Итог("НеВыполнено"), Таблица.Итог("Просроченные"));
	
КонецПроцедуры

&НаСервере
Процедура ПривестиЗначениеПериода(ВидПериода)
	
	НачалоПериода = ОбщегоНазначенияУТКлиентСервер.НачалоПериодаОтчета(ВидПериода, НачалоПериода);
	КонецПериода =  ОбщегоНазначенияУТКлиентСервер.КонецПериодаОтчета(ВидПериода, НачалоПериода);
	
	СписокПериодов = ОбщегоНазначенияУТКлиентСервер.ПолучитьСписокПериодов(НачалоПериода, ВидПериода);
	ЭлементСписка = СписокПериодов.НайтиПоЗначению(НачалоПериода);
	
	Если ЭлементСписка = Неопределено Тогда
		Период = "";
	Иначе
		Период = ЭлементСписка.Представление;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодНачалоВыбораЗавершение(ВыбранныйПериод, ДополнительныеПараметры) Экспорт

	Если ВыбранныйПериод <> Неопределено Тогда
		
		Период = ВыбранныйПериод.Представление;
		
		НачалоПериода = ВыбранныйПериод.Значение;
		КонецПериода = ОбщегоНазначенияУТКлиентСервер.КонецПериодаОтчета(ВидПериода, ВыбранныйПериод.Значение);
		
	КонецЕсли; 
	
КонецПроцедуры


#КонецОбласти
