
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Отказ = Истина;
	ОбщегоНазначения.СообщитьПользователю("Проведение документа не реализовано.");

	//МожноЗаписывать = МеКаМи_ОбщегоНазначения.ПроверитьВозможностьПроведения(Дата);
	//Если НЕ МожноЗаписывать Тогда
	//	Отказ = Истина;
	//	Сообщить("Изменение данных данного периода запрещено.");
	//КонецЕсли;	
	//
	//ЕстьНезаполненноеТС = ЛОЖЬ;
	//ЕстьПустаяСумма = ЛОЖЬ;
	//ЕстьНезаполненноеПУ = ЛОЖЬ;
	//Для Каждого Строка из ТЧ Цикл
	//	Если Строка.Сумма = 0 Тогда
	//		ЕстьПустаяСумма = Истина;
	//	КонецЕсли;
	//	Если Строка.ТС.Пустая() Тогда
	//		ЕстьНезаполненноеТС = Истина;
	//	КонецЕсли;
	//	Если Строка.ПУ.Пустая() Тогда
	//		ЕстьНезаполненноеПУ = Истина;
	//	КонецЕсли;
	//КонецЦикла;
	//Если ЕстьНезаполненноеТС Тогда
	//	Сообщить("В табличной части есть незаполненное поле ТС. Это ошибка!");
	//	Отказ = Истина;
	//КонецЕсли;	
	//Если ЕстьПустаяСумма Тогда
	//	Сообщить("В табличной части есть поле сумма = 0. Это ошибка!");
	//	Отказ = Истина;
	//КонецЕсли;	
	//Если ЕстьНезаполненноеПУ Тогда
	//	Сообщить("В табличной части есть незаполненное поле ПУ. Это ошибка!");
	//	Отказ = Истина;
	//КонецЕсли;	
	
	//тзДанныеРеестра = Новый ТаблицаЗначений;
	//тзДанныеРеестра.Колонки.Добавить("Период");
	//тзДанныеРеестра.Колонки.Добавить("ПутевойЛист");
	//тзДанныеРеестра.Колонки.Добавить("ТС");
	//тзДанныеРеестра.Колонки.Добавить("Номенклатура");
	//тзДанныеРеестра.Колонки.Добавить("ДатаС");
	//тзДанныеРеестра.Колонки.Добавить("Расценка");
	//тзДанныеРеестра.Колонки.Добавить("Водитель");
	//тзДанныеРеестра.Колонки.Добавить("Подразделение");
	//тзДанныеРеестра.Колонки.Добавить("Локация");
	//тзДанныеРеестра.Колонки.Добавить("Контрагент");
	//тзДанныеРеестра.Колонки.Добавить("ВидУслуг");
	//тзДанныеРеестра.Колонки.Добавить("ОбщийУчасток");
	//тзДанныеРеестра.Колонки.Добавить("Количество");
	//тзДанныеРеестра.Колонки.Добавить("Сумма");
	//тзДанныеРеестра.Колонки.Добавить("СуммаНДС");
	//тзДанныеРеестра.Колонки.Добавить("СуммаВсего");
	//тзДанныеРеестра.Колонки.Добавить("КоличествоТонн");
	//тзДанныеРеестра.Колонки.Добавить("КоличествоКмГруз");
	//тзДанныеРеестра.Колонки.Добавить("РасходПофакту");
	//
	////Если Дата >= Дата(2022,5,1) Тогда
	//	НоменклатураДоставкаГСМ = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул","СТ00000010");
	//	
	//	//По решению от главного диспетчера - все записи в путевом листе идут с одной строкой.
	//	Движения.СитэкТранс_ДанныеРеестраПутевыхЛистов.Записывать = Истина;
	//	Для Каждого ТекСтрокаПутевыеЛисты Из ТЧ_ПоПЛ Цикл
	//		//Движение = Движения.СитэкТранс_ДанныеРеестраПутевыхЛистов.Добавить();
	//		НоваяСрока = тзДанныеРеестра.Добавить();
	//		
	//		НоваяСрока.Период           = Дата;
	//		НоваяСрока.ПутевойЛист      = ТекСтрокаПутевыеЛисты.ПЛ; 
	//		НоваяСрока.ТС               = ТекСтрокаПутевыеЛисты.ПЛ.ТранспортноеСредство; 
	//		НоваяСрока.Номенклатура     = НоменклатураДоставкаГСМ;
	//		НоваяСрока.ДатаС            = ТекСтрокаПутевыеЛисты.ПЛ.Задание[0].ВремяПрибытия;
	//		НоваяСрока.Расценка         = ?(ТекСтрокаПутевыеЛисты.Количество = 0, 0, ТекСтрокаПутевыеЛисты.Сумма / ТекСтрокаПутевыеЛисты.Количество);
	//		НоваяСрока.Водитель         = ТекСтрокаПутевыеЛисты.ПЛ.Водитель1; 
	//		НоваяСрока.Подразделение    = ТекСтрокаПутевыеЛисты.ПЛ.Задание[0].Подразделение;
	//		НоваяСрока.Локация          = ТекСтрокаПутевыеЛисты.ПУ;
	//		НоваяСрока.Контрагент       = Контрагент;
	//		НоваяСрока.ВидУслуг         = ТекСтрокаПутевыеЛисты.ПЛ.Задание[0].ВидУслуг;
	//		НоваяСрока.ОбщийУчасток     = ТекСтрокаПутевыеЛисты.ПЛ.Задание[0].ОбщийУчасток;
	//		
	//		НоваяСрока.Количество       = ТекСтрокаПутевыеЛисты.Количество;
	//		НоваяСрока.Сумма            = ТекСтрокаПутевыеЛисты.Сумма;
	//		НоваяСрока.СуммаНДС   	  = ТекСтрокаПутевыеЛисты.Сумма * 0.22;
	//		НоваяСрока.СуммаВсего		  = ТекСтрокаПутевыеЛисты.Сумма * 1.22;
	//		НоваяСрока.КоличествоТонн   = ТекСтрокаПутевыеЛисты.ПЛ.Задание[0].КоличествоТонн;
	//		НоваяСрока.КоличествоКмГруз = ТекСтрокаПутевыеЛисты.ПЛ.Задание[0]._КоличествоКмГрузДляРеестра;
	//		НоваяСрока.РасходПофакту    = 0;
	//		Для каждого СтрокаГСМ из ТекСтрокаПутевыеЛисты.ПЛ.РасходГСМ Цикл 
	//			НоваяСрока.РасходПофакту = НоваяСрока.РасходПофакту + СтрокаГСМ.РасходПоФакту;	
	//		КонецЦикла;	
	//		
	//	КонецЦикла;
	////Конецесли;
	//тзДанныеРеестра.Свернуть("Период,ПутевойЛист,ТС,Номенклатура,ДатаС,Водитель,Подразделение,Локация,Контрагент,ВидУслуг,ОбщийУчасток,КоличествоТонн,КоличествоКмГруз,РасходПофакту","Количество,Сумма,СуммаНДС,СуммаВсего");
	//тзДанныеРеестра.Колонки.Добавить("Расценка");
	//Для каждого Строка из тзДанныеРеестра Цикл
	//	Строка.Расценка = ?(Строка.Количество = 0, 0, Строка.Сумма / Строка.Количество);
	//КонецЦикла;
	////По решению от главного диспетчера - все записи в путевом листе идут с одной строкой.
	//Движения.СитэкТранс_ДанныеРеестраПутевыхЛистов.Записывать = Истина;
	//Движения.СитэкТранс_ДанныеРеестраПутевыхЛистов.Загрузить(тзДанныеРеестра);	
	//
	//тзПутевыеЛисты = тзДанныеРеестра.Скопировать();  
	//тзПутевыеЛисты.Свернуть("ПутевойЛист");
	//
	//Для каждого Строка Из тзПутевыеЛисты Цикл
	//	МенеджерЗаписи = РегистрыСведений.СитэкТранс_РеестрыПутевыхЛистов.СоздатьМенеджерЗаписи();
	//	МенеджерЗаписи.ПутевойЛист = Строка.ПутевойЛист;
	//	МенеджерЗаписи.НомерРеестра = Номер;
	//	МенеджерЗаписи.Реестр = Ссылка;
	//	МенеджерЗаписи.Записать();
	//КонецЦикла;

КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Префикс = "ДТ";
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//Если Проведен и (РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения) и (Дата >= Дата(2023,7,1)) и (не отказ) Тогда
	//	Отказ = МеКаМи_ФункцииОбменаЧерезCOM.ОпределитьПроведенДокументВ_БП(Номер,Дата) 
	//КонецЕсли;	
	//
	//Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
	//	МожноЗаписывать = МеКаМи_ОбщегоНазначения.ПроверитьВозможностьПроведения(Дата);
	//	Если НЕ МожноЗаписывать Тогда
	//		Отказ = Истина;
	//		Сообщить("Изменение данных данного периода запрещено.");
	//	КонецЕсли;
	//КонецЕсли;
	
КонецПроцедуры

