#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Записать данные предпросмотра.
// 
// Параметры:
//  Файл -  СправочникССылка.Файлы
//  HTMLПредставление - Строка
//  ВерсияФайла - СправочникСсылка.ВерсииФайлов
//  ПредпросмотрУрезан  - Булево
Процедура ДобавитьЗапись(Идентификатор, Файлы) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Идентификатор.Установить(Идентификатор);
	
	Для Каждого Стр Из Файлы Цикл
		НоваяЗапись = НаборЗаписей.Добавить();
		
		НоваяЗапись.Идентификатор       = Идентификатор;
		НоваяЗапись.ИдентификаторФайла  = Стр.ИдентификаторФайла;
		НоваяЗапись.ДатаФайла           = ТекущаяДатаСеанса();
		
		НоваяЗапись.Имя                 = Стр.Имя;
		НоваяЗапись.Размер              = Стр.Размер;
		НоваяЗапись.Расширение          = Стр.Расширение;
		НоваяЗапись.ДвоичныеДанныеФайла = Новый ХранилищеЗначения(Стр.ДвоичныеДанныеФайла, Новый СжатиеДанных);
		
	КонецЦикла;
	
	НаборЗаписей.Записать();

КонецПроцедуры

// Очищает HTML представление файла
// 
// Параметры:
//  Файл - СправочникССылка.Файлы
Процедура Удалить(Идентификатор) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Идентификатор.Установить(Идентификатор);
	
	НаборЗаписей.Записать(); // удалим все по отбору
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
