////////////////////////////////////////////////////////////////////////////////
// Управление автотранспортом.
// 
// Защищенные функции серверного контекста.
// 
// Содержит код, используемый в варианте поставке СТД, ПРОФ, КОРП
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьВнутреннийХешОрганизации(Организация) Экспорт
	
	ДанныеОрганизацииПакет = Новый Структура("ХешСумма,ContentOptionsPack", "", "");
	
	ЗащищеннаяОбработка = уатЗащищенныеФункцииСервер.ПолучитьЗащищеннуюОбработку();
	Если ЗащищеннаяОбработка = Неопределено Тогда
		Возврат ДанныеОрганизацииПакет;
	КонецЕсли;
	
	Возврат ЗащищеннаяОбработка.ПолучитьВнутреннийХешОрганизации(Организация);

КонецФункции

Функция ПолучитьВнутреннийХешОрганизаций() Экспорт
	
	ВнутреннийХешОрганизаций = Новый Соответствие();
	
	ЗащищеннаяОбработка = уатЗащищенныеФункцииСервер.ПолучитьЗащищеннуюОбработку();
	Если ЗащищеннаяОбработка = Неопределено Тогда
		Возврат ВнутреннийХешОрганизаций;
	КонецЕсли;
	
	Возврат ЗащищеннаяОбработка.ПолучитьВнутреннийХешОрганизаций();

КонецФункции

#КонецОбласти 
 