
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнициализироватьСоответствиеЗаголовковФайлов();
	УстановитьТекущуюСтраницу(Параметры.Операция);
	ПолеHTML = Элементы.Декорация1.Заголовок;
	Элементы.Далее.КнопкаПоУмолчанию = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Организация = ВладелецФормы.Объект.Организация;
	УстановитьВидимость();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИскатьЗаказНаТСПоДатеПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуДоходыНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОткрытия = Новый Структура("ИмяРеквизитаПутьКФайлу, ЗаголовокДиалога", "ПутьКФайлуДоходы", НСтр("en='Select the file ""Income""';ru='Выберите файл ""Доходы""'"));
	Обработчик        = Новый ОписаниеОповещения("ПоказатьДиалогВыбораФайла", ЭтотОбъект, ПараметрыОткрытия);
	НачатьПодключениеРасширенияРаботыСФайлами(Обработчик);
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуРасходыНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОткрытия = Новый Структура("ИмяРеквизитаПутьКФайлу, ЗаголовокДиалога", "ПутьКФайлуРасходы", НСтр("en='Select the file ""Income""';ru='Выберите файл ""Расходы""'"));
	Обработчик        = Новый ОписаниеОповещения("ПоказатьДиалогВыбораФайла", ЭтотОбъект, ПараметрыОткрытия);
	НачатьПодключениеРасширенияРаботыСФайлами(Обработчик);
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуОстаткиДСНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОткрытия = Новый Структура("ИмяРеквизитаПутьКФайлу, ЗаголовокДиалога", "ПутьКФайлуОстаткиДС", НСтр("en='Select the file ""Cash balances""';ru='Выберите файл ""Остатки денежных средств""'"));
	Обработчик        = Новый ОписаниеОповещения("ПоказатьДиалогВыбораФайла", ЭтотОбъект, ПараметрыОткрытия);
	НачатьПодключениеРасширенияРаботыСФайлами(Обработчик);
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуОстаткиДСПодотчетныхЛицНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОткрытия = Новый Структура("ИмяРеквизитаПутьКФайлу, ЗаголовокДиалога", "ПутьКФайлуОстаткиДСПодотчетныхЛиц", 
		НСтр("en='Select the file ""Balances of funds of accountable persons""';ru='Выберите файл ""Остатки денежных средств подотчетных лиц""'"));
	Обработчик        = Новый ОписаниеОповещения("ПоказатьДиалогВыбораФайла", ЭтотОбъект, ПараметрыОткрытия);
	НачатьПодключениеРасширенияРаботыСФайлами(Обработчик);
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуМатериалыНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОткрытия = Новый Структура("ИмяРеквизитаПутьКФайлу, ЗаголовокДиалога", "ПутьКФайлуМатериалы", НСтр("en='Select the file ""Lots of goods in warehouses""';ru='Выберите файл ""Партии товаров на складах""'"));
	Обработчик        = Новый ОписаниеОповещения("ПоказатьДиалогВыбораФайла", ЭтотОбъект, ПараметрыОткрытия);
	НачатьПодключениеРасширенияРаботыСФайлами(Обработчик);
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуДоходыОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ЗначениеЗаполнено(ПутьКФайлуДоходы) Тогда 
		СообщениеПользователю(НСтр("en='You must select a file';ru='Необходимо выбрать файл'"), "ПутьКФайлуДоходы");
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПутьКФайлуПослеОткрытия", ЭтотОбъект);
	НачатьЗапускПриложения(Оповещение, ПутьКФайлуДоходы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуРасходовОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ЗначениеЗаполнено(ПутьКФайлуРасходы) Тогда 
		СообщениеПользователю(НСтр("en='You must select a file';ru='Необходимо выбрать файл'"), "ПутьКФайлуРасходы");
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПутьКФайлуПослеОткрытия", ЭтотОбъект);
	НачатьЗапускПриложения(Оповещение, ПутьКФайлуРасходы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуОстаткиДСПодотчетныхЛицОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ЗначениеЗаполнено(ПутьКФайлуОстаткиДСПодотчетныхЛиц) Тогда 
		СообщениеПользователю(НСтр("en='You must select a file';ru='Необходимо выбрать файл'"), "ПутьКФайлуОстаткиДСПодотчетныхЛиц");
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПутьКФайлуПослеОткрытия", ЭтотОбъект);
	НачатьЗапускПриложения(Оповещение, ПутьКФайлуОстаткиДСПодотчетныхЛиц);
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуОстаткиДСОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ЗначениеЗаполнено(ПутьКФайлуОстаткиДС) Тогда 
		СообщениеПользователю(НСтр("en='You must select a file';ru='Необходимо выбрать файл'"), "ПутьКФайлуОстаткиДС");
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПутьКФайлуПослеОткрытия", ЭтотОбъект);
	НачатьЗапускПриложения(Оповещение, ПутьКФайлуОстаткиДС);
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуМатериалыОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ЗначениеЗаполнено(ПутьКФайлуМатериалы) Тогда 
		СообщениеПользователю(НСтр("en='You must select a file';ru='Необходимо выбрать файл'"), "ПутьКФайлуМатериалы");
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПутьКФайлуПослеОткрытия", ЭтотОбъект);
	НачатьЗапускПриложения(Оповещение, ПутьКФайлуМатериалы);
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница = Элементы.СтраницаОстаткиДС Тогда
		КассаБанковскийСчет = Элементы.КассаБанковскийСчет.СписокВыбора[0];
		УстановитьВидимость();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КассаБанковскийСчетПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьШаблонДоходы(Команда)
	СохранитьШаблонФайла("ШаблонДоходы");
КонецПроцедуры

&НаКлиенте
Процедура СохранитьШаблонРасходы(Команда)
	СохранитьШаблонФайла("ШаблонРасходы");
КонецПроцедуры

&НаКлиенте
Процедура СохранитьШаблонОстаткиДС(Команда)
	Если КассаБанковскийСчет = "Касса" Тогда
		СохранитьШаблонФайла("ШаблонОстаткиДСВКассах");
	Иначе
		СохранитьШаблонФайла("ШаблонОстаткиДСНаБанковскихСчетах");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьШаблонОстаткиДСПодотчетныхЛиц(Команда)
	СохранитьШаблонФайла("ШаблонОстаткиДСПодотчетныхЛиц");
КонецПроцедуры

&НаКлиенте
Процедура СохранитьШаблонМатериалы(Команда)
	СохранитьШаблонФайла("ШаблонМатериалы");
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьДоходы(Команда)
	
	Если Не ЗначениеЗаполнено(ПутьКФайлуДоходы) Тогда 
		СообщениеПользователю(НСтр("en='You must select a file';ru='Необходимо выбрать файл'"), "ПутьКФайлуДоходы");
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ИмяТаблицы",              "Доходы");
	ДополнительныеПараметры.Вставить("ПутьКФайлу",              ПутьКФайлуДоходы);
	ДополнительныеПараметры.Вставить("НомерПервойСтрокиДанных", НомерПервойСтрокиДанныхДоходов);
	
	Если Доходы.Количество() Тогда 
		ТекстВопроса = НСтр("en='The table ""Income"" will be cleared. Continue?';ru='Таблица ""Доходы"" будет очищена. Продолжить?'");
		Оповещение = Новый ОписаниеОповещения("ОчиститьТаблицуДанных", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
	Иначе 
		ПрочитатьДанныеИзФайла(ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьРасходы(Команда)
	Если Не ЗначениеЗаполнено(ПутьКФайлуРасходы) Тогда 
		СообщениеПользователю(НСтр("en='You must select a file';ru='Необходимо выбрать файл'"), "ПутьКФайлуРасходы");
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ИмяТаблицы",              "Расходы");
	ДополнительныеПараметры.Вставить("ПутьКФайлу",              ПутьКФайлуРасходы);
	ДополнительныеПараметры.Вставить("НомерПервойСтрокиДанных", НомерПервойСтрокиДанныхРасходов);
	
	Если Расходы.Количество() Тогда 
		ТекстВопроса = НСтр("en='The table ""Expenses"" will be cleared. Continue?';ru='Таблица ""Расходы"" будет очищена. Продолжить?'");
		Оповещение = Новый ОписаниеОповещения("ОчиститьТаблицуДанных", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
	Иначе 
		ПрочитатьДанныеИзФайла(ДополнительныеПараметры);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьОстаткиДС(Команда)
	Если Не ЗначениеЗаполнено(ПутьКФайлуОстаткиДС) Тогда 
		СообщениеПользователю(НСтр("en='You must select a file';ru='Необходимо выбрать файл'"), "ПутьКФайлуОстаткиДС");
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ИмяТаблицы",              "ОстаткиДС");
	ДополнительныеПараметры.Вставить("ПутьКФайлу",              ПутьКФайлуОстаткиДС);
	ДополнительныеПараметры.Вставить("НомерПервойСтрокиДанных", НомерПервойСтрокиДанныхОстатковДС);
	
	Если ОстаткиДС.Количество() Тогда 
		ТекстВопроса = НСтр("en='The table ""Cash balances"" will be cleared. Continue?';ru='Таблица ""Остатки денежных средств"" будет очищена. Продолжить?'");
		Оповещение = Новый ОписаниеОповещения("ОчиститьТаблицуДанных", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
	Иначе 
		ПрочитатьДанныеИзФайла(ДополнительныеПараметры);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьОстаткиДСПодотчетныхЛиц(Команда)
	Если Не ЗначениеЗаполнено(ПутьКФайлуОстаткиДСПодотчетныхЛиц) Тогда 
		СообщениеПользователю(НСтр("en='You must select a file';ru='Необходимо выбрать файл'"), "ПутьКФайлуОстаткиДСПодотчетныхЛиц");
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ИмяТаблицы",              "ОстаткиДСПодотчетныхЛиц");
	ДополнительныеПараметры.Вставить("ПутьКФайлу",              ПутьКФайлуОстаткиДСПодотчетныхЛиц);
	ДополнительныеПараметры.Вставить("НомерПервойСтрокиДанных", НомерПервойСтрокиДанныхОстатковДСПодотчетныхЛиц);
	
	Если ОстаткиДСПодотчетныхЛиц.Количество() Тогда 
		ТекстВопроса = НСтр("en='The table ""Balances of funds of accountable persons"" will be cleared. Continue?';ru='Таблица ""Остатки денежных средств подотчетных лиц"" будет очищена. Продолжить?'");
		Оповещение = Новый ОписаниеОповещения("ОчиститьТаблицуДанных", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
	Иначе 
		ПрочитатьДанныеИзФайла(ДополнительныеПараметры);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьМатериалы(Команда)
	
	Если Не ЗначениеЗаполнено(ПутьКФайлуМатериалы) Тогда 
		СообщениеПользователю(НСтр("en='You must select a file';ru='Необходимо выбрать файл'"), "ПутьКФайлуМатериалы");
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ИмяТаблицы",              "Материалы");
	ДополнительныеПараметры.Вставить("ПутьКФайлу",              ПутьКФайлуМатериалы);
	ДополнительныеПараметры.Вставить("НомерПервойСтрокиДанных", НомерПервойСтрокиДанныхМатериалов);
	
	Если Материалы.Количество() Тогда 
		ТекстВопроса = НСтр("en='The table ""Materials"" will be cleared. Continue?';ru='Таблица ""Материалы"" будет очищена. Продолжить?'");
		Оповещение = Новый ОписаниеОповещения("ОчиститьТаблицуДанных", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
	Иначе 
		ПрочитатьДанныеИзФайла(ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	ТаблСообщенияПеренос.Очистить();
	
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаДоходы Тогда
		ПеренестиДоходы();
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаРасходы Тогда
		ПеренестиРасходы();
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОстаткиДСПодотчетныхЛиц Тогда
		ПеренестиОстаткиДСПодотчетныхЛиц();
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОстаткиДС Тогда
		ПеренестиОстаткиДС();
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаМатериалы Тогда
		ПеренестиМатериалы();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиДоходы()
	
	Если Не ПроверитьЗаполнениеОбязательныхПолей("Доходы") Тогда 
		Возврат;
	КонецЕсли;
	
	МассивСтруктурДляПереноса.Очистить();
	СтруктураЗаголовок = Новый Структура;
	СтруктураЗаголовок.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.уатВидыОперацийВводОстатков.ОперативныеДоходы"));
	СтруктураЗаголовок.Вставить("ТаблицаДокумента", "Доходы");
	МассивСтруктурДляПереноса.Добавить(СтруктураЗаголовок);
	
	СчВсего   = 0;
	СчПеренесено = 0;
	
	ОбработатьТаблицуДоходы(СчВсего, СчПеренесено);
	ШаблонСообщения = НСтр(
		"en = 'Rows moved: %1'; ru = 'Строк перенесено: %1'"
	);
	Если ТаблСообщенияПеренос.Количество() > 0 Тогда
		ШаблонСообщения = ШаблонСообщения + Символы.ПС + НСтр("ru = 'При загрузке не все поля были перенесены.'; en = 'Not all fields were transferred during loading.'"
		);
	КонецЕсли;
	
	ПоказатьПредупреждение(Новый ОписаниеОповещения("ПеренестиТЧЗавершение",ЭтотОбъект, Новый Структура), СтрШаблон(ШаблонСообщения, СчПеренесено));
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиРасходы()
	
	Если Не ПроверитьЗаполнениеОбязательныхПолей("Расходы") Тогда 
		Возврат;
	КонецЕсли;
	
	МассивСтруктурДляПереноса.Очистить();
	СтруктураЗаголовок = Новый Структура;
	СтруктураЗаголовок.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.уатВидыОперацийВводОстатков.ОперативныеРасходы"));
	СтруктураЗаголовок.Вставить("ТаблицаДокумента", "Расходы");
	МассивСтруктурДляПереноса.Добавить(СтруктураЗаголовок);
	
	СчВсего   = 0;
	СчПеренесено = 0;
	
	ОбработатьТаблицуРасходы(СчВсего, СчПеренесено);
	
	ШаблонСообщения = НСтр(
		"en = 'Rows moved: %1'; ru = 'Строк перенесено: %1'"
	);
	
	Если ТаблСообщенияПеренос.Количество() > 0 Тогда
		ШаблонСообщения = ШаблонСообщения + Символы.ПС + НСтр("ru = 'При загрузке не все поля были перенесены.'; en = 'Not all fields were transferred during loading.'"
		);
	КонецЕсли;
	
	ПоказатьПредупреждение(Новый ОписаниеОповещения("ПеренестиТЧЗавершение",ЭтотОбъект, Новый Структура), СтрШаблон(ШаблонСообщения, СчПеренесено));
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиОстаткиДС()
	
	Если Не ПроверитьЗаполнениеОбязательныхПолей("ОстаткиДС") Тогда 
		Возврат;
	КонецЕсли;
	
	МассивСтруктурДляПереноса.Очистить();
	
	СчВсего   = 0;
	СчПеренесено = 0;
	Операция = 0;
	
	ОбработатьТаблицуОстаткиДС(СчВсего, СчПеренесено);
	ПолучитьОперацияДляПереносаОстатковДС(Операция);
	
	СтруктураЗаголовок = Новый Структура;
	СтруктураЗаголовок.Вставить("ВидОперации", Операция);
	СтруктураЗаголовок.Вставить("ТаблицаДокумента", "ОстаткиДС");
	МассивСтруктурДляПереноса.Вставить(0, СтруктураЗаголовок);
	
	ШаблонСообщения = НСтр(
		"en = 'Rows moved: %1'; ru = 'Строк перенесено: %1'"
	);
	
	Если ТаблСообщенияПеренос.Количество() > 0 Тогда
		ШаблонСообщения = ШаблонСообщения + Символы.ПС + НСтр("ru = 'При загрузке не все поля были перенесены.'; en = 'Not all fields were transferred during loading.'"
		);
	КонецЕсли;
	
	ПоказатьПредупреждение(Новый ОписаниеОповещения("ПеренестиТЧЗавершение",ЭтотОбъект, Новый Структура), СтрШаблон(ШаблонСообщения, СчПеренесено));
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиОстаткиДСПодотчетныхЛиц()
	
	Если Не ПроверитьЗаполнениеОбязательныхПолей("ОстаткиДСПодотчетныхЛиц") Тогда 
		Возврат;
	КонецЕсли;
	
	МассивСтруктурДляПереноса.Очистить();
	
	СчВсего   = 0;
	СчПеренесено = 0;
	Операция = 0;
	
	ОбработатьТаблицуОстаткиДСПодотчетныхЛиц(СчВсего, СчПеренесено);
	
	СтруктураЗаголовок = Новый Структура;
	СтруктураЗаголовок.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.уатВидыОперацийВводОстатков.ОстаткиДСПодотчетныхЛиц"));
	СтруктураЗаголовок.Вставить("ТаблицаДокумента", "ОстаткиДСПодотчетныхЛиц");
	МассивСтруктурДляПереноса.Вставить(0, СтруктураЗаголовок);
	
	ШаблонСообщения = НСтр(
		"en = 'Rows moved: %1'; ru = 'Строк перенесено: %1'"
	);
	
	Если ТаблСообщенияПеренос.Количество() > 0 Тогда
		ШаблонСообщения = ШаблонСообщения + Символы.ПС + НСтр("ru = 'При загрузке не все поля были перенесены.'; en = 'Not all fields were transferred during loading.'"
		);
	КонецЕсли;
	
	ПоказатьПредупреждение(Новый ОписаниеОповещения("ПеренестиТЧЗавершение",ЭтотОбъект, Новый Структура), СтрШаблон(ШаблонСообщения, СчПеренесено));
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиМатериалы()
	
	Если Не ПроверитьЗаполнениеОбязательныхПолей("Материалы") Тогда 
		Возврат;
	КонецЕсли;
	
	МассивСтруктурДляПереноса.Очистить();
	СтруктураЗаголовок = Новый Структура;
	СтруктураЗаголовок.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.уатВидыОперацийВводОстатков.ПартииТоваровНаСкладах"));
	СтруктураЗаголовок.Вставить("ТаблицаДокумента", "Материалы");
	МассивСтруктурДляПереноса.Добавить(СтруктураЗаголовок);
	
	СчВсего   = 0;
	СчПеренесено = 0;
	
	ОбработатьТаблицуМатериалы(СчВсего, СчПеренесено);
	
	ШаблонСообщения = НСтр(
		"en = 'Rows moved: %1'; ru = 'Строк перенесено: %1'"
	);
	
	Если ТаблСообщенияПеренос.Количество() > 0 Тогда
		ШаблонСообщения = ШаблонСообщения + Символы.ПС + НСтр("ru = 'При загрузке не все поля были перенесены.'; en = 'Not all fields were transferred during loading.'"
		);
	КонецЕсли;
	
	ПоказатьПредупреждение(Новый ОписаниеОповещения("ПеренестиТЧЗавершение",ЭтотОбъект, Новый Структура), СтрШаблон(ШаблонСообщения, СчПеренесено));
	
КонецПроцедуры

&НаКлиенте
Процедура Далее(Команда)
	Элементы.СтраницыОбщие.ТекущаяСтраница = Элементы.СтраницаЗагрузка;
	Элементы.ПеренестиВДокумент.КнопкаПоУмолчанию = Истина;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимость()
	
	Если ИскатьЗаказНаТСПоДате Тогда
		Элементы.ДоходыЗаказДата.Видимость = Истина;
		Элементы.РасходыЗаказДата.Видимость = Истина;
	Иначе
		Элементы.ДоходыЗаказДата.Видимость = Ложь;
		Элементы.РасходыЗаказДата.Видимость = Ложь;
	КонецЕсли;
	
	Если КассаБанковскийСчет = "Касса" Тогда
		Элементы.ОстаткиДСКасса.Видимость          = Истина;
		Элементы.ОстаткиДСБанковскийСчет.Видимость = Ложь;
		Элементы.ОстаткиДСКонтрагент.Видимость     = Ложь;
		Элементы.ОстаткиДСБИК.Видимость            = Ложь;
	Иначе
		Элементы.ОстаткиДСКасса.Видимость          = Ложь;
		Элементы.ОстаткиДСБанковскийСчет.Видимость = Истина;
		Элементы.ОстаткиДСКонтрагент.Видимость     = Истина;
		Элементы.ОстаткиДСБИК.Видимость            = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТекущуюСтраницу(Операция)
	Если Операция = Перечисления.уатВидыОперацийВводОстатков.ОперативныеДоходы Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаДоходы;
	ИначеЕсли Операция = Перечисления.уатВидыОперацийВводОстатков.ОперативныеРасходы Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаРасходы;
	ИначеЕсли Операция = Перечисления.уатВидыОперацийВводОстатков.ОстаткиДСВКассах Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОстаткиДС;
		КассаБанковскийСчет = Элементы.КассаБанковскийСчет.СписокВыбора[0];
	ИначеЕсли Операция = Перечисления.уатВидыОперацийВводОстатков.ОстаткиДСНаСчетах Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОстаткиДС;
		КассаБанковскийСчет = Элементы.КассаБанковскийСчет.СписокВыбора[1];
	ИначеЕсли Операция = Перечисления.уатВидыОперацийВводОстатков.ОстаткиДСПодотчетныхЛиц Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОстаткиДСПодотчетныхЛиц;
	ИначеЕсли Операция = Перечисления.уатВидыОперацийВводОстатков.ПартииТоваровНаСкладах Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаМатериалы;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДиалогВыбораФайла(Подключено, ДополнительныеПараметры) Экспорт
	
	Если НЕ Подключено Тогда
		
		Оповещение = Новый ОписаниеОповещения("НачатьУстановкуРасширенияРаботыСФайламиЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ТекстСообщения = НСтр("ru = 'Для продолжении работы необходимо установить расширение для веб-клиента ""1С:Предприятие"". Установить?'; en = 'To continue, you need to install an extension for 1C:Enterprise web client. Install?'");
		ПоказатьВопрос(Оповещение, ТекстСообщения, РежимДиалогаВопрос.ДаНет);
		Возврат;
		
	КонецЕсли;
	
	ОповещениеВыбора = Новый ОписаниеОповещения("ПутьКФайлуЗавершениеВыбора", ЭтотОбъект, ДополнительныеПараметры.ИмяРеквизитаПутьКФайлу);
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.ПолноеИмяФайла     = ЭтотОбъект[ДополнительныеПараметры.ИмяРеквизитаПутьКФайлу];
	ДиалогВыбораФайла.Фильтр             = НСтр("en='Excel file';ru='Файлы Excel'") + "(*.xls; *.xlsx)|*.xls;*.xlsx";
	ДиалогВыбораФайла.МножественныйВыбор = Ложь;
	ДиалогВыбораФайла.Заголовок          = ДополнительныеПараметры.ЗаголовокДиалога;
	
	ДиалогВыбораФайла.Показать(ОповещениеВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуЗавершениеВыбора(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ЭтотОбъект[ДополнительныеПараметры] = ВыбранныеФайлы[0];
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьШаблонФайла(Знач КлючШаблона)
	
	Если КлючШаблона = "ШаблонДоходы" Тогда 
		ПолноеИмяФайла = НСтр("en = 'Income'; ru = 'Доходы'") + ".xlsx";
		
	ИначеЕсли КлючШаблона = "ШаблонРасходы" Тогда 
		ПолноеИмяФайла = НСтр("en = 'Expenses'; ru = 'Расходы'") + ".xlsx";
		
	ИначеЕсли КлючШаблона = "ШаблонОстаткиДСВКассах" Тогда 
		ПолноеИмяФайла = НСтр("en = 'Cash balances'; ru = 'Остатки денежных средств в кассах'") + ".xlsx";
		
	ИначеЕсли КлючШаблона = "ШаблонОстаткиДСНаБанковскихСчетах" Тогда 
		ПолноеИмяФайла = НСтр("en = 'Cash balances'; ru = 'Остатки денежных средств на банковских счетах'") + ".xlsx";
		
	ИначеЕсли КлючШаблона = "ШаблонОстаткиДСПодотчетныхЛиц" Тогда 
		ПолноеИмяФайла = НСтр("en = 'Balances of funds of accountable persons'; ru = 'Остатки денежных средств подотчетных лиц'") + ".xlsx";
		
	ИначеЕсли КлючШаблона = "ШаблонМатериалы" Тогда 
		ПолноеИмяФайла = НСтр("en = 'Lots of goods in warehouses'; ru = 'Партии товаров на складах'") + ".xlsx";
	Иначе 
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура("ПолноеИмяФайла, КлючШаблона", ПолноеИмяФайла, КлючШаблона);
	Обработчик        = Новый ОписаниеОповещения("ПоказатьДиалогВыбораФайлаШаблона", ЭтотОбъект, ПараметрыОткрытия);
	НачатьПодключениеРасширенияРаботыСФайлами(Обработчик);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДиалогВыбораФайлаШаблона(Подключено, ДополнительныеПараметры) Экспорт
	
	Если НЕ Подключено Тогда
		
		Оповещение = Новый ОписаниеОповещения("НачатьУстановкуРасширенияРаботыСФайламиЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ТекстСообщения = НСтр("ru = 'Для продолжении работы необходимо установить расширение для веб-клиента ""1С:Предприятие"". Установить?'; en = 'To continue, you need to install an extension for 1C:Enterprise web client. Install?'");
		ПоказатьВопрос(Оповещение, ТекстСообщения, РежимДиалогаВопрос.ДаНет);
		Возврат;
		
	КонецЕсли;
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогВыбораФайла.ПолноеИмяФайла = ДополнительныеПараметры.ПолноеИмяФайла;
	ДиалогВыбораФайла.Фильтр = НСтр("en = 'Excel book'; ru = 'Книга Excel'") + " (*.xlsx)|*.xlsx";
	ДиалогВыбораФайла.МножественныйВыбор = Ложь;
	ДиалогВыбораФайла.Заголовок = "Выберите файл";
	
	ДопПараметры = Новый Структура();
	ДопПараметры.Вставить("КлючШаблона", ДополнительныеПараметры.КлючШаблона);
	
	Оповещение = Новый ОписаниеОповещения("СохранитьШаблонФайлаПослеВыбораФайла", ЭтотОбъект, ДопПараметры);
	
	ДиалогВыбораФайла.Показать(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьШаблонФайлаПослеВыбораФайла(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ТабДокШаблона = Новый ТабличныйДокумент;
	
	ТабДокШаблона = ПолучитьТабДокШаблонаДляСохранения(ДополнительныеПараметры.КлючШаблона);
	ТабДокШаблона.НачатьЗапись(, ВыбранныеФайлы[0], ТипФайлаТабличногоДокумента.XLSX);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТабДокШаблонаДляСохранения(Знач КлючШаблона)
	
	Возврат РеквизитФормыВЗначение("Объект").ПолучитьМакет(КлючШаблона);
	
КонецФункции // ПолучитьТабДокШаблонаДляСохранения()

&НаКлиенте
Процедура ОчиститьТаблицуДанных(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.ОК Тогда 
		ЭтотОбъект[ДополнительныеПараметры.ИмяТаблицы].Очистить();
		ПрочитатьДанныеИзФайла(ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьДанныеИзФайла(ДополнительныеПараметры)

	Обработчик = Новый ОписаниеОповещения("ПрочитатьДанныеИзФайлаПослеПодключения", ЭтотОбъект, ДополнительныеПараметры);
	НачатьПодключениеРасширенияРаботыСФайлами(Обработчик);
		
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьДанныеИзФайлаПослеПодключения(Подключено, ДополнительныеПараметры) Экспорт
	
	Если НЕ Подключено Тогда
		
		Оповещение = Новый ОписаниеОповещения("НачатьУстановкуРасширенияРаботыСФайламиЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ТекстСообщения = НСтр("ru = 'Для продолжении работы необходимо установить расширение для веб-клиента ""1С:Предприятие"". Установить?'; en = 'To continue, you need to install an extension for 1C:Enterprise web client. Install?'");
		ПоказатьВопрос(Оповещение, ТекстСообщения, РежимДиалогаВопрос.ДаНет);
		Возврат;
		
	КонецЕсли;
	
	#Если МобильныйКлиент ИЛИ МобильноеПриложениеКлиент Тогда
		ДвоичныеДанные = Новый ДвоичныеДанные(ДополнительныеПараметры.ПутьКФайлу); 
		ПрочитатьДанныеИзФайлаЗавершение(ДвоичныеДанные, ДополнительныеПараметры);
	#Иначе
		Оповещение = Новый ОписаниеОповещения("ПрочитатьДанныеИзФайлаЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		НачатьСозданиеДвоичныхДанныхИзФайла(Оповещение, ДополнительныеПараметры.ПутьКФайлу);
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьУстановкуРасширенияРаботыСФайламиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		НачатьУстановкуРасширенияРаботыСФайлами();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СообщениеПользователю(ТекстСообщения, Поле="", Отказ=Ложь)
	
	СообщениеПользователю = Новый СообщениеПользователю();
	СообщениеПользователю.Текст = ТекстСообщения;
	СообщениеПользователю.Поле  = Поле;
	СообщениеПользователю.Сообщить();
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьДанныеИзФайлаЗавершение(ДвоичныеДанные, ДополнительныеПараметры) Экспорт
	
	Если ДвоичныеДанные <> Неопределено Тогда
		
		Адрес = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор);
		РасширениеФайла = ОбщегоНазначенияКлиентСервер.РасширениеБезТочки(ОбщегоНазначенияКлиентСервер.ПолучитьРасширениеИмениФайла(ДополнительныеПараметры.ПутьКФайлу));
		
		Состояние(НСтр("en='Opening a file';ru='Открытие файла'") + " ...");
		
		Попытка
			ДокументДанных = ПолучитьТабличныйДокумент(Адрес, РасширениеФайла);
		Исключение
			ДокументДанных = Неопределено;
			СообщениеПользователю(НСтр("en='An error occurred while reading the document.';ru='Ошибка при чтении табличного документа.'"));
			Возврат;
		КонецПопытки;
		
		Попытка
			
			ВсегоСтрок = ДокументДанных.ВысотаТаблицы;
			ВсегоКолонок = ДокументДанных.ШиринаТаблицы;
			
		Исключение
			ДокументДанных = Неопределено;
			СообщениеПользователю(НСтр("en='Error while working with the document.';ru='Ошибка при работе с табличным документом.'"));
			Возврат;
		КонецПопытки;
		
		СтруктураШапки = ПолучитьСтруктуруШапки(ДополнительныеПараметры.ИмяТаблицы);
		
		НомерСтрокиШапки = Неопределено;
		
		Для НомерСтроки = 1 По ВсегоСтрок Цикл 
			Если НомерСтрокиШапки <> Неопределено Тогда 
				Прервать;
			КонецЕсли;
			
			Для НомерКолонки = 1 По ВсегоКолонок Цикл 
				ТекущееЗначение = НРег(СокрЛП(ДокументДанных.Область("R" + НомерСтроки + "C" + НомерКолонки).Текст));
				
				НомерУстановлен = Ложь;
				Для Каждого ТекКлюч Из СтруктураШапки Цикл 
					Если ТекКлюч.Значение.НомерКолонки <> 0 Тогда 
						Продолжить;
					КонецЕсли;
					
					Если ТекущееЗначение = ТекКлюч.Значение.ЗаголовокВФайле Тогда 
						ТекКлюч.Значение.НомерКолонки = НомерКолонки;
						НомерСтрокиШапки = НомерСтроки;
						НомерУстановлен = Истина;
					КонецЕсли;
				КонецЦикла;
				
				Если Не НомерУстановлен Тогда 
					Для Каждого ТекКлюч Из СтруктураШапки Цикл 
						Если ТекКлюч.Значение.НомерКолонки <> 0 Тогда 
							Продолжить;
						КонецЕсли;
						
						Если Лев(ТекущееЗначение, СтрДлина(ТекКлюч.Значение.ЗаголовокВФайле)) = ТекКлюч.Значение.ЗаголовокВФайле Тогда 
							ТекКлюч.Значение.НомерКолонки = НомерКолонки;
							НомерСтрокиШапки = НомерСтроки;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		Если НомерСтрокиШапки = Неопределено Тогда 
			ДокументДанных = Неопределено;
			СообщениеПользователю(НСтр("en='Invalid file format';ru='Неверный формат файла'"));
			Возврат;
		КонецЕсли;
		
		флНомераКолонокЗаполнены = Ложь;
		Для Каждого ТекКлюч Из СтруктураШапки Цикл 
			Если ЗначениеЗаполнено(ТекКлюч.Значение.НомерКолонки) Тогда 
				флНомераКолонокЗаполнены = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если Не флНомераКолонокЗаполнены Тогда 
			ДокументДанных = Неопределено;
			СообщениеПользователю(НСтр("en='Invalid file format';ru='Неверный формат файла'"));
			Возврат;
		КонецЕсли;
		
		ПерваяСтрокаДанных = ДополнительныеПараметры.НомерПервойСтрокиДанных;
		Если (НомерСтрокиШапки + 1) > ПерваяСтрокаДанных Тогда 
			ПерваяСтрокаДанных = НомерСтрокиШапки + 1;
		КонецЕсли;
		
		Для НомерСтроки = ПерваяСтрокаДанных По ВсегоСтрок Цикл 
			ОбработкаПрерыванияПользователя();
			ПрогрессЗагрузки = Окр((НомерСтроки / ВсегоСтрок) * 100, 0);
			Состояние(НСтр("en='Reading a file';ru='Чтение файла'") + " ...", ПрогрессЗагрузки);
			
			НоваяСтрока = ЭтотОбъект[ДополнительныеПараметры.ИмяТаблицы].Добавить();
			Для Каждого ТекКлюч Из СтруктураШапки Цикл 
				
				Попытка
					НоваяСтрокаКлюч = ТекКлюч.Ключ;
					мНоваяСтрока    = НоваяСтрока[НоваяСтрокаКлюч];
				Исключение
					НоваяСтрокаКлюч = СтрЗаменить(ТекКлюч.Ключ, "_1", "");
					мНоваяСтрока    = НоваяСтрока[НоваяСтрокаКлюч];
				КонецПопытки;
				
				ТекТипЯчейки = ТипЗнч(мНоваяСтрока);
				
				Если ТекКлюч.Значение.НомерКолонки = 0 Тогда 
					
					Продолжить;
					
				Иначе 
					
					ТекОбласть = "R" + НомерСтроки + "C" + ТекКлюч.Значение.НомерКолонки;
					ТекОбласть = СтрЗаменить(ТекОбласть,Символы.НПП,"");
					ТекОбласть = СтрЗаменить(ТекОбласть," ","");
					ТекЗначение = уатОбщегоНазначенияКлиентСервер.ПолучитьЗначениеЯчейкиТабличногоДокумента(
					ДокументДанных.Область(ТекОбласть),
					ТекТипЯчейки
					);
					
				КонецЕсли;
				
				НоваяСтрока[НоваяСтрокаКлюч] = ТекЗначение;
				
			КонецЦикла;
			
			флПустаяСтрока = Истина;
			Для Каждого ТекКлюч Из СтруктураШапки Цикл
				Попытка
					НоваяСтрокаКлюч = НоваяСтрока[ТекКлюч.Ключ];
				Исключение
					Попытка
						НоваяСтрокаКлюч = НоваяСтрока[СтрЗаменить(ТекКлюч.Ключ, "_1", "")];
					Исключение
					КонецПопытки;
				КонецПопытки;
				
				Если (ТипЗнч(НоваяСтрокаКлюч) = Тип("Булево") 
					И НоваяСтрокаКлюч = Истина)
					ИЛИ (ТипЗнч(НоваяСтрокаКлюч) <> Тип("Булево")
					И ЗначениеЗаполнено(НоваяСтрокаКлюч)) Тогда 
					флПустаяСтрока = Ложь;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если флПустаяСтрока Тогда 
				ЭтотОбъект[ДополнительныеПараметры.ИмяТаблицы].Удалить(НоваяСтрока);
			КонецЕсли;
		КонецЦикла;
		
		ПоказатьПредупреждение(, НСтр("en='Read file successfully completed';ru='Чтение файла завершено успешно'"));
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция ПолучитьТабличныйДокумент(Адрес, Расширение)
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(Расширение);
	ДвоичныеДанные = ПолучитьИЗВременногоХранилища(Адрес); // ДвоичныеДанные
	ДвоичныеДанные.Записать(ИмяВременногоФайла);
	
	Попытка
		ТабличныйДокумент = Новый ТабличныйДокумент;
		ТабличныйДокумент.Прочитать(ИмяВременногоФайла, СпособЧтенияЗначенийТабличногоДокумента.Значение);
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ОписаниеОшибки();
		Сообщение.Сообщить();
		Возврат Ложь;
	КонецПопытки;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

&НаКлиенте
Функция ПолучитьСтруктуруШапки(Знач ИмяТаблицы)
	
	СтруктураШапки = Новый Структура();
	
	Для Каждого ТекСтрока Из СоответствиеЗаголовковФайлов Цикл 
		Если ТекСтрока.ИмяТаблицы = ИмяТаблицы Тогда 
			ДанныеКлюча = Новый Структура();
			ДанныеКлюча.Вставить("НомерКолонки",        0);
			ДанныеКлюча.Вставить("ЗаголовокВФайле",     ТекСтрока.ЗаголовокВФайле);
			
			Если СтруктураШапки.Свойство(ТекСтрока.ИмяКолонки) Тогда
				СтруктураШапки.Вставить(ТекСтрока.ИмяКолонки + "_1", ДанныеКлюча);
			Иначе
				СтруктураШапки.Вставить(ТекСтрока.ИмяКолонки, ДанныеКлюча);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтруктураШапки;
	
КонецФункции // ПолучитьСтруктуруШапки()

&НаСервере
Процедура ИнициализироватьСоответствиеЗаголовковФайлов()
	
	Если Метаданные.Языки.Найти("Русский") <> Неопределено И ТекущийЯзык() = Метаданные.Языки.Русский Тогда 
		СуффиксЛокализации = "C3";
	ИначеЕсли Метаданные.Языки.Найти("Английский") <> Неопределено И ТекущийЯзык() = Метаданные.Языки.Английский Тогда 
		СуффиксЛокализации = "C4";
	Иначе 
		СуффиксЛокализации = "C3";
	КонецЕсли;
	
	МакетСоответствий = РеквизитФормыВЗначение("Объект").ПолучитьМакет("СоответствиеЗаголовковФайлов");
	
	Для СчСтрок = 1 По МакетСоответствий.ВысотаТаблицы Цикл 
		СчСтрокой = Формат(СчСтрок, "ЧН=0; ЧГ=0");
		
		СтрокаСоответствия = СоответствиеЗаголовковФайлов.Добавить();
		СтрокаСоответствия.ИмяТаблицы          = МакетСоответствий.Область("R"+СчСтрокой+"C1").Текст;
		СтрокаСоответствия.ИмяКолонки          = МакетСоответствий.Область("R"+СчСтрокой+"C2").Текст;
		СтрокаСоответствия.ЗаголовокВФайле     = НРег(МакетСоответствий.Область("R"+СчСтрокой+СуффиксЛокализации).Текст);
		СтрокаСоответствия.ПроверкаЗаполнения  = НРег(МакетСоответствий.Область("R"+СчСтрокой+"C4").Текст) = "да";
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЛокализованныеЗаголовкиРеквизитов(Знач ИмяТаблицы)
	
	ЛокализованныеЗаголовки = Новый Структура();
	
	Для Каждого ТекРеквизит Из ПолучитьРеквизиты(ИмяТаблицы) Цикл 
		ЛокализованныеЗаголовки.Вставить(ТекРеквизит.Имя, ТекРеквизит.Заголовок);
	КонецЦикла;
	
	Возврат ЛокализованныеЗаголовки;
	
КонецФункции // ПолучитьЛокализованныеЗаголовкиРеквизитов()

&НаКлиенте
Функция ПроверитьЗаполнениеОбязательныхПолей(Знач ИмяТаблицы)
	
	ЛокализованныеЗаголовки = ПолучитьЛокализованныеЗаголовкиРеквизитов(ИмяТаблицы);
	
	ЕстьОшибки = Ложь;
	
	ПроверяемыеРеквизиты = Новый Массив();
	
	Для Каждого ТекСтрока Из СоответствиеЗаголовковФайлов Цикл 
		Если ТекСтрока.ИмяТаблицы = ИмяТаблицы И ТекСтрока.ПроверкаЗаполнения Тогда 
			ПроверяемыеРеквизиты.Добавить(ТекСтрока.ИмяКолонки);
		КонецЕсли;
	КонецЦикла;
	
	Для СчСтрок = 0 По ЭтотОбъект[ИмяТаблицы].Количество() - 1 Цикл 
		ТекСтрока = ЭтотОбъект[ИмяТаблицы][СчСтрок];
		
		Для Каждого ПроверяемыйРеквизит Из ПроверяемыеРеквизиты Цикл 
			Если Не ЗначениеЗаполнено(ТекСтрока[ПроверяемыйРеквизит]) Тогда 
				ЗаголовокРеквизита = ЛокализованныеЗаголовки[ПроверяемыйРеквизит];
				ТекстОшибки = НСтр("ru = 'Не заполнено обязательное поле'; en = 'Required field is not filled'") + " """ + СтрЗаменить(ЗаголовокРеквизита, "*", "") + """.";
				ПолеОшибки = ИмяТаблицы + "["+Формат(СчСтрок, "ЧН=0; ЧГ=0")+"]." + ПроверяемыйРеквизит;
				СообщениеПользователю(ТекстОшибки, ПолеОшибки, ЕстьОшибки);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Не ЕстьОшибки;
	
КонецФункции // ПроверитьЗаполнениеОбязательныхПолей()

&НаСервере
Процедура ОбработатьТаблицуДоходы(СчВсего, СчПеренесено)
	
	ЗагружаемыеСсылки = Новый Соответствие;
	
	Для Каждого ТекСтрока Из Доходы Цикл
		Реквизиты = РеквизитыДоходов();
		ЗаполнитьЗначенияСвойств(Реквизиты, ТекСтрока);
		СоздатьСтрокуДоходовВводаОстатков(Реквизиты, СчПеренесено, СчВсего, ЗагружаемыеСсылки);
		СчВсего = СчВсего + 1;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьТаблицуРасходы(СчВсего, СчПеренесено)
	
	ЗагружаемыеСсылки = Новый Соответствие;
	
	Для Каждого ТекСтрока Из Расходы Цикл
		Реквизиты = РеквизитыРасходов();
		ЗаполнитьЗначенияСвойств(Реквизиты, ТекСтрока);
		СоздатьСтрокуРасходовВводаОстатков(Реквизиты, СчПеренесено, СчВсего, ЗагружаемыеСсылки);
		СчВсего = СчВсего + 1;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьТаблицуОстаткиДС(СчВсего, СчПеренесено)
	
	ЗагружаемыеСсылки = Новый Соответствие;
	
	Для Каждого ТекСтрока Из ОстаткиДС Цикл
		Реквизиты = РеквизитыОстатковДС();
		ЗаполнитьЗначенияСвойств(Реквизиты, ТекСтрока);
		СоздатьСтрокуОстатковДСВводаОстатков(Реквизиты, СчПеренесено, СчВсего, ЗагружаемыеСсылки);
		СчВсего = СчВсего + 1;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьТаблицуОстаткиДСПодотчетныхЛиц(СчВсего, СчПеренесено)
	
	ЗагружаемыеСсылки = Новый Соответствие;
	
	Для Каждого ТекСтрока Из ОстаткиДСПодотчетныхЛиц Цикл
		Реквизиты = РеквизитыОстатковДСПодотчетныхЛиц();
		ЗаполнитьЗначенияСвойств(Реквизиты, ТекСтрока);
		СоздатьСтрокуОстатковДСПодотчетныхЛицВводаОстатков(Реквизиты, СчПеренесено, СчВсего, ЗагружаемыеСсылки);
		СчВсего = СчВсего + 1;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьТаблицуМатериалы(СчВсего, СчПеренесено)
	
	ЗагружаемыеСсылки = Новый Соответствие;
	
	Для Каждого ТекСтрока Из Материалы Цикл
		Реквизиты = РеквизитыМатериалов();
		ЗаполнитьЗначенияСвойств(Реквизиты, ТекСтрока);
		СоздатьСтрокуМатериаловВводаОстатков(Реквизиты, СчПеренесено, СчВсего, ЗагружаемыеСсылки);
		СчВсего = СчВсего + 1;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция РеквизитыДоходов()
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("ДатаОтражения",        "");
	Реквизиты.Вставить("СтатьяДоходов",        "");
	Реквизиты.Вставить("Сумма",                 0);
	Реквизиты.Вставить("Колонна",              "");
	Реквизиты.Вставить("ТС",                   "");
	Реквизиты.Вставить("ЗаказДата",            ""); 
	Реквизиты.Вставить("ЗаказНомер",           "");
	Реквизиты.Вставить("Контрагент",           "");
	Реквизиты.Вставить("ОбъектСтроительства",  "");
	Реквизиты.Вставить("Маршрут",              "");
	Реквизиты.Вставить("ВидПеревозки",         "");
	Реквизиты.Вставить("НаправлениеПеревозки", "");
	Реквизиты.Вставить("ПараметрВыработки",    "");
	Реквизиты.Вставить("НоменклатураУслуги",   "");
	Реквизиты.Вставить("Валюта",               "");
	Реквизиты.Вставить("СтавкаНДС",            "");
	Возврат Реквизиты;
КонецФункции

&НаСервере
Функция РеквизитыРасходов()
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("ДатаОтражения",        "");
	Реквизиты.Вставить("СтатьяРасходов",       "");
	Реквизиты.Вставить("Сумма",                 0);
	Реквизиты.Вставить("Колонна",              "");
	Реквизиты.Вставить("ТС",                   "");
	Реквизиты.Вставить("ЗаказДата",            ""); 
	Реквизиты.Вставить("ЗаказНомер",           "");
	Реквизиты.Вставить("Контрагент",           "");
	Реквизиты.Вставить("ОбъектСтроительства",  "");
	Реквизиты.Вставить("Маршрут",              "");
	Реквизиты.Вставить("ВидПеревозки",         "");
	Реквизиты.Вставить("НаправлениеПеревозки", "");
	Реквизиты.Вставить("НоменклатураУслуги",   "");
	Реквизиты.Вставить("Валюта",               "");
	Реквизиты.Вставить("СтавкаНДС",            "");
	Возврат Реквизиты;
КонецФункции

&НаСервере
Функция РеквизитыОстатковДС()
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("ДатаОтражения",                 "");
	Реквизиты.Вставить("Касса",                         "");
	Реквизиты.Вставить("СтатьяДвиженияДенежныхСредств", "");
	Реквизиты.Вставить("Сумма",                          0);
	Реквизиты.Вставить("БанковскийСчет",                "");
	Реквизиты.Вставить("Контрагент",                    "");
	Реквизиты.Вставить("БИК",                           "");
	Возврат Реквизиты;
КонецФункции

&НаСервере
Функция РеквизитыОстатковДСПодотчетныхЛиц()
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("ДатаОтражения",   "");
	Реквизиты.Вставить("ПодотчетноеЛицо", "");
	Реквизиты.Вставить("Сумма",            0);
	Реквизиты.Вставить("Валюта",          "");
	Возврат Реквизиты;
КонецФункции

&НаСервере
Функция РеквизитыМатериалов()
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("ДатаОтражения", "");
	Реквизиты.Вставить("Склад",         "");
	Реквизиты.Вставить("Номенклатура",  "");
	Реквизиты.Вставить("Количество",     0);
	Реквизиты.Вставить("Стоимость",      0);
	Реквизиты.Вставить("СтоимостьУпр",   0);
	Возврат Реквизиты;
КонецФункции

&НаСервере
Процедура СоздатьСтрокуДоходовВводаОстатков(Реквизиты, СчПеренесено, СчВсего, ЗагружаемыеСсылки)
	
	СоздатьСтроку = Истина;
	ТекстСообщения = "";
	СтруктураСтроки = Новый Структура;
	СтруктураСтроки.Вставить("ДатаОтражения", Реквизиты.ДатаОтражения);
	
	СтрокаПоиска = "уатСтатьиДоходов/" + Реквизиты.СтатьяДоходов;
	СтатьяДоходов = ЗагружаемыеСсылки.Получить(СтрокаПоиска);
	
	Если СтатьяДоходов = Неопределено И ЗначениеЗаполнено(Реквизиты.СтатьяДоходов) Тогда
		
		СтатьяДоходов = НайтиСоздатьСтатьяДоходов(Реквизиты.СтатьяДоходов);
		
		Если СтатьяДоходов = Неопределено Тогда
			СоздатьСтроку = Ложь;
			ТекстСообщения = ТекстСообщения + Нстр("ru = 'Строка %1. Ошибка при создании статьи доходов: %2'; en = 'Line %1. Error creating income item: %2'") + Символы.ПС;
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%1", СчВсего + 1);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%2", Реквизиты.СтатьяДоходов);
		Иначе
			СтруктураСтроки.Вставить("СтатьяДоходов", СтатьяДоходов);
			ЗагружаемыеСсылки.Вставить(СтрокаПоиска, СтатьяДоходов);
		КонецЕсли;
	Иначе
		
		СтруктураСтроки.Вставить("СтатьяДоходов", СтатьяДоходов);
		
	КонецЕсли;
	
	СтрокаПоиска = "уатТС/" + Реквизиты.ТС;
	ТС = ЗагружаемыеСсылки.Получить(СтрокаПоиска);
	
	Если ТС = Неопределено И ЗначениеЗаполнено(Реквизиты.ТС) Тогда
		
		ТС = НайтиЭлементСправочника("уатТС", Реквизиты.ТС);
		
		Если ТС = Неопределено Тогда
			ТекстСообщения = ТекстСообщения + Нстр("ru = 'Для строки №%1 не найдено ТС: %2'; en = 'No vehicle found for line #%1: %2'") + Символы.ПС;
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%1", СчВсего + 1);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%2", Реквизиты.ТС);
			СтруктураСтроки.Вставить("ТС", Неопределено);
		Иначе
			СтруктураСтроки.Вставить("ТС", ТС);
			СтруктураСтроки.Вставить("Колонна", ТС.Колонна);
			ЗагружаемыеСсылки.Вставить(СтрокаПоиска, ТС);
		КонецЕсли;
		
	Иначе
		
		Колонна = ?(ТС = Неопределено, Неопределено, ТС.Колонна);
		СтруктураСтроки.Вставить("ТС", ТС);
		СтруктураСтроки.Вставить("Колонна", Колонна);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Реквизиты.ЗаказНомер) Тогда
		
		Заказ = НайтиДокумент(ИскатьЗаказНаТСПоДате, Реквизиты.ЗаказДата, Реквизиты.ЗаказНомер, "уатЗаказГрузоотправителя");
		
		Если Заказ.Пустой() Тогда
			ТекстСообщения = ТекстСообщения + Нстр("ru = 'Для строки №%1 не найден заказ на ТС: %2'; en = 'No order found for vehicle No. %1: %2'") + Символы.ПС;
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%1", СчВсего + 1);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%2", Реквизиты.ЗаказНомер + ?(ИскатьЗаказНаТСПоДате, " от " + Реквизиты.ЗаказДата, ""));
			СтруктураСтроки.Вставить("Заказ", Неопределено);
		Иначе
			СтруктураСтроки.Вставить("Заказ", Заказ.Выгрузить()[0].Ссылка);
		КонецЕсли;
	Иначе
		СтруктураСтроки.Вставить("Заказ", Неопределено);
	КонецЕсли;
	
	СтрокаПоиска = "Контрагенты/" + Реквизиты.Контрагент;
	Контрагент = ЗагружаемыеСсылки.Получить(СтрокаПоиска);
	
	Если Контрагент = Неопределено И ЗначениеЗаполнено(Реквизиты.Контрагент) Тогда
		
		Контрагент = НайтиЭлементСправочника("Контрагенты", Реквизиты.Контрагент);
		
		Если Контрагент = Неопределено Тогда
			ТекстСообщения = ТекстСообщения + Нстр("ru = 'Для строки №%1 не найден Контрагент: %2'; en = 'Counterparty not found for line #%1: %2'") + Символы.ПС;
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%1", СчВсего + 1);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%2", Реквизиты.Контрагент);
			СтруктураСтроки.Вставить("Контрагент", Неопределено);
		Иначе
			СтруктураСтроки.Вставить("Контрагент", Контрагент);
			ЗагружаемыеСсылки.Вставить(СтрокаПоиска, Контрагент);
		КонецЕсли;
		
	Иначе
		
		СтруктураСтроки.Вставить("Контрагент", Контрагент);
		
	КонецЕсли;
	
	СтрокаПоиска = "уатОбъектыСтроительства/" + Реквизиты.ОбъектСтроительства;
	ОбъектСтроительства = ЗагружаемыеСсылки.Получить(СтрокаПоиска);
	
	Если ОбъектСтроительства = Неопределено И ЗначениеЗаполнено(Реквизиты.ОбъектСтроительства) Тогда
		
		ОбъектСтроительства = НайтиСоздатьОбъектСтроительства(Реквизиты.ОбъектСтроительства);
		
		Если ОбъектСтроительства = Неопределено Тогда
			СоздатьСтроку = Ложь;
			ТекстСообщения = ТекстСообщения + Нстр("ru = 'Строка %1. Ошибка при создании Объекта строительства: %2'; en = 'Line %1. Error creating Construction Object: %2'") + Символы.ПС;
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%1", СчВсего + 1);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%2", Реквизиты.ОбъектСтроительства);
		Иначе
			СтруктураСтроки.Вставить("ОбъектСтроительства", ОбъектСтроительства);
			ЗагружаемыеСсылки.Вставить(СтрокаПоиска, ОбъектСтроительства);
		КонецЕсли;
	Иначе
		
		СтруктураСтроки.Вставить("ОбъектСтроительства", ОбъектСтроительства);
		
	КонецЕсли;
	
	СтрокаПоиска = "уатМаршруты/" + Реквизиты.Маршрут;
	Маршрут = ЗагружаемыеСсылки.Получить(СтрокаПоиска);
	
	Если Маршрут = Неопределено И ЗначениеЗаполнено(Реквизиты.Маршрут) Тогда
		
		Маршрут = НайтиСоздатьМаршруты(Реквизиты.Маршрут);
		
		Если Маршрут = Неопределено Тогда
			СоздатьСтроку = Ложь;
			ТекстСообщения = ТекстСообщения + Нстр("ru = 'Строка %1. Ошибка при создании Маршрута: %2'; en = 'Line %1. Error creating Route: %2'") + Символы.ПС;
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%1", СчВсего + 1);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%2", Реквизиты.Маршрут);
		Иначе
			СтруктураСтроки.Вставить("Маршрут", Маршрут);
			ЗагружаемыеСсылки.Вставить(СтрокаПоиска, Маршрут);
		КонецЕсли;
	Иначе
		
		СтруктураСтроки.Вставить("Маршрут", Маршрут);
		
	КонецЕсли;
	
	СтрокаПоиска = "уатВидыПеревозок/" + Реквизиты.ВидПеревозки;
	ВидПеревозки = ЗагружаемыеСсылки.Получить(СтрокаПоиска);
	
	Если ВидПеревозки = Неопределено И ЗначениеЗаполнено(Реквизиты.ВидПеревозки) Тогда
		
		ВидПеревозки = НайтиСоздатьВидПеревозки(Реквизиты.ВидПеревозки);
		
		Если ВидПеревозки = Неопределено Тогда
			СоздатьСтроку = Ложь;
			ТекстСообщения = ТекстСообщения + Нстр("ru = 'Строка %1. Ошибка при создании Вида перевозки: %2'; en = 'Line %1. Error creating the Transportation Type: %2'") + Символы.ПС;
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%1", СчВсего + 1);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%2", Реквизиты.ВидПеревозки);
		Иначе
			СтруктураСтроки.Вставить("ВидПеревозки", ВидПеревозки);
			ЗагружаемыеСсылки.Вставить(СтрокаПоиска, ВидПеревозки);
		КонецЕсли;
	Иначе
		
		СтруктураСтроки.Вставить("ВидПеревозки", ВидПеревозки);
		
	КонецЕсли;
	
	СтрокаПоиска = "уатНаправленияПеревозок/" + Реквизиты.НаправлениеПеревозки;
	НаправлениеПеревозки = ЗагружаемыеСсылки.Получить(СтрокаПоиска);
	
	Если НаправлениеПеревозки = Неопределено И ЗначениеЗаполнено(Реквизиты.НаправлениеПеревозки) Тогда
		
		НаправлениеПеревозки = НайтиСоздатьНаправлениеПеревозки(Реквизиты.НаправлениеПеревозки);
		
		Если НаправлениеПеревозки = Неопределено Тогда
			СоздатьСтроку = Ложь;
			ТекстСообщения = ТекстСообщения + Нстр("ru = 'Строка %1. Ошибка при создании Направления перевозки: %2'; en = 'Line %1. Error creating the Transportation Direction: %2'") + Символы.ПС;
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%1", СчВсего + 1);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%2", Реквизиты.НаправлениеПеревозки);
		Иначе
			СтруктураСтроки.Вставить("НаправлениеПеревозки", НаправлениеПеревозки);
			ЗагружаемыеСсылки.Вставить(СтрокаПоиска, НаправлениеПеревозки);
		КонецЕсли;
	Иначе
		
		СтруктураСтроки.Вставить("НаправлениеПеревозки", НаправлениеПеревозки);
		
	КонецЕсли;
	
	СтрокаПоиска = "уатПараметрыВыработки/" + Реквизиты.ПараметрВыработки;
	ПараметрВыработки = ЗагружаемыеСсылки.Получить(СтрокаПоиска);
	
	Если ПараметрВыработки = Неопределено И ЗначениеЗаполнено(Реквизиты.ПараметрВыработки) Тогда
		
		ПараметрВыработки = НайтиСоздатьПараметрВыработки(Реквизиты.ПараметрВыработки);
		
		Если ПараметрВыработки = Неопределено Тогда
			СоздатьСтроку = Ложь;
			ТекстСообщения = ТекстСообщения + Нстр("ru = 'Строка %1. Ошибка при создании Параметра выработки: %2'; en = 'Line %1. Error creating Production Parameter: %2'") + Символы.ПС;
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%1", СчВсего + 1);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%2", Реквизиты.ПараметрВыработки);
		Иначе
			СтруктураСтроки.Вставить("ПараметрВыработки", ПараметрВыработки);
			ЗагружаемыеСсылки.Вставить(СтрокаПоиска, ПараметрВыработки);
		КонецЕсли;
	Иначе
		
		СтруктураСтроки.Вставить("ПараметрВыработки", ПараметрВыработки);
		
	КонецЕсли;
	
	СтрокаПоиска = "Номенклатура/" + Реквизиты.НоменклатураУслуги;
	НоменклатураУслуги = ЗагружаемыеСсылки.Получить(СтрокаПоиска);
	
	Если НоменклатураУслуги = Неопределено И ЗначениеЗаполнено(Реквизиты.НоменклатураУслуги) Тогда
		
		НоменклатураУслуги = НайтиСоздатьНоменклатура(Реквизиты.НоменклатураУслуги, Истина);
		
		Если НоменклатураУслуги = Неопределено Тогда
			СоздатьСтроку = Ложь;
			ТекстСообщения = ТекстСообщения + Нстр("ru = 'В строке №%1 возникла ошибка при создании Номенклатуры услуги: %2. Уставновите основную единицу измерения в обработке ""Установка прав и настроек""'; en = 'An error occurred in line #%1 while creating the Service Nomenclature: %2. Set the primary unit of measurement in the ""Setting Rights and Settings"" process.'") + Символы.ПС;
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%1", СчВсего + 1);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%2", Реквизиты.НоменклатураУслуги);
		Иначе
			СтруктураСтроки.Вставить("НоменклатураУслуги", НоменклатураУслуги);
			ЗагружаемыеСсылки.Вставить(СтрокаПоиска, НоменклатураУслуги);
		КонецЕсли;
	Иначе
		
		СтруктураСтроки.Вставить("НоменклатураУслуги", НоменклатураУслуги);
		
	КонецЕсли;
	
	СтрокаПоиска = "Валюты/" + Реквизиты.Валюта;
	Валюта = ЗагружаемыеСсылки.Получить(СтрокаПоиска);
	
	Если ЗначениеЗаполнено(Реквизиты.Валюта) Тогда
		
		Валюта = НайтиЭлементСправочника("Валюты", Реквизиты.Валюта, Ложь);
		
		Если Валюта = Неопределено Тогда
			ТекстСообщения = ТекстСообщения + Нстр("ru = 'Для строки №%1 не найдена Валюта: %2'; en = 'Currency not found for row #%1: %2'") + Символы.ПС;
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%1", СчВсего + 1);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%2", Реквизиты.Валюта);
			СтруктураСтроки.Вставить("Валюта", Неопределено);
		Иначе
			СтруктураСтроки.Вставить("Валюта", Валюта);
			ЗагружаемыеСсылки.Вставить(СтрокаПоиска, Валюта);
		КонецЕсли;
	Иначе
		СтруктураСтроки.Вставить("Валюта", Неопределено);
	КонецЕсли;
	
	СтавкаНДС = Неопределено;
	Если ЗначениеЗаполнено(Реквизиты.СтавкаНДС) И СокрЛП(Реквизиты.СтавкаНДС) <> "%" Тогда
		ОбменСКонтрагентамиПереопределяемый.ПолучитьЗначениеПеречисления("СтавкиНДС", Реквизиты.СтавкаНДС, СтавкаНДС);
	КонецЕсли;
	СтруктураСтроки.Вставить("СтавкаНДС", СтавкаНДС);
		
	СтруктураСтроки.Вставить("Сумма", Реквизиты.Сумма);
	
	СчПеренесено = СчПеренесено + 1;
	
	Если ЗначениеЗаполнено(ТекстСообщения) Тогда
		НоваяСтрока = ТаблСообщенияПеренос.Добавить();
		НоваяСтрока.ТекстСообщенияПеренос = ТекстСообщения;
	КонецЕсли;
	
	МассивСтруктурДляПереноса.Добавить(СтруктураСтроки);
	
КонецПроцедуры

&НаСервере
Процедура СоздатьСтрокуРасходовВводаОстатков(Реквизиты, СчПеренесено, СчВсего, ЗагружаемыеСсылки)
	
	СоздатьСтроку = Истина;
	ТекстСообщения = "";
	СтруктураСтроки = Новый Структура;
	СтруктураСтроки.Вставить("ДатаОтражения", Реквизиты.ДатаОтражения);
	
	СтрокаПоиска = "уатСтатьиРасходов/" + Реквизиты.СтатьяРасходов;
	СтатьяРасходов = ЗагружаемыеСсылки.Получить(СтрокаПоиска);
	
	Если СтатьяРасходов = Неопределено И ЗначениеЗаполнено(Реквизиты.СтатьяРасходов) Тогда
		
		СтатьяРасходов = НайтиСоздатьСтатьяРасходов(Реквизиты.СтатьяРасходов);
		
		Если СтатьяРасходов = Неопределено Тогда
			СоздатьСтроку = Ложь;
			ТекстСообщения = ТекстСообщения + Нстр("ru = 'Строка %1. Ошибка при создании статьи расходов: %2'; en = 'Line %1. Error creating expense item: %2'") + Символы.ПС;
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%1", СчВсего + 1);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%2", Реквизиты.СтатьяРасходов);
		Иначе
			СтруктураСтроки.Вставить("СтатьяРасходов", СтатьяРасходов);
			ЗагружаемыеСсылки.Вставить(СтрокаПоиска, СтатьяРасходов);
		КонецЕсли;
	Иначе
		
		СтруктураСтроки.Вставить("СтатьяРасходов", СтатьяРасходов);
		
	КонецЕсли;
	
	СтрокаПоиска = "уатТС/" + Реквизиты.ТС;
	ТС = ЗагружаемыеСсылки.Получить(СтрокаПоиска);
	
	Если ТС = Неопределено И ЗначениеЗаполнено(Реквизиты.ТС) Тогда
		
		ТС = НайтиЭлементСправочника("уатТС", Реквизиты.ТС);
		
		Если ТС = Неопределено Тогда
			ТекстСообщения = ТекстСообщения + Нстр("ru = 'Для строки №%1 не найдено ТС: %2'; en = 'No vehicle found for line #%1: %2'") + Символы.ПС;
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%1", СчВсего + 1);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%2", Реквизиты.ТС);
			СтруктураСтроки.Вставить("ТС", Неопределено);
		Иначе
			СтруктураСтроки.Вставить("ТС", ТС);
			СтруктураСтроки.Вставить("Колонна", ТС.Колонна);
			ЗагружаемыеСсылки.Вставить(СтрокаПоиска, ТС);
		КонецЕсли;
		
	Иначе
		
		Колонна = ?(ТС = Неопределено, Неопределено, ТС.Колонна);
		СтруктураСтроки.Вставить("ТС", ТС);
		СтруктураСтроки.Вставить("Колонна", Колонна);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Реквизиты.ЗаказНомер) Тогда
		
		Заказ = НайтиДокумент(ИскатьЗаказНаТСПоДате, Реквизиты.ЗаказДата, Реквизиты.ЗаказНомер, "уатЗаказГрузоотправителя");
		
		Если Заказ.Пустой() Тогда
			ТекстСообщения = ТекстСообщения + Нстр("ru = 'Для строки №%1 не найден заказ на ТС: %2'; en = 'No order found for vehicle No. %1: %2'") + Символы.ПС;
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%1", СчВсего + 1);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%2", Реквизиты.ЗаказНомер + ?(ИскатьЗаказНаТСПоДате, " от " + Реквизиты.ЗаказДата, ""));
			СтруктураСтроки.Вставить("Заказ", Неопределено);
		Иначе
			СтруктураСтроки.Вставить("Заказ", Заказ.Выгрузить()[0].Ссылка);
		КонецЕсли;
	Иначе
		СтруктураСтроки.Вставить("Заказ", Неопределено);
	КонецЕсли;
	
	СтрокаПоиска = "Контрагенты/" + Реквизиты.Контрагент;
	Контрагент = ЗагружаемыеСсылки.Получить(СтрокаПоиска);
	
	Если Контрагент = Неопределено И ЗначениеЗаполнено(Реквизиты.Контрагент) Тогда
		
		Контрагент = НайтиЭлементСправочника("Контрагенты", Реквизиты.Контрагент);
		
		Если Контрагент = Неопределено Тогда
			ТекстСообщения = ТекстСообщения + Нстр("ru = 'Для строки №%1 не найден Контрагент: %2'; en = 'Counterparty not found for line #%1: %2'") + Символы.ПС;
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%1", СчВсего + 1);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%2", Реквизиты.Контрагент);
			СтруктураСтроки.Вставить("Контрагент", Неопределено);
		Иначе
			СтруктураСтроки.Вставить("Контрагент", Контрагент);
			ЗагружаемыеСсылки.Вставить(СтрокаПоиска, Контрагент);
		КонецЕсли;
		
	Иначе
		
		СтруктураСтроки.Вставить("Контрагент", Контрагент);
		
	КонецЕсли;
	
	СтрокаПоиска = "уатОбъектыСтроительства/" + Реквизиты.ОбъектСтроительства;
	ОбъектСтроительства = ЗагружаемыеСсылки.Получить(СтрокаПоиска);
	
	Если ОбъектСтроительства = Неопределено И ЗначениеЗаполнено(Реквизиты.ОбъектСтроительства) Тогда
		
		ОбъектСтроительства = НайтиСоздатьОбъектСтроительства(Реквизиты.ОбъектСтроительства);
		
		Если ОбъектСтроительства = Неопределено Тогда
			СоздатьСтроку = Ложь;
			ТекстСообщения = ТекстСообщения + Нстр("ru = 'Строка %1. Ошибка при создании Объекта строительства: %2'; en = 'Line %1. Error creating Construction Object: %2'") + Символы.ПС;
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%1", СчВсего + 1);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%2", Реквизиты.ОбъектСтроительства);
		Иначе
			СтруктураСтроки.Вставить("ОбъектСтроительства", ОбъектСтроительства);
			ЗагружаемыеСсылки.Вставить(СтрокаПоиска, ОбъектСтроительства);
		КонецЕсли;
	Иначе
		
		СтруктураСтроки.Вставить("ОбъектСтроительства", ОбъектСтроительства);
		
	КонецЕсли;
	
	СтрокаПоиска = "уатМаршруты/" + Реквизиты.Маршрут;
	Маршрут = ЗагружаемыеСсылки.Получить(СтрокаПоиска);
	
	Если Маршрут = Неопределено И ЗначениеЗаполнено(Реквизиты.Маршрут) Тогда
		
		Маршрут = НайтиСоздатьМаршруты(Реквизиты.Маршрут);
		
		Если Маршрут = Неопределено Тогда
			СоздатьСтроку = Ложь;
			ТекстСообщения = ТекстСообщения + Нстр("ru = 'Строка %1. Ошибка при создании Маршрута: %2'; en = 'Line %1. Error creating Route: %2'") + Символы.ПС;
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%1", СчВсего + 1);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%2", Реквизиты.Маршрут);
		Иначе
			СтруктураСтроки.Вставить("Маршрут", Маршрут);
			ЗагружаемыеСсылки.Вставить(СтрокаПоиска, Маршрут);
		КонецЕсли;
	Иначе
		
		СтруктураСтроки.Вставить("Маршрут", Маршрут);
		
	КонецЕсли;
	
	СтрокаПоиска = "уатВидыПеревозок/" + Реквизиты.ВидПеревозки;
	ВидПеревозки = ЗагружаемыеСсылки.Получить(СтрокаПоиска);
	
	Если ВидПеревозки = Неопределено И ЗначениеЗаполнено(Реквизиты.ВидПеревозки) Тогда
		
		ВидПеревозки = НайтиСоздатьВидПеревозки(Реквизиты.ВидПеревозки);
		
		Если ВидПеревозки = Неопределено Тогда
			СоздатьСтроку = Ложь;
			ТекстСообщения = ТекстСообщения + Нстр("ru = 'Строка %1. Ошибка при создании Вида перевозки: %2'; en = 'Line %1. Error creating the Transportation Type: %2'") + Символы.ПС;
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%1", СчВсего + 1);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%2", Реквизиты.ВидПеревозки);
		Иначе
			СтруктураСтроки.Вставить("ВидПеревозки", ВидПеревозки);
			ЗагружаемыеСсылки.Вставить(СтрокаПоиска, ВидПеревозки);
		КонецЕсли;
	Иначе
		
		СтруктураСтроки.Вставить("ВидПеревозки", ВидПеревозки);
		
	КонецЕсли;
	
	СтрокаПоиска = "уатНаправленияПеревозок/" + Реквизиты.НаправлениеПеревозки;
	НаправлениеПеревозки = ЗагружаемыеСсылки.Получить(СтрокаПоиска);
	
	Если НаправлениеПеревозки = Неопределено И ЗначениеЗаполнено(Реквизиты.НаправлениеПеревозки) Тогда
		
		НаправлениеПеревозки = НайтиСоздатьНаправлениеПеревозки(Реквизиты.НаправлениеПеревозки);
		
		Если НаправлениеПеревозки = Неопределено Тогда
			СоздатьСтроку = Ложь;
			ТекстСообщения = ТекстСообщения + Нстр("ru = 'Строка %1. Ошибка при создании Направления перевозки: %2'; en = 'Line %1. Error creating the Transportation Direction: %2'") + Символы.ПС;
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%1", СчВсего + 1);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%2", Реквизиты.НаправлениеПеревозки);
		Иначе
			СтруктураСтроки.Вставить("НаправлениеПеревозки", НаправлениеПеревозки);
			ЗагружаемыеСсылки.Вставить(СтрокаПоиска, НаправлениеПеревозки);
		КонецЕсли;
	Иначе
		
		СтруктураСтроки.Вставить("НаправлениеПеревозки", НаправлениеПеревозки);
		
	КонецЕсли;
	
	СтрокаПоиска = "Номенклатура/" + Реквизиты.НоменклатураУслуги;
	НоменклатураУслуги = ЗагружаемыеСсылки.Получить(СтрокаПоиска);
	
	Если НоменклатураУслуги = Неопределено И ЗначениеЗаполнено(Реквизиты.НоменклатураУслуги) Тогда
		
		НоменклатураУслуги = НайтиСоздатьНоменклатура(Реквизиты.НоменклатураУслуги, Истина);
		
		Если НоменклатураУслуги = Неопределено Тогда
			СоздатьСтроку = Ложь;
			ТекстСообщения = ТекстСообщения + Нстр("ru = 'В строке №%1 возникла ошибка при создании Номенклатуры услуги: %2. Уставновите основную единицу измерения в обработке ""Установка прав и настроек""'; en = 'An error occurred in line #%1 while creating the Service Nomenclature: %2. Set the primary unit of measurement in the ""Setting Rights and Settings"" process.'") + Символы.ПС;
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%1", СчВсего + 1);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%2", Реквизиты.НоменклатураУслуги);
		Иначе
			СтруктураСтроки.Вставить("НоменклатураУслуги", НоменклатураУслуги);
			ЗагружаемыеСсылки.Вставить(СтрокаПоиска, НоменклатураУслуги);
		КонецЕсли;
	Иначе
		
		СтруктураСтроки.Вставить("НоменклатураУслуги", НоменклатураУслуги);
		
	КонецЕсли;
	
	СтрокаПоиска = "Валюты/" + Реквизиты.Валюта;
	Валюта = ЗагружаемыеСсылки.Получить(СтрокаПоиска);
	
	Если ЗначениеЗаполнено(Реквизиты.Валюта) Тогда
		
		Валюта = НайтиЭлементСправочника("Валюты", Реквизиты.Валюта, Ложь);
		
		Если Валюта = Неопределено Тогда
			ТекстСообщения = ТекстСообщения + Нстр("ru = 'Для строки №%1 не найдена Валюта: %2'; en = 'Currency not found for row #%1: %2'") + Символы.ПС;
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%1", СчВсего + 1);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%2", Реквизиты.Валюта);
			СтруктураСтроки.Вставить("Валюта", Неопределено);
		Иначе
			СтруктураСтроки.Вставить("Валюта", Валюта);
			ЗагружаемыеСсылки.Вставить(СтрокаПоиска, Валюта);
		КонецЕсли;
	Иначе
		СтруктураСтроки.Вставить("Валюта", Неопределено);
	КонецЕсли;
	
	СтавкаНДС = Неопределено;
	Если ЗначениеЗаполнено(Реквизиты.СтавкаНДС) И СокрЛП(Реквизиты.СтавкаНДС) <> "%" Тогда
		ОбменСКонтрагентамиПереопределяемый.ПолучитьЗначениеПеречисления("СтавкиНДС", Реквизиты.СтавкаНДС, СтавкаНДС);
	КонецЕсли;
	СтруктураСтроки.Вставить("СтавкаНДС", СтавкаНДС);
		
	СтруктураСтроки.Вставить("Сумма", Реквизиты.Сумма);
	
	СчПеренесено = СчПеренесено + 1;
	
	Если ЗначениеЗаполнено(ТекстСообщения) Тогда
		НоваяСтрока = ТаблСообщенияПеренос.Добавить();
		НоваяСтрока.ТекстСообщенияПеренос = ТекстСообщения;
	КонецЕсли;
	
	МассивСтруктурДляПереноса.Добавить(СтруктураСтроки);
	
КонецПроцедуры

&НаСервере
Процедура СоздатьСтрокуОстатковДСВводаОстатков(Реквизиты, СчПеренесено, СчВсего, ЗагружаемыеСсылки)
	
	СоздатьСтроку = Истина;
	ТекстСообщения = "";
	СтруктураСтроки = Новый Структура;
	СтруктураСтроки.Вставить("ДатаОтражения", Реквизиты.ДатаОтражения);
	
	СтрокаПоиска = "СтатьиДвиженияДенежныхСредств/" + Реквизиты.СтатьяДвиженияДенежныхСредств;
	СтатьяДвиженияДенежныхСредств = ЗагружаемыеСсылки.Получить(СтрокаПоиска);
	
	Если СтатьяДвиженияДенежныхСредств = Неопределено И ЗначениеЗаполнено(Реквизиты.СтатьяДвиженияДенежныхСредств) Тогда
		
		СтатьяДвиженияДенежныхСредств = НайтиСоздатьСтатьяДвиженияДенежныхСредств(Реквизиты.СтатьяДвиженияДенежныхСредств);
		
		Если СтатьяДвиженияДенежныхСредств = Неопределено Тогда
			СоздатьСтроку = Ложь;
			ТекстСообщения = ТекстСообщения + Нстр("ru = 'Строка %1. Ошибка при создании статьи движения сенежных  средств: %2'; en = 'Line %1. Error creating cash flow statement: %2'") + Символы.ПС;
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%1", СчВсего + 1);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%2", Реквизиты.СтатьяДвиженияДенежныхСредств);
		Иначе
			СтруктураСтроки.Вставить("СтатьяДвиженияДенежныхСредств", СтатьяДвиженияДенежныхСредств);
			ЗагружаемыеСсылки.Вставить(СтрокаПоиска, СтатьяДвиженияДенежныхСредств);
		КонецЕсли;
	Иначе
		
		СтруктураСтроки.Вставить("СтатьяДвиженияДенежныхСредств", СтатьяДвиженияДенежныхСредств);
		
	КонецЕсли;
	
	СтруктураСтроки.Вставить("Сумма", Реквизиты.Сумма);
	
	Если КассаБанковскийСчет = "Касса" Тогда
		СтрокаПоиска = "Кассы/" + Реквизиты.Касса;
		Касса = ЗагружаемыеСсылки.Получить(СтрокаПоиска);
		
		Если Касса = Неопределено И ЗначениеЗаполнено(Реквизиты.Касса) Тогда
			
			Касса = НайтиСоздатьКасса(Реквизиты.Касса);
			
			Если Касса = Неопределено Тогда
				ТекстСообщения = ТекстСообщения + Нстр("ru = 'Строка %1. Ошибка при создании кассы: %2'; en = 'Line %1. Error creating cash register: %2'") + Символы.ПС;
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%1", СчВсего + 1);
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%2", Реквизиты.Касса);
			Иначе
				СтруктураСтроки.Вставить("БанковскийСчетКасса", Касса);
				ЗагружаемыеСсылки.Вставить(СтрокаПоиска, Касса);
			КонецЕсли;
		Иначе
			
			СтруктураСтроки.Вставить("БанковскийСчетКасса", Касса);
			
		КонецЕсли;
	Иначе
		СтрокаПоиска = "БанковскиеСчета/" + Реквизиты.БанковскийСчет;
		БанковскийСчет = ЗагружаемыеСсылки.Получить(СтрокаПоиска);
		
		Если БанковскийСчет = Неопределено И ЗначениеЗаполнено(Реквизиты.БанковскийСчет) Тогда
			
			БанковскийСчет = НайтиСоздатьБанковскийСчет(Реквизиты.БанковскийСчет, Реквизиты.Контрагент, 
				Реквизиты.БИК, СчВсего, ЗагружаемыеСсылки);
			
			Если БанковскийСчет = 1 Тогда
				ТекстСообщения = Нстр("ru = 'В строке №%1 ошибка при создании банковского счета: %2'; en = 'There was an error creating a bank account at line #%1: %2'") + ТекстСообщения;
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%1", СчВсего + 1);
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%2", Реквизиты.БанковскийСчет);
			Иначе
				СтруктураСтроки.Вставить("БанковскийСчетКасса", БанковскийСчет);
				ЗагружаемыеСсылки.Вставить(СтрокаПоиска, БанковскийСчет);
			КонецЕсли;
		Иначе
			
			СтруктураСтроки.Вставить("БанковскийСчетКасса", БанковскийСчет);
			
		КонецЕсли;
	КонецЕсли;
	
	СчПеренесено = СчПеренесено + 1;
	
	Если ЗначениеЗаполнено(ТекстСообщения) Тогда
		НоваяСтрока = ТаблСообщенияПеренос.Добавить();
		НоваяСтрока.ТекстСообщенияПеренос = ТекстСообщения;
	КонецЕсли;
	
	МассивСтруктурДляПереноса.Добавить(СтруктураСтроки);
	
КонецПроцедуры

&НаСервере
Процедура СоздатьСтрокуОстатковДСПодотчетныхЛицВводаОстатков(Реквизиты, СчПеренесено, СчВсего, ЗагружаемыеСсылки)
	
	СоздатьСтроку = Истина;
	ТекстСообщения = "";
	СтруктураСтроки = Новый Структура;
	СтруктураСтроки.Вставить("ДатаОтражения", Реквизиты.ДатаОтражения);
	
	СтрокаПоиска = "ФизическиеЛица/" + Реквизиты.ПодотчетноеЛицо;
	ПодотчетноеЛицо = ЗагружаемыеСсылки.Получить(СтрокаПоиска);
	
	Если ПодотчетноеЛицо = Неопределено И ЗначениеЗаполнено(Реквизиты.ПодотчетноеЛицо) Тогда
		
		ПодотчетноеЛицо = НайтиСоздатьФизЛицо(Реквизиты.ПодотчетноеЛицо);
		
		Если ПодотчетноеЛицо = Неопределено Тогда
			СоздатьСтроку = Ложь;
			ТекстСообщения = ТекстСообщения + Нстр("ru = 'Строка %1. Ошибка при создании подотчетного лица: %2'; en = 'Line %1. Error creating accountable person: %2'") + Символы.ПС;
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%1", СчВсего + 1);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%2", Реквизиты.ПодотчетноеЛицо);
		Иначе
			СтруктураСтроки.Вставить("ПодотчетноеЛицо", ПодотчетноеЛицо);
			ЗагружаемыеСсылки.Вставить(СтрокаПоиска, ПодотчетноеЛицо);
		КонецЕсли;
	Иначе
		
		СтруктураСтроки.Вставить("ПодотчетноеЛицо", ПодотчетноеЛицо);
		
	КонецЕсли;
	
	СтрокаПоиска = "Валюты/" + Реквизиты.Валюта;
	Валюта = ЗагружаемыеСсылки.Получить(СтрокаПоиска);
	
	Если ЗначениеЗаполнено(Реквизиты.Валюта) Тогда
		
		Валюта = НайтиЭлементСправочника("Валюты", Реквизиты.Валюта, Ложь);
		
		Если Валюта = Неопределено Тогда
			ТекстСообщения = ТекстСообщения + Нстр("ru = 'Для строки №%1 не найдена Валюта: %2'; en = 'Currency not found for row #%1: %2'") + Символы.ПС;
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%1", СчВсего + 1);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%2", Реквизиты.Валюта);
			СтруктураСтроки.Вставить("Валюта", Неопределено);
		Иначе
			СтруктураСтроки.Вставить("Валюта", Валюта);
			ЗагружаемыеСсылки.Вставить(СтрокаПоиска, Валюта);
		КонецЕсли;
	Иначе
		СтруктураСтроки.Вставить("Валюта", Неопределено);
	КонецЕсли;
		
	СтруктураСтроки.Вставить("Сумма", Реквизиты.Сумма);
	
	СчПеренесено = СчПеренесено + 1;
	
	Если ЗначениеЗаполнено(ТекстСообщения) Тогда
		НоваяСтрока = ТаблСообщенияПеренос.Добавить();
		НоваяСтрока.ТекстСообщенияПеренос = ТекстСообщения;
	КонецЕсли;
	
	МассивСтруктурДляПереноса.Добавить(СтруктураСтроки);
	
КонецПроцедуры

&НаСервере
Процедура СоздатьСтрокуМатериаловВводаОстатков(Реквизиты, СчПеренесено, СчВсего, ЗагружаемыеСсылки)
	
	СоздатьСтроку = Истина;
	ТекстСообщения = "";
	СтруктураСтроки = Новый Структура;
	СтруктураСтроки.Вставить("ДатаОтражения", Реквизиты.ДатаОтражения);
	
	СтрокаПоиска = "Склады/" + Реквизиты.Склад;
	Склад = ЗагружаемыеСсылки.Получить(СтрокаПоиска);
	
	Если Склад = Неопределено И ЗначениеЗаполнено(Реквизиты.Склад) Тогда
		
		Склад = НайтиСоздатьСклад(Реквизиты.Склад);
		
		Если Склад = Неопределено Тогда
			ТекстСообщения = ТекстСообщения + Нстр("ru = 'Строка %1. Ошибка при создании склада: %2'; en = 'Line %1. Error creating warehouse: %2'") + Символы.ПС;
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%1", СчВсего + 1);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%2", Реквизиты.Склад);
		Иначе
			СтруктураСтроки.Вставить("Склад", Склад);
			ЗагружаемыеСсылки.Вставить(СтрокаПоиска, Склад);
		КонецЕсли;
	Иначе
		
		СтруктураСтроки.Вставить("Склад", Склад);
		
	КонецЕсли;
	
	СтрокаПоиска = "Номенклатура/" + Реквизиты.Номенклатура;
	Номенклатура = ЗагружаемыеСсылки.Получить(СтрокаПоиска);
	
	Если Номенклатура = Неопределено И ЗначениеЗаполнено(Реквизиты.Номенклатура) Тогда
		
		Номенклатура = НайтиСоздатьНоменклатура(Реквизиты.Номенклатура, Ложь);
		
		Если Номенклатура = Неопределено Тогда
			ТекстСообщения = ТекстСообщения + Нстр("ru = 'В строке №%1 ошибка при создании Номенклатуры услуги: %2. Уставновите основную единицу измерения в обработке ""Установка прав и настроек""'; en = 'Line #%1 contains an error while creating the Service Nomenclature: %2. Set the primary unit of measurement in the ""Setting Rights and Settings"" process.'") + Символы.ПС;
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%1", СчВсего + 1);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%2", Реквизиты.Номенклатура);
		Иначе
			СтруктураСтроки.Вставить("Номенклатура", Номенклатура);
			ЗагружаемыеСсылки.Вставить(СтрокаПоиска, Номенклатура);
		КонецЕсли;
	Иначе
		
		СтруктураСтроки.Вставить("Номенклатура", Номенклатура);
		
	КонецЕсли;
	
	СтруктураСтроки.Вставить("Количество", Реквизиты.Количество);
	СтруктураСтроки.Вставить("Стоимость", Реквизиты.Стоимость);
	СтруктураСтроки.Вставить("СтоимостьУпр", Реквизиты.СтоимостьУпр);
	
	СчПеренесено = СчПеренесено + 1;
	
	Если ЗначениеЗаполнено(ТекстСообщения) Тогда
		НоваяСтрока = ТаблСообщенияПеренос.Добавить();
		НоваяСтрока.ТекстСообщенияПеренос = ТекстСообщения;
	КонецЕсли;
	
	МассивСтруктурДляПереноса.Добавить(СтруктураСтроки);
	
КонецПроцедуры

&НаСервере
Функция НайтиЭлементСправочника(НаименованиеСправочника, НаименованиеЭлемента, Иерархический = Истина)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Наименование", НаименованиеЭлемента);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	" + НаименованиеСправочника + ".Ссылка КАК Ссылка
	|ИЗ
	|	Справочник." + НаименованиеСправочника + " КАК " + НаименованиеСправочника + "
	|ГДЕ
	|	НЕ " + НаименованиеСправочника + ".ПометкаУдаления
	|	" + ?(Иерархический, "И НЕ " + НаименованиеСправочника + ".ЭтоГруппа", "") + "
	|	И " + НаименованиеСправочника + ".Наименование = &Наименование";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Функция НайтиДокумент(ИскатьПоДате, ДатаСтр, Номер, ИмяДокумента)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИскатьПоДате", ИскатьПоДате);
	Запрос.УстановитьПараметр("Дата", Дата(ДатаСтр));
	Запрос.УстановитьПараметр("Номер", Номер);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	" + ИмяДокумента + ".Ссылка КАК Ссылка
	|ИЗ
	|	Документ." + ИмяДокумента + " КАК " + ИмяДокумента + "
	|ГДЕ
	|	" + ИмяДокумента + ".Номер = &Номер
	|	И ВЫБОР
	|			КОГДА &ИскатьПоДате
	|				ТОГДА " + ИмяДокумента + ".Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И " + ИмяДокумента + ".Проведен
	|	И НЕ " + ИмяДокумента + ".ПометкаУдаления";
	
	Возврат Запрос.Выполнить();
	
КонецФункции

&НаСервере
Функция НайтиСоздатьСтатьяДоходов(СтатьяДоходов)
	
	Если Не ЗначениеЗаполнено(СтатьяДоходов) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	уатСтатьиДоходов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.уатСтатьиДоходов КАК уатСтатьиДоходов
	|ГДЕ
	|	уатСтатьиДоходов.Наименование = &Наименование
	|	И НЕ уатСтатьиДоходов.ПометкаУдаления
	|	И НЕ уатСтатьиДоходов.ЭтоГруппа";
	Запрос.УстановитьПараметр("Наименование", СтатьяДоходов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	СтатьяДоходовНовый = Справочники.уатСтатьиДоходов.СоздатьЭлемент();
	СтатьяДоходовНовый.Заполнить(Неопределено);
	СтатьяДоходовНовый.Наименование = СтатьяДоходов;
	СтатьяДоходовНовый.СпособРаспределенияМеждуТС = Перечисления.уатСпособыРаспределенияДоходовРасходовМеждуТС.НеРаспределять;
	СтатьяДоходовНовый.СпособРаспределенияМеждуАналитиками = Перечисления.уатСпособыРаспределенияДоходовРасходовМеждуАналитиками.НеРаспределять;
	
	СтатьяДоходовНовый.Записать();
	
	Возврат СтатьяДоходовНовый.Ссылка;
	
КонецФункции

&НаСервере
Функция НайтиСоздатьСтатьяРасходов(СтатьяРасходов)
	
	Если Не ЗначениеЗаполнено(СтатьяРасходов) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	уатСтатьиРасходов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.уатСтатьиРасходов КАК уатСтатьиРасходов
	|ГДЕ
	|	уатСтатьиРасходов.Наименование = &Наименование
	|	И НЕ уатСтатьиРасходов.ПометкаУдаления
	|	И НЕ уатСтатьиРасходов.ЭтоГруппа";
	Запрос.УстановитьПараметр("Наименование", СтатьяРасходов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	СтатьяРасходовНовый = Справочники.уатСтатьиРасходов.СоздатьЭлемент();
	СтатьяРасходовНовый.Заполнить(Неопределено);
	СтатьяРасходовНовый.Наименование = СтатьяРасходов;
	СтатьяРасходовНовый.ВидЗатрат = Перечисления.уатВидыЗатрат.Прочие;
	СтатьяРасходовНовый.ПорядокОтнесенияЗатрат = Перечисления.уатПорядкиОтнесенияРасходов.ПрямыеРасходы;
	СтатьяРасходовНовый.СпособРаспределенияЗатрат = Перечисления.уатСпособыРаспределенияДоходовРасходовМеждуТС.НеРаспределять;
	НоваяСтрока = СтатьяРасходовНовый.ПараметрыВыработкиРаспределенияМеждуАналитиками.Добавить();
	НоваяСтрока.СпособРаспределенияЗатратМеждуАналитиками = Перечисления.уатСпособыРаспределенияДоходовРасходовМеждуАналитиками.НеРаспределять;
	
	СтатьяРасходовНовый.Записать();
	
	Возврат СтатьяРасходовНовый.Ссылка;
	
КонецФункции

&НаСервере
Функция НайтиСоздатьОбъектСтроительства(ОбъектСтроительства)
	
	Если Не ЗначениеЗаполнено(ОбъектСтроительства) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	уатОбъектыСтроительства.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.уатОбъектыСтроительства КАК уатОбъектыСтроительства
	|ГДЕ
	|	уатОбъектыСтроительства.Наименование = &Наименование
	|	И НЕ уатОбъектыСтроительства.ПометкаУдаления
	|	И НЕ уатОбъектыСтроительства.ЭтоГруппа";
	Запрос.УстановитьПараметр("Наименование", ОбъектСтроительства);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	ОбъектСтроительстваНовый = Справочники.уатОбъектыСтроительства.СоздатьЭлемент();
	ОбъектСтроительстваНовый.Заполнить(Неопределено);
	ОбъектСтроительстваНовый.Наименование = ОбъектСтроительства;
	
	ОбъектСтроительстваНовый.Записать();
	
	Возврат ОбъектСтроительстваНовый.Ссылка;
	
КонецФункции

&НаСервере
Функция НайтиСоздатьМаршруты(Маршрут)
	
	Если Не ЗначениеЗаполнено(Маршрут) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	уатМаршруты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.уатМаршруты КАК уатМаршруты
	|ГДЕ
	|	уатМаршруты.Наименование = &Наименование
	|	И НЕ уатМаршруты.ПометкаУдаления
	|	И НЕ уатМаршруты.ЭтоГруппа";
	Запрос.УстановитьПараметр("Наименование", Маршрут);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	МаршрутНовый = Справочники.уатМаршруты.СоздатьЭлемент();
	МаршрутНовый.Заполнить(Неопределено);
	МаршрутНовый.Наименование = Маршрут;
	
	МаршрутНовый.Записать();
	
	Возврат МаршрутНовый.Ссылка;
	
КонецФункции

&НаСервере
Функция НайтиСоздатьВидПеревозки(ВидПеревозки)
	
	Если Не ЗначениеЗаполнено(ВидПеревозки) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	уатВидыПеревозок.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.уатВидыПеревозок КАК уатВидыПеревозок
	|ГДЕ
	|	уатВидыПеревозок.Наименование = &Наименование
	|	И НЕ уатВидыПеревозок.ПометкаУдаления";
	Запрос.УстановитьПараметр("Наименование", ВидПеревозки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	ВидПеревозкиНовый = Справочники.уатВидыПеревозок.СоздатьЭлемент();
	ВидПеревозкиНовый.Заполнить(Неопределено);
	ВидПеревозкиНовый.Наименование = ВидПеревозки;
	ВидПеревозкиНовый.ВидМоделиТС  = Перечисления.уатВидыМоделейТС.Автотранспорт;
	
	ВидПеревозкиНовый.Записать();
	
	Возврат ВидПеревозкиНовый.Ссылка;
	
КонецФункции

&НаСервере
Функция НайтиСоздатьНаправлениеПеревозки(НаправлениеПеревозки)
	
	Если Не ЗначениеЗаполнено(НаправлениеПеревозки) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	уатНаправленияПеревозок.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.уатНаправленияПеревозок КАК уатНаправленияПеревозок
	|ГДЕ
	|	уатНаправленияПеревозок.Наименование = &Наименование
	|	И НЕ уатНаправленияПеревозок.ПометкаУдаления
	|	И НЕ уатНаправленияПеревозок.ЭтоГруппа";
	Запрос.УстановитьПараметр("Наименование", НаправлениеПеревозки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	НаправлениеПеревозкиНовый = Справочники.уатНаправленияПеревозок.СоздатьЭлемент();
	НаправлениеПеревозкиНовый.Заполнить(Неопределено);
	НаправлениеПеревозкиНовый.Наименование = НаправлениеПеревозки;
	
	НаправлениеПеревозкиНовый.Записать();
	
	Возврат НаправлениеПеревозкиНовый.Ссылка;
	
КонецФункции

&НаСервере
Функция НайтиСоздатьПараметрВыработки(ПараметрВыработки)
	
	Если Не ЗначениеЗаполнено(ПараметрВыработки) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	уатПараметрыВыработки.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.уатПараметрыВыработки КАК уатПараметрыВыработки
	|ГДЕ
	|	уатПараметрыВыработки.Наименование = &Наименование
	|	И НЕ уатПараметрыВыработки.ПометкаУдаления";
	Запрос.УстановитьПараметр("Наименование", ПараметрВыработки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	ПараметрВыработкиНовый = Справочники.уатПараметрыВыработки.СоздатьЭлемент();
	ПараметрВыработкиНовый.Заполнить(Неопределено);
	ПараметрВыработкиНовый.Наименование = ПараметрВыработки;
	
	ПараметрВыработкиНовый.Записать();
	
	Возврат ПараметрВыработкиНовый.Ссылка;
	
КонецФункции

&НаСервере
Функция НайтиСоздатьНоменклатура(НоменклатураУслуги, Услуга)
	
	Если Не ЗначениеЗаполнено(НоменклатураУслуги) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Наименование = &Наименование
	|	И НЕ Номенклатура.ПометкаУдаления
	|	И НЕ Номенклатура.ЭтоГруппа";
	Запрос.УстановитьПараметр("Наименование", НоменклатураУслуги);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	НоменклатураУслугиНовый = Справочники.Номенклатура.СоздатьЭлемент();
	НоменклатураУслугиНовый.Заполнить(Неопределено);
	НоменклатураУслугиНовый.Наименование     = НоменклатураУслуги;
	Если Услуга Тогда
		НоменклатураУслугиНовый.ВидНоменклатуры  = Справочники.ВидыНоменклатуры.Услуга;
	Иначе
		НоменклатураУслугиНовый.ВидНоменклатуры  = Справочники.ВидыНоменклатуры.Товар;
	КонецЕсли;
	НоменклатураУслугиНовый.СтавкаНДС        = уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(
		ПользователиКлиентСервер.АвторизованныйПользователь(), "ОсновнаяСтавкаНДС");
	НоменклатураУслугиНовый.ЕдиницаИзмерения = уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(
		ПользователиКлиентСервер.АвторизованныйПользователь(), "ОсновнаяЕдиницаПоКлассификатору");
	
	Если Не ЗначениеЗаполнено(НоменклатураУслугиНовый.ЕдиницаИзмерения) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НоменклатураУслугиНовый.Записать();
	
	Возврат НоменклатураУслугиНовый.Ссылка;
	
КонецФункции

&НаСервере
Функция НайтиСоздатьФизЛицо(ПодотчетноеЛицо)
	
	Если Не ЗначениеЗаполнено(ПодотчетноеЛицо) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ФизическиеЛица.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФизическиеЛица
	|ГДЕ
	|	ФизическиеЛица.Наименование = &Наименование
	|	И НЕ ФизическиеЛица.ПометкаУдаления
	|	И НЕ ФизическиеЛица.ЭтоГруппа";
	Запрос.УстановитьПараметр("Наименование", ПодотчетноеЛицо);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	ПодотчетноеЛицоНовый = Справочники.ФизическиеЛица.СоздатьЭлемент();
	ПодотчетноеЛицоНовый.Заполнить(Неопределено);
	ПодотчетноеЛицоНовый.Наименование = ПодотчетноеЛицо;
	
	ПодотчетноеЛицоНовый.Записать();
	
	Возврат ПодотчетноеЛицоНовый.Ссылка;
	
КонецФункции

&НаСервере
Функция НайтиСоздатьСклад(Склад)
	
	Если Не ЗначениеЗаполнено(Склад) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Склады.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Склады КАК Склады
	|ГДЕ
	|	Склады.Наименование = &Наименование
	|	И НЕ Склады.ПометкаУдаления
	|	И НЕ Склады.ЭтоГруппа";
	Запрос.УстановитьПараметр("Наименование", Склад);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	СкладНовый = Справочники.Склады.СоздатьЭлемент();
	СкладНовый.Заполнить(Неопределено);
	СкладНовый.Наименование = Склад;
	
	СкладНовый.Записать();
	
	Возврат СкладНовый.Ссылка;
	
КонецФункции

&НаСервере
Функция НайтиСоздатьСтатьяДвиженияДенежныхСредств(СтатьяДвиженияДенежныхСредств)
	
	Если Не ЗначениеЗаполнено(СтатьяДвиженияДенежныхСредств) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СтатьиДвиженияДенежныхСредств.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СтатьиДвиженияДенежныхСредств КАК СтатьиДвиженияДенежныхСредств
	|ГДЕ
	|	СтатьиДвиженияДенежныхСредств.Наименование = &Наименование
	|	И НЕ СтатьиДвиженияДенежныхСредств.ПометкаУдаления
	|	И НЕ СтатьиДвиженияДенежныхСредств.ЭтоГруппа";
	Запрос.УстановитьПараметр("Наименование", СтатьяДвиженияДенежныхСредств);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	СтатьяДвиженияДенежныхСредствНовый = Справочники.СтатьиДвиженияДенежныхСредств.СоздатьЭлемент();
	СтатьяДвиженияДенежныхСредствНовый.Заполнить(Неопределено);
	СтатьяДвиженияДенежныхСредствНовый.Наименование = СтатьяДвиженияДенежныхСредств;
	
	СтатьяДвиженияДенежныхСредствНовый.Записать();
	
	Возврат СтатьяДвиженияДенежныхСредствНовый.Ссылка;
	
КонецФункции

&НаСервере
Функция НайтиСоздатьКасса(Касса)
	
	Если Не ЗначениеЗаполнено(Касса) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Кассы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Кассы КАК Кассы
	|ГДЕ
	|	Кассы.Наименование = &Наименование
	|	И НЕ Кассы.ПометкаУдаления
	|	И НЕ Кассы.ЭтоГруппа";
	Запрос.УстановитьПараметр("Наименование", Касса);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	КассаНовый = Справочники.Кассы.СоздатьЭлемент();
	КассаНовый.Заполнить(Неопределено);
	КассаНовый.Наименование = Касса;
	КассаНовый.Владелец = Организация;
	КассаНовый.ВалютаДенежныхСредств = уатОбщегоНазначенияТиповые.ВалютаРегламентированногоУчета(Организация);
	
	КассаНовый.Записать();
	
	Возврат КассаНовый.Ссылка;
	
КонецФункции

&НаСервере
Функция НайтиСоздатьБанковскийСчет(БанковскийСчет, КонтрагентСтр, БИКСтр, СчВсего, ЗагружаемыеСсылки)
	
	Если Не ЗначениеЗаполнено(БанковскийСчет) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	БанковскиеСчета.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.БанковскиеСчета КАК БанковскиеСчета
	|ГДЕ
	|	(БанковскиеСчета.Наименование = &Наименование
	|			ИЛИ БанковскиеСчета.НомерСчета = &Наименование)
	|	И НЕ БанковскиеСчета.ПометкаУдаления";
	Запрос.УстановитьПараметр("Наименование", БанковскийСчет);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	СоздаватьСчет = Истина;
	
	Если Не ЗначениеЗаполнено(КонтрагентСтр) Тогда
		ТекстСообщения = ТекстСообщения + Символы.ПС + Нстр("ru = 'Строка %1. Банковский счет: %2 не найден. Заполните колонку ""Контрагент"" для создания счета'; en = 'Line %1. Bank account: %2 not found. Please fill in the ""Counterparty"" column to create an invoice.'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%1", СчВсего + 1);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%2", БанковскийСчет);
		СоздаватьСчет = Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(БИКСтр) Тогда
		ТекстСообщения = ТекстСообщения + Символы.ПС + Нстр("ru = 'Строка %1. Банковский счет: %2 не найден. Заполните колонку ""БИК"" для создания счета'; en = 'Line %1. Bank account: %2 not found. Please fill in the ""BIC"" column to create an account.'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%1", СчВсего + 1);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%2", БанковскийСчет);
		СоздаватьСчет = Ложь;
	КонецЕсли;
	
	Если Не СоздаватьСчет Тогда
		Возврат 1;
	КонецЕсли;
	
	СтрокаПоиска = "Контрагенты/" + КонтрагентСтр;
	Контрагент = ЗагружаемыеСсылки.Получить(СтрокаПоиска);
	
	Если Контрагент = Неопределено Тогда
		
		Контрагент = НайтиЭлементСправочника("Контрагенты", КонтрагентСтр);
		
		Если Контрагент = Неопределено Тогда
			ТекстСообщения = ТекстСообщения + Символы.ПС + Нстр("ru = 'Для строки №%1 не найден Контрагент: %2'; en = 'Counterparty not found for line #%1: %2'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%1", СчВсего + 1);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%2", КонтрагентСтр);
			СоздаватьСчет = Ложь;
		Иначе
			ЗагружаемыеСсылки.Вставить(СтрокаПоиска, Контрагент);
		КонецЕсли;
		
	КонецЕсли;
	
	СтрокаПоиска = "Банки/" + БИКСтр;
	БИК = ЗагружаемыеСсылки.Получить(СтрокаПоиска);
	
	Если БИК = Неопределено Тогда
		
		БИК = НайтиБИК(БИКСтр);
		
		Если БИК = Неопределено Тогда
			ТекстСообщения = ТекстСообщения + Символы.ПС + Нстр("ru = 'Для строки №%1 не найден БИК: %2, создание счета невозможно'; en = 'BIC not found for line #%1: %2, account creation impossible'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%1", СчВсего + 1);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%2", БИКСтр);
			СоздаватьСчет = Ложь;
		Иначе
			ЗагружаемыеСсылки.Вставить(СтрокаПоиска, БИК);
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не СоздаватьСчет Тогда
		Возврат 1;
	КонецЕсли;
	
	БанковскийСчетНовый = Справочники.БанковскиеСчета.СоздатьЭлемент();
	БанковскийСчетНовый.Заполнить(Неопределено);
	БанковскийСчетНовый.Наименование = БанковскийСчет;
	БанковскийСчетНовый.НомерСчета   = БанковскийСчет;
	БанковскийСчетНовый.Владелец     = Контрагент;
	БанковскийСчетНовый.Банк         = БИК;
	
	БанковскийСчетНовый.Записать();
	
	Возврат БанковскийСчетНовый.Ссылка;
	
КонецФункции

&НаСервере
Функция НайтиБИК(БИК)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Банки.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Банки КАК Банки
	|ГДЕ
	|	(Банки.Наименование = &Наименование
	|			ИЛИ Банки.Код = &Наименование)
	|	И НЕ Банки.ПометкаУдаления
	|	И НЕ Банки.ЭтоГруппа";
	Запрос.УстановитьПараметр("Наименование", БИК);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Процедура ПеренестиТЧЗавершение(Результат) Экспорт
	
	Если МассивСтруктурДляПереноса.Количество() > 1 Тогда
		СтруктураДляПереноса = Новый Структура("ТекстСообщения, МассивСтруктурДляПереноса", ПолучитьМассивСообщений(), МассивСтруктурДляПереноса);
		Закрыть(СтруктураДляПереноса);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьОперацияДляПереносаОстатковДС(Операция)
	
	Если КассаБанковскийСчет = "Касса" Тогда
		Операция = ПредопределенноеЗначение("Перечисление.уатВидыОперацийВводОстатков.ОстаткиДСВКассах");
	Иначе
		Операция = ПредопределенноеЗначение("Перечисление.уатВидыОперацийВводОстатков.ОстаткиДСНаСчетах");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуПослеОткрытия(КодВозврата, ДополнительныеПараметры) Экспорт 
	
	ДополнительнаяОбработкаНеТребуется = Истина;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивСообщений()
	
	ТЗСообщения = ДанныеФормыВЗначение(ТаблСообщенияПеренос, Тип("ТаблицаЗначений"));
	Возврат ТЗСообщения.ВыгрузитьКолонку("ТекстСообщенияПеренос");
	
КонецФункции

#КонецОбласти