
#Область СлужебныйПрограммныйИнтерфейс

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	мЗапрос = Новый Запрос;
	мЗапрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗНАЧЕНИЕ(Справочник.уатСостояниеТС.Опломбирован) КАК Состояние,
	|	уатОпломбированиеВагонов.ДатаОпломбирования КАК Период,
	|	уатОпломбированиеВагонов.ДатаОкончанияОпломбирования КАК ДатаОкончания,
	|	уатОпломбированиеВагоновВагоны.Вагон КАК ТС
	|ИЗ
	|	Документ.уатОпломбированиеВагонов КАК уатОпломбированиеВагонов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уатОпломбированиеВагонов.Вагоны КАК уатОпломбированиеВагоновВагоны
	|		ПО уатОпломбированиеВагонов.Ссылка = уатОпломбированиеВагоновВагоны.Ссылка
	|ГДЕ
	|	уатОпломбированиеВагонов.Ссылка = &Ссылка";
	мЗапрос.УстановитьПараметр("Ссылка",ДокументСсылка);
	
	ТаблицаДокумента = мЗапрос.Выполнить().Выгрузить();

	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСостоянийТС", ТаблицаДокумента);
КонецПроцедуры

Процедура ВыполнитьКонтроль(ДокументСсылка, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
	
	
КонецПроцедуры

#КонецОбласти