
Процедура ОбработкаФормыСправочникаТС(ФормаТС) Экспорт
		
    GDS_МодульДинамическогоФормированияИнтерфейса.СздГруппаОбычная(ФормаТС, "GDS_ГруппаТопливо", ФормаТС.Элементы.ГруппаДопПараметрыШапкаКолонкаЛевая,"Топливо");
    GDS_МодульДинамическогоФормированияИнтерфейса.СздПоле(ФормаТС, "GDS_ОбъемБака", ФормаТС.Элементы.GDS_ГруппаТопливо, "Объем бака", 1, "Объект.GDS_ОбъемБака");

	
	ФормаТС.Элементы.ДатаВводаВЭксплуатацию.Доступность = РольДоступна("GDS_ИзменениеПараметровТС") Или РольДоступна("ПолныеПрава");
	ФормаТС.Элементы.ДатаВыбытия.Доступность 			= РольДоступна("GDS_ИзменениеПараметровТС") Или РольДоступна("ПолныеПрава");	
	
	Если НЕ GDS_ДополнительныеФункции.ПроверитьДоступностьРоли("GDS_СотрудникиМеКаМи") Тогда
		GDS_МодульДинамическогоФормированияИнтерфейса.СздГруппаОбычная(ФормаТС, "GDS_ГруппаПринадлежностьТС", ФормаТС.Элементы.ГруппаОсновнаяКолонкаЛевая,"Владелец ТС");
		СобытияЭлемента = Новый Структура("ПриИзменении", "ДТК_GDS_ПривлеченныйТранспортПриИзмененииПосле");
		GDS_МодульДинамическогоФормированияИнтерфейса.СздПолеФлажок(ФормаТС, "GDS_ПривлеченныйТранспорт", ФормаТС.Элементы.GDS_ГруппаПринадлежностьТС, "Привлеченный транспорт", 1, "Объект.GDS_ПривлеченныйТранспорт",,СобытияЭлемента);
	    ФормаТС.Элементы.Переместить(ФормаТС.Элементы.ВладелецТС2, ФормаТС.Элементы.GDS_ГруппаПринадлежностьТС);
		ФормаТС.Элементы.Переместить(ФормаТС.Элементы.ТипВладенияТС, ФормаТС.Элементы.GDS_ГруппаПринадлежностьТС);
        GDS_МодульДинамическогоФормированияИнтерфейса.СздПоле(ФормаТС, "GDS_Собственник", ФормаТС.Элементы.GDS_ГруппаПринадлежностьТС, "Собственник", 1, "Объект.GDS_СобственникТС");
        GDS_МодульДинамическогоФормированияИнтерфейса.СздПоле(ФормаТС, "GDS_ОснованиеВладения", ФормаТС.Элементы.GDS_ГруппаПринадлежностьТС, "Основание", 1, "Объект.GDS_ОснованиеВладения");
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаФормыДокументаРемонтныйЛист(ТекущаяФорма) Экспорт
	
	ДФИ = GDS_МодульДинамическогоФормированияИнтерфейса;
	Элементы = ТекущаяФорма.Элементы;
	
	ТекущаяФорма.Элементы.Страницы.ПодчиненныеЭлементы.ГруппаОсновное.ПодчиненныеЭлементы.ГруппаОсновноеКолонки.Видимость = Ложь;
	
	ПолеВвода = ТекущаяФорма.Элементы.Добавить("ПУ", Тип("ПолеФормы"), ТекущаяФорма.Элементы.ГруппаЛеваяКолонка);
	ПолеВвода.Вид 					= ВидПоляФормы.ПолеВвода; 
	ПолеВвода.ПутьКДанным 			= "Объект.GDS_ПУ";
	ПолеВвода.ПоложениеЗаголовка 	= ПоложениеЗаголовкаЭлементаФормы.Верх;
	ПолеВвода.ЦветТекстаЗаголовка 	= WebЦвета.Красный;
	ПолеВвода.ВысотаЗаголовка 		= 0;
	ПолеВвода.Заголовок 			= "ПУ на котором был выполнен ремонт";
	
	НоваяГруппа 					= ТекущаяФорма.Элементы.Вставить("ГруппаНаработок", Тип("ГруппаФормы"), ТекущаяФорма.Элементы.ГруппаОсновное,ТекущаяФорма.Элементы.ГруппаВидыРемонта);
	НоваяГруппа.Вид 				= ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.Отображение 		= ОтображениеОбычнойГруппы.Нет;
	НоваяГруппа.Заголовок 			= "Текущие показания наработки";
	НоваяГруппа.ЦветТекстаЗаголовка = Новый Цвет(255, 0, 0);
	
	ГруппаНаработок = ТекущаяФорма.Элементы.Добавить("ГруппаТекущиеПоказанияНаработки", Тип("ГруппаФормы"), ТекущаяФорма.Элементы.ГруппаНаработок);
	ГруппаНаработок.Вид 		= ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаНаработок.Отображение = ОтображениеОбычнойГруппы.Нет;
	
	ПолеВвода = ТекущаяФорма.Элементы.Добавить("ТекущиеПоказанияОдометра", Тип("ПолеФормы"), ГруппаНаработок);
	ПолеВвода.Вид 				= ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным 		= "Объект.GDS_ТекущаяНаработкаОдометр";
	ПолеВвода.ПоложениеЗаголовка= ПоложениеЗаголовкаЭлементаФормы.Верх;
	ПолеВвода.ВысотаЗаголовка 	= 0;
	
	ПолеВвода = ТекущаяФорма.Элементы.Добавить("ТекущиеПоказанияМЧ_ДВС", Тип("ПолеФормы"), ГруппаНаработок);
	ПолеВвода.Вид 				= ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным 		= "Объект.GDS_ТекущаяНаработкаМЧ_ДВС";
	ПолеВвода.ПоложениеЗаголовка= ПоложениеЗаголовкаЭлементаФормы.Верх;
	ПолеВвода.ВысотаЗаголовка 	= 0;
	
	ПолеВвода = ТекущаяФорма.Элементы.Добавить("ТекущаеПоказанияМЧ_ВО", Тип("ПолеФормы"), ГруппаНаработок);
	ПолеВвода.Вид 				= ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным 		= "Объект.GDS_ТекущаяНаработкаМЧ_ВО";
	ПолеВвода.ПоложениеЗаголовка= ПоложениеЗаголовкаЭлементаФормы.Верх;
	ПолеВвода.ВысотаЗаголовка 	= 0;
	
	ГруппаВидРемонта4 = ТекущаяФорма.Элементы.Добавить("ГруппаВидРем4", Тип("ГруппаФормы"), ТекущаяФорма.Элементы.Группа3);
	ГруппаВидРемонта4.Вид 					= ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаВидРемонта4.Отображение 			= ОтображениеОбычнойГруппы.Нет;
	ГруппаВидРемонта4.ОтображатьЗаголовок 	= Ложь;
	
	ДекорВидРемонта4 = ТекущаяФорма.Элементы.Добавить("ДекорацияВидРем4", Тип("ДекорацияФормы"), ТекущаяФорма.Элементы.ГруппаВидРем4);
	ДекорВидРемонта4.Вид 		= ВидДекорацииФормы.Надпись;
	ДекорВидРемонта4.Заголовок 	= "Вид ремонта 4:";
	ДекорВидРемонта4.Ширина 	= 10;
	
	СтруктураСвойств = Новый Структура("ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Нет);
	СобытияЭлемента = Новый Структура("ПриИзменении", "Расш1_GDS_ВидОбслуживания4ПриИзмененииПосле");
	Если ТекущаяФорма.ИмяФормы = "Документ.уатРемонтныйЛист.Форма.ФормаДокумента" Тогда
		GDS_МодульДинамическогоФормированияИнтерфейса.СздПоле(ТекущаяФорма, "ВидОбслуживания4", ТекущаяФорма.Элементы.ГруппаВидРем4,"", 1, "Объект.GDS_ВидОбслуживания4", СтруктураСвойств, СобытияЭлемента); 	
	КонецЕсли;
	
	//ПолеВвода = ТекущаяФорма.Элементы.Добавить("ВидОбслуживания4", Тип("ПолеФормы"), ТекущаяФорма.Элементы.ГруппаВидРем4);
	//ПолеВвода.Вид 				= ВидПоляФормы.ПолеВвода;
	//ПолеВвода.ПутьКДанным 		= "Объект.GDS_ВидОбслуживания4";
	//ПолеВвода.ПоложениеЗаголовка= ПоложениеЗаголовкаЭлементаФормы.Нет;
	//ПолеВвода.ВысотаЗаголовка 	= 0;
	
	ГруппаВидРемонта5 = ТекущаяФорма.Элементы.Добавить("ГруппаВидРем5", Тип("ГруппаФормы"), ТекущаяФорма.Элементы.Группа3);
	ГруппаВидРемонта5.Вид 					= ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаВидРемонта5.Отображение 			= ОтображениеОбычнойГруппы.Нет;
	ГруппаВидРемонта5.ОтображатьЗаголовок 	= Ложь;
	
	НоваяГруппа 			= ТекущаяФорма.Элементы.Вставить("ГосудНомер", Тип("ДекорацияФормы"), ТекущаяФорма.Элементы.ГруппаТС,ТекущаяФорма.Элементы.ТСМодель);
	НоваяГруппа.Вид 		= ВидДекорацииФормы.Надпись;
	НоваяГруппа.Заголовок	= "Гос. № " + ТекущаяФорма.Объект.ТС.ГосударственныйНомер;
	НоваяГруппа.Шрифт 		= Новый Шрифт(,,Истина);
	
	ДекорВидРемонта5 = ТекущаяФорма.Элементы.Добавить("ДекорацияВидРем5", Тип("ДекорацияФормы"), ТекущаяФорма.Элементы.ГруппаВидРем5);
	ДекорВидРемонта5.Вид 		= ВидДекорацииФормы.Надпись;
	ДекорВидРемонта5.Заголовок 	= "Вид ремонта 5:";
	ДекорВидРемонта5.Ширина 	= 10;
	
	СтруктураСвойств = Новый Структура("ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Нет);
	СобытияЭлемента = Новый Структура("ПриИзменении", "Расш1_GDS_ВидОбслуживания5ПриИзмененииПосле");
	Если ТекущаяФорма.ИмяФормы = "Документ.уатРемонтныйЛист.Форма.ФормаДокумента" Тогда
		GDS_МодульДинамическогоФормированияИнтерфейса.СздПоле(ТекущаяФорма, "ВидОбслуживания5", ТекущаяФорма.Элементы.ГруппаВидРем5,"", 1, "Объект.GDS_ВидОбслуживания5", СтруктураСвойств, СобытияЭлемента); 	
	КонецЕсли;
	
	//ПолеВвода = ТекущаяФорма.Элементы.Добавить("ВидОбслуживания5", Тип("ПолеФормы"), ТекущаяФорма.Элементы.ГруппаВидРем5);
	//ПолеВвода.Вид 				= ВидПоляФормы.ПолеВвода;
	//ПолеВвода.ПутьКДанным 		= "Объект.GDS_ВидОбслуживания5";
	//ПолеВвода.ПоложениеЗаголовка= ПоложениеЗаголовкаЭлементаФормы.Нет;
	//ПолеВвода.ВысотаЗаголовка 	= 0;
	
	ПолеВвода = ТекущаяФорма.Элементы.Вставить("СкладВБП", Тип("ПолеФормы"), ТекущаяФорма.Элементы.ГруппаМатериалы,ТекущаяФорма.Элементы.Материалы);
	ПолеВвода.Вид 				= ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным 		= "Объект.GDS_СкладВБП";
	ПолеВвода.ВысотаЗаголовка 	= 0;
	ПолеВвода.Заголовок			= "МОЛ";
	
	ГруппаСчетчикМЧ_ВО = ТекущаяФорма.Элементы.Добавить("ГруппаСчетчикМЧ_ВО", Тип("ГруппаФормы"), ТекущаяФорма.Элементы.ГруппаИзмененныеПоказанияПриборов);
	ГруппаСчетчикМЧ_ВО.Вид 					= ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаСчетчикМЧ_ВО.Отображение 			= ОтображениеОбычнойГруппы.Нет;
	ГруппаСчетчикМЧ_ВО.ОтображатьЗаголовок 	= Ложь;
	
	ПолеФлажка = ТекущаяФорма.Элементы.Добавить("СчетчикМЧ_ВО", Тип("ПолеФормы"), ТекущаяФорма.Элементы.ГруппаСчетчикМЧ_ВО);
	ПолеФлажка.Вид 				= ВидПоляФормы.ПолеФлажка;
	ПолеФлажка.ПутьКДанным 		= "Объект.GDS_СчетчикМЧ_ВО";
	ПолеФлажка.ВысотаЗаголовка 	= 0;
	ПолеФлажка.УстановитьДействие("ПриИзменении", "GDS_СчетчикМЧ_ВОПриИзменении");
	
	ПолеВвода = ТекущаяФорма.Элементы.Добавить("ПоказанияСчетчикаМЧ_ВО", Тип("ПолеФормы"), ТекущаяФорма.Элементы.ГруппаСчетчикМЧ_ВО);
	ПолеВвода.Вид 				= ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным 		= "Объект.GDS_ПоказанияСчетчикаМЧ_ВО";
	ПолеВвода.Доступность 		= ТекущаяФорма.Объект.GDS_СчетчикМЧ_ВО;
	ПолеВвода.ВысотаЗаголовка 	= 0;
	
	//ПолеВвода = ТекущаяФорма.Элементы.Добавить("СсылкаНаВидеоФайл", Тип("ПолеФормы"), ТекущаяФорма.Элементы.ГруппаОсновное);
	//ПолеВвода.Вид 				= ВидПоляФормы.ПолеВвода;
	//ПолеВвода.ПутьКДанным 		= "Объект.GDS_СсылкаНаВидеоФайл";
	//ПолеВвода.ПоложениеЗаголовка= ПоложениеЗаголовкаЭлементаФормы.Верх;
	//ПолеВвода.ВысотаЗаголовка 	= 0;
	
	СтруктураСвойств = Новый Структура("ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Верх);
	Если ТекущаяФорма.ИмяФормы = "Документ.уатРемонтныйЛист.Форма.ФормаДокумента" Тогда
		GDS_МодульДинамическогоФормированияИнтерфейса.СздПоле(ТекущаяФорма, "СсылкаНаВидеоФайл", ТекущаяФорма.Элементы.ГруппаОсновное,"", 1, "Объект.GDS_СсылкаНаВидеоФайл", СтруктураСвойств); 
	КонецЕсли;
	
	//ТекущаяФорма.Элементы.ГруппаКузовныеЭлементы.Видимость 	= Ложь;
	//ТекущаяФорма.Элементы.ГруппаКомплектация.Видимость 		= Ложь;
	ТекущаяФорма.Элементы.ГруппаЗарплата.Видимость 			= Ложь;
	ТекущаяФорма.Элементы.Группа5.Видимость 				= Ложь;
	
	//Кнопка Заполнить по заявке из Бухгалтерии
	НоваяКоманда = ТекущаяФорма.Команды.Добавить("ЗаполнитьИзБухгалтерии");
	НоваяКоманда.Действие = "GDS_ЗаполнитьИзБухгалтерииМатериалы";
	НоваяКоманда.Заголовок= "Заполнить данными из 1С Бухгалтерии";
	
	КнопкаЗаполненияМатериалов = ТекущаяФорма.Элементы.Добавить("ЗаполнитьИзБухгалтерии", Тип("КнопкаФормы"), ТекущаяФорма.Элементы.ЗаполнитьМатериалы);
	КнопкаЗаполненияМатериалов.ИмяКоманды = "ЗаполнитьИзБухгалтерии";
	
	КнопкаЗаполненияМатериалов = ТекущаяФорма.Элементы.Добавить("ЗаполнитьИзБухгалтерии1", Тип("КнопкаФормы"), ТекущаяФорма.Элементы.Материалы.КоманднаяПанель);
	КнопкаЗаполненияМатериалов.ИмяКоманды = "ЗаполнитьИзБухгалтерии";
	КнопкаЗаполненияМатериалов.Заголовок = "Обновить список ТМЦ";
	
	ТекущаяФорма.Элементы.ГруппаШины.ПодчиненныеЭлементы.Шины.КоманднаяПанель.ПодчиненныеЭлементы.ШиныМастерУстановкиШин.Видимость = Ложь;
	
	Если ТекущаяФорма.Объект.Ссылка.Пустая() Тогда
		ТекущаяФорма.Объект.ДатаОкончания = Дата(1,1,1);
	КонецЕсли;
	
	СтруктураРеквизитов = Новый Структура();
	СтруктураРеквизитов.Вставить("ПП_МЧ_ВО1", GDS_МодульДинамическогоФормированияИнтерфейса.ОписаниеТипаЧисло(10, 2));
	СтруктураРеквизитов.Вставить("ПП_МЧ_ВО2", GDS_МодульДинамическогоФормированияИнтерфейса.ОписаниеТипаЧисло(10, 2));
	СтруктураРеквизитов.Вставить("ПП_МЧ_ВО3", GDS_МодульДинамическогоФормированияИнтерфейса.ОписаниеТипаЧисло(10, 2));
	СтруктураРеквизитов.Вставить("ПП_МЧ_ВО4", GDS_МодульДинамическогоФормированияИнтерфейса.ОписаниеТипаЧисло(10, 2));
	СтруктураРеквизитов.Вставить("ПП_МЧ_ВО5", GDS_МодульДинамическогоФормированияИнтерфейса.ОписаниеТипаЧисло(10, 2));
	
	СтруктураРеквизитов.Вставить("ПП_Одометр_ВО1", GDS_МодульДинамическогоФормированияИнтерфейса.ОписаниеТипаЧисло(10, 2));
	СтруктураРеквизитов.Вставить("ПП_Одометр_ВО2", GDS_МодульДинамическогоФормированияИнтерфейса.ОписаниеТипаЧисло(10, 2));
	СтруктураРеквизитов.Вставить("ПП_Одометр_ВО3", GDS_МодульДинамическогоФормированияИнтерфейса.ОписаниеТипаЧисло(10, 2));
	СтруктураРеквизитов.Вставить("ПП_Одометр_ВО4", GDS_МодульДинамическогоФормированияИнтерфейса.ОписаниеТипаЧисло(10, 2));
	СтруктураРеквизитов.Вставить("ПП_Одометр_ВО5", GDS_МодульДинамическогоФормированияИнтерфейса.ОписаниеТипаЧисло(10, 2));
	
	СтруктураРеквизитов.Вставить("ПП_МЧ_ДВС1", GDS_МодульДинамическогоФормированияИнтерфейса.ОписаниеТипаЧисло(10, 2));
	СтруктураРеквизитов.Вставить("ПП_МЧ_ДВС2", GDS_МодульДинамическогоФормированияИнтерфейса.ОписаниеТипаЧисло(10, 2));
	СтруктураРеквизитов.Вставить("ПП_МЧ_ДВС3", GDS_МодульДинамическогоФормированияИнтерфейса.ОписаниеТипаЧисло(10, 2));
	СтруктураРеквизитов.Вставить("ПП_МЧ_ДВС4", GDS_МодульДинамическогоФормированияИнтерфейса.ОписаниеТипаЧисло(10, 2));
	СтруктураРеквизитов.Вставить("ПП_МЧ_ДВС5", GDS_МодульДинамическогоФормированияИнтерфейса.ОписаниеТипаЧисло(10, 2));
	
	GDS_МодульДинамическогоФормированияИнтерфейса.СоздатьРеквизиты(ТекущаяФорма,СтруктураРеквизитов);
	
	СтруктураСвойств = Новый Структура("Видимость", Ложь);
	
	
	GDS_МодульДинамическогоФормированияИнтерфейса.СздПоле(ТекущаяФорма, "ПП_Одометр_ВО5", ТекущаяФорма.Элементы.ГруппаВидРем5,"Одометр",1,"ПП_Одометр_ВО5", СтруктураСвойств,,); 		
	GDS_МодульДинамическогоФормированияИнтерфейса.СздПоле(ТекущаяФорма, "ПП_МЧ_ДВС5", ТекущаяФорма.Элементы.ГруппаВидРем5,"М/ч ДВС (шасси)",1,"ПП_МЧ_ДВС5", СтруктураСвойств,,); 		
	GDS_МодульДинамическогоФормированияИнтерфейса.СздПоле(ТекущаяФорма, "ПП_МЧ_ВО5", ТекущаяФорма.Элементы.ГруппаВидРем5,"М/ч ВО",1,"ПП_МЧ_ВО5", СтруктураСвойств,,); 
	
	
	GDS_МодульДинамическогоФормированияИнтерфейса.СздПоле(ТекущаяФорма, "ПП_Одометр_ВО4", ТекущаяФорма.Элементы.ГруппаВидРем4,"Одометр",1,"ПП_Одометр_ВО4", СтруктураСвойств,,); 		
	GDS_МодульДинамическогоФормированияИнтерфейса.СздПоле(ТекущаяФорма, "ПП_МЧ_ДВС4", ТекущаяФорма.Элементы.ГруппаВидРем4,"М/ч ДВС (шасси)",1,"ПП_МЧ_ДВС4", СтруктураСвойств,,);
	GDS_МодульДинамическогоФормированияИнтерфейса.СздПоле(ТекущаяФорма, "ПП_МЧ_ВО4", ТекущаяФорма.Элементы.ГруппаВидРем4,"М/ч ВО",1,"ПП_МЧ_ВО4", СтруктураСвойств,,);
	
	
	GDS_МодульДинамическогоФормированияИнтерфейса.СздПоле(ТекущаяФорма, "ПП_Одометр_ВО3", ТекущаяФорма.Элементы.ГруппаВидРем3,"Одометр",1,"ПП_Одометр_ВО3", СтруктураСвойств,,); 		
	GDS_МодульДинамическогоФормированияИнтерфейса.СздПоле(ТекущаяФорма, "ПП_МЧ_ДВС3", ТекущаяФорма.Элементы.ГруппаВидРем3,"М/ч ДВС (шасси)",1,"ПП_МЧ_ДВС3", СтруктураСвойств,,);
	GDS_МодульДинамическогоФормированияИнтерфейса.СздПоле(ТекущаяФорма, "ПП_МЧ_ВО3", ТекущаяФорма.Элементы.ГруппаВидРем3,"М/ч ВО",1,"ПП_МЧ_ВО3", СтруктураСвойств,,);
	
	
	GDS_МодульДинамическогоФормированияИнтерфейса.СздПоле(ТекущаяФорма, "ПП_Одометр_ВО2", ТекущаяФорма.Элементы.ГруппаВидРем2,"Одометр",1,"ПП_Одометр_ВО2", СтруктураСвойств,,); 		
	GDS_МодульДинамическогоФормированияИнтерфейса.СздПоле(ТекущаяФорма, "ПП_МЧ_ДВС2", ТекущаяФорма.Элементы.ГруппаВидРем2,"М/ч ДВС (шасси)",1,"ПП_МЧ_ДВС2", СтруктураСвойств,,);
	GDS_МодульДинамическогоФормированияИнтерфейса.СздПоле(ТекущаяФорма, "ПП_МЧ_ВО2", ТекущаяФорма.Элементы.ГруппаВидРем2,"М/ч ВО",1,"ПП_МЧ_ВО2", СтруктураСвойств,,);
	
	GDS_МодульДинамическогоФормированияИнтерфейса.СздПоле(ТекущаяФорма, "ПП_Одометр_ВО1", ТекущаяФорма.Элементы.ГруппаВидРем1,"Одометр",1,"ПП_Одометр_ВО1", СтруктураСвойств,,); 		
	GDS_МодульДинамическогоФормированияИнтерфейса.СздПоле(ТекущаяФорма, "ПП_МЧ_ДВС1", ТекущаяФорма.Элементы.ГруппаВидРем1,"М/ч ДВС (шасси)",1,"ПП_МЧ_ДВС1", СтруктураСвойств,,);
	GDS_МодульДинамическогоФормированияИнтерфейса.СздПоле(ТекущаяФорма, "ПП_МЧ_ВО1", ТекущаяФорма.Элементы.ГруппаВидРем1,"М/ч ВО",1,"ПП_МЧ_ВО1", СтруктураСвойств,,);	
	//ТекущаяФорма.Элементы.ДатаОкончания.Доступность = Ложь;
	//ТекущаяФорма.Элементы.ВремяОкончания.Доступность = Ложь;
	
	ИмяКоманды = "GDS_ПрерватьСогласование";
	ДФИ.СоздатьКоманду(ТекущаяФорма, ИмяКоманды, "Прервать согласование", ИмяКоманды);
	ДФИ.СздКнопка(ТекущаяФорма, ИмяКоманды, Элементы.ФормаКоманднаяПанель, , ИмяКоманды, 1);
	
	СтруктураРеквизитов = Новый Структура();
	СтруктураРеквизитов.Вставить("НаСогласовании", ДФИ.ОписаниеТипаБулево());
	СтруктураРеквизитов.Вставить("Согласован", ДФИ.ОписаниеТипаБулево());
	ДФИ.СоздатьРеквизиты(ТекущаяФорма, СтруктураРеквизитов);
	
	ТекстПредупреждения = "На согласование можно отправить проведенный рем. лист с пометкой Выполнен";
	Надпись = ДФИ.СздДекорацияНадпись(ТекущаяФорма, "GDS_ПредупреждениеПоСогласованию", ТекущаяФорма, ТекстПредупреждения, , Элементы.ГруппаШапка);
	Надпись.ЦветТекста = WebЦвета.Зеленый;
	
	ТекущаяФорма.Элементы.МатериалыСумма.Доступность = Ложь;
	
КонецПроцедуры 

Функция ПолучитьДанныеИз1СБухгалтерии(РемонтныйЛист) Экспорт
		
	СоединениеWS = GDS_ФункцииОбмена.ПолучитьДанныеОWS_БП();
		
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ИтогВыборки.ЗаявкаНаРемонт,
	                      |	ИтогВыборки.РЛ
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		уатРемонтныйЛист.ЗаявкаНаРемонт КАК ЗаявкаНаРемонт,
	                      |		уатРемонтныйЛист.Ссылка КАК РЛ
	                      |	ИЗ
	                      |		Документ.уатРемонтныйЛист КАК уатРемонтныйЛист
	                      |	ГДЕ
	                      |		уатРемонтныйЛист.Ссылка = &Ссылка
	                      |	
	                      |	ОБЪЕДИНИТЬ ВСЕ
	                      |	
	                      |	ВЫБРАТЬ
	                      |		уатРемонтныйЛистРаботы.ЗаявкаНаРемонт,
	                      |		уатРемонтныйЛистРаботы.Ссылка
	                      |	ИЗ
	                      |		Документ.уатРемонтныйЛист.Работы КАК уатРемонтныйЛистРаботы
	                      |	ГДЕ
	                      |		уатРемонтныйЛистРаботы.Ссылка = &Ссылка) КАК ИтогВыборки
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ИтогВыборки.ЗаявкаНаРемонт,
	                      |	ИтогВыборки.РЛ");
						  
	Запрос.УстановитьПараметр("Ссылка",РемонтныйЛист.Ссылка);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	ТаблицаНеобходимыхДанных = РемонтныйЛист.Материалы.Выгрузить();
	ТаблицаНеобходимыхДанных.Очистить();
	
	Пока Результат.Следующий() Цикл
		Если ТипЗнч(Результат.РЛ) = ТипЗнч(Документы.уатРемонтныйЛист.ПустаяСсылка()) Тогда
			Данные = СоединениеWS.ВернутьДанныеПоЗапросу("ЗапросНоменклатурыПоРЛ",строка(Результат.РЛ.УникальныйИдентификатор()));
			
			Если НЕ ЗначениеЗаполнено(Данные.Получить()) Тогда
				Сообщить(Строка(Результат.РЛ) + " не найден в 1С Бухгалтерия!!!");
				Возврат 0;
			КонецЕсли;
		КонецЕсли;
		
		XML_Строка 				= Данные.Получить();
		СписокПолученныхДанных 	= GDS_ФункцииОбмена.РазобратьПолученныеДанные(XML_Строка);
		СписокНоменклатуры 		= СписокПолученныхДанных[0].Значение.Номенклатура;
		
		Если СписокНоменклатуры = "" Тогда
			Данные = СоединениеWS.ВернутьДанныеПоЗапросу("ЗапросНоменклатурыПоЗаявке",строка(Результат.ЗаявкаНаРемонт.УникальныйИдентификатор()));
			XML_Строка 				= Данные.Получить();
			СписокПолученныхДанных 	= GDS_ФункцииОбмена.РазобратьПолученныеДанные(XML_Строка);
			СписокНоменклатуры 		= СписокПолученныхДанных[0].Значение.Номенклатура;
			
			Если СписокНоменклатуры = "" Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Для Каждого Запись из СписокНоменклатуры Цикл
			СтрокаИзБухгалтерии = Запись.Значение;
			строка = ТаблицаНеобходимыхДанных.Добавить();
			строка.Номенклатура     = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаИзБухгалтерии.Номенклатура));
			строка.Количество       = СтрокаИзБухгалтерии.КоличествоОстаток;
			строка.Сумма            = СтрокаИзБухгалтерии.СуммаОстаток;
			строка.Цена             = ?(Строка.Количество <> 0,Строка.Сумма / строка.Количество,строка.Сумма);
			строка.ЕдиницаИзмерения = Строка.Номенклатура.ЕдиницаХраненияОстатков;
		КонецЦикла;	
	КонецЦикла;
	
	ТаблицаНеобходимыхДанных.Свернуть("Номенклатура,ЕдиницаИзмерения, Цена","Количество,Сумма");

	Возврат ТаблицаНеобходимыхДанных;
	
КонецФункции

Процедура ОбработкаФормыСпискаРЛ(ФормаДокумента) Экспорт
	
	//Если GDS_ДополнительныеФункции.ПроверитьДоступностьРоли("GDS_СотрудникиМеКаМи") ИЛИ GDS_ДополнительныеФункции.ПроверитьДоступностьРоли("ПолныеПрава") Тогда
	//	ФормаДокумента.Элементы.Список.ПодчиненныеЭлементы.Контрагент.Видимость 		= Ложь;
	//	ФормаДокумента.Элементы.Список.ПодчиненныеЭлементы.ТребуетСогласования.Видимость= Ложь;
	//	ФормаДокумента.Элементы.Список.ПодчиненныеЭлементы.ДокументСогласован.Видимость = Ложь;
	//КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьРеквизитыНаФорму(Форма) Экспорт 
	
	#Область Справочники	
	
	#Область ФизическиеЛица							
	Если Форма.ИмяФормы = "Справочник.Должности.Форма.ФормаЭлемента" Тогда	
		GDS_МодульДинамическогоФормированияИнтерфейса.СздПоле(Форма, "GDS_ЯвляетсяВодительскойДолжностью",  Форма, , 2, "Объект.GDS_ЯвляетсяВодительскойДолжностью", , , Форма.Элементы.Страницы); 
		GDS_МодульДинамическогоФормированияИнтерфейса.СздПоле(Форма, "GDS_КатегорияВоинскогоУчета", Форма, , 1, "Объект.GDS_КатегорияВоинскогоУчета", , , Форма.Элементы.Страницы); 
		Возврат;
	КонецЕсли;
	#КонецОбласти
		
	#Область ДоговорыКонтрагентов							
	Если Форма.ИмяФормы = "Справочник.ДоговорыКонтрагентов.Форма.ФормаЭлемента" Тогда	
		// ИнтеграцияС1СДокументооборотом
		ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(Форма);
		// Конец ИнтеграцияС1СДокументооборотом
		Возврат;
	КонецЕсли;
	#КонецОбласти  

	#Область уатРегистрационныеДокументы							
	Если Форма.ИмяФормы = "Справочник.уатРегистрационныеДокументы.Форма.ФормаЭлемента" Тогда	
		// ИнтеграцияС1СДокументооборотом
		ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(Форма);
		// Конец ИнтеграцияС1СДокументооборотом
		Возврат;
	КонецЕсли;
	#КонецОбласти
	
	#Область уатОбъектыСтроительства
	Если Форма.ИмяФормы = "Справочник.уатОбъектыСтроительства.Форма.ФормаЭлемента" Тогда	
		GDS_МодульДинамическогоФормированияИнтерфейса.СздПоле(Форма, "GDS_МаршрутПоУмолчанию",, "Маршрут по умолчанию",1, "Объект.GDS_МаршрутПоУмолчанию",,,);
		GDS_МодульДинамическогоФормированияИнтерфейса.СздПоле(Форма, "GDS_НаправлениеПоУмолчанию",, "Направление по умолчанию",1, "Объект.GDS_НаправлениеПоУмолчанию",,,);
		Возврат;
	КонецЕсли;
	#КонецОбласти
	#Область Склады
	Если Форма.ИмяФормы = "Справочник.Склады.Форма.ФормаЭлемента" Тогда	
		GDS_МодульДинамическогоФормированияИнтерфейса.СздПоле(Форма, "GDS_ТС",, "ТС",1, "Объект.GDS_ТС",,,);
		GDS_МодульДинамическогоФормированияИнтерфейса.СздПоле(Форма, "GDS_Контрагент",, "Контрагент",1, "Объект.GDS_Контрагент",,,);
		Возврат;
	КонецЕсли;
	#КонецОбласти
	#КонецОбласти

	#Область Документы	
	
	#Область уатПутевойЛист							
	Если Форма.ИмяФормы = "Документ.уатПутевойЛист.Форма.ФормаДокумента" Тогда	
		СтруктураСвойств = Новый Структура;
		СтруктураСвойств.Вставить("РастягиватьПоГоризонтали",Ложь); 
		GDS_МодульДинамическогоФормированияИнтерфейса.СздПоле(Форма, "GDS_НомерПутевогоЛиста", Форма.Элементы.ГруппаНомерДата, , 1, "Объект.GDS_НомерПутевогоЛиста", СтруктураСвойств, , ); 
		
		СтруктураСвойств = Новый Структура;
		СтруктураСвойств.Вставить("ОтображатьЗаголовок", Ложь);
		GDS_МодульДинамическогоФормированияИнтерфейса.СздГруппаОбычная(Форма, "GDS_Группа_Организация", Форма.Элементы.ГруппаШапкаПравая, , 3, 1, , СтруктураСвойств, );                                                                                                                       
		
		Форма.Элементы.Переместить(Форма.Элементы.Организация, Форма.Элементы.GDS_Группа_Организация);

		СтруктураСвойств = Новый Структура;
		GDS_МодульДинамическогоФормированияИнтерфейса.СздДекорацияНадпись(Форма, "GDS_ОригиналДокуумента", Форма.Элементы.GDS_Группа_Организация, , , ); 
		GDS_МодульДинамическогоФормированияИнтерфейса.СоздатьКоманду(Форма, "ПодборМЛ", "Подбор М/Л", "ДПЛ_ПодборПЛ");
		GDS_МодульДинамическогоФормированияИнтерфейса.СздКнопка(Форма, "ПодборМЛ", Форма.Элементы.Задание.КоманднаяПанель, "Подбор М/Л", "ПодборМЛ", 1);
		GDS_МодульДинамическогоФормированияИнтерфейса.СздКолонкаТаблицыФормы(Форма, "GDS_МаршрутныйЛист",Форма.Элементы.Задание,, "Маршрутный лист", "Объект.Задание.GDS_МаршрутныйЛист",,,,,Форма.Элементы.ЗаданиеГруппаПодразделение);
		Возврат;
	КонецЕсли;
	#КонецОбласти  
	
	#КонецОбласти
	
КонецПроцедуры

Процедура ОбработкаФормыДокументаПЛ(ФормаДокумента) Экспорт
			
КонецПроцедуры
