
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	уатЗащищенныеФункцииСервер.уатСправочникФормаЭлементаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, Объект, ЭтотОбъект, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	уатЗащищенныеФункцииКлиент.уатСправочникФормаЭлементаПриОткрытии(Отказ, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если Объект.Ссылка.Пустая() Тогда
		уатОбщегоНазначенияКлиент.УстановитьОтборУСписка(Нормочасы.Отбор, Новый ПолеКомпоновкиДанных("Работа"), 
			ПредопределенноеЗначение("Справочник.уатРаботыПоРемонту.ПустаяСсылка"), ВидСравненияКомпоновкиДанных.Равно);
		уатОбщегоНазначенияКлиент.УстановитьОтборУСписка(СвязанныеРаботы.Отбор, Новый ПолеКомпоновкиДанных("Работа"), 
			ПредопределенноеЗначение("Справочник.уатРаботыПоРемонту.ПустаяСсылка"), ВидСравненияКомпоновкиДанных.Равно);
	Иначе
		уатОбщегоНазначенияКлиент.УстановитьОтборУСписка(Нормочасы.Отбор, Новый ПолеКомпоновкиДанных("Работа"), 
			Объект.Ссылка, ВидСравненияКомпоновкиДанных.Равно);
		уатОбщегоНазначенияКлиент.УстановитьОтборУСписка(СвязанныеРаботы.Отбор, Новый ПолеКомпоновкиДанных("Работа"), 
			Объект.Ссылка, ВидСравненияКомпоновкиДанных.Равно);
	КонецЕсли;
	Модифицированность=Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	уатОбщегоНазначенияКлиент.УстановитьОтборУСписка(Нормочасы.Отбор, Новый ПолеКомпоновкиДанных("Работа"), 
		Объект.Ссылка, ВидСравненияКомпоновкиДанных.Равно);
	уатОбщегоНазначенияКлиент.УстановитьОтборУСписка(СвязанныеРаботы.Отбор, Новый ПолеКомпоновкиДанных("Работа"), 
		Объект.Ссылка, ВидСравненияКомпоновкиДанных.Равно);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	Если ПустаяСтрока(Объект.НаименованиеПолное) Тогда
		Объект.НаименованиеПолное = Объект.Наименование;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыНормочасы

&НаКлиенте
Процедура НормочасыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Элемент.ТекущиеДанные.Работа = Объект.Ссылка;
КонецПроцедуры

&НаКлиенте
Процедура НормочасыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Если Объект.Ссылка.Пустая() Тогда
		Ответ = Неопределено;
		Отказ = Истина;
		ТекстНСТР = НСтр("en='It is necessary to record element to perform this operation! Continue?';ru='Для выполнения этой операции необходимо записать элемент! Продолжить?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("НормочасыПередНачаломДобавленияЗавершение", ЭтотОбъект), ТекстНСТР, РежимДиалогаВопрос.ОКОтмена);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НормочасыПередНачаломДобавленияЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.ОК Тогда
		Попытка
			Записать();
		Исключение
			Возврат;
		КонецПопытки;
		Если Не Объект.Ссылка.Пустая() Тогда
			ФормаЗаписи = ПолучитьФорму("РегистрСведений.уатНормочасыРаботПоРемонту.Форма.ФормаЗаписи");
			ФормаЗаписи.Запись.Работа = Объект.Ссылка;
			ФормаЗаписи.Открыть();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыСвязанныеРаботы

&НаКлиенте
Процедура СвязанныеРаботыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Элемент.ТекущиеДанные.Работа = Объект.Ссылка;
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеРаботыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Если Объект.Ссылка.Пустая() Тогда
		Ответ = Неопределено;
		Отказ = Истина;
		ТекстНСТР = НСтр("en='It is necessary to record element to perform this operation! Continue?';ru='Для выполнения этой операции необходимо записать элемент! Продолжить?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("СвязанныеРаботыПередНачаломДобавленияЗавершение", ЭтотОбъект), ТекстНСТР, РежимДиалогаВопрос.ОКОтмена);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеРаботыПередНачаломДобавленияЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.ОК Тогда
		Попытка
			Записать();
		Исключение
			Возврат;
		КонецПопытки;
		Если Не Объект.Ссылка.Пустая() Тогда
			ФормаЗаписи = ПолучитьФорму("РегистрСведений.уатСвязанныеРаботыПоРемонту.Форма.ФормаЗаписи");
			ФормаЗаписи.Запись.Работа = Объект.Ссылка;
			ФормаЗаписи.Открыть();
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
