
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДобавлениИзФормыЗаказа = Ложь;
	Если Параметры.Свойство("Заказ") Тогда
		ДобавлениИзФормыЗаказа = Истина;
		Запись.ЗаказНаТС = Параметры.Заказ;
	КонецЕсли;
	
	Если Параметры.Свойство("ТипВагона") Тогда
		ТипВагона = Параметры.ТипВагона;
	КонецЕсли;
	
	Если Параметры.Свойство("ГрузовоеМесто") Тогда
		Если ТипЗнч(Параметры.ГрузовоеМесто) = Тип("СправочникСсылка.уатГрузовыеМеста_уэ") Тогда
			Запись.Груз = Параметры.ГрузовоеМесто;
		КонецЕсли;
		Груз = Параметры.ГрузовоеМесто;
	КонецЕсли;
	
	УстановитьВидимость();
	
	Если ДобавлениИзФормыЗаказа И ТипВагона <> Справочники.уатТипыТС.ПустаяСсылка() Тогда
		Элементы.ДекорацияТипВагона.Заголовок = НСтр("ru='В строке табличной части документа установлен отбор по типу вагона: %1.'");
		Элементы.ДекорацияТипВагона.Заголовок = СтрЗаменить(Элементы.ДекорацияТипВагона.Заголовок, "%1", ТипВагона.Наименование);
	КонецЕсли;
	
	Если ДобавлениИзФормыЗаказа И (Груз <> Справочники.уатГрузовыеМеста_уэ.ПустаяСсылка() Или Груз <> Справочники.уатКодыЕТСНГ.ПустаяСсылка()
		Или Груз <> Справочники.уатКодыГНГ.ПустаяСсылка() Или Груз <> Неопределено) Тогда
		Элементы.ДекорацияГруз.Заголовок = НСтр("ru='В строке табличной части документа установлен отбор по %1.'");
		Если ТипЗнч(Груз) = Тип("СправочникСсылка.уатГрузовыеМеста_уэ") Тогда 
			СтрокаДляПодстановки = НСтр("ru = 'грузовому месту: %1'; en = 'cargo space: %1'");
		ИначеЕсли ТипЗнч(Груз) = Тип("СправочникСсылка.уатКодыЕТСНГ") Тогда
			СтрокаДляПодстановки = НСтр("ru = 'коду ЕТСНГ: %1'; en = 'ETSNG code: %1'");
		ИначеЕсли ТипЗнч(Груз) = Тип("СправочникСсылка.уатКодыГНГ") Тогда
			СтрокаДляПодстановки = НСтр("ru = 'коду ГНГ: %1'; en = 'GNG code: %1'");
		КонецЕсли;
		
		СтрокаДляПодстановки = СтрЗаменить(СтрокаДляПодстановки, "%1", Строка(Груз));
		Элементы.ДекорацияГруз.Заголовок = СтрЗаменить(Элементы.ДекорацияГруз.Заголовок, "%1", СтрокаДляПодстановки);
	КонецЕсли;
	
	ПредставлениеЕдиницыИзмеренияВеса = уатОбщегоНазначенияПовтИсп.ПолучитьПредставлениеОсновнойЕдиницыИзмеренияВеса();
	Если ЗначениеЗаполнено(ПредставлениеЕдиницыИзмеренияВеса) Тогда
		Элементы.Вес.Заголовок = НСтр("en='Weight, ';ru='Вес, '") + ПредставлениеЕдиницыИзмеренияВеса;
	КонецЕсли;
	
	ПредставлениеЕдиницыИзмеренияОбъема = уатОбщегоНазначенияПовтИсп.ПолучитьПредставлениеОсновнойЕдиницыИзмеренияОбъема();
	Если ЗначениеЗаполнено(ПредставлениеЕдиницыИзмеренияОбъема) Тогда
		Элементы.Объем.Заголовок = НСтр("en='Volume, ';ru='Объем, '") + ПредставлениеЕдиницыИзмеренияОбъема;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Запись.КодГруза) Тогда
		Запись.КодГруза = Запись.Груз.КодЕТСНГ;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ГрузПриИзменении(Элемент)
	
	Запись.КодГруза = ПолучитьКодЕТСНГ(Запись.Груз);
	
	Если ДобавлениИзФормыЗаказа И (Груз <> ПредопределенноеЗначение("Справочник.уатГрузовыеМеста_уэ.ПустаяСсылка")
		Или Груз <> ПредопределенноеЗначение("Справочник.уатКодыЕТСНГ.ПустаяСсылка")
		Или Груз <> ПредопределенноеЗначение("Справочник.уатКодыГНГ.ПустаяСсылка")
		Или Груз <> Неопределено) Тогда
		
		Элементы.ДекорацияГруз.Заголовок = НСтр("ru='В строке табличной части документа установлен отбор по %1. '");
		
		Если ТипЗнч(Груз) = Тип("СправочникСсылка.уатГрузовыеМеста_уэ") Тогда 
			ГрузПриИзменении = Запись.Груз;
			СтрокаДляПодстановки = НСтр("ru = 'грузовому месту: %1'; en = 'cargo space: %1'");
		ИначеЕсли ТипЗнч(Груз) = Тип("СправочникСсылка.уатКодыЕТСНГ") Тогда
			ГрузПриИзменении = ПолучитьКодЕТСНГ(Запись.Груз);
			СтрокаДляПодстановки = НСтр("ru = 'коду ЕТСНГ: %1'; en = 'ETSNG code: %1'")
		ИначеЕсли ТипЗнч(Груз) = Тип("СправочникСсылка.уатКодыГНГ") Тогда
			ГрузПриИзменении = ПолучитьКодГНГ(Запись.Груз);
			СтрокаДляПодстановки = НСтр("ru = 'коду ГНГ: %1'; en = 'GNG code: %1'");
		КонецЕсли;
		
		СтрокаДляПодстановки = СтрЗаменить(СтрокаДляПодстановки, "%1", Строка(Груз));
		
		Элементы.ДекорацияГруз.Заголовок = СтрЗаменить(Элементы.ДекорацияГруз.Заголовок, "%1", СтрокаДляПодстановки);
		
		Если ГрузПриИзменении <> Груз Тогда
			
			Если ТипЗнч(Груз) = Тип("СправочникСсылка.уатГрузовыеМеста_уэ") Тогда 
				Элементы.ДекорацияГруз.Заголовок = Элементы.ДекорацияГруз.Заголовок 
					+ НСтр("ru = 'Выбрано грузовоме место: %1'; en = 'Selected cargo space: %1'");
			ИначеЕсли ТипЗнч(Груз) = Тип("СправочникСсылка.уатКодыЕТСНГ") Тогда
				Элементы.ДекорацияГруз.Заголовок = Элементы.ДекорацияГруз.Заголовок 
					+ НСтр("ru = 'Выбран код ЕТСНГ: %1'; en = 'The ETSNG code selected was: %1'");
			ИначеЕсли ТипЗнч(Груз) = Тип("СправочникСсылка.уатКодыГНГ") Тогда
				Элементы.ДекорацияГруз.Заголовок = Элементы.ДекорацияГруз.Заголовок 
					+ НСтр("ru = 'Выбран код ГНГ: %1'; en = 'The selected GNG code is: %1'");
			КонецЕсли;
			
			Элементы.ДекорацияГруз.Заголовок = СтрЗаменить(Элементы.ДекорацияГруз.Заголовок, "%1", Строка(ГрузПриИзменении));
			Элементы.ДекорацияГруз.Заголовок = Элементы.ДекорацияГруз.Заголовок + НСтр("ru = '"
"После записи, ТЧ ""Обеспечение вагонами"" не изменится!'; en = '"
"After registration, the ""Wagon Supply"" TC will not change!'");
			
		ИначеЕсли ГрузПриИзменении = Груз Тогда
			
			Элементы.ДекорацияГруз.Заголовок = Элементы.ДекорацияГруз.Заголовок 
			+ НСтр("ru = '"
"Выбранное значение удовлетворяет отбору документа.'; en = '"
"The selected value satisfies the document selection.'");
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВагонПриИзменении(Элемент)
	
	Если ДобавлениИзФормыЗаказа И ТипВагона <> ПредопределенноеЗначение("Справочник.уатТипыТС.ПустаяСсылка") Тогда
		
		ТипВагонаПриИзменении = ПолучитьТипВагона(Запись.Вагон);
		
		Элементы.ДекорацияТипВагона.Заголовок = НСтр("ru='В строке табличной части документа установлен отбор по типу вагона: %1. '");
		Элементы.ДекорацияТипВагона.Заголовок = СтрЗаменить(Элементы.ДекорацияТипВагона.Заголовок, "%1", Строка(ТипВагона));
		
		Если ТипВагонаПриИзменении <> ТипВагона Тогда
			
			Элементы.ДекорацияТипВагона.Заголовок = Элементы.ДекорацияТипВагона.Заголовок 
			+ НСтр("ru = 'Выбран вагон с типом %1."
"После записи, ТЧ ""Обеспечение вагонами"" не изменится!'; en = 'A wagon of type %1 has been selected."
"After recording, the ""Wagon Provision"" TC will not change!'");
			
			Элементы.ДекорацияТипВагона.Заголовок = СтрЗаменить(Элементы.ДекорацияТипВагона.Заголовок, "%1", Строка(ТипВагонаПриИзменении));
			
		ИначеЕсли ТипВагонаПриИзменении = ТипВагона Тогда
			
			Элементы.ДекорацияТипВагона.Заголовок = Элементы.ДекорацияТипВагона.Заголовок 
			+ НСтр("ru = '"
"Выбранное значение удовлетворяет отбору документа.'; en = '"
"The selected value satisfies the document selection.'");
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимость()
	
	Если ТипВагона <> Справочники.уатТипыТС.ПустаяСсылка() Тогда
		Элементы.ГруппаВагонПодсказка.Видимость = Истина;
	Иначе
		Элементы.ГруппаВагонПодсказка.Видимость = Ложь;
	КонецЕсли;
	
	Если Груз = Справочники.уатГрузовыеМеста_уэ.ПустаяСсылка() Или Груз = Справочники.уатКодыЕТСНГ.ПустаяСсылка()
		Или Груз = Справочники.уатКодыГНГ.ПустаяСсылка() Или Груз = Неопределено Тогда
		Элементы.ГруппаГрузПодсказка.Видимость = Ложь;
	Иначе
		Элементы.ГруппаГрузПодсказка.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТипВагона(Вагон)
	
	Возврат Вагон.ТипТС;
	
КонецФункции

&НаСервере
Функция ПолучитьКодЕТСНГ(Груз)
	
	Возврат Груз.КодЕТСНГ;
	
КонецФункции

&НаСервере
Функция ПолучитьКодГНГ(Груз)
	
	Возврат Груз.КодГНГ;
	
КонецФункции

#КонецОбласти