#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	уатЗащищенныеФункцииСервер.уатОтчетОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Настройки размещения в панели отчетов.
//
// Параметры:
//   Настройки – Коллекция – Используется для описания настроек отчетов и вариантов
//       см. описание к ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//   НастройкиОтчета – СтрокаДереваЗначений – Настройки размещения всех вариантов отчета.
//       См. "Реквизиты для изменения" функции ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//
// Описание:
//   См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//
// Вспомогательные методы:
//   НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "<ИмяВарианта>");
//   ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, НастройкиОтчета, Истина/Ложь); // Отчет
//   поддерживает только этот режим.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "");
	
	НастройкиВарианта.Описание = 
		НСтр("ru = 'Отчет отображает записи Журнала учета показаний одометра.'; en = 'The report displays the records of the Odometer Readings Log.'");
	
	НастройкиВарианта.НастройкиДляПоиска.НаименованияПолей =
		НСтр("en='Log';ru='Журнал'");
	
	НастройкиВарианта.НастройкиДляПоиска.НаименованияПараметровИОтборов =
		НСтр("en='Period';ru='Период'");
	
	НастройкиВарианта.НастройкиДляПоиска.КлючевыеСлова = ""
		+ НСтр("en='journal';ru='журнал'") + Символы.ПС
		+ НСтр("ru = 'учета'; en = 'accounting'") + Символы.ПС
		+ НСтр("ru = 'показаний'; en = 'testimony'") + Символы.ПС
		+ НСтр("ru = 'одометра'; en = 'odometer'") + Символы.ПС;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли