
#Область СлужебныйПрограммныйИнтерфейс

Функция СтруктураНастроекПоУмолчанию() Экспорт
	
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("ПунктДатаОтправления",     Ложь);
	СтруктураНастроек.Вставить("ПунктДатаПрибытия",        Ложь);
	СтруктураНастроек.Вставить("ПунктНаименование",        Истина);
	СтруктураНастроек.Вставить("ПунктКраткоеНаименование", Ложь);
	СтруктураНастроек.Вставить("ПунктАдрес",               Ложь);
	СтруктураНастроек.Вставить("ПунктНомерПункта",         Ложь);
	СтруктураНастроек.Вставить("ЭтапВес",                  Истина);
	СтруктураНастроек.Вставить("ЭтапВремяВПути",           Ложь);
	СтруктураНастроек.Вставить("ЭтапДлительность",         Ложь);
	СтруктураНастроек.Вставить("ЭтапНомерЭтапа",           Ложь);
	СтруктураНастроек.Вставить("ЭтапОбъем",                Истина);
	СтруктураНастроек.Вставить("ЭтапУпаковки",             Ложь);
	
	Возврат СтруктураНастроек;
	
КонецФункции

#КонецОбласти
