#Область ПрограммныйИнтерфейс

// Определить объекты метаданных, в модулях менеджеров которых ограничивается возможность
// редактирования реквизитов с помощью экспортной функции ПолучитьБлокируемыеРеквизитыОбъекта.
//
// Функция ПолучитьБлокируемыеРеквизитыОбъекта должна возвращать значение Массив - строки в формате
// ИмяРеквизита[;ИмяЭлементаФормы,...], где ИмяРеквизита - имя реквизита объекта, ИмяЭлементаФормы -
// имя элемента формы, связанного с реквизитом. Например, "Объект.Автор", "ПолеАвтор".
//
// Поле надписи, связанное с реквизитом, не блокируется. Если требуется блокировать,
// имя элемента надписи нужно указать после точки с запятой, как написано выше.
//
// Параметры:
//   Объекты - Соответствие - в качестве ключа указать полное имя объекта метаданных,
//             подключенного к подсистеме "Запрет редактирования реквизитов объектов",
//             в качестве значения - пустую строку.
//
// Пример:
//   Объекты.Вставить(Метаданные.Документы.ЗаказПокупателя.ПолноеИмя(), "");
//
//   При этом в модуле менеджера документа ЗаказПокупателя размещается код:
//   // См. ЗапретРедактированияРеквизитовОбъектовПереопределяемый.ПриОпределенииОбъектовСЗаблокированнымиРеквизитами.
//   Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
//   	БлокируемыеРеквизиты = Новый Массив;
//   	БлокируемыеРеквизиты.Добавить("Организация"); // заблокировать редактирование реквизита Организация
//   	Возврат БлокируемыеРеквизиты;
//   КонецФункции
//
Процедура ПриОпределенииОбъектовСЗаблокированнымиРеквизитами(Объекты) Экспорт
	
	Объекты.Вставить(Метаданные.Справочники.БанковскиеСчета.ПолноеИмя(),      "");
	Объекты.Вставить(Метаданные.Справочники.ДоговорыКонтрагентов.ПолноеИмя(), "");
	Объекты.Вставить(Метаданные.Справочники.ЕдиницыИзмерения.ПолноеИмя(),     "");
	Объекты.Вставить(Метаданные.Справочники.Кассы.ПолноеИмя(),                "");
	Объекты.Вставить(Метаданные.Справочники.Номенклатура.ПолноеИмя(),         ""); 
		
	Объекты.Вставить(Метаданные.Справочники.уатГеозоны_уэ.ПолноеИмя(),      	          "");
	Объекты.Вставить(Метаданные.Справочники.уатГрузовыеМеста_уэ.ПолноеИмя(),	          "");
	Объекты.Вставить(Метаданные.Справочники.уатМоделиАгрегатов.ПолноеИмя(),               "");
	Объекты.Вставить(Метаданные.Справочники.уатМоделиСпецодеждыИИнструментов.ПолноеИмя(), "");
	Объекты.Вставить(Метаданные.Справочники.уатМоделиТС.ПолноеИмя(),                      "");
	Объекты.Вставить(Метаданные.Справочники.уатПараметрыВыработки.ПолноеИмя(),            "");
	Объекты.Вставить(Метаданные.Справочники.уатПластиковыеКарты.ПолноеИмя(),              "");
	Объекты.Вставить(Метаданные.Справочники.уатСценарииПланирования.ПолноеИмя(),          "");
	Объекты.Вставить(Метаданные.Справочники.уатТС.ПолноеИмя(),                            "");
	
	Объекты.Вставить(Метаданные.Документы.уатПутевойЛист.ПолноеИмя(),    "");
	Объекты.Вставить(Метаданные.Документы.уатМаршрутныйЛист.ПолноеИмя(), "");
		
	Если уатОбщегоНазначенияПовтИсп.ВариантПоставкиТакси() Тогда 
		Объекты.Вставить(Метаданные.Документы.такАрендаТС.ПолноеИмя(), "");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти