
#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустой() Тогда
		Если ЗначениеЗаполнено(Запись.Карта)
			И НЕ ЗначениеЗаполнено(Запись.КомуВыдана) Тогда
			Запись.КомуВыдана = уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Запись.Карта, "КомуВыдана");
		КонецЕсли;
	КонецЕсли;  
	флДоступностьПримененияЛимитов = РольДоступна("ПолныеПрава") ИЛИ РольДоступна("уатПрименениеЛимитовТопливныхКарт");

	УстановитьВидимость();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипЛимитаПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура КартаПриИзменении(Элемент)
	Запись.КомуВыдана = уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Запись.Карта, "КомуВыдана"); 
	УстановитьВидимость();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПрименитьЛимит(Команда)
	ПрименитьЛимитСервер();
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

&НаСервере
Процедура УстановитьВидимость()
	Если НЕ ЗначениеЗаполнено(Запись.ТипЛимита) Тогда
		Запись.ТипЛимита = Перечисления.уатТипыЛимитовТопливныхКарт.ПоКоличеству;
	КонецЕсли;
	Элементы.ГруппаЕдиницаИзмерения.ТекущаяСтраница = 
		?(Запись.ТипЛимита = Перечисления.уатТипыЛимитовТопливныхКарт.ПоСумме,
		Элементы.ГруппаВалюта, Элементы.ГруппаЛитры);   
	Если Запись.ТипЛимита = Перечисления.уатТипыЛимитовТопливныхКарт.ПоСумме Тогда
		Если НЕ ЗначениеЗаполнено(Запись.Валюта) Тогда
			Запись.Валюта = Константы.ВалютаУправленческогоУчета.Получить(); 
		КонецЕсли; 
	Иначе  
		Запись.Валюта = Неопределено;
	КонецЕсли;
	АЗС              = Запись.Карта.КемВыдана;
	Если ТипЗнч(АЗС) = Тип("СправочникСсылка.уатАЗС") Тогда
		УчетнаяЗаписьПЦ = АЗС.УчетнаяЗаписьПЦ;
		Элементы.ФормаПрименитьЛимит.Видимость   = УчетнаяЗаписьПЦ.ВнешняяСистема = Справочники.уатВнешниеСистемы.Газпромнефть;
		Элементы.ФормаПрименитьЛимит.Доступность = флДоступностьПримененияЛимитов;
	Иначе
		Элементы.ФормаПрименитьЛимит.Видимость = Ложь;  
	Конецесли;
	
КонецПроцедуры

&НаСервере
Процедура ПрименитьЛимитСервер()
	АЗС = Запись.Карта.КемВыдана;
	Если ТипЗнч(АЗС) <> Тип("СправочникСсылка.уатАЗС") 
		И ЗначениеЗаполнено(Запись.Карта.IDкарты) Тогда
		Возврат;
	КонецЕсли;
	
	Комментарий = СтрШаблон(Нстр("ru = 'Применение лимита топливной карты. Лимит: %1'; en = 'Applying fuel card limit. Limit: %1'"), Запись.Лимит);
	ЗаписьЖурналаРегистрации(НСтр("en = 'Application of limits on fuel cards'; ru = 'Применение лимитов топливных карт'"),
		УровеньЖурналаРегистрации.Информация,
		Метаданные.Справочники.уатПластиковыеКарты,
		Запись.Карта,
		Комментарий);
		
	УчетнаяЗаписьПЦ = АЗС.УчетнаяЗаписьПЦ;
	
	ТекстОшибки = "";
	СтруктураПараметровУчетнойЗаписи = уатЗагрузкаПЦ.ПолучитьСтруктуруПараметровДляРаботыСПЦ(УчетнаяЗаписьПЦ);
	Выполнено   = уатЗагрузкаПЦ.Газпромнефть_ПрименитьЛимит(СтруктураПараметровУчетнойЗаписи, Запись.Карта.IDкарты, Запись.Лимит, ТекстОшибки);
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		
		Комментарий = Нстр("ru = 'При установке лимита возникли ошибки: '; en = 'Errors occurred while setting the limit:'") + ТекстОшибки;
		
		ЗаписьЖурналаРегистрации(НСтр("en = 'Application of limits on fuel cards'; ru = 'Применение лимитов топливных карт'"),
		УровеньЖурналаРегистрации.Информация,
		Метаданные.Справочники.уатПластиковыеКарты,
		Запись.Карта,
		Комментарий);
		Возврат;
	КонецЕсли;
	
	Если Выполнено Тогда 
		Комментарий = Нстр("ru = 'Лимит успешно установлен.'; en = 'The limit has been set successfully.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Комментарий);
		
		ЗаписьЖурналаРегистрации(НСтр("en = 'Application of limits on fuel cards'; ru = 'Применение лимитов топливных карт'"),
		УровеньЖурналаРегистрации.Информация,
		Метаданные.Справочники.уатПластиковыеКарты,
		Запись.Карта,
		Комментарий);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти