
&НаКлиенте
Процедура ТипЗагружаемогоЭлементаПриИзменении(Элемент) 
	ВидимостьДоступность();
КонецПроцедуры

&НаСервере
Функция ВернутьНаименованиеТипа()
	Если ЗначениеЗаполнено(Запись.ТипЗагружаемогоЭлемента) ТОгда
		ИмяТипа = Метаданные.Перечисления["GDS_ТипЗагружаемогоЭлемента"].ЗначенияПеречисления[Перечисления["GDS_ТипЗагружаемогоЭлемента"].Индекс(Запись.ТипЗагружаемогоЭлемента)].Имя;
	
		НаименованиеТипа = "СправочникСсылка."+ИмяТипа;
	Иначе 
		НаименованиеТипа = Неопределено;
	КонецЕсли;
	Возврат  НаименованиеТипа;
КонецФункции


&НаКлиенте
Процедура ВидимостьДоступность()
	Если ЗначениеЗаполнено(Запись.ТипЗагружаемогоЭлемента) ТОгда
		Элементы.Значение.Видимость = Истина;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	НаименованиеТипа = ВернутьНаименованиеТипа();
	Если НаименованиеТипа <> Неопределено ТОгда
		Элемент.ОграничениеТипа = Новый ОписаниеТипов(НаименованиеТипа);
		Элемент.ВыбиратьТип = Ложь;
	Иначе 
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВидимостьДоступность();
КонецПроцедуры
