////////////////////////////////////////////////////////////////////////////////
// Работа с БСП (вызов сервера повторного использования)
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс
	
// Функция возвращает установленную версию Библиотеки стандартных подсистем.
// 
// Возвращаемое значение:
//  Число
//
Функция ВерсияБСП() Экспорт
	
	ВерсияБСП = "0";
	Метаданные.Подсистемы.Найти("БазоваяФункциональность");
	// Подсистема СтандартныеПодсистемы.БазоваяФункциональность 
	СтандартныеПодсистемы = Метаданные.Подсистемы.Найти("СтандартныеПодсистемы");
	Если СтандартныеПодсистемы <> Неопределено И СтандартныеПодсистемы.Подсистемы.Найти("БазоваяФункциональность") <> Неопределено Тогда
		ОбщийМодуль = ОбщегоНазначения.ОбщийМодуль("СтандартныеПодсистемыСервер");
		ВерсияБСП = ОбщийМодуль.ВерсияБиблиотеки();
	КонецЕсли; 
	
	ВерсияБСП = СтрЗаменить(ВерсияБСП,".","");
	ВерсияБСП = ?(СтрДлина(ВерсияБСП) = 4,ВерсияБСП + "0",ВерсияБСП);
	ВерсияБСП = Число(ВерсияБСП);
	
	Возврат ВерсияБСП;
КонецФункции

#КонецОбласти

