
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭтоГруппа Тогда
		Если ЗначениеЗаполнено(ВидУпаковки) И КоличествоМест = 0 Тогда
			ТекстНСТР = НСтр("en='Package quantity should be specified.';ru='Необходимо заполнить количество упаковок.'");
			уатОбщегоНазначенияСервер.СообщитьОбОшибке(ЭтотОбъект, ТекстНСТР ,,, "КоличествоМест", Отказ);
		КонецЕсли;
		
		Если Не Отказ И ЭтоНовый() И Контейнер Тогда
			ИмяКлючевойОперации = "уатОперации.Контейнеры.Создание";
			ЦентрМониторинга.ЗаписатьОперациюБизнесСтатистики(ИмяКлючевойОперации, 1);
		КонецЕсли;
		
		Если НЕ ПолучитьФункциональнуюОпцию("уатИспользоватьРасчетТары_уэ") Тогда
			ВесТары = 0;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
