                                                      
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если НЕ уатОбщегоНазначенияПовтИсп.ВариантПоставкиТакси() Тогда
		СтандартнаяОбработка = Ложь;
		
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.Добавить(Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом);
		ДанныеВыбора.Добавить(Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам);
		ДанныеВыбора.Добавить(Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоНакладным);
		ДанныеВыбора.Добавить(Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказамНаТС);
	КонецЕсли;
	
КонецПроцедуры
