
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция - Получить текущий чат водителя
//
// Параметры:
//  Водитель - 	СправочникСсылка.Сотрудники - Текущий водитель
// 
// Возвращаемое значение:
//   - СправочникСсылка.Чаты - Текущий чат с водителем
//
Функция ПолучитьТекущийЧатВодителя(Водитель = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Водитель) Тогда
		Чат = Справочники.уатЧаты.ОбщийЧат;
		Возврат Чат;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Водитель", Водитель);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	               |	уатЧатыВодители.Ссылка КАК Чат
	               |ИЗ
	               |	Справочник.уатЧаты.Водители КАК уатЧатыВодители
	               |ГДЕ
	               |	НЕ уатЧатыВодители.Ссылка.ПометкаУдаления
	               |	И уатЧатыВодители.Водитель = &Водитель";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Чат = Выборка.Чат;
	Иначе
		Чат = Справочники.уатЧаты.ОбщийЧат;
	КонецЕсли;
	
	Возврат Чат;
	
КонецФункции

#КонецОбласти

#КонецЕсли