
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ЗащитаПерсональныхДанных
	ЗащитаПерсональныхДанных.ПриСозданииНаСервереФормыСписка(ЭтотОбъект, Элементы.Список);
	// Конец СтандартныеПодсистемы.ЗащитаПерсональныхДанных
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
    ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	Если Не ПравоДоступа("Редактирование", Метаданные.Справочники.ФизическиеЛица) Тогда 
		Элементы.ФормаИзменитьВыделенные.Видимость = Ложь;
		Элементы.СписокКонтекстноеМенюИзменитьВыделенные.Видимость = Ложь;
	КонецЕсли;
	
	Если ПравоДоступа("Редактирование", Метаданные.Документы.СогласиеНаОбработкуПерсональныхДанных) Тогда
		Если Элементы.Найти("ПодменюПечатьОбычное_СогласиеНаОбработкуПерсональныхДанных") <> Неопределено Тогда
			Элементы.ПодменюПечатьОбычное_СогласиеНаОбработкуПерсональныхДанных.Заголовок = НСтр("ru='Согласие на обработку ПДн';en='Consent to personal data processing'");
			Элементы.Переместить(Элементы.ПодменюПечатьОбычное_СогласиеНаОбработкуПерсональныхДанных, Элементы.ПерсональныеДанные, Элементы.ФормаОткрытьСогласия);
		КонецЕсли;	
	Иначе
		Элементы.ПерсональныеДанные.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.ЗащитаПерсональныхДанных
	ЗащитаПерсональныхДанныхКлиент.ОбработкаОповещенияФормыСписка(Элементы.Список, ИмяСобытия);
	// Конец СтандартныеПодсистемы.ЗащитаПерсональныхДанных
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Список

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	// СтандартныеПодсистемы.ЗащитаПерсональныхДанных
	ЗащитаПерсональныхДанных.ПриПолученииДанныхНаСервере(Настройки, Строки); 
	// Конец СтандартныеПодсистемы.ЗащитаПерсональныхДанных
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.ЗащитаПерсональныхДанных
&НаКлиенте
Процедура Подключаемый_ПоказыватьСоСкрытымиПДн(Команда)
	ЗащитаПерсональныхДанныхКлиент.ПоказыватьСоСкрытымиПДн(ЭтотОбъект, Список);
КонецПроцедуры
// СтандартныеПодсистемы.ЗащитаПерсональныхДанных

&НаКлиенте
Процедура ИзменитьВыделенные(Команда)
	
	ГрупповоеИзменениеОбъектовКлиент.ИзменитьВыделенные(Элементы.Список, Список);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСогласия(Команда)
	
	Если Не ЭтоГруппа(Элементы.Список.ТекущиеДанные.Ссылка) Тогда
		Отбор = Новый Структура("Субъект", Элементы.Список.ТекущиеДанные.Ссылка);
		ПараметрыОткрытия = Новый Структура("Отбор", Отбор);
		ОткрытьФорму("Документ.СогласиеНаОбработкуПерсональныхДанных.ФормаСписка", ПараметрыОткрытия);
	Иначе
		ОткрытьФорму("Документ.СогласиеНаОбработкуПерсональныхДанных.ФормаСписка");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтзывСогласия(Команда)
	
	Если Не ЭтоГруппа(Элементы.Список.ТекущиеДанные.Ссылка) Тогда
		Отбор = Новый Структура("Субъект", Элементы.Список.ТекущиеДанные.Ссылка);
		ПараметрыОткрытия = Новый Структура("Отбор", Отбор);
		ОткрытьФорму("Документ.ОтзывСогласияНаОбработкуПерсональныхДанных.ФормаСписка", ПараметрыОткрытия);
	Иначе
		ОткрытьФорму("Документ.ОтзывСогласияНаОбработкуПерсональныхДанных.ФормаСписка");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаСервере
Функция ЭтоГруппа(Ссылка)
	Возврат Ссылка.ЭтоГруппа;
КонецФункции
#КонецОбласти
