
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресСервиса      = "";
	Wialon_ВидСистемы = 0;
	
	Если Параметры.Свойство("АдресСервиса") Тогда 
		АдресСервера = Параметры.АдресСервиса;
	КонецЕсли;
	
	Если Параметры.Свойство("Версия") Тогда 
		Версия = Параметры.Версия;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьТокен(Команда)
	
	Токен       = "";
	ТекстОшибки = "";
	Токен = уатИнтеграцияШтрафовНет.ШтрафовНет_СозданиеТокена(АдресСервера, Версия, Логин, Пароль, ТекстОшибки);
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда 
		ТекстПредупреждения = Новый ФорматированнаяСтрока(
					ТекстОшибки,
					Символы.ПС,
					НСтр("ru = 'Перейти в'; en = 'Перейти в'"),
					" """,
					Новый ФорматированнаяСтрока(НСтр("ru='Журнал регистрации';en='Event log'"),,,, "e1cib/app/Обработка.ЖурналРегистрации"),
					"""."
				);
		ПоказатьПредупреждение(, ТекстПредупреждения);
		Возврат;
	КонецЕсли;
	
	Закрыть(Токен);
	
КонецПроцедуры

#КонецОбласти
