#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	уатЗащищенныеФункцииСервер.уатСправочникФормаЭлементаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, Объект, ЭтотОбъект, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда
		Заголовок = ?(Объект.Контейнер,
		НСтр("ru = 'Контейнер (создание группы)'; en = 'Container (creating a group)'"), НСтр("ru = 'Грузовое место (создание группы)'; en = 'Cargo space (creation of a group)'"));
	Иначе
		Заголовок = Объект.Наименование + " " + ?(Объект.Контейнер,
		НСтр("ru = '(Контейнер)'; en = '(Container)'"), НСтр("ru = '(Грузовое место)'; en = '(Cargo space)'"));
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	уатЗащищенныеФункцииКлиент.уатСправочникФормаЭлементаПриОткрытии(Отказ, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
