
#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАПОЛНЕНИЯ ДОКУМЕНТОВ

// Функция получает структуру параметров для получения договора покупки
//
// Возвращаемое значение:
//   Структура   – Структура со значением вида договора "С поставщиком"
//
Функция ПолучитьСтруктуруПараметровДляПолученияДоговораПокупки()  Экспорт

	СтруктураПараметровДляПолученияДоговора = Новый Структура();

	СписокДопустимыхВидовДоговоров = Новый СписокЗначений();
	СписокДопустимыхВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
	
	СтруктураПараметровДляПолученияДоговора.Вставить("СписокДопустимыхВидовДоговоров", СписокДопустимыхВидовДоговоров);
	
	Возврат СтруктураПараметровДляПолученияДоговора;

КонецФункции // ПолучитьСтруктуруПараметровДляПолученияДоговораПокупки()

// Формирует структуру параметров для получения договора продажи со значениями по умолчанию.
//
// Возвращаемое значение:
//   Структура – структура параметров для получения договора продажи.
//
Функция ПолучитьСтруктуруПараметровДляПолученияДоговораПродажи()  Экспорт

	СтруктураПараметровДляПолученияДоговора = Новый Структура();

	СписокДопустимыхВидовДоговоров = Новый СписокЗначений();
	СписокДопустимыхВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
	
	СтруктураПараметровДляПолученияДоговора.Вставить("СписокДопустимыхВидовДоговоров", СписокДопустимыхВидовДоговоров);
	Возврат СтруктураПараметровДляПолученияДоговора;

КонецФункции // ПолучитьСтруктуруПараметровДляПолученияДоговораПродажи()

// Функция возвращает основной договор контрагента
//
// Параметры
//  Контрагент  – Ссылка на справочник контрагентов
//	ВидДоговора - значение перечисления или массив/список значений
//
// Возвращаемое значение:
//   Ссылка на справочник договоры контрагентов
//
Функция ПолучитьОсновнойДоговорКонтрагента(Контрагент, Знач ВидДоговора = Неопределено,
	Знач Организация = Неопределено, Знач Валюта = Неопределено, Знач ПредметДоговора = Неопределено) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 2
	|	ДоговорыКонтрагентов.Ссылка КАК ДоступныйДоговорКонтрагента
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеДоговорыКонтрагента КАК ОсновныеДоговорыКонтрагента
	|		ПО ДоговорыКонтрагентов.Ссылка = ОсновныеДоговорыКонтрагента.Договор
	|			И ДоговорыКонтрагентов.Владелец = ОсновныеДоговорыКонтрагента.Контрагент
	|			И ДоговорыКонтрагентов.ВидДоговора = ОсновныеДоговорыКонтрагента.ВидДоговора
	|			И ДоговорыКонтрагентов.Организация = ОсновныеДоговорыКонтрагента.Организация
	|ГДЕ
	|	ДоговорыКонтрагентов.Владелец = &Контрагент
	|	И НЕ ДоговорыКонтрагентов.ПометкаУдаления
	|	И (&Организация = НЕОПРЕДЕЛЕНО
	|			ИЛИ ДоговорыКонтрагентов.Организация = &Организация)
	|	И ДоговорыКонтрагентов.ВидДоговора В(&ВидДоговора)
	|	И (&Валюта = НЕОПРЕДЕЛЕНО
	|			ИЛИ ДоговорыКонтрагентов.ВалютаВзаиморасчетов = &Валюта)
	|	И ДоговорыКонтрагентов.ПредметДоговора В(&ПредметДоговора)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВЫБОР
	|		КОГДА ОсновныеДоговорыКонтрагента.Договор ЕСТЬ NULL
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ");
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Организация", ?(ЗначениеЗаполнено(Организация), Организация, Неопределено));
	Запрос.УстановитьПараметр("Валюта", ?(ЗначениеЗаполнено(Валюта), Валюта, Неопределено));
	
	мсвВидДоговора = Новый Массив;
	Если ВидДоговора = Неопределено Тогда
		Для Каждого ТекВидДоговора Из Метаданные.Перечисления.ВидыДоговоровКонтрагентов.ЗначенияПеречисления Цикл
			мсвВидДоговора.Добавить(Перечисления.ВидыДоговоровКонтрагентов[ТекВидДоговора.Имя]);
		КонецЦикла;
	Иначе
		Если ТипЗнч(ВидДоговора) = Тип("Массив") ИЛИ ТипЗнч(ВидДоговора) = Тип("СписокЗначений") Тогда
			мсвВидДоговора = ВидДоговора;
		Иначе
			Если ТипЗнч(ВидДоговора) = Тип("Строка") Тогда
				мсвВидДоговора.Добавить(Перечисления.ВидыДоговоровКонтрагентов[ВидДоговора]);
			Иначе
				мсвВидДоговора.Добавить(ВидДоговора);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Запрос.УстановитьПараметр("ВидДоговора", мсвВидДоговора);
	
	Если ТипЗнч(ПредметДоговора) = Тип("Массив") Тогда
		Запрос.УстановитьПараметр("ПредметДоговора", ПредметДоговора);
	ИначеЕсли НЕ ЗначениеЗаполнено(ПредметДоговора) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ДоговорыКонтрагентов.ПредметДоговора В(&ПредметДоговора)", "");
	Иначе
		мсвПредметДоговора = Новый Массив;
		Если ТипЗнч(ПредметДоговора) = Тип("Строка") Тогда
			мсвСтрокПредметДоговора = СтрРазделить(ПредметДоговора, ",");
			Для Каждого ТекПредметДоговора Из мсвСтрокПредметДоговора Цикл
				мсвПредметДоговора.Добавить(Перечисления.уатПредметыДоговоровКонтрагентов[СокрЛП(ТекПредметДоговора)]);
			КонецЦикла;
		Иначе
			мсвПредметДоговора.Добавить(ПредметДоговора);
		КонецЕсли;
		Запрос.УстановитьПараметр("ПредметДоговора", мсвПредметДоговора);
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ДоступныйДоговорКонтрагента;
	Иначе
		Возврат Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции // ПолучитьОсновнойДоговорКонтрагента()

// Функция возвращает вид договор контрагента по входящему документу
//
// Параметры:
//  МетаданныеДокумента - Метаданные - Метаданные документа или другого объекта
// 
// Возвращаемое значение:
//  Строка, ПеречислениеСсылка.уатПредметыДоговоров, Массив - значение или массив значений вида договора
//
Функция ПолучитьВидДоговораКонтрагента(МетаданныеДокумента) Экспорт
	
	ДокументыПоставщик = "уатВозвратТоваров, уатДоверенность, уатЗаказПеревозчику_уэ, уатЗаказПоставщику,
		|уатЗаправкаГСМ, уатЗаявкаНаРемонт,
		|уатМаршрутныйЛист, уатОтчетСистемыПлатон, уатПоступлениеАгрегатов, уатПоступлениеТоваровУслуг, уатРемонтныйЛист,
		|уатСчетНаОплатуПоставщика, уатРасходныйКассовыйОрдер, уатСтраховойСертификат_уэ";
	ДокументыПокупатель = "уатАктКС3_стм, уатЗаказГрузоотправителя, уатПотребностьВПеревозке_уэ, уатРеализацияУслуг,
		|уатРекламация_уэ, уатСчетНаОплатуПокупателю, уатСчетФактураВыданный, уатТТД";
	
	Если СтрНайти(ДокументыПоставщик, МетаданныеДокумента.Имя) <> 0 Тогда
		ВидДоговора = "СПоставщиком";
	ИначеЕсли СтрНайти(ДокументыПокупатель, МетаданныеДокумента.Имя) <> 0 Тогда
		ВидДоговора = "СПокупателем";
	Иначе
		ВидДоговора    = Неопределено;
	КонецЕсли;
	
	Возврат ВидДоговора;
	
КонецФункции
	
// Функция возвращает предмет договор контрагента по входящему документу
//
// Параметры:
//  МетаданныеДокумента - Метаданные - Метаданные документа или другого объекта
// 
// Возвращаемое значение:
//  Строка, ПеречислениеСсылка.уатПредметыДоговоров, Массив - значение или массив значений предмета договора
//
Функция ПолучитьПредметДоговораКонтрагента(МетаданныеДокумента) Экспорт
	
	Рез = Неопределено;
	
	Если МетаданныеДокумента.Имя = "такАгентскийДоговор"
		ИЛИ МетаданныеДокумента.Имя = "такЗаказТакси" Тогда
		Рез = "Такси";
	ИначеЕсли МетаданныеДокумента.Имя = "такАрендаТС" Тогда
		Рез = "Аренда";
	ИначеЕсли МетаданныеДокумента.Имя = "уатЗаказГрузоотправителя"
		ИЛИ МетаданныеДокумента.Имя = "уатЗаказПеревозчику_уэ"
		ИЛИ МетаданныеДокумента.Имя = "уатМаршрутныйЛист"
		ИЛИ МетаданныеДокумента.Имя = "уатПотребностьВПеревозке_уэ"
		ИЛИ МетаданныеДокумента.Имя = "уатРеестрПеревозок"
		ИЛИ МетаданныеДокумента.Имя = "уатРекламация_уэ"
		ИЛИ МетаданныеДокумента.Имя = "уатСтраховойСертификат_уэ" Тогда
		Рез = "Перевозка";
	ИначеЕсли МетаданныеДокумента.Имя = "уатАктКС3_стм"
		ИЛИ МетаданныеДокумента.Имя = "уатВозвратТоваров"
		ИЛИ МетаданныеДокумента.Имя = "уатЗаявкаНаРемонт"
		ИЛИ МетаданныеДокумента.Имя = "уатПоступлениеАгрегатов"
		ИЛИ МетаданныеДокумента.Имя = "уатРемонтныйЛист" Тогда
		Рез = "ПрочиеУслуги";
	ИначеЕсли НЕ уатОбщегоНазначенияПовтИсп.ВариантПоставкиСТД()
		И (МетаданныеДокумента.Имя = "уатЗаправкаГСМ"
		ИЛИ МетаданныеДокумента.Имя = "уатТТД") Тогда
		Рез = Новый Массив;
		Рез.Добавить(Перечисления.уатПредметыДоговоровКонтрагентов.Перевозка);
		Рез.Добавить(Перечисления.уатПредметыДоговоровКонтрагентов.ПрочиеУслуги);
	КонецЕсли;
	
	Возврат Рез;
	
КонецФункции 

#КонецОбласти
