
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПрочитатьНастройки();
	ОбновитьФормуПоНастройкам(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЗапрещатьВходВПрограммуУволеннымСотрудникамАвтоматическиПриИзменении(Элемент)
	ЗапрещатьВходВПрограммуУволеннымСотрудникамАвтоматическиПриИзмененииНаСервере(КонстантыНабор.GDS_ЗапрещатьВходВПрограммуУволеннымСотрудникамАвтоматически);
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СписокСотрудниковДоступНеЗапрещается(Команда)
	ОткрытьФорму("Обработка.GDS_ПанельНастроек.Форма.СписокСотрудниковДоступНеЗапрещается", , ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПрочитатьНастройки()
	
	СтрокаКонстант = 
	"GDS_ЗапрещатьВходВПрограммуУволеннымСотрудникамАвтоматически";
	
	Настройка = Константы.СоздатьНабор(СтрокаКонстант);
	Настройка.Прочитать();
	ЗначениеВРеквизитФормы(Настройка, "КонстантыНабор");
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьФормуПоНастройкам(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы, "СписокСотрудниковДоступНеЗапрещается", "Доступность",
		Форма.КонстантыНабор.GDS_ЗапрещатьВходВПрограммуУволеннымСотрудникамАвтоматически);
	
КонецПроцедуры

&НаСервере
Процедура ЗапрещатьВходВПрограммуУволеннымСотрудникамАвтоматическиПриИзмененииНаСервере(Использование)
	
	Константы.GDS_ЗапрещатьВходВПрограммуУволеннымСотрудникамАвтоматически.Установить(Использование);
	ПрочитатьНастройки();
	ОбновитьФормуПоНастройкам(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

