
#Область ПеременныеФормы

&НаКлиенте
Перем СоответвиеСтрокГрузов;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		АвтоТест = Истина;
	КонецЕсли;
	
	Если НЕ Параметры.Свойство("Грузы") Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("СоответвиеСтрокГрузов") Тогда   
		Для Каждого ТекСтрока Из Параметры.СоответвиеСтрокГрузов Цикл
			ТекСтрока.Значение.Вставить("НомерСтроки", ТекСтрока.Ключ);
			мсвГрузов.Добавить(ТекСтрока.Значение);
		КонецЦикла;
	КонецЕсли; 
	
	Если Параметры.Свойство("Ссылка") Тогда
		ДокументИмя = Параметры.Ссылка.Метаданные().Имя;
	Иначе
		Если Параметры.Свойство("ДокументИмя") Тогда
			ДокументИмя = Параметры.ДокументИмя;
		Иначе
			ДокументИмя = "";
		КонецЕсли;
	КонецЕсли;
	
	ДокументОснование = Параметры.ДокументОснование;
	
	СоответвиеВалют = Новый Соответствие();
	ЭтоКонтейнер = Ложь;
	Для Каждого ТекГруз Из Параметры.Грузы Цикл
		НоваяСтрока = ГрузовойСостав.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекГруз); 
		
		Если ТипЗнч(НоваяСтрока.Номенклатура) = Тип("СправочникСсылка.уатГрузовыеМеста_уэ")
			И НоваяСтрока.Номенклатура.Контейнер Тогда 
			ЭтоКонтейнер = Истина;
		Конецесли;  
		СоответвиеВалют.Вставить(НоваяСтрока.Валюта, НоваяСтрока.Валюта);
	КонецЦикла;
	СоздаватьОтдельныеДокументы = ЭтоКонтейнер ИЛИ СоответвиеВалют.Количество() > 1;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ВладелецФормы = Неопределено Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("en='Immediate opening for this object is prohibited!';ru='Непосредственное открытие для данного объекта запрещено!'"), 10);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	СоответвиеСтрокГрузов = Новый Соответствие();
	Для Каждого ТекСтрока Из мсвГрузов Цикл
		СоответвиеСтрокГрузов.Вставить(ТекСтрока.Значение.НомерСтроки, ТекСтрока.Значение);
	КонецЦикла;

	УстановитьФлажки(Неопределено);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	Для Каждого ТекКонтрагент из ГрузовойСостав Цикл
		ТекКонтрагент.ФлагВыбора = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	Для Каждого ТекКонтрагент из ГрузовойСостав Цикл
		ТекКонтрагент.ФлагВыбора = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	Результат = ОКСервер();
	
	Если СоздаватьОтдельныеДокументы Тогда
		Сч = 1;
		Для Каждого ТекНомерСтроки Из Результат Цикл
			Если Сч = 1 Тогда
				Оповестить("СозданиеДокументаИзФормыВыбораКонтрагента_" + ДокументИмя, ТекНомерСтроки);
			Иначе  
				ТекСтрокаГруза = СоответвиеСтрокГрузов.Получить(ТекНомерСтроки);
				
				мсвТекГрузов = Новый Массив();
				мсвТекГрузов.Добавить(ТекСтрокаГруза);
				ДанныеЗаполнения = Новый Структура("Основание, мсвГрузов", ДокументОснование, мсвТекГрузов);
				
				ОткрытьФорму("Документ." + ДокументИмя + ".ФормаОбъекта", ДанныеЗаполнения,, Новый УникальныйИдентификатор);
			КонецЕсли;
			Сч = Сч + 1;
		КонецЦикла;
		Закрыть();
	Иначе
		Закрыть(Результат); 
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ОКСервер()
	
	МассивСтрокГрузов = Новый Массив();
	
	Для Каждого текСтрока Из ГрузовойСостав Цикл
		Если НЕ текСтрока.ФлагВыбора Тогда
			Продолжить;
		КонецЕсли;
		
		МассивСтрокГрузов.Добавить(текСтрока.НомерСтроки);
	КонецЦикла;
	
	Возврат МассивСтрокГрузов;
	
КонецФункции

#КонецОбласти
