
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	уатЗащищенныеФункцииСервер.уатСправочникФормаЭлементаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, Объект, ЭтотОбъект, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	уатЗащищенныеФункцииКлиент.уатСправочникФормаЭлементаПриОткрытии(Отказ, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	УправлениеВидимостью();
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УправлениеВидимостью()
	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		Элементы.ШагКластеризации.Доступность = НайтиКластерыПоНастройке(Объект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НайтиКластерыПоНастройке(НастройкаКластеризации)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НастройкаКластеризации",НастройкаКластеризации);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	уатКластеры_уэ.Ссылка
	               |ИЗ
	               |	Справочник.уатКластеры_уэ КАК уатКластеры_уэ
	               |ГДЕ
	               |	уатКластеры_уэ.НастройкаКластеризации = &НастройкаКластеризации";
	Выборка = Запрос.Выполнить().Выбрать();				  
	Возврат (Выборка.Количество() = 0);
	
КонецФункции

#КонецОбласти
