#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция НовыйНастройки() Экспорт
	
	Настройки = Новый Структура;
	Настройки.Вставить("АдресСервера", "");
	Настройки.Вставить("ИмяБазы", "");
	Настройки.Вставить("АдресРесурса", "");
	Настройки.Вставить("Порт", "");
	Настройки.Вставить("Логин", "");
	Настройки.Вставить("Пароль", "");
	
	Возврат Настройки;
	
КонецФункции

Функция Прочитать(ИдентификаторБазы, ВидНастройки, УзелИнтеграции = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Настройки = НовыйНастройки();
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ИдентификаторБазы", ИдентификаторБазы);
	Запрос.УстановитьПараметр("УзелИнтеграции", УзелИнтеграции);
	Запрос.УстановитьПараметр("ВидНастройки", ВидНастройки);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Настройки.АдресСервера КАК АдресСервера,
	|	Настройки.ИмяБазы КАК ИмяБазы,
	|	Настройки.АдресРесурса КАК АдресРесурса,
	|	Настройки.Порт КАК Порт,
	|	Настройки.Логин КАК Логин,
	|	Настройки.Пароль КАК Пароль
	|ИЗ
	|	РегистрСведений.GDS_НастройкиВнешнихСоединений КАК Настройки
	|ГДЕ
	|	Настройки.ИдентификаторБазы = &ИдентификаторБазы
	|	И Настройки.ВидНастройки = &ВидНастройки";
	
	Если ЗначениеЗаполнено(УзелИнтеграции) Тогда
		Запрос.Текст = Запрос.Текст + " И Настройки.УзелИнтеграции = &УзелИнтеграции";
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Настройки, Выборка);
	КонецЕсли;
	
	Возврат Настройки;
	
КонецФункции

#КонецОбласти

#КонецЕсли
