
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	уатЗащищенныеФункцииСервер.уатДокументФормаСпискаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
    ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
	Если Не ПравоДоступа("Редактирование", Метаданные.Документы.уатРекламация_уэ) Тогда 
		Элементы.ФормаИзменитьВыделенные.Видимость = Ложь;
		Элементы.СписокКонтекстноеМенюИзменитьВыделенные.Видимость = Ложь;
	КонецЕсли;
	
	АвторизованВнешнийПользователь = Ложь;
	АвторизованныйКонтрагент = уатЗащищенныеФункцииСервер_проф.АвторизованныйКонтрагент(АвторизованВнешнийПользователь);
	Если АвторизованВнешнийПользователь Тогда
		Список.ТекстЗапроса = ТекстЗапросаВнешнегоПеревозчика();
		Список.Параметры.УстановитьЗначениеПараметра("ВиновникРекламации", АвторизованныйКонтрагент);
		
		Элементы.ПодменюПечать.Видимость = Ложь;
	КонецЕсли; 
	
	ИспользуютсяСогласования = ПолучитьФункциональнуюОпцию("уатИспользоватьСогласованиеДокументов");
	Элементы.Согласован.Видимость = ИспользуютсяСогласования;
	Элементы.ТребуетСогласования.Видимость = ИспользуютсяСогласования;
	
	Настройки = ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ИспользоватьИнтеграцию();
	Элементы.СогласованиеДО.Видимость = Настройки.ИспользоватьИнтеграциюДО3;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	уатЗащищенныеФункцииКлиент.уатДокументФормаСпискаПриОткрытии(Отказ, ЭтотОбъект, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Список

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Элементы.Список);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

&НаКлиенте
Процедура ИзменитьВыделенные(Команда)
	ГрупповоеИзменениеОбъектовКлиент.ИзменитьВыделенные(Элементы.Список, Список);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаСервереБезКонтекста
Функция ТекстЗапросаВнешнегоПеревозчика()
	ТекстЗапроса = "ВЫБРАТЬ
	|	ДокументуатРекламация_уэ.Ссылка КАК Ссылка,
	|	ДокументуатРекламация_уэ.ПометкаУдаления КАК ПометкаУдаления,
	|	ДокументуатРекламация_уэ.Номер КАК Номер,
	|	ДокументуатРекламация_уэ.Дата КАК Дата,
	|	ДокументуатРекламация_уэ.Проведен КАК Проведен,
	|	ДокументуатРекламация_уэ.Организация КАК Организация,
	|	ДокументуатРекламация_уэ.Подразделение КАК Подразделение,
	|	ДокументуатРекламация_уэ.Контрагент КАК Контрагент,
	|	ДокументуатРекламация_уэ.Ответственный КАК Ответственный,
	|	ДокументуатРекламация_уэ.ВалютаДокумента КАК ВалютаДокумента,
	|	ДокументуатРекламация_уэ.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ДокументуатРекламация_уэ.ЗаказГрузоотправителя КАК ЗаказГрузоотправителя,
	|	СУММА(ДокументуатРекламация_уэ.СуммаВыставленная) КАК СуммаВыставленная,
	|	МАКСИМУМ(ДокументуатРекламация_уэ.СуммаВыставленная) КАК СуммаПодтвержденная,
	|	МАКСИМУМ(ДокументуатРекламация_уэ.СуммаПодтвержденная) КАК КурсДокумента,
	|	МАКСИМУМ(ДокументуатРекламация_уэ.КратностьДокумента) КАК КратностьДокумента,
	|	ДокументуатРекламация_уэ.МаршрутныйЛист КАК МаршрутныйЛист,
	|	ДокументуатРекламация_уэ.УчитыватьНДС КАК УчитыватьНДС,
	|	ДокументуатРекламация_уэ.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ДокументуатРекламация_уэ.МоментВремени КАК МоментВремени,
	|	ВЫБОР
	|		КОГДА НаличиеФайлов.ЕстьФайлы ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ НаличиеФайлов.ЕстьФайлы
	|	КОНЕЦ КАК ПрисоединенныйФайл,
	|	ВЫРАЗИТЬ(ДокументуатРекламация_уэ.Комментарий КАК СТРОКА(200)) КАК Поле1
	|ИЗ
	|	Документ.уатРекламация_уэ.Распределение КАК уатРекламация_уэРаспределение
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уатРекламация_уэ КАК ДокументуатРекламация_уэ
	|		ПО уатРекламация_уэРаспределение.Ссылка = ДокументуатРекламация_уэ.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НаличиеФайлов КАК НаличиеФайлов
	|		ПО (ДокументуатРекламация_уэ.Ссылка = НаличиеФайлов.ОбъектСФайлами)
	|ГДЕ
	|	уатРекламация_уэРаспределение.Контрагент = &ВиновникРекламации
	|
	|СГРУППИРОВАТЬ ПО
	|	ДокументуатРекламация_уэ.Ссылка,
	|	ДокументуатРекламация_уэ.ПометкаУдаления,
	|	ДокументуатРекламация_уэ.Номер,
	|	ДокументуатРекламация_уэ.Дата,
	|	ДокументуатРекламация_уэ.Проведен,
	|	ДокументуатРекламация_уэ.Организация,
	|	ДокументуатРекламация_уэ.Подразделение,
	|	ДокументуатРекламация_уэ.Контрагент,
	|	ДокументуатРекламация_уэ.Ответственный,
	|	ДокументуатРекламация_уэ.ВалютаДокумента,
	|	ДокументуатРекламация_уэ.ДоговорКонтрагента,
	|	ДокументуатРекламация_уэ.ЗаказГрузоотправителя,
	|	ДокументуатРекламация_уэ.МаршрутныйЛист,
	|	ДокументуатРекламация_уэ.УчитыватьНДС,
	|	ДокументуатРекламация_уэ.СуммаВключаетНДС,
	|	ДокументуатРекламация_уэ.МоментВремени,
	|	ВЫБОР
	|		КОГДА НаличиеФайлов.ЕстьФайлы ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ НаличиеФайлов.ЕстьФайлы
	|	КОНЕЦ,
	|	ВЫРАЗИТЬ(ДокументуатРекламация_уэ.Комментарий КАК СТРОКА(200))";
	Возврат ТекстЗапроса;
КонецФункции

#КонецОбласти
