
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		АвтоТест = Истина;
		Возврат;
	КонецЕсли;
	
	ТолькоПросмотр = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если АвтоТест Тогда
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = НСтр("en='This object is for compatibility with previous releases."
	"Modifying data is prohibited!';ru='Данный объект предназначен для совместимости с предыдущими релизами."
	"Изменение данных запрещено!'");
	ПоказатьПредупреждение(, ТекстСообщения, 60, НСтр("en='Data can be changed!';ru='Изменение данных запрещено!'"));
	Отказ = Истина;
	
КонецПроцедуры

#КонецОбласти