
#Область  ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ПолеПоиска") Тогда
		ПолеПоиска = Параметры.ПолеПоиска;
	КонецЕсли;
	Если Параметры.Свойство("Направление") Тогда
		Направление = Параметры.Направление;
	КонецЕсли;
	Если Параметры.Свойство("УчитыватьРегистр") Тогда
		УчитыватьРегистр = Параметры.УчитыватьРегистр;
	КонецЕсли;
	Если Параметры.Свойство("ОбъектПоиска") Тогда
		ОбъектПоиска = Параметры.ОбъектПоиска;
	КонецЕсли;
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Искать(Команда)
	
	СтруктураПоискаОбъектовМониторинга = Новый Структура();
	СтруктураПоискаОбъектовМониторинга.Вставить("ПолеПоиска",ПолеПоиска);
	СтруктураПоискаОбъектовМониторинга.Вставить("Направление",Направление);
	СтруктураПоискаОбъектовМониторинга.Вставить("УчитыватьРегистр",УчитыватьРегистр);
	СтруктураПоискаОбъектовМониторинга.Вставить("ОбъектПоиска",ОбъектПоиска);	
	
	Закрыть(СтруктураПоискаОбъектовМониторинга);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти
