
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	уатЗащищенныеФункцииСервер.уатДокументФормаСпискаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	// Внешнему пользователю физическому лицу запрещено открытие документов
	Если уатОбщегоНазначения.ПроверкаВнешнегоПользователя() И ТипЗнч(ПользователиКлиентСервер.АвторизованныйПользователь().ОбъектАвторизации) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
    ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	ПравоДоступаНаРедактирование = ПравоДоступа("Редактирование", Метаданные.Документы.уатМаршрутныйЛист);
	Если Не ПравоДоступаНаРедактирование Тогда 
		Элементы.ФормаИзменитьВыделенные.Видимость = Ложь;
		Элементы.СписокКонтекстноеМенюИзменитьВыделенные.Видимость = Ложь;
		Элементы.Закрытие.Видимость = Ложь;
	КонецЕсли;
	
	// Ограничение просмотра для внешнего пользователя
	АвторизованВнешнийПользователь = Ложь;
	АвторизованныйКонтрагент = уатЗащищенныеФункцииСервер_проф.АвторизованныйКонтрагент(АвторизованВнешнийПользователь);
	Если АвторизованВнешнийПользователь Тогда
		ЭлементОтбора                  = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Контрагент");
		ЭлементОтбора.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение   = АвторизованныйКонтрагент;
		ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		ЭлементОтбора.Использование    = Истина;
		
		Элементы.ПодменюПечать.Видимость = Ложь;
		Элементы.ФормаИзменитьВыделенные.Видимость = Ложь;
		Элементы.Закрытие.Видимость = Ложь;
		Элементы.ПодменюПодключитьСервисы.Видимость = Ложь;
		Если АвторизованВнешнийПользователь Тогда
			Элементы.СуммаДоходов.Видимость = Ложь;
		КонецЕсли;
		
		Если уатОбщегоНазначенияСервер.АвторизованВнещнийПеревозчик() Тогда
			КомандаСоздатьНаОсновании = Элементы.Найти("ФормаДокументуатСчетНаОплатуПоставщикаСоздатьНаОсновании");
			Если КомандаСоздатьНаОсновании <> Неопределено Тогда
				КомандаСоздатьНаОсновании.Заголовок = НСтр("ru = 'Счет на оплату'; en = 'Invoice for payment'");
			КонецЕсли;
			КомандаСоздатьНаОсновании = Элементы.Найти("ФормаДокументуатПоступлениеТоваровУслугСоздатьНаОсновании");
			Если КомандаСоздатьНаОсновании <> Неопределено Тогда
				КомандаСоздатьНаОсновании.Заголовок = НСтр("ru = 'Реализация услуг'; en = 'Sale of services'");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	уатОбщегоНазначенияСервер.ПереместитьКнопкуКонтакты(Элементы);
	
	Если ПолучитьФункциональнуюОпцию("уатИспользоватьДокументооборот") = Ложь Тогда
		Элементы.СтатусОбработкиСопроводительныхДокументов.Видимость = Ложь;
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("уатИспользоватьИнтеграциюWMS_уэ") = Ложь Тогда
		ЭлементСтатусВыгрузкиВWMS = Элементы.Найти("СтатусВыгрузкиВWMS");
		Если ЭлементСтатусВыгрузкиВWMS <> Неопределено Тогда
			ЭлементСтатусВыгрузкиВWMS.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("уатРазделятьПланФактВСкладскихАктах_уэ") = Ложь Тогда
		Элементы.КартинкаЕстьРасхождения.Видимость = Ложь;
	КонецЕсли;
	
	Если уатОбщегоНазначенияПовтИсп.ВариантПоставкиКОРП() Тогда
		Элементы.ФормаСоздатьТендеры.Видимость = ПравоДоступа("Добавление", Метаданные.Документы.уатТендер_уэ);
	Иначе
		Элементы.ФормаСоздатьТендеры.Видимость = Ложь;
	КонецЕсли;
	
	ИспользоватьЗакреплениеМаршрутныхЛистовЗаПеревозчиками
		= ПолучитьФункциональнуюОпцию("уатИспользоватьЗакреплениеМаршрутныхЛистовЗаПеревозчиками_уэ");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	уатЗащищенныеФункцииКлиент.уатДокументФормаСпискаПриОткрытии(Отказ, ЭтотОбъект, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("Подключаемый_УстановитьБаннер", 1, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Список

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Не ПравоДоступаНаРедактирование Тогда 
		Возврат;
	КонецЕсли;
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ПользователиКлиентСервер.АвторизованныйПользователь()) = Тип("СправочникСсылка.ВнешниеПользователи") Тогда
		Возврат;
	КонецЕсли;  
		
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура КартинкаЗакрытьБаннерНажатие(Элемент)
	КартинкаЗакрытьБаннерНажатиеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КартинкаБаннераПодключитьНажатие(Элемент)
	
	Если Баннер.ИмяСервиса = "МобильноеПриложение" Тогда
		ПодключитьМобильноеПриложение(Неопределено);
	Иначе
		ПодключитьМаршрутизацию(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ИзменитьВыделенные(Команда)
	
	//Если уатОбщегоНазначенияПовтИсп.ВариантПоставкиКОРП() Тогда
		ИзменитьВыделенныеСтроки(Элементы.Список, Список);
	//Иначе
	//	ГрупповоеИзменениеОбъектовКлиент.ИзменитьВыделенные(Элементы.Список, Список);
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказЗаявкаОтГрузоотправителя(Команда)
	МассивОбъектов = Элементы.Список.ВыделенныеСтроки;
	ПечатьЗаказЗаявка(МассивОбъектов, "Грузоотправитель");
КонецПроцедуры

&НаКлиенте
Процедура ЗаказЗаявкаОтПеревозчика(Команда)
	МассивОбъектов = Элементы.Список.ВыделенныеСтроки;
	ПечатьЗаказЗаявка(МассивОбъектов, "Перевозчик");
КонецПроцедуры

&НаКлиенте
Процедура Закрытие(Команда)
	ТекСтрока = Элементы.Список.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекДатаЗакрытия = уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(ТекСтрока.Ссылка, "ДатаЗакрытия");
	Если ТекДатаЗакрытия <> '00010101' Тогда
		ТекстНСТР = НСтр("en='Document is already closed on date ""%1"". To cancel closing, open the document form.';ru='Документ уже закрыт на дату ""%1"". Для отмены закрытия откройте форму документа.'");
		ТекстНСТР = СтрШаблон(ТекстНСТР, ТекДатаЗакрытия);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР);
		Возврат;
	КонецЕсли;
	
	ДопПараметры = Новый Структура("Документ", ТекСтрока.Ссылка);
	ТекстНСТР = НСтр("en='Enter closing date and time';ru='Введите дату и время закрытия'");
	ПоказатьВводДаты(Новый ОписаниеОповещения("ЗакрытиеВводДатыЗавершение", ЭтотОбъект, ДопПараметры),
		ДатаЗакрытияПоУмолчанию(ТекСтрока.Ссылка), ТекстНСТР, ЧастиДаты.ДатаВремя)
КонецПроцедуры

&НаСервере
Функция ДатаЗакрытияПоУмолчанию(ДокументСсылка)
	Если Элементы.Список.ВыделенныеСтроки.Количество() = 1 Тогда
		Возврат Документы.уатМаршрутныйЛист.ДатаЗакрытияПоУмолчанию(ДокументСсылка, ТекущаяДата());
	Иначе
		Возврат ТекущаяДата();
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ЗакрытиеВводДатыЗавершение(Результат, ДопПараметры) Экспорт
	Если ЗначениеЗаполнено(Результат) Тогда
		СообщениеОшибки = "";
		флСуммаУслугИзменилась = Ложь;
		флПересчетИтогов = Ложь;
		ЗакрытиеЗаказаСервер(ДопПараметры.Документ, Результат, СообщениеОшибки, флСуммаУслугИзменилась, флПересчетИтогов);
		Если НЕ ПустаяСтрока(СообщениеОшибки) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОшибки);
		Иначе
			Если флСуммаУслугИзменилась И НЕ флПересчетИтогов Тогда
				ПоказатьПредупреждение(Неопределено, НСтр("en='Recalculation of incomes and expenses not done';ru='Не выполнен пересчет доходов и расходов'"));
			КонецЕсли;
			Элементы.Список.Обновить();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗакрытиеЗаказаСервер(ДокументСсылка, ДатаЗакрытия, СообщениеОшибки = "", флСуммаУслугИзменилась = Ложь, флПересчетИтогов = Ложь)
	Если ЗначениеЗаполнено(ДокументСсылка) Тогда
		Документы.уатМаршрутныйЛист.ЗакрытиеДокумента(ДокументСсылка, ДатаЗакрытия, СообщениеОшибки, Истина, флСуммаУслугИзменилась);
		флПересчетИтогов = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(ПользователиКлиентСервер.АвторизованныйПользователь(), "МаршрутныйЛистПерерасчетИтоговПриПроведении");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьТендеры(Команда)
	
	Если ИспользоватьЗакреплениеМаршрутныхЛистовЗаПеревозчиками Тогда
		МаршрутныеЛисты = Новый Массив;
		ВыбранныеСтроки = Элементы.Список.ВыделенныеСтроки;
		Если ВыбранныеСтроки.Количество() > 1 Тогда
			ПараметрыВыбораПеревозчиков = Новый Структура;
			ПараметрыВыбораПеревозчиков.Вставить("МаршрутныеЛисты", ВыбранныеСтроки);
			ПараметрыВыбораПеревозчиков.Вставить("ОткрытьФормыТендеров", Истина);
			ОткрытьФорму("ОбщаяФорма.уатВыборПеревозчиков", ПараметрыВыбораПеревозчиков, ЭтаФорма,,,,,
				РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Иначе
			ТекСтрока = Элементы.Список.ТекущиеДанные;
			ПараметрыФормыТендера = Новый Структура("Основание", ТекСтрока.Ссылка);
			ОткрытьФорму("Документ.уатТендер_уэ.ФормаОбъекта", ПараметрыФормыТендера);
		КонецЕсли;
	Иначе
		ТекСтрока = Элементы.Список.ТекущиеДанные;
		ПараметрыФормыТендера = Новый Структура("Основание", ТекСтрока.Ссылка);
		ОткрытьФорму("Документ.уатТендер_уэ.ФормаОбъекта", ПараметрыФормыТендера);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьМобильноеПриложение(Команда)
	ПараметрыФормы = Новый Структура("ВидОбращения", 4);
	ОткрытьФорму("РегистрСведений.пр_ОбращенияВСлужбуПоддержки.ФормаЗаписи", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьМаршрутизацию(Команда)
	ПараметрыФормы = Новый Структура("ВидОбращения", 3);
	ОткрытьФорму("РегистрСведений.пр_ОбращенияВСлужбуПоддержки.ФормаЗаписи", ПараметрыФормы);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ИзменитьВыделенныеСтроки(СписокЭлемент, Знач СписокРеквизит = Неопределено)
	
	Если СписокРеквизит = Неопределено Тогда
		Форма = СписокЭлемент.Родитель;
		Пока ТипЗнч(Форма) <> Тип("УправляемаяФорма") Цикл
			Форма = Форма.Родитель;
		КонецЦикла;
		
		Попытка
			СписокРеквизит = Форма.Список;
		Исключение
			СписокРеквизит = Неопределено;
		КонецПопытки;
	КонецЕсли;
	
	ВыделенныеСтроки = СписокЭлемент.ВыделенныеСтроки;
	
	ПараметрыФормы = Новый Структура("МассивОбъектов", Новый Массив);
	Если ТипЗнч(СписокРеквизит) = Тип("ДинамическийСписок") Тогда
		ПараметрыФормы.Вставить("КомпоновщикНастроек", СписокРеквизит.КомпоновщикНастроек);
	КонецЕсли;
	
	Для Каждого ВыделеннаяСтрока Из ВыделенныеСтроки Цикл
		Если ТипЗнч(ВыделеннаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
			Продолжить;
		КонецЕсли;
		
		ТекущаяСтрока = СписокЭлемент.ДанныеСтроки(ВыделеннаяСтрока);
		Если ТекущаяСтрока <> Неопределено Тогда
			ПараметрыФормы.МассивОбъектов.Добавить(ТекущаяСтрока.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	Если ПараметрыФормы.МассивОбъектов.Количество() = 0 Тогда
		ПоказатьПредупреждение(, НСтр("ru='Команда не может быть выполнена для указанного объекта.';en='Command cannot be executed for the specified object.'"));
		Возврат;
	КонецЕсли;
		
	ОткрытьФорму("ОбщаяФорма.уатФормаОбработкиДокументов", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЗаказЗаявка(МассивОбъектов, ТипПФ)
	уатОбменСГИСЭПДКлиент.ПечатьЗаказЗаявка_ВыборЗаказа(ЭтотОбъект, МассивОбъектов, "МЛ", ТипПФ);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораЗаказа(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда 
		Возврат;
	КонецЕсли; 
	СоответвиеЗаказов  = Новый Соответствие();
	Для Каждого ТекСтрока Из ДополнительныеПараметры.СоответвиеЗаказов Цикл
		СоответвиеЗаказов.Вставить(ТекСтрока.Ключ, ТекСтрока.Значение);
	КонецЦикла; 
	Для Каждого ТекСтрока Из РезультатЗакрытия.СоответвиеЗаказов Цикл
		СоответвиеЗаказов.Вставить(ТекСтрока.Ключ, ТекСтрока.Значение);
	КонецЦикла;
	
	МассивОбъектов = ДополнительныеПараметры.МассивОбъектов;
	Для Каждого ТекСтрока Из РезультатЗакрытия.МассивОбъектов Цикл
		МассивОбъектов.Добавить(ТекСтрока);
	КонецЦикла;
	
	уатОбменСГИСЭПДКлиент.ПечатьЗаказЗаявка_ВыполнитьКомандуПечати(ЭтотОбъект,
	МассивОбъектов, "МЛ", СоответвиеЗаказов, ДополнительныеПараметры.ТипПФ);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УстановитьБаннер()
	
	УстановитьБаннер();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьБаннер(ПоказатьПредыдущий = Ложь)
	
	ДлительнаяОперация = ПолучитьБаннерНаСервере(ПоказатьПредыдущий);
	
	Если ДлительнаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДлительнаяОперация.Статус <> "Ошибка" Тогда
		
		НастройкиОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		НастройкиОжидания.ВыводитьОкноОжидания = Ложь;
		
		Обработчик = Новый ОписаниеОповещения("ПослеПолученияБаннераВФоне", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Обработчик, НастройкиОжидания);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПолученияБаннераВФоне(ДлительнаяОперация, ДополнительныеПараметры) Экспорт
	
	Если ДлительнаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДлительнаяОперация.Статус = "Выполнено" Тогда
		УстановитьБаннерНаФорме(ДлительнаяОперация.АдресРезультата);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьБаннерНаФорме(АдресРезультата)
	
	уатПерсонализированныеПредложенияСервисов.УстановитьБаннерНаФорме(ЭтотОбъект, АдресРезультата);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьБаннерНаСервере(ПоказатьПредыдущий)
	
	НастройкиЗапуска = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	НастройкиЗапуска.НаименованиеФоновогоЗадания = НСтр("ru = 'Получение баннера в фоне'");
	НастройкиЗапуска.ЗапуститьВФоне = Истина;
	НастройкиЗапуска.ОжидатьЗавершение = 0;
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("Организация", Неопределено);
	СтруктураПараметров.Вставить("Размещение", "МаршрутныйЛист");
	СтруктураПараметров.Вставить("ПоказатьПредыдущий", ПоказатьПредыдущий);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(
		"уатПерсонализированныеПредложенияСервисов.ПолучитьБаннер",
		СтруктураПараметров,
		НастройкиЗапуска);
	
КонецФункции

&НаСервере
Процедура КартинкаЗакрытьБаннерНажатиеНаСервере()
	уатПерсонализированныеПредложенияСервисов.ЗакрытьБаннер(ЭтотОбъект, Неопределено);
КонецПроцедуры

#КонецОбласти
