
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ГруппаГСМ") И Параметры.Свойство("ТС") И Параметры.Свойство("Организация") Тогда
		Если Параметры.ГруппаГСМ = ПредопределенноеЗначение("Перечисление.уатГруппыГСМ.Талон") Тогда
			Заголовок = НСтр("en='Fuels coupons for cars.';ru='Талоны ГСМ для авто.'") + " " + Строка(Параметры.ТС);
		ИначеЕсли Параметры.ГруппаГСМ = ПредопределенноеЗначение("Перечисление.уатГруппыГСМ.ПрисадкиИТехническиеЖидкости") Тогда
			Заголовок = НСтр("en='Additives and technical fluids';ru='Присадки и технические жидкости'");
		Иначе //топливо
			Если Параметры.БезАналогов Тогда
				Заголовок = НСтр("en='Main fuel for vehicle';ru='Основное топливо для ТС'") + " ";
			Иначе	
				Заголовок = НСтр("en='Fuel for vehicle';ru='Топливо для ТС'") + " ";
			КонецЕсли;
			Заголовок = Заголовок + Строка(Параметры.ТС);
		КонецЕсли;
		
		Если ТипЗнч(Параметры.ГруппаГСМ) = Тип("Массив") Тогда
			ТаблицаГСМ.Очистить();
			Для каждого ГруппаГСМ Из Параметры.ГруппаГСМ Цикл
				мсвГСМ = уатЗащищенныеФункцииСервер.СписокГСМдляТССервер(Параметры.Организация, Параметры.ТС, ГруппаГСМ, 
				Параметры.БезАналогов);
				флЕстьТалоны = Ложь;
				
				Для Каждого ТекЭл Из мсвГСМ Цикл
					Если ТаблицаГСМ.НайтиСтроки(ТекЭл).Количество() > 0 Тогда //исключаем дубли строк
						Продолжить;
					КонецЕсли;
					Если Параметры.Свойство("ВводОстатков") И ГруппаГСМ = Перечисления.уатГруппыГСМ.Электроэнергия Тогда
						СтруктураПоиска = Новый Структура("Номенклатура", ТекЭл.ГСМ);
						ВестиУчет = РегистрыСведений.уатНоменклатураГСМ.Получить(СтруктураПоиска).ВестиУчетОстатковТЖ;
						Если Не ВестиУчет Тогда
							Продолжить;
						КонецЕсли;
					КонецЕсли;
					НоваяСтрока = ТаблицаГСМ.Добавить();
					НоваяСтрока.ГСМ = ТекЭл.ГСМ;
					НоваяСтрока.ГСМТалона = ТекЭл.ГСМТалона;
					НоваяСтрока.Литровый = ТекЭл.Литровый;
					НоваяСтрока.Номинал = ТекЭл.Номинал;
					
					Если ЗначениеЗаполнено(ТекЭл.ГСМТалона) Тогда
						флЕстьТалоны = Истина;
					КонецЕсли;
				КонецЦикла;
				
				Если флЕстьТалоны Тогда
					Элементы.ТаблицаГСМГСМТалона.Видимость = Истина;
					Элементы.ТаблицаГСМЛитровый.Видимость = Истина;
					Элементы.ТаблицаГСМНоминал.Видимость = Истина;
				КонецЕсли;
			КонецЦикла;
		Иначе
			мсвГСМ = уатЗащищенныеФункцииСервер.СписокГСМдляТССервер(Параметры.Организация, Параметры.ТС, Параметры.ГруппаГСМ, 
			Параметры.БезАналогов);
			ТаблицаГСМ.Очистить();
			
			флЕстьТалоны = Ложь;
			
			Для Каждого ТекЭл Из мсвГСМ Цикл
				Если ТаблицаГСМ.НайтиСтроки(ТекЭл).Количество() > 0 Тогда //исключаем дубли строк
					Продолжить;
				КонецЕсли;
				Если Параметры.Свойство("ВводОстатков") И Параметры.ГруппаГСМ = Перечисления.уатГруппыГСМ.Электроэнергия Тогда
					СтруктураПоиска = Новый Структура("Номенклатура", ТекЭл.ГСМ);
					ВестиУчет = РегистрыСведений.уатНоменклатураГСМ.Получить(СтруктураПоиска).ВестиУчетОстатковТЖ;
					Если Не ВестиУчет Тогда
						Продолжить;
					КонецЕсли;
				КонецЕсли;
				НоваяСтрока = ТаблицаГСМ.Добавить();
				НоваяСтрока.ГСМ = ТекЭл.ГСМ;
				НоваяСтрока.ГСМТалона = ТекЭл.ГСМТалона;
				НоваяСтрока.Литровый = ТекЭл.Литровый;
				НоваяСтрока.Номинал = ТекЭл.Номинал;
				
				Если ЗначениеЗаполнено(ТекЭл.ГСМТалона) Тогда
					флЕстьТалоны = Истина;
				КонецЕсли;
			КонецЦикла;
			
			Если флЕстьТалоны Тогда
				Элементы.ТаблицаГСМГСМТалона.Видимость = Истина;
				Элементы.ТаблицаГСМЛитровый.Видимость = Истина;
				Элементы.ТаблицаГСМНоминал.Видимость = Истина;
			КонецЕсли;
		КонецЕсли;
		
		// удаляем ТЖ с отключенным учетом остатков
		Если ЗначениеЗаполнено(Параметры.ТС) И Параметры.Свойство("ТолькоТЖсУчетомОстатка")
			И Параметры.ТолькоТЖсУчетомОстатка Тогда
			
			Сч = ТаблицаГСМ.Количество()-1;
			Пока Сч >= 0 Цикл
				Если уатГСМ.ЭтоТехническаяЖидкость(ТаблицаГСМ[Сч].ГСМ) И НЕ уатГСМ.УчитыватьОстаткиТЖ(ТаблицаГСМ[Сч].ГСМ) Тогда
					ТаблицаГСМ.Удалить(Сч);
				КонецЕсли;
				Сч = Сч - 1;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаГСМ

&НаКлиенте
Процедура ТаблицаГСМВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	ТекСтрока = Элементы.ТаблицаГСМ.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Закрыть();
	Иначе
		Закрыть(ТекСтрока.ГСМ);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти