
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ПользовательскиеНастройки = ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;
	
	Для каждого ТекПользовательскаяНастройка Из ПользовательскиеНастройки Цикл
		
		Если ТекПользовательскаяНастройка.Параметр = Новый ПараметрКомпоновкиДанных("Сценарий") Тогда
			ЗначениеСценария = ТекПользовательскаяНастройка.Значение;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ЗначениеСценария) Тогда
		НаборыДанныхСкд = ЭтотОбъект.СхемаКомпоновкиДанных.НаборыДанных;
		Если ЗначениеСценария.Раздел = Перечисления.уатРазделыПланирования.ЗаказыНаЖДПеревозки Тогда
			НаборыДанныхСкд.НаборДанных1.Запрос  =
			"ВЫБРАТЬ
			|	уатПланРаботыТСОбороты.Организация КАК Организация,
			|	уатПланРаботыТСОбороты.ДетализацияПланирования КАК ДетализацияПланирования,
			|	уатПланРаботыТСОбороты.ПараметрВыработки КАК ПараметрВыработки,
			|	уатПланРаботыТСОбороты.Подразделение КАК Подразделение,
			|	уатПланРаботыТСОбороты.Колонна КАК Колонна,
			|	уатПланРаботыТСОбороты.Контрагент КАК Контрагент,
			|	уатПланРаботыТСОбороты.ВидПеревозки КАК ВидПеревозки,
			|	уатПланРаботыТСОбороты.ОбъектСтроительства КАК ОбъектСтроительства,
			|	уатПланРаботыТСОбороты.НаправлениеПеревозки КАК НаправлениеПеревозки,
			|	уатПланРаботыТСОбороты.Маршрут КАК Маршрут,
			|	уатПланРаботыТСОбороты.КоличествоОборот КАК КоличествоПлан,
			|	0 КАК КоличествоФакт,
			|	-уатПланРаботыТСОбороты.КоличествоОборот КАК Отклонение,
			|	уатПланРаботыТСОбороты.Менеджер КАК Менеджер,
			|	уатПланРаботыТСОбороты.Номенклатура КАК Номенклатура,
			|	уатПланРаботыТСОбороты.Регистратор КАК Регистратор
			|ПОМЕСТИТЬ ВремТаб
			|ИЗ
			|	РегистрНакопления.уатПланРаботыТС.Обороты(
			|			,
			|			,
			|			Регистратор,
			|			Сценарий = &Сценарий
			|				И ПараметрВыработки.ИспользоватьПриПланировании
			|				И ВЫБОР
			|					КОГДА Сценарий.ИспользоватьКраткосрочноеПланирование
			|						ТОГДА Периодичность = Сценарий.ПериодичностьКраткосрочногоПланирования
			|					ИНАЧЕ Периодичность = Сценарий.Периодичность
			|				КОНЕЦ) КАК уатПланРаботыТСОбороты
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	уатФактПоЗаказамНаТСОбороты.Организация,
			|	уатФактПоЗаказамНаТСОбороты.ДетализацияПланирования,
			|	уатФактПоЗаказамНаТСОбороты.ПараметрВыработки,
			|	уатФактПоЗаказамНаТСОбороты.Подразделение,
			|	ЗНАЧЕНИЕ(Справочник.уатКолонны.ПустаяСсылка),
			|	уатФактПоЗаказамНаТСОбороты.Контрагент,
			|	уатФактПоЗаказамНаТСОбороты.ВидПеревозки,
			|	уатФактПоЗаказамНаТСОбороты.ОбъектСтроительства,
			|	уатФактПоЗаказамНаТСОбороты.НаправлениеПеревозки,
			|	уатФактПоЗаказамНаТСОбороты.Маршрут,
			|	0,
			|	уатФактПоЗаказамНаТСОбороты.КоличествоОборот,
			|	уатФактПоЗаказамНаТСОбороты.КоличествоОборот,
			|	уатФактПоЗаказамНаТСОбороты.Менеджер,
			|	уатФактПоЗаказамНаТСОбороты.Номенклатура,
			|	уатФактПоЗаказамНаТСОбороты.Регистратор
			|ИЗ
			|	РегистрНакопления.уатФактПоЗаказамНаТС.Обороты(, , Регистратор, ) КАК уатФактПоЗаказамНаТСОбороты
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВремТаб.Организация КАК Организация,
			|	ВремТаб.ДетализацияПланирования КАК Детализация,
			|	ВремТаб.ПараметрВыработки КАК ПараметрВыработки,
			|	ВремТаб.Подразделение КАК Подразделение,
			|	ЕСТЬNULL(ВремТаб.Колонна, ЗНАЧЕНИЕ(Справочник.уатКолонны.ПустаяСсылка)) КАК Колонна,
			|	ВремТаб.Контрагент КАК Контрагент,
			|	ВремТаб.ВидПеревозки КАК ВидПеревозки,
			|	ВремТаб.ОбъектСтроительства КАК ОбъектСтроительства,
			|	ВремТаб.НаправлениеПеревозки КАК НаправлениеПеревозки,
			|	ВремТаб.Маршрут КАК Маршрут,
			|	СУММА(ВремТаб.КоличествоПлан) КАК КоличествоПлан,
			|	СУММА(ВремТаб.КоличествоФакт) КАК КоличествоФакт,
			|	СУММА(ВремТаб.Отклонение) КАК Отклонение,
			|	ВремТаб.Менеджер КАК Менеджер,
			|	ВремТаб.Номенклатура КАК Номенклатура,
			|	ВремТаб.Регистратор КАК Регистратор
			|ИЗ
			|	ВремТаб КАК ВремТаб
			|
			|СГРУППИРОВАТЬ ПО
			|	ВремТаб.Организация,
			|	ВремТаб.ДетализацияПланирования,
			|	ВремТаб.ПараметрВыработки,
			|	ВремТаб.Подразделение,
			|	ВремТаб.Колонна,
			|	ВремТаб.Контрагент,
			|	ВремТаб.ВидПеревозки,
			|	ВремТаб.ОбъектСтроительства,
			|	ВремТаб.НаправлениеПеревозки,
			|	ВремТаб.Маршрут,
			|	ВремТаб.Менеджер,
			|	ВремТаб.Номенклатура,
			|	ВремТаб.Регистратор";
		Иначе
			НаборыДанныхСкд.НаборДанных1.Запрос  =
			"ВЫБРАТЬ
			|	уатПланРаботыТСОбороты.Организация КАК Организация,
			|	уатПланРаботыТСОбороты.ДетализацияПланирования КАК ДетализацияПланирования,
			|	уатПланРаботыТСОбороты.ПараметрВыработки КАК ПараметрВыработки,
			|	уатПланРаботыТСОбороты.Подразделение КАК Подразделение,
			|	уатПланРаботыТСОбороты.Колонна КАК Колонна,
			|	уатПланРаботыТСОбороты.Контрагент КАК Контрагент,
			|	уатПланРаботыТСОбороты.ВидПеревозки КАК ВидПеревозки,
			|	уатПланРаботыТСОбороты.ОбъектСтроительства КАК ОбъектСтроительства,
			|	уатПланРаботыТСОбороты.НаправлениеПеревозки КАК НаправлениеПеревозки,
			|	уатПланРаботыТСОбороты.Маршрут КАК Маршрут,
			|	уатПланРаботыТСОбороты.КоличествоОборот КАК КоличествоПлан,
			|	0 КАК КоличествоФакт,
			|	-уатПланРаботыТСОбороты.КоличествоОборот КАК Отклонение,
			|	уатПланРаботыТСОбороты.Регистратор КАК Регистратор,
			|	уатПланРаботыТСОбороты.Менеджер КАК Менеджер,
			|	уатПланРаботыТСОбороты.Номенклатура КАК Номенклатура
			|ПОМЕСТИТЬ ВремТаб
			|ИЗ
			|	РегистрНакопления.уатПланРаботыТС.Обороты(
			|			,
			|			,
			|			Регистратор,
			|			Сценарий = &Сценарий
			|				И ПараметрВыработки.ИспользоватьПриПланировании
			|				И ВЫБОР
			|					КОГДА Сценарий.ИспользоватьКраткосрочноеПланирование
			|						ТОГДА Периодичность = Сценарий.ПериодичностьКраткосрочногоПланирования
			|					ИНАЧЕ Периодичность = Сценарий.Периодичность
			|				КОНЕЦ) КАК уатПланРаботыТСОбороты
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	уатФактРаботыТСОбороты.Организация,
			|	уатФактРаботыТСОбороты.ДетализацияПланирования,
			|	уатФактРаботыТСОбороты.ПараметрВыработки,
			|	уатФактРаботыТСОбороты.Подразделение,
			|	уатФактРаботыТСОбороты.Колонна,
			|	уатФактРаботыТСОбороты.Контрагент,
			|	уатФактРаботыТСОбороты.ВидПеревозки,
			|	уатФактРаботыТСОбороты.ОбъектСтроительства,
			|	уатФактРаботыТСОбороты.НаправлениеПеревозки,
			|	уатФактРаботыТСОбороты.Маршрут,
			|	0,
			|	уатФактРаботыТСОбороты.КоличествоОборот,
			|	уатФактРаботыТСОбороты.КоличествоОборот,
			|	уатФактРаботыТСОбороты.Регистратор,
			|	уатФактРаботыТСОбороты.Менеджер,
			|	уатФактРаботыТСОбороты.Номенклатура
			|ИЗ
			|	РегистрНакопления.уатФактРаботыТС.Обороты(, , Регистратор, ПараметрВыработки.ИспользоватьПриПланировании) КАК уатФактРаботыТСОбороты
			|ГДЕ
			|	уатФактРаботыТСОбороты.Регистратор.Сценарий = &Сценарий
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВремТаб.Организация КАК Организация,
			|	ВремТаб.ДетализацияПланирования КАК Детализация,
			|	ВремТаб.ПараметрВыработки КАК ПараметрВыработки,
			|	ВремТаб.Подразделение КАК Подразделение,
			|	ВремТаб.Колонна КАК Колонна,
			|	ВремТаб.Контрагент КАК Контрагент,
			|	ВремТаб.ВидПеревозки КАК ВидПеревозки,
			|	ВремТаб.ОбъектСтроительства КАК ОбъектСтроительства,
			|	ВремТаб.НаправлениеПеревозки КАК НаправлениеПеревозки,
			|	ВремТаб.Маршрут КАК Маршрут,
			|	СУММА(ВремТаб.КоличествоПлан) КАК КоличествоПлан,
			|	СУММА(ВремТаб.КоличествоФакт) КАК КоличествоФакт,
			|	СУММА(ВремТаб.Отклонение) КАК Отклонение,
			|	ВремТаб.Регистратор КАК Регистратор,
			|	ВремТаб.Менеджер КАК Менеджер,
			|	ВремТаб.Номенклатура КАК Номенклатура
			|ИЗ
			|	ВремТаб КАК ВремТаб
			|
			|СГРУППИРОВАТЬ ПО
			|	ВремТаб.Организация,
			|	ВремТаб.ДетализацияПланирования,
			|	ВремТаб.ПараметрВыработки,
			|	ВремТаб.Подразделение,
			|	ВремТаб.Колонна,
			|	ВремТаб.Контрагент,
			|	ВремТаб.ВидПеревозки,
			|	ВремТаб.ОбъектСтроительства,
			|	ВремТаб.НаправлениеПеревозки,
			|	ВремТаб.Маршрут,
			|	ВремТаб.Регистратор,
			|	ВремТаб.Менеджер,
			|	ВремТаб.Номенклатура";
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
