
#Область ПрограммныйИнтерфейс

// Функция - Текст условия отбор по складам
// 
// Возвращаемое значение:
//  Строка - Текст запроса.
//
Функция ТекстУсловияОтборПоСкладам() Экспорт
	
	ТипыКонтрагенты = Метаданные.ОпределяемыеТипы.ItobКонтрагент.Тип.Типы();
	ТипыСклады = Метаданные.ОпределяемыеТипы.ItobСклад.Тип.Типы();
	
	ТекстЗапроса = "";
	Если НЕ ОбщегоНазначения.ДанныеСовпадают(ТипыКонтрагенты, ТипыСклады) Тогда
		ТекстЗапроса = " ССЫЛКА " + "Справочник." + ItobВызовСервераПовтИсп.ПолучитьИмяОбъекта("Склады");
	КонецЕсли; 
	
	 	
	Возврат ТекстЗапроса;
	
КонецФункции
 
#КонецОбласти 