////////////////////////////////////////////////////////////////////////////////
// Модуль хранит повторно-используемые значения для работы с библиотекой CsmHandler.
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает указатель на библиотеку CsmHandler.
//
// Параметры:
//  ТекстОшибки	 - Строка	 - Текст ошибки.
// 
// Возвращаемое значение:
//  AddIn.ItobCsmHandler.CsmHandler -  Указатель на библиотеку CsmHandler.
//
Функция ПолучитьБиблиотеку(ТекстОшибки = "") Экспорт

	Результат = ПодключитьВнешнююКомпоненту("ОбщийМакет.ItobCsmHandler", "ItobCsmHandler", ТипВнешнейКомпоненты.Native);
	Если (НЕ Результат) Тогда
		ТекстОшибки = НСтр("ru = 'Ошибка подключения библиотеки CsmHandler.'; en = 'Error connecting CsmHandler library.'");		  
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
		Библиотека = Новый("AddIn.ItobCsmHandler.CSMouterSchell1c");
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		Возврат Неопределено;
	КонецПопытки;
	
	Если Библиотека = Null Тогда
		ТекстОшибки = НСтр("ru = 'Ошибка создания библиотеки CsmHandler.'; en = 'Error creating CsmHandler library.'");
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Библиотека;
	
КонецФункции

// Возвращает флаг использования библиотеки CsmHandler.
// 
// Возвращаемое значение:
//  Булево - Библиотека используется.
//
Функция ИспользованиеCsmHandlerВключено() Экспорт
	
	//ИспользоватьCsmHandler = Константы.ItobИспользоватьCsmHandler.Получить();
	//Если ИспользоватьCsmHandler Тогда	
	//	ТекстОшибки = "";
	//	ВерсияБиблиотеки = ItobCsmHandlerJSON.Версия(ТекстОшибки);
	//	
	//	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
	//		ItobРаботаС_БСП_КлиентСервер.СообщитьПользователю(НСтр("ru = 'Неудачная попытка использовать CsmHandler'; en = 'Unsuccessful attempt to use CsmHandler'") + " " + ТекстОшибки);
	//		Возврат Ложь;
	//	КонецЕсли; 
	//	
	//	ВерсияБиблиотекиМногострочная = СтрЗаменить(ВерсияБиблиотеки, ".", Символы.ПС);
	//	
	//	Редакция = СтрПолучитьСтроку(ВерсияБиблиотекиМногострочная, 1);
	//	Подредакция  = СтрПолучитьСтроку(ВерсияБиблиотекиМногострочная, 2);
	//	Релиз = СтрПолучитьСтроку(ВерсияБиблиотекиМногострочная, 3);
	//	
	//	ПолныйНомерВерсииЧисло = Редакция * 10000 + Подредакция * 100 + Релиз;			
	//	
	//	Если ПолныйНомерВерсииЧисло < 20001 Тогда
	//		ItobРаботаС_БСП_КлиентСервер.СообщитьПользователю(НСтр("ru = 'CsmHandler не используется, необходимо обновить до версии 2.0.1'; en = 'CsmHandler is not used, it needs to be updated to version 2.0.1'"));			
	//		Возврат Ложь;		
	//	КонецЕсли;	
	//КонецЕсли;	
	
	
	Возврат Истина;

КонецФункции

#КонецОбласти
