#Область СлужебныйПрограммныйИнтерфейс

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	мЗапрос = Новый Запрос;
	мЗапрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатАктОсмотраВагоны.Вагон КАК ТС,
	|	уатАктОсмотраВагоны.РезультатОсмотра КАК Состояние,
	|	уатАктОсмотраВагонов.ДатаОкончанияОсмотра КАК ДатаОкончания,
	|	уатАктОсмотраВагонов.ДатаОсмотра КАК Период
	|ИЗ
	|	Документ.уатАктОсмотраВагонов КАК уатАктОсмотраВагонов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уатАктОсмотраВагонов.Вагоны КАК уатАктОсмотраВагоны
	|		ПО уатАктОсмотраВагонов.Ссылка = уатАктОсмотраВагоны.Ссылка
	|ГДЕ
	|	уатАктОсмотраВагонов.Ссылка = &Ссылка";
	мЗапрос.УстановитьПараметр("Ссылка",ДокументСсылка);
	
	ТаблицаДокумента = мЗапрос.Выполнить().Выгрузить();

	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСостоянийТС", ТаблицаДокумента);
КонецПроцедуры

Процедура ВыполнитьКонтроль(ДокументСсылка, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
	
	
КонецПроцедуры

#КонецОбласти