////////////////////////////////////////////////////////////////////////////////
// Обработка событий начала работы с Центром спутникового мониторинга
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Перед началом работы системы.
//
// Параметры:
//  Параметры	 - Структура - Параметры работы системы.
//
Процедура ПередНачаломРаботыСистемы(Параметры) Экспорт

	Если мкПараметрыПриложения = Неопределено Тогда
		мкПараметрыПриложения = Новый Соответствие;
	КонецЕсли;
	
	Если НЕ ItobВызовСервераПовтИсп.ПользовательИспользуетЦСМ() Тогда
		Возврат;
	КонецЕсли;	
					
	ItobВызовСервераПолныеПрава.ПроверитьНаличиеПодсистемыЦентрСпутниковогоМониторинга();
	
	// Устанавливает часовой пояс текущего сеанса
	ItobОперативныйМониторингКлиент.ОпределениеЧасовогоПоясаСеанса();
	
КонецПроцедуры // ПередНачаломРаботыСистемы()

// При начале работы системы.
//
// Параметры:
//  Параметры	 - Структура - Параметры работы системы.
//
Процедура ПриНачалеРаботыСистемы(Параметры) Экспорт
	
	Если НЕ ItobВызовСервераПовтИсп.ПользовательИспользуетЦСМ() Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ItobЦентрСпутниковогоМониторинга.События") Тогда
		МодульОбработкаСобытийВызовСервера = ОбщегоНазначенияКлиент.ОбщийМодуль("ItobОбработкаСобытийВызовСервера");
		МодульОбработкаСобытийВызовСервера.УстановитьДатуНачалаВыборкиСобытий();
	КонецЕсли;
	
	// ItobЦентрСпутниковогоМониторинга.ПользователиИПраваДоступа
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ItobЦентрСпутниковогоМониторинга.ПользователиИПраваДоступа") Тогда
		ОбщийМодуль = ОбщегоНазначенияКлиент.ОбщийМодуль("ItobПользователиИПраваДоступаКлиент");
		ОбщийМодуль.ПриНачалеРаботыСистемы(Параметры);
	КонецЕсли;
	// Конец ItobЦентрСпутниковогоМониторинга.ПользователиИПраваДоступа
		
	ItobОперативныйМониторингКлиент.ПроверитьВариантПодключения();	

КонецПроцедуры

#КонецОбласти
