
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НачПериодаРегулирование(Элемент, Направление, СтандартнаяОбработка)
	Если Объект.НачПериода = '00010101' Тогда
		Объект.НачПериода = НачалоДня(ItobОбщегоНазначенияКлиент.ТекущаяДатаНаКлиенте());
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура КонПериодаРегулирование(Элемент, Направление, СтандартнаяОбработка)
	Если Объект.КонПериода = '00010101' Тогда
		Объект.КонПериода = КонецДня(ItobОбщегоНазначенияКлиент.ТекущаяДатаНаКлиенте());
	КонецЕсли; 
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьИнтервал(Команда)
	ItobОбщегоНазначенияКлиент.УстановитьИнтервал(Объект, Объект.НачПериода, Объект.КонПериода)
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПересчет(Команда)
	
	ПересчетВыработкиСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьДубли(Команда)
	УдалитьДублиНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПересчетВыработкиСервер()

	РеквизитФормыВЗначение("Объект").Пересчитать(Объект.Терминал, Объект.НачПериода, Объект.КонПериода);

КонецПроцедуры

&НаСервере
Процедура УдалитьДублиНаСервере()
	
	РеквизитФормыВЗначение("Объект").УдалитьДублиКалькуляции(Объект.Терминал);
	
КонецПроцедуры

#КонецОбласти
