
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Тара") Тогда 
		Для Каждого ТекСтрока Из Параметры.Тара Цикл 
			НайдСтроки = ТаблицаТары.НайтиСтроки(Новый Структура("Тара", ТекСтрока.Тара));
			Если НайдСтроки.Количество() = 0 Тогда 
				СтрокаТары = ТаблицаТары.Добавить();
				СтрокаТары.Тара = ТекСтрока.Тара;
			Иначе 
				СтрокаТары = НайдСтроки[0];
			КонецЕсли;
			
			СтрокаТары.Количество = СтрокаТары.Количество + ТекСтрока.Количество;
			СтрокаТары.ВесТары    = СтрокаТары.ВесТары + ТекСтрока.ВесТары;
		КонецЦикла;
	КонецЕсли;
	
	ПредставлениеЕдиницыИзмеренияВеса = уатОбщегоНазначенияПовтИсп.ПолучитьПредставлениеОсновнойЕдиницыИзмеренияВеса();
	Если ЗначениеЗаполнено(ПредставлениеЕдиницыИзмеренияВеса) Тогда
		Элементы.ТаблицаТарыВесТары.Заголовок = НСтр("en='Tare weight';ru='Вес тары'") + ", " + ПредставлениеЕдиницыИзмеренияВеса;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
