
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ВладелецФормы = Неопределено Тогда
		Отказ = Истина;
		ПоказатьПредупреждение(Неопределено, НСтр("en='Immediate opening for this object is prohibited!';ru='Непосредственное открытие для данного объекта запрещено!'"));
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ВладелецФормы.СтруктураНастроек) = Тип("Структура") Тогда
		СтруктураНастроек = ВладелецФормы.СтруктураНастроек;
	Иначе
		СтруктураНастроек = СтруктураНастроекПоУмолчанию();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, СтруктураНастроек);
	Если ПунктНаименование Тогда
		НастройкаПунктПредставление = 0;
	ИначеЕсли ПунктКраткоеНаименование Тогда
		НастройкаПунктПредставление = 1;
	ИначеЕсли ПунктАдрес Тогда
		НастройкаПунктПредставление = 2;
	КонецЕсли;
	НастройкаПунктИспользование = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	ПараметрыЗакрытия = ПолучитьСтруктуруНастроек();
	Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЭтапВремяВПутиПриИзменении(Элемент)
	// Длительность и время в пути не должны отображаться одновременно
	Если ЭтапВремяВПути Тогда
		ЭтапДлительность = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЭтапДлительностьПриИзменении(Элемент)
	// Длительность и время в пути не должны отображаться одновременно
	Если ЭтапДлительность Тогда
		ЭтапВремяВПути = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция СтруктураНастроекПоУмолчанию() 
	Возврат Обработки.уатРедактированиеСхемыПеревозки_уэ.СтруктураНастроекПоУмолчанию();
КонецФункции

Функция ПолучитьСтруктуруНастроек() 
	СтруктураНастроек = СтруктураНастроекПоУмолчанию();
	
	ПунктНаименование = НастройкаПунктПредставление = 0;
	ПунктКраткоеНаименование = НастройкаПунктПредставление = 1; 
	ПунктАдрес = НастройкаПунктПредставление = 2;
	
	ЗаполнитьЗначенияСвойств(СтруктураНастроек, ЭтаФорма);
	Возврат СтруктураНастроек;
КонецФункции

#КонецОбласти