
#Область ОбработчикиСобытийФормы 

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		уатОбщегоНазначенияКлиент.ОбработатьСобытиеПодключаемогоОборудования(ИмяСобытия, Параметр, Источник);
	КонецЕсли;
	// Конец ПодключаемоеОборудование
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы 

&НаКлиенте
Процедура ВыполнитьПоиск(Команда) 
	
	РезультатПоиска = ПоискОбъектовПоТрекНомеру(ВведеннаяСтрокаПоиска); 
	
	Если ТипЗнч(РезультатПоиска) = Тип("Строка") Тогда  
		ПоказатьПредупреждение(,РезультатПоиска);
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(РезультатПоиска) = Тип("ДокументСсылка.уатЗаказГрузоотправителя") 
		ИЛИ ТипЗнч(РезультатПоиска) = Тип("ДокументСсылка.уатПотребностьВПеревозке_уэ") Тогда
		СсылкаНаДокумент = РезультатПоиска;
	КонецЕсли;
		
	уатОбщегоНазначенияКлиент.ОбработатьПолучениеОбъектаПоШтрихкоду(СсылкаНаДокумент, ЭтаФорма);
		
КонецПроцедуры

#КонецОбласти 


#Область СлужебныеПроцедурыИФункции 

&НаСервереБезКонтекста
Функция ПоискОбъектовПоТрекНомеру(ТрекНомер)
	
	Запрос = Новый Запрос();
	// Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	//               |	уатШтрихкоды.Объект КАК Объект,
	//               |	уатШтрихкоды.ЗаказГрузоотправителя КАК ЗаказГрузоотправителя,
	//               |	уатШтрихкоды.Штрихкод КАК Штрихкод,
	//               |	ВЫБОР
	//               |		КОГДА ТИПЗНАЧЕНИЯ(уатШтрихкоды.ЗаказГрузоотправителя) = ТИП(Документ.уатЗаказГрузоотправителя)
	//               |			ТОГДА 1
	//               |		ИНАЧЕ 2
	//               |	КОНЕЦ КАК Приоритет
	//               |ИЗ
	//               |	РегистрСведений.уатШтрихкоды КАК уатШтрихкоды
	//               |ГДЕ
	//               |	уатШтрихкоды.Штрихкод ПОДОБНО ""%"" + &Штрихкод + ""%""
	//               |
	//               |УПОРЯДОЧИТЬ ПО
	//               |	Приоритет";
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	               |	уатШтрихкоды.Объект КАК Объект,
	               |	уатШтрихкоды.ЗаказГрузоотправителя КАК ЗаказГрузоотправителя,
	               |	уатШтрихкоды.Штрихкод КАК Штрихкод,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(уатШтрихкоды.ЗаказГрузоотправителя) = ТИП(Документ.уатЗаказГрузоотправителя)
	               |			ТОГДА 1
	               |		ИНАЧЕ 2
	               |	КОНЕЦ КАК Приоритет
	               |ИЗ
	               |	РегистрСведений.уатШтрихкоды КАК уатШтрихкоды
	               |ГДЕ
	               |	уатШтрихкоды.Штрихкод = &Штрихкод
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Приоритет";
	
	Запрос.УстановитьПараметр("Штрихкод", ТрекНомер); 
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		Если ЗначениеЗаполнено(Выборка.ЗаказГрузоотправителя) Тогда
			СсылкаНаДокумент = Выборка.ЗаказГрузоотправителя;
		Иначе
			СсылкаНаДокумент = Выборка.Объект;
		КонецЕсли;
		
		Возврат СсылкаНаДокумент;
		
	Иначе 	
		ТекстСообщения = НСтр("ru = 'По данному трек-номеру объектов не обнаружено'; en = 'No objects were found with this tracking number.'");
		Возврат ТекстСообщения;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
