
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("МассивДокументов") Тогда
		Для Каждого ТекДокумент Из Параметры.МассивДокументов Цикл
			НоваяСтрока = ТаблицаДокументов.Добавить();
			НоваяСтрока.Документ = ТекДокумент
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ТаблицаДокументов

&НаКлиенте
Процедура ТаблицаДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекСтрокаТаблицы = Элемент.ТекущиеДанные;
	Если ТекСтрокаТаблицы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение(, ТекСтрокаТаблицы.Документ);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьДокумент(Команда)
	
	ТекСтрокаТаблицы = Элементы.ТаблицаДокументов.ТекущиеДанные;
	Если ТекСтрокаТаблицы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение(, ТекСтрокаТаблицы.Документ);
	
КонецПроцедуры

#КонецОбласти