
#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	Если Значение Тогда
		// Константа установлена в значение Истина, то есть алгоритм маршрутизации включен.
		ТекстНСтр = НСтр("ru = 'Для получения параметров подключения к серверу маршрутизации Рарус VRP нужно обратиться в техподдержку по адресу auto@rarus.ru'; en = 'To obtain connection parameters to the Rarus VRP routing server, please contact technical support at auto@rarus.ru'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСтр);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
