#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаспознаваниеДокументовСлужебный.АктуализироватьОбъектыСвязанныеСРаспознаннымДокументом(Параметры.РаспознанныйДокумент);
	
	ЗагрузитьСвязанные();
	
	// Эксперимент с отображением пустой таблицы связанных документов
	//
	//Если СвязанныеДокументы.Количество() = 0 Тогда
	//	Отказ = Истина;
	//КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСвязанныеДокументы

&НаКлиенте
Процедура СвязанныеДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "СвязанныеДокументыСсылка" Тогда
		ПоказатьЗначение(, Элемент.ТекущиеДанные.Ссылка);
	ИначеЕсли Поле.Имя = "СвязанныеДокументыКоманда" Тогда
		Если Элемент.ТекущиеДанные.ПотенциальныйКандидат Тогда
			ПрикрепитьНаСервере(Элемент.ТекущиеДанные.Ссылка);
			Оповестить("ПрикрепленСканДокумента");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПрикрепитьНаСервере(Кандидат)
	
	ДокументОбъект = Параметры.РаспознанныйДокумент.ПолучитьОбъект();
	
	Документы.РаспознанныйДокумент.ОтметитьДокументОбработанным(ДокументОбъект);
	
	АдресКартинки = ПоместитьВоВременноеХранилище(ДокументОбъект.ИсходноеИзображение.Получить());
	РаспознаваниеДокументовСлужебный.ДобавитьПрисоединенныйФайл(ДокументОбъект, Кандидат.Ссылка, АдресКартинки);
	УдалитьИзВременногоХранилища(АдресКартинки);
	
	ЗагрузитьСвязанные();
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСвязанные()
	
	СвязанныеДокументы.Загрузить(
		РегистрыСведений.СвязанныеОбъектыРаспознаниеДокументов.ВсеСвязанныеДокументы(Параметры.РаспознанныйДокумент)
	);
	
	Для Каждого Документ Из СвязанныеДокументы Цикл 
		
		Если Документ.ПотенциальныйКандидат Тогда
			
			Документ.Команда = НСтр("ru = 'Прикрепить скан'; en = 'Attach scanned copy'");
			
		Иначе
			
			Документ.Картинка = БиблиотекаКартинок.Картинка;
			Документ.Команда = НСтр("ru = 'Скан уже прикреплен'; en = 'Scanned copy is already attached'");
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти