
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ИмяМакета = "ИнструкцияНастройкаРарусVRP";
	Макет = Обработки.уатАРМЛогиста_уэ.ПолучитьМакет(ИмяМакета);
	ПотокДляЧтения = Макет.ОткрытьПотокДляЧтения();
	ПолеPDFДокумента.Прочитать(ПотокДляЧтения);
	
	Заголовок = НСтр("en='Information about routing settings for Rarus VRP in Logistician AWP';
		|ru='Инструкция по настройке маршрутизации Рарус VRP в АРМ Логиста'");
	
КонецПроцедуры

#КонецОбласти
