#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция НайтиСоздать(Наименование) Экспорт
	
	Ссылка = НайтиПоНаименованию(Наименование, Истина);
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Возврат Ссылка;
	КонецЕсли;
	
	Результат = СоздатьЭлемент();
	Результат.Заполнить(Неопределено);
	Результат.Наименование = Наименование;
	Если Результат.ПроверитьЗаполнение() Тогда
		Результат.Записать();
		Возврат Результат.Ссылка;
	КонецЕсли;
	
	Возврат ПустаяСсылка();
	
КонецФункции

#КонецОбласти

#КонецЕсли
