
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	уатЗащищенныеФункцииСервер.уатДокументФормаСпискаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("СписокТС") Тогда
		ПараметрОтборПоТС = Истина;
		ПараметрСписокТС.ЗагрузитьЗначения(Параметры.СписокТС.ВыгрузитьЗначения());
	Иначе
		ПараметрОтборПоТС = Ложь;
		Элементы.ГруппаОтборПоТС.Видимость = Ложь;
	КонецЕсли;
	УстановитьПараметрСписокТС();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	уатЗащищенныеФункцииКлиент.уатДокументФормаСпискаПриОткрытии(Отказ, ЭтотОбъект, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийРеквизитовФормы

&НаКлиенте
Процедура ПараметрОтборПоТСПриИзменении(Элемент)
	УстановитьПараметрСписокТС();
КонецПроцедуры

&НаКлиенте
Процедура ПараметрСписокТСПриИзменении(Элемент)
	УстановитьПараметрСписокТС();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Процедура УстановитьПараметрСписокТС()
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ОтбиратьПоТС", ПараметрОтборПоТС);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "СписокТС", ПараметрСписокТС);
КонецПроцедуры

#КонецОбласти
