
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	уатЗащищенныеФункцииСервер.уатСправочникФормаЭлементаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, Объект, ЭтотОбъект, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов

	Если НЕ Объект.ЭтоГруппа Тогда
		ПрочитатьЦветЗоны(Объект.Ссылка);
	КонецЕсли;
		
	ЭтоКОРП  = уатОбщегоНазначенияПовтИсп.ВариантПоставкиКОРП(); 
	ЭтоТакси = уатОбщегоНазначенияПовтИсп.ВариантПоставкиТакси();
	Элементы.Страницы.Видимость      = ЭтоКОРП ИЛИ ЭтоТакси;
	Элементы.ГруппаЗаливка.Видимость = ЭтоКОРП ИЛИ ЭтоТакси;
	Элементы.Основная.Видимость      = ЭтоКОРП ИЛИ ЭтоТакси;

	Если Объект.Ссылка.Пустая() Тогда
		ОбновлятьПривязкуПунктовПриЗаписи = Истина;
	КонецЕсли;
	ПрочитатьПунктыГеозоны();
	
	Если ЭтоКОРП Тогда  
		ТипАвторизацииЯндекс                    = уатЭлектронныеКартыСервер.ПолучитьНастройкуСервераКартографииМаршрутизации("Маршрутизация_ТипАвторизации");
		Маршрутизация_Токен                     = уатЭлектронныеКартыСервер.ПолучитьНастройкуСервераКартографииМаршрутизации("Маршрутизация_Токен");
		Элементы.ГруппаЯндекс.Доступность       = ТипАвторизацииЯндекс = "OAuth-токен" И ЗначениеЗаполнено(Маршрутизация_Токен); 
		
		МодульВнешнийМаршрутизаторСервер = ОбщегоНазначения.ОбщийМодуль("уатВнешнийМаршрутизаторСервер_уэ");
		МодульВнешнийМаршрутизаторСервер.УстановитьСписокВыбораЦветовВПоле(Элементы.ЦветЯндекс); 
		Если НЕ ЗначениеЗаполнено(Объект.ЦветЯндекс) Тогда
			УстановитьСлучайныйЦветГеозоныЯндекс(); 
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Объект.НомерЯндекс) Тогда
			Элементы.НомерЯндекс.ПодсказкаВвода = Объект.Наименование;
		КонецЕсли;
		
	Иначе
		Элементы.ГруппаЯндекс.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	уатЗащищенныеФункцииКлиент.уатСправочникФормаЭлементаПриОткрытии(Отказ, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаписатьЦветЗоны(ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов

	ОбновитьПривязкуПунктовПриЗаписи(ТекущийОбъект);
	ПрочитатьПунктыГеозоны();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ЗаписьЭлементаЗоны",, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЦветЗоныНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	КрасныйЦвет = ?(ЦветЗоны.Красный=-1, 255, ЦветЗоны.Красный);
	ЗеленыйЦвет = ?(ЦветЗоны.Зеленый=-1, 255, ЦветЗоны.Зеленый);
	СинийЦвет   = ?(ЦветЗоны.Синий=-1,   255, ЦветЗоны.Синий);
	
	ПараметрыФормы = Новый Структура("Красный, Зеленый, Синий", КрасныйЦвет, ЗеленыйЦвет, СинийЦвет);
	
	ОповеститьОВыбореЦвета = Новый ОписаниеОповещения("ЦветЗоныПослеВыбора", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.уатГеозоны_уэ.Форма.ФормаВыбораЦвета", ПараметрыФормы, Элемент,,,, ОповеститьОВыбореЦвета);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветЗоныПослеВыбора(Результат, ДопПараметры) Экспорт
	
	Если Не Результат = Неопределено Тогда 
		ЦветЗоны = Новый Цвет(Результат.Красный, Результат.Зеленый, Результат.Синий);
		ЭтотОбъект.Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КоординатыПриИзменении(Элемент)
	ОбновлятьПривязкуПунктовПриЗаписи = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОсновнаяПриИзменении(Элемент) 
	Если ЕстьОсновнаяГеозона(Объект.Ссылка) Тогда  
		ТекстНСТР = НСтр("ru = 'Сменить основную геозону?'; en = 'Change the main geofence?'");
		Оповещение = Новый ОписаниеОповещения("ИспользоватьОсновнойОтветНаВопрос", ЭтотОбъект, Объект.Ссылка);
		ПоказатьВопрос(Оповещение, ТекстНСТР, РежимДиалогаВопрос.ДаНет);
	Иначе
		ИспользоватьКакОсновнаяГеозона(Объект.Ссылка);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	Если НЕ ЗначениеЗаполнено(Объект.НомерЯндекс) Тогда
		Элементы.НомерЯндекс.ПодсказкаВвода = Объект.Наименование;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов
&НаКлиенте
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовОбъекта(Команда)
	ЗапретРедактированияРеквизитовОбъектовКлиент.РазрешитьРедактированиеРеквизитовОбъекта(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов

&НаКлиенте
Процедура ОпределитьПункты(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(Неопределено, "Перед автоопределением пунктов геозоны необходимо записать элемент");
		Возврат;
	КонецЕсли;
	
	Оповещ = Новый ОписаниеОповещения("ОпределитьПунктыВопрос", ЭтотОбъект);
	ПоказатьВопрос(Оповещ,
		"Существующая привязка пунктов к данной геозоне будет удалена!
		|Операция может занять длительное время!
		|Продолжить?", РежимДиалогаВопрос.ОКОтмена);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьЯндекс(Команда)
	Если Объект.Координаты.Количество() = 0  Тогда
		ТекстНСТР = НСтр("ru = 'Не заполнены координаты.'; en = 'Coordinates are not filled in.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР,,"Объект.Координаты");
		Возврат;
	КонецЕсли; 
	Если Объект.Координаты.Количество() < 3  Тогда
		ТекстНСТР = НСтр("ru = 'Необходимо указать как минимум 3 точки.'; en = 'At least 3 points must be specified.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР,,"Объект.Координаты");
		Возврат;
	КонецЕсли;
	Если Объект.Координаты.Количество() > 1000  Тогда
		ТекстНСТР = НСтр("ru = 'Геозона не может содержать более 1000 точек.'; en = 'A geofence cannot contain more than 1000 points.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР,,"Объект.Координаты");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.НомерЯндекс) Тогда
		Объект.НомерЯндекс = Объект.Наименование;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.НомерЯндекс) Тогда
		ТекстНСТР = НСтр("ru = 'Не заполнено наименование зоны в Яндекс.Маршрутизации.'; en = 'The zone name in Yandex.Routing is not filled in.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР,,"Объект.НомерЯндекс");
		Возврат;
	КонецЕсли;
	МодульВнешнийМаршрутизаторСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("уатВнешнийМаршрутизаторСервер_уэ");
	ЦветЗоны       = МодульВнешнийМаршрутизаторСервер.ПолучитьЦветГеозоныЯндекс(Объект.ЦветЯндекс);
	
	ТекстОшибки    = "";
	ГеозонаСоздана = МодульВнешнийМаршрутизаторСервер.СоздатьГеозонуЯндекс(Объект, Объект.ИдентификаторЯндекс, ЦветЗоны, ТекстОшибки);
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	Иначе
		ПоказатьОповещениеПользователя(НСтр("ru = 'Геозона выгружена в Яндекс.'; en = 'Geofence uploaded to Yandex.'"), , , БиблиотекаКартинок.Информация32);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОпределитьПунктыВопрос(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.ОК Тогда
		уатОбщегоНазначения_уэ.уатПривязкаПунктовНазначенияКГеозонам(, Объект.Ссылка);
		ПрочитатьПунктыГеозоны();
		ОбновлятьПривязкуПунктовПриЗаписи = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПрочитатьЦветЗоны(Знач Геозона)
	
	Цвет = Геозона.ЦветЗоныХранилище.Получить();
	Если Цвет = Неопределено Тогда 
		ЦветЗоны = Новый Цвет();
	Иначе 
		ЦветЗоны = Цвет;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьЦветЗоны(ТекущийОбъект)
	
	Если НЕ ТекущийОбъект.Ссылка.ЭтоГруппа Тогда
		ТекущийОбъект.ЦветЗоныХранилище = Новый ХранилищеЗначения(ЦветЗоны, Новый СжатиеДанных(9));
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПрочитатьПунктыГеозоны()
	
	КоличествоПунктовНазначения = 0;
	
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(уатПривязкаПунктовНазначенияКГеозонам.ПунктНазначения) КАК Количество
	|ИЗ
	|	РегистрСведений.уатПривязкаПунктовНазначенияКГеозонам_уэ КАК уатПривязкаПунктовНазначенияКГеозонам
	|ГДЕ
	|	уатПривязкаПунктовНазначенияКГеозонам.Геозона = &Геозона");
	Запрос.УстановитьПараметр("Геозона", Объект.Ссылка);
	
	ВыборкаПункты = Запрос.Выполнить().Выбрать();
	Если ВыборкаПункты.Количество() > 0 Тогда
		ВыборкаПункты.Следующий();
		КоличествоПунктовНазначения = ВыборкаПункты.Количество;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПривязкуПунктовПриЗаписи(ТекущийОбъект)
	
	Если ОбновлятьПривязкуПунктовПриЗаписи Тогда
		флКоординатыЗаданы = Истина;
		Если ТекущийОбъект.Координаты.Количество() < 3 Тогда
			флКоординатыЗаданы = Ложь;
		Иначе
			Для Каждого ТекСтрока Из ТекущийОбъект.Координаты Цикл
				Если ТекСтрока.Лат = 0 ИЛИ ТекСтрока.Лон = 0 Тогда
					флКоординатыЗаданы = Ложь;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		Если флКоординатыЗаданы Тогда
			уатОбщегоНазначения_уэ.уатПривязкаПунктовНазначенияКГеозонам(, Объект.Ссылка);
			ОбновлятьПривязкуПунктовПриЗаписи = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИспользоватьКакОсновнаяГеозона(Знач Геозона)
	
	Справочники.уатГеозоны_уэ.ИспользоватьКакОсновнаяГеозона(Геозона, Ложь);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьОсновнаяГеозона(Знач Геозона)
	
	Возврат Справочники.уатГеозоны_уэ.ЕстьОсновнаяГеозона(Геозона);
	
КонецФункции

&НаКлиенте
Процедура ИспользоватьОсновнойОтветНаВопрос(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда 
		ИспользоватьКакОсновнаяГеозона(Объект.Ссылка);
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура УстановитьСлучайныйЦветГеозоныЯндекс()
	
	Объект.ЦветЯндекс = уатЗащищенныеФункцииСервер_проф.СлучайноеЧисло(, 15);
	
	Если Объект.ЦветЯндекс = 0 
		ИЛИ Объект.ЦветЯндекс = 1 
		ИЛИ Объект.ЦветЯндекс = 3
		ИЛИ Объект.ЦветЯндекс = 4
		ИЛИ Объект.ЦветЯндекс = 7
		ИЛИ Объект.ЦветЯндекс = 11 Тогда 
		Объект.ЦветЯндекс = 16;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
