
Процедура ПриСозданииНаСервере(Форма, ДополнительныеПараметры = Неопределено) Экспорт

	#Область Документы	
	
	#Область уатПутевойЛист							
	Если Форма.ИмяФормы = "Документ.уатПутевойЛист.Форма.ФормаДокумента" Тогда	
		
		Если Форма.Объект.Ссылка.Пустая() Тогда
			
		Иначе
			
			Если РольДоступна("ПолныеПрава") 
				Или РольДоступна("GDS_УчетПринятыхОригиналовДокументов") Тогда  
				
				Форма.Элементы.GDS_ОригиналДокуумента.Заголовок = "Оригинал отсутствует!!!";
				Форма.Элементы.GDS_ОригиналДокуумента.ЦветТекста = WebЦвета.Красный; 
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	GDS_ПринятыеОригиналыДокументовСрезПоследних.Период КАК Период
				|ИЗ
				|	РегистрСведений.GDS_ПринятыеОригиналыДокументов.СрезПоследних КАК GDS_ПринятыеОригиналыДокументовСрезПоследних
				|ГДЕ
				|	GDS_ПринятыеОригиналыДокументовСрезПоследних.Документ = &Документ";
				
				Запрос.УстановитьПараметр("Документ", Форма.Объект.Ссылка);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					Форма.Элементы.GDS_ОригиналДокуумента.Заголовок = "Оригинал принят " + Формат(ВыборкаДетальныеЗаписи.Период,"ДФ=dd.MM.yyyy") + "г.!!!";
					Форма.Элементы.GDS_ОригиналДокуумента.ЦветТекста = WebЦвета.Зеленый; 
				КонецЦикла;
				
			КонецЕсли; 
		КонецЕсли; 
		Возврат;
	КонецЕсли;
	#КонецОбласти  
	
	#КонецОбласти
	
КонецПроцедуры
