
#Область ОбработчикиСобытий

&НаКлиенте
// Обработчик команды
//
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если НЕ ЗначениеЗаполнено(ПараметрКоманды) Тогда
		Возврат;	
	КонецЕсли;
	
	ПараметрыФормыВладельца = ItobОбщегоНазначенияКлиент.СоздатьПараметрыФормыВладельца();
	ПараметрыФормыВладельца.Владелец         = ПараметрыВыполненияКоманды.Источник;
	ПараметрыФормыВладельца.КлючУникальности = Новый УникальныйИдентификатор;
	ПараметрыФормыВладельца.Окно             = ВариантОткрытияОкна.ОтдельноеОкно;
	
	ПараметрыДляПередачи = Новый Структура;
	ПараметрыДляПередачи.Вставить("РедактируемаяЗона", ПараметрКоманды);
	
	ОткрытьФорму("Обработка.ItobРедактированиеГеографическихЗон.Форма", ПараметрыДляПередачи, ПараметрыФормыВладельца.Владелец, 
	Строка(ПараметрыФормыВладельца.КлючУникальности), ПараметрыФормыВладельца.Окно,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	
КонецПроцедуры

#КонецОбласти
