
#Область ПрограммныйИнтерфейс

//@skip-check module-empty-method
// Обработчик заполнения документа.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма:
//  ДанныеЗаполнения - произвольный - данные для заполнения
Процедура ОбработкаЗаполненияНаФормеЭТрН(Форма, ДанныеЗаполнения) Экспорт
КонецПроцедуры

//@skip-check module-empty-method
// Обработчик заполнения документа.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма:
//  ДанныеЗаполнения - произвольный - данные для заполнения
Процедура ОбработкаЗаполненияНаФормеЭСВ(Форма, ДанныеЗаполнения) Экспорт
КонецПроцедуры

//@skip-check module-empty-method
// Обработчик заполнения документа.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма:
//  ДанныеЗаполнения - произвольный - данные для заполнения
Процедура ОбработкаЗаполненияНаФормеЭЗН(Форма, ДанныеЗаполнения) Экспорт
КонецПроцедуры

//@skip-check module-empty-method
// Обработчик заполнения документа.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма:
//  ДанныеЗаполнения - произвольный - данные для заполнения
Процедура ОбработкаЗаполненияНаФормеЭЗЗ(Форма, ДанныеЗаполнения) Экспорт
КонецПроцедуры

//@skip-check module-empty-method
// Обработчик заполнения документа.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма:
//  ДанныеЗаполнения - произвольный - данные для заполнения
Процедура ОбработкаЗаполненияНаФормеЭПЛ(Форма, ДанныеЗаполнения) Экспорт
КонецПроцедуры

//@skip-check module-empty-method
// Обработчик заполнения документа.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма:
//  ДанныеЗаполнения - произвольный - данные для заполнения
Процедура ОбработкаЗаполненияНаФормеЭДФ(Форма, ДанныеЗаполнения) Экспорт
КонецПроцедуры

//@skip-check module-empty-method
// При вводе адреса.
// 
// Параметры:
//  ПараметрыФормыВводаАдреса - Структура - Параметры формы ввода адреса
//  ДополнительныеПараметры - Структура - Дополнительные параметры
//  Оповещение - ОписаниеОповещения - Оповещение о завершении
//  СтандартнаяОбработка - Булево - Стандартная обработка
Процедура ПриВводеАдреса(ПараметрыФормыВводаАдреса, ДополнительныеПараметры, Оповещение, СтандартнаяОбработка) Экспорт
	// {УАТ}
	СтандартнаяОбработка = уатОбменСГИСЭПДКлиент.ВводАдреса(ПараметрыФормыВводаАдреса,
	ДополнительныеПараметры.ИмяЭлемента, ДополнительныеПараметры.Форма, Оповещение,
	ДополнительныеПараметры.ТекущиеДанные);
	// {/УАТ}
КонецПроцедуры

//@skip-check module-empty-method
// При завершении ввода адреса.
// 
// Параметры:
//  Результат - Произвольный - Результат ввода адреса
//  ДополнительныеПараметры - Структура - Дополнительные параметры
Процедура ПриЗавершенииВводаАдреса(Результат, ДополнительныеПараметры) Экспорт
	// {УАТ}
	Результат = уатОбменСГИСЭПДКлиент.ВводАдреса_Завершение(Результат, ДополнительныеПараметры);
	// {/УАТ}
КонецПроцедуры

// Список выбор на форме списка ЭПД.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма
//  Элемент - ПолеФормы - Элемент формы списка
//  ВыбраннаяСтрока - Произвольный - Выбранная строка
//  Поле - ПолеФормы - Поле формы списка
//  СтандартнаяОбработка - Булево - Стандартная обработка (требуется установить Ложь, если дальнейшая обработка не требуется)
Процедура СписокВыборНаФормеСпискаЭПД(Форма, Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) Экспорт
	Элементы = Форма.Элементы;
	// {УАТ}
	Если Поле = Элементы.ДокументОснование Тогда 
		СтандартнаяОбработка = Ложь;
		
		ДанныеСтроки       = Элементы.Список.ДанныеСтроки(ВыбраннаяСтрока);
		ДокументыОснования = уатОбменСГИСЭПД.ПолучитьДокументыОснования(ДанныеСтроки.Ссылка);
		Если ДокументыОснования.Количество() = 1 Тогда
			ПоказатьЗначение(Неопределено, ДокументыОснования[0].ДокументОснование);
		ИначеЕсли ДокументыОснования.Количество() > 1 Тогда
			ПараметрыФормы = Новый Структура;
			
			МассивДокументов = Новый Массив;
			Для Каждого СтрТаб Из ДокументыОснования Цикл
				МассивДокументов.Добавить(СтрТаб.ДокументОснование);	
			КонецЦикла;
			
			ПараметрыФормы.Вставить("ТипДокумента",     ТипЗнч(ДанныеСтроки.Ссылка));
			ПараметрыФормы.Вставить("МассивДокументов", МассивДокументов); 
			
			ОписаниеДокументыОснование_Закрытие = Новый ОписаниеОповещения("ДокументыОснование_Закрытие", Форма);

			ОткрытьФорму("ОбщаяФорма.ДокументыОснованияЭПД",
			ПараметрыФормы, Форма,,,,ОписаниеДокументыОснование_Закрытие,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
		Иначе
			Возврат;
		КонецЕсли; 
	ИначеЕсли НЕ Поле = Элементы.ПредставлениеСостояния Тогда  
		ТекущиеДанные = Элемент.ТекущиеДанные;
		ПоказатьЗначение(Неопределено, ТекущиеДанные.Ссылка);
	КонецЕсли; 
	// {/УАТ}
КонецПроцедуры

// Обработка оповещения на форме списка ЭПД.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма
//  ИмяСобытия - Строка - Имя события
//  Параметр - Произвольный - Параметр
//  Источник - Произвольный - Источник
Процедура ОбработкаОповещенияНаФормеСпискаЭПД(Форма, ИмяСобытия, Параметр, Источник) Экспорт
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Обработчик команды "Скопировать"
// Если в конфигурации нет реализации собственного метода следует использовать метод модуля ОбменСГИСЭПДКлиент.
//
// Параметры:
//  Список - ТаблицаФормы - Таблица формы:
//  	* ТекущиеДанные - ДанныеФормыСтруктура - С полями:
//  		** Ссылка - ДокументСсылка - 
Процедура СкопироватьЭлемент(Список) Экспорт
	// {УАТ}
	ОбменСГИСЭПДКлиент.СкопироватьЭлемент(Список); 
	// {/УАТ}
КонецПроцедуры

// Обработчик команды "Установить пометку удаления"
// Если в конфигурации нет реализации собственного метода следует использовать метод модуля ОбменСГИСЭПДКлиент.
//
//	Параметры:
//		Список - ТаблицаФормы - 
//		ТипСписка - Строка - тип документов списка.
//		ОповещениеОЗавершении - ОписаниеОповещения - оповещение, которое должно быть вызвано после завершения попытки пометки на удаление.
//
Процедура УстановитьПометкуУдаления(Список, ТипСписка = "", ОповещениеОЗавершении = Неопределено) Экспорт
	// {УАТ}
	ОбменСГИСЭПДКлиент.УстановитьПометкуУдаления(Список); 
	// {/УАТ}
КонецПроцедуры

// Процедура позволяет установить период через стандартный диалог выбора периода
// Если в конфигурации нет реализации собственного метода следует использовать метод модуля ОбменСГИСЭПДКлиент.
//
// Параметры:
//  Объект                - Произвольный - Объект в котором устанавливается значения периода
//  ПараметрыПериода      - Структура - структура со свойствами "ДатаНачала", "ДатаОкончания" и в значениях имена полей
//                              объекта, для свойства "Вариант" - значение варианта стандартного периода.
//  ОповещениеПослеВыбора - ОписаниеОповещения - Описание оповещение которое выполняется после установки периода. 
//                              Может быть установлена пост-обработка в месте вызова после выбора периода.
// 
Процедура РедактироватьПериод(Объект, ПараметрыПериода = Неопределено, ОповещениеПослеВыбора = Неопределено) Экспорт
	// {УАТ}
	ОбменСГИСЭПДКлиент.РедактироватьПериод(Объект, ПараметрыПериода, ОповещениеПослеВыбора); 
	// {/УАТ}
КонецПроцедуры

// Обработчик команды "Изменить"
// Если в конфигурации нет реализации собственного метода следует использовать метод модуля ОбменСГИСЭПДКлиент.
//
// Параметры:
//  Список - ТаблицаФормы - Таблица формы:
//  	* ТекущиеДанные - ДанныеФормыСтруктура - С полями:
//  		** Ссылка - ДокументСсылка - 
Процедура ИзменитьЭлемент(Список) Экспорт
	// {УАТ}
	ОбменСГИСЭПДКлиент.ИзменитьЭлемент(Список); 
	// {/УАТ}
КонецПроцедуры

#КонецОбласти
