#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	уатЗащищенныеФункцииСервер.уатОтчетОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Настройки размещения в панели отчетов.
//
// Параметры:
//   Настройки – Коллекция – Используется для описания настроек отчетов и вариантов
//       см. описание к ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//   НастройкиОтчета – СтрокаДереваЗначений – Настройки размещения всех вариантов отчета.
//       См. "Реквизиты для изменения" функции ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//
// Описание:
//   См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//
// Вспомогательные методы:
//   НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "<ИмяВарианта>");
//   ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, НастройкиОтчета, Истина/Ложь); // Отчет
//   поддерживает только этот режим.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "");
	
	НастройкиВарианта.Описание = 
		НСтр("en='Report serves to analyze provided transport services for construction projects, for construction equipment and mechanisms.';ru='Отчет служит для анализа оказанных транспортных услуг по объектам строительства, для строительной техники и механизмов.'");
	
	НастройкиВарианта.НастройкиДляПоиска.НаименованияПолей = ""
		+ НСтр("en = 'Vehicle'; ru = 'ТС'") + Символы.ПС
		+ НСтр("en='ПутевойЛист';ru='ПутевойЛист'") + Символы.ПС
		+ НСтр("en='ПараметрВыработки';ru='ПараметрВыработки'") + Символы.ПС
		+ НСтр("en='Quantity';ru='Количество'") + Символы.ПС
		+ НСтр("en='Sum';ru='Сумма'");
	
	НастройкиВарианта.НастройкиДляПоиска.НаименованияПараметровИОтборов = ""
		+ НСтр("en='Period';ru='Период'") + Символы.ПС
		+ НСтр("en='Counterpartу';ru='Контрагент'") + Символы.ПС
		+ НСтр("en='Company';ru='Организация'");
	
	НастройкиВарианта.НастройкиДляПоиска.КлючевыеСлова = ""
		+ НСтр("en='registry';ru='реестр'") + Символы.ПС
		+ НСтр("en='extract';ru='выписка'") + Символы.ПС
		+ НСтр("en='account';ru='счет'");
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли