
#Область СлужебныйПрограммныйИнтерфейс

// Процедура создает записи в регистре для нового рейса
Процедура СоздатьЭлементРасписания(СтруктураПараметров) Экспорт
	
	Если Не ЗначениеЗаполнено(СтруктураПараметров.Рейс) Тогда
		Возврат;
	КонецЕсли;
	
	ДатаУстановкиРасписания = ТекущаяДатаСеанса();
	
	НаборЗаписей = РегистрыСведений.уатРасписаниеРейсов.СоздатьНаборЗаписей();
	Если СтруктураПараметров.Свойство("Маршрут") И ЗначениеЗаполнено(СтруктураПараметров.Маршрут) Тогда
		Для Каждого ТекЭтап Из СтруктураПараметров.Маршрут.Этапы Цикл
			НоваяЗапись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, СтруктураПараметров);
			НоваяЗапись.УИДПункта = ТекЭтап.УИД;
			НоваяЗапись.ДатаУстановки = ДатаУстановкиРасписания;
		КонецЦикла;
	Иначе
		НоваяЗапись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, СтруктураПараметров);
		НоваяЗапись.ДатаУстановки = ДатаУстановкиРасписания;
	КонецЕсли;
	
	НаборЗаписей.Записать(Ложь);
КонецПроцедуры

#КонецОбласти