
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если НЕ ЭтоГруппа Тогда
		Если ВариантОтсчета = Перечисления.уатВариантыОтсчетаДатыПлатежа.ПослеПолученияСопроводительныхДокументов Тогда
			ПроверяемыеРеквизиты.Добавить("ВидСопроводительногоДокумента");
		КонецЕсли;
		Если Процент > 100 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Значение процента оплаты не должно превышать 100%",
				ЭтотОбъект, "Процент",, Отказ);
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти