&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.ТолькоПросмотр = Истина;
	ВывестиТабльныеНомераВодителей();
	ВывестиИнформациюПоТТН();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

Функция ВернутьОтветHTTPЗапроса(JSONОбъект)
	
	HTTPСоединение = GDS_ФункцииОбмена.ПолучитьСоединениеHTTP("evm.mecamineft.com");
	
    ЗаголовокЗапросаHTTP = Новый Соответствие();
	
	ЗаголовокЗапросаHTTP.Вставить("Content-Type", "application/json; charset=utf-8");
	
    ЗапросHTTP = Новый HTTPЗапрос(GDS_ФункцииОбмена.ПолучитьАдресРесурсаДляHTTPЗапроса("Бухгалтерия_МеКаМи"), ЗаголовокЗапросаHTTP);
	                     
    //создадим заголовок запроса
	
	ЗапросHTTP.УстановитьТелоИзСтроки(JSONОбъект, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);	
	
	HTTPОтвет = HTTPСоединение.ВызватьHTTPМетод("POST",ЗапросHTTP);
	
	HTTPСоединение = Неопределено;
	
	Возврат HTTPОтвет;
	
КонецФункции

&НаСервере
Процедура КомандаРазблокироватьНаСервере()
	
	Структура = Новый Структура(); 
	
	Структура.Вставить("Type",Объект.Ссылка.ПолучитьОбъект().Метаданные().Имя);
	Структура.Вставить("Ref",строка(Объект.Ссылка.УникальныйИдентификатор()));
	Структура.Вставить("СтаусЭДО", "Разблокирован");
	
	JSONОбъект = GDS_ФункцииОбмена.ПолучитьОбъектJSON(Структура,Истина);
	
	HTTPОтвет = ВернутьОтветHTTPЗапроса(JSONОбъект);
	
    Сообщение = HTTPОтвет.ПолучитьТелоКакСтроку();
	
	Если HTTPОтвет.КодСостояния = 200 тогда
	
		ЧтениеJSON 		= Новый ЧтениеJSON;
	    ЧтениеJSON.УстановитьСтроку(Сообщение);
	    ДанныеДругойБазы = ПрочитатьJSON(ЧтениеJSON);
	    ЧтениеJSON.Закрыть();
	
		Если ДанныеДругойБазы.Результат <> "НеСмогЗаписатьДокумент" Тогда 
			Сообщить("Документ разблокирован");
		Иначе
			Сообщить("Не смог разблокировать документ, сообщите программистам.");
		КонецЕсли;
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура КомандаРазблокировать(Команда)
	КомандаРазблокироватьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Водитель1ПриИзменении(Элемент)
	ВывестиТабльныеНомераВодителей();
КонецПроцедуры

&НаСервере
Процедура ВывестиТабльныеНомераВодителей()
	Если ЗначениеЗаполнено(Объект.Водитель1) Тогда
		ТабельныйНомер1 = Объект.Водитель1.Код;	
	КонецЕсли;	
	Если ЗначениеЗаполнено(Объект.Водитель2) Тогда
		ТабельныйНомер2 = Объект.Водитель2.Код;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Водитель2ПриИзменении(Элемент)
	ВывестиТабльныеНомераВодителей();
КонецПроцедуры

 &НаСервере
Процедура ВывестиИнформациюПоТТН(ИдентификаторСтроки = 0)

	Если ИдентификаторСтроки = 0 Тогда
		Для каждого СтрокаМаршруты Из Объект.Маршруты Цикл
			ОписаниеТТН = "";
			МассаНетто = 0;
			мСтрокиТТН = Объект.ТТН.НайтиСтроки(Новый Структура("ИдентификаторСтрокиМаршруты",СтрокаМаршруты.ИдентификаторСтроки));
			Для Каждого Строка Из  мСтрокиТТН Цикл 
				ОписаниеТТН = ОписаниеТТН + Строка.ТТН + ";";
				МассаНетто = МассаНетто + Строка.МассаНетто;
			КонецЦикла;	
			Если ОписаниеТТН = "" Тогда
				ОписаниеТТН = "Выбрать ТТН";
			Конецесли;
			СтрокаМаршруты.ГиперссылкаТТН = ОписаниеТТН; 
			СтрокаМаршруты.ТТНМассаНетто = МассаНетто; 
		КонецЦикла;
	Иначе	
		ОписаниеТТН = "";
    	МассаНетто = 0;
		мСтрокиТТН = Объект.ТТН.НайтиСтроки(Новый Структура("ИдентификаторСтрокиМаршруты",ИдентификаторСтроки));
		Для Каждого Строка Из  мСтрокиТТН Цикл 
			ОписаниеТТН = ОписаниеТТН + Строка.ТТН + ";";
			МассаНетто = МассаНетто + Строка.МассаНетто;
		КонецЦикла;
		Если ОписаниеТТН = "" Тогда
			ОписаниеТТН = "Выбрать ТТН";
		Конецесли;
		мСтрокиМаршруты = Объект.Маршруты.НайтиСтроки(Новый Структура("ИдентификаторСтроки",ИдентификаторСтроки));
		мСтрокиМаршруты[0].ГиперссылкаТТН = ОписаниеТТН;
		мСтрокиМаршруты[0].ТТНМассаНетто = МассаНетто;
	КонецЕсли;
	
КонецПроцедуры
