#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьПараметры() Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запись = РегистрыСведений.РаспознаваниеДокументовПоследнийОтправленныйЗамерВремени.СоздатьМенеджерЗаписи();
	Запись.Прочитать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Результат = Новый Структура;
	Результат.Вставить("ДатаПоследнего", Запись.ДатаПоследнего);
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаписатьПараметры(ДатаПоследнего) Экспорт 
	
	Если ДатаПоследнего = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запись = РегистрыСведений.РаспознаваниеДокументовПоследнийОтправленныйЗамерВремени.СоздатьМенеджерЗаписи();
	Запись.ДатаПоследнего = ДатаПоследнего;
	Запись.Записать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
