////////////////////////////////////////////////////////////////////////////////
// Подсистема "Дополнительные отчеты и обработки" (уат).
// 
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Определяет разделы, в которых доступна команда вызова дополнительных обработок.
//
// Параметры:
//   Разделы - Массив - Разделы, в которых размещены команды вызова дополнительных обработок.
//       * ОбъектМетаданных: Подсистема - Метаданные раздела (подсистемы).
//       * Строка - Для рабочего стола.
//
// Описание:
//   В Разделы необходимо добавить метаданные тех разделов,
//   в которых размещены команды вызова.
//
//   Для рабочего стола вместо Метаданных необходимо добавлять.
//   ДополнительныеОтчетыИОбработкиКлиентСервер.ИдентификаторРабочегоСтола().
//
Процедура ОпределитьРазделыСДополнительнымиОбработками(Разделы) Экспорт
	
	Разделы.Добавить(Метаданные.Подсистемы.уатТранспорт);
	Разделы.Добавить(Метаданные.Подсистемы.уатСклад);
	Разделы.Добавить(Метаданные.Подсистемы.уатДоходыИРасходы);
	Разделы.Добавить(Метаданные.Подсистемы.уатПерсонал);
	Разделы.Добавить(Метаданные.Подсистемы.уатРемонтыИАгрегаты);
	Разделы.Добавить(Метаданные.Подсистемы.уатГСМ);
	Разделы.Добавить(Метаданные.Подсистемы.Бюджетирование);
	Разделы.Добавить(Метаданные.Подсистемы.уатМониторинг);
	Разделы.Добавить(Метаданные.Подсистемы.уатБилетыИВыручка);
	Разделы.Добавить(Метаданные.Подсистемы.уатДвижениеДС);
	Разделы.Добавить(Метаданные.Подсистемы.уатМобильноеПриложениеВодителя);
	Разделы.Добавить(Метаданные.Подсистемы.уатУслуги);
	Разделы.Добавить(Метаданные.Подсистемы.уатЛогистика_уэ);
	Разделы.Добавить(Метаданные.Подсистемы.уатCRM);
	
	Если Метаданные.Подсистемы.Найти("такЗаказыТакси") <> Неопределено Тогда
		Разделы.Добавить(Метаданные.Подсистемы["такЗаказыТакси"]);
	КонецЕсли;
	Если Метаданные.Подсистемы.Найти("такАренда") <> Неопределено Тогда
		Разделы.Добавить(Метаданные.Подсистемы["такАренда"]);
	КонецЕсли;

КонецПроцедуры

// Определяет разделы, в которых доступна команда вызова дополнительных отчетов.
//
// Параметры:
//   Разделы - Массив - Разделы, в которых размещены команды вызова дополнительных отчетов.
//       * ОбъектМетаданных: Подсистема - Метаданные раздела (подсистемы).
//       * Строка - Для рабочего стола.
//
// Описание:
//   В Разделы необходимо добавить метаданные тех разделов, 
//   в которых размещены команды вызова.
//
//   Для рабочего стола вместо Метаданных необходимо добавлять.
//   ДополнительныеОтчетыИОбработкиКлиентСервер.ИдентификаторРабочегоСтола().
//
Процедура ОпределитьРазделыСДополнительнымиОтчетами(Разделы) Экспорт
	
	Разделы.Добавить(Метаданные.Подсистемы.уатТранспорт);
	Разделы.Добавить(Метаданные.Подсистемы.уатСклад);
	Разделы.Добавить(Метаданные.Подсистемы.уатДоходыИРасходы);
	Разделы.Добавить(Метаданные.Подсистемы.уатПерсонал);
	Разделы.Добавить(Метаданные.Подсистемы.уатРемонтыИАгрегаты);
	Разделы.Добавить(Метаданные.Подсистемы.уатГСМ);
	Разделы.Добавить(Метаданные.Подсистемы.Бюджетирование);
	Разделы.Добавить(Метаданные.Подсистемы.уатМониторинг);
	Разделы.Добавить(Метаданные.Подсистемы.уатБилетыИВыручка);
	Разделы.Добавить(Метаданные.Подсистемы.уатДвижениеДС);
	Разделы.Добавить(Метаданные.Подсистемы.уатМобильноеПриложениеВодителя);
	Разделы.Добавить(Метаданные.Подсистемы.уатУслуги);
	Разделы.Добавить(Метаданные.Подсистемы.уатЛогистика_уэ);
	Разделы.Добавить(Метаданные.Подсистемы.уатCRM);
	
	Если Метаданные.Подсистемы.Найти("такЗаказыТакси") <> Неопределено Тогда
		Разделы.Добавить(Метаданные.Подсистемы["такЗаказыТакси"]);
	КонецЕсли; 
	Если Метаданные.Подсистемы.Найти("такАренда") <> Неопределено Тогда
		Разделы.Добавить(Метаданные.Подсистемы["такАренда"]);
	КонецЕсли;

	
КонецПроцедуры

#КонецОбласти
