////////////////////////////////////////////////////////////////////////////////
// Управление автотранспортом.
// 
// Работа с расширениями конфигурации.
// 
// Содержит код, используемый в варианте поставке ПРОФ, КОРП
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Выполняет переопределяемую команду
//
// Параметры:
//  Форма	- ФормаКлиентскогоПриложения - форма, в которой расположена команда
//  Команда	- КомандаФормы - команда формы
//  ДополнительныеПараметры	- Структура - дополнительные параметры.
//
Процедура ВыполнитьПереопределяемуюКоманду(Форма, Команда, ДополнительныеПараметры = Неопределено) Экспорт
	
КонецПроцедуры

// Процедура, вызываемая из одноименного обработчика события формы.
//
// Параметры:
//  Форма					- ФормаКлиентскогоПриложения - форма, из обработчика события которой происходит вызов процедуры.
//  ИмяСобытия				- Строка - идентификатор сообщения принимающей формой (см. метод Оповестить)
//	Параметр				- Произвольный - параметр сообщения (см. метод Оповестить)
//	Источник				- Произвольный - источник события (см. метод Оповестить)
//  ДополнительныеПараметры	- Структура - дополнительные параметры.
//
Процедура ОбработкаОповещения(Форма, ИмяСобытия, Параметр, Источник, ДополнительныеПараметры = Неопределено) Экспорт
	
	
КонецПроцедуры

// Процедура, вызываемая из одноименного обработчика события формы.
//
// Параметры:
//  Форма					- ФормаКлиентскогоПриложения - форма, из обработчика события которой происходит вызов процедуры.
//  Отказ					- Булево - признак отказа от записи документа
//	ПараметрыЗаписи			- Структура - параметры записи (см. событие ПередЗаписью).
//
Процедура ПередЗаписью(Форма, Отказ, ПараметрыЗаписи) Экспорт
	
КонецПроцедуры

// Переопределяемая процедура, вызываемая из одноименного обработчика события формы.
//
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения - форма, из обработчика события которой происходит вызов процедуры.
//	ПараметрыЗаписи - Структура - параметры записи (см. событие ПослеЗаписи).
//
Процедура ПослеЗаписи(Форма, ПараметрыЗаписи) Экспорт
	
КонецПроцедуры

// Переопределяемая процедура, вызываемая из одноименного обработчика события формы.
//
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения - форма, из обработчика события которой происходит вызов процедуры.
//  Отказ	- Булево - признак отказа от открытия формы.
//
Процедура ПриОткрытии(Форма, Отказ) Экспорт
	#Если Не ТолстыйКлиентОбычноеПриложение Тогда
	Если Форма.ИмяФормы = "Справочник.уатТС.Форма.ФормаЭлемента" Тогда
		// Устарела
		НаименованиеДействия = "Справочник.уатТС.Форма.ФормаЭлемента.ПриОткрытии";
		уатРаботаСРасширениямиКлиент.ПСМ_ВыполнитьДействияВФорме(НаименованиеДействия, 
		уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Форма.Объект.ИспользуемаяСистемаGPS, "НаименованиеПС"),, Форма.ЭтотОбъект);
		
	КонецЕсли;
	#КонецЕсли
КонецПроцедуры

// Переопределяемая процедура, вызываемая из одноименного обработчика события элемента.
//
// Параметры:
//   Форма                   - ФормаКлиентскогоПриложения - форма, из которой происходит вызов процедуры.
//   Элемент                 - Произвольный     - элемент-источник события "При изменении".
//   ДополнительныеПараметры - Структура        - значения дополнительных параметров влияющих на обработку.
//
Процедура ПриИзмененииЭлемента(Форма, Элемент, ДополнительныеПараметры = Неопределено) Экспорт
	
	#Если Не ТолстыйКлиентОбычноеПриложение Тогда
		Если Форма.ИмяФормы = "Справочник.уатТС.Форма.ФормаЭлемента"
			И Элемент.Имя = "ИспользуемаяСистемаGPS" Тогда
			// Устарела
			НаименованиеДействия = "Справочник.уатТС.Форма.ФормаЭлемента.ИспользуемаяСистемаGPSПриИзменении";
			уатРаботаСРасширениямиКлиент.ПСМ_ВыполнитьДействияВФорме(НаименованиеДействия, 
			уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Форма.Объект.ИспользуемаяСистемаGPS, "НаименованиеПС"),, Форма.ЭтотОбъект);
		КонецЕсли;
	#КонецЕсли  
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ РАБОТЫ С РАСШИРЕНИЕМ КОНФИГУРАЦИИ (ПОДКЛЮЧАЕМАЯ СИСТЕМА МОНИТОРИНГА)
//
#Область ПроцедурыИФункцииДляРаботыПСМ

Процедура ПСМ_ВыполнитьДействияВФорме(ИдентификаторДействия, СистемаМониторинга, УчетнаяЗапись = Неопределено, ЭтотОбъект = Неопределено, ДопПараметры = Неопределено) Экспорт
	
	Заглушка = Истина;
	
КонецПроцедуры

#КонецОбласти

///////////////////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ РАБОТЫ С РАСШИРЕНИЕМ КОНФИГУРАЦИИ (ПОДКЛЮЧАЕМАЯ СИСТЕМА ПРОЦЕССИНГОВОГО ЦЕНТРА)
//
#Область ПроцедурыИФункцииДляРаботыПСПЦ

Процедура ПСПЦ_ВыполнитьДействияВФорме(ИдентификаторДействия, СистемаМониторинга, УчетнаяЗапись = Неопределено, ЭтотОбъект = Неопределено, ДопПараметры = Неопределено) Экспорт
	
	Заглушка = Истина;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти