#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаполнитьОткрытыеКатегории() Экспорт
	ОткрытыеКатегории = "";
	Если ВидДокумента.УчетКатегорий Тогда
		списКатегории = Новый СписокЗначений;
		Для Каждого ТекКатегория Из Категории Цикл
			Если ТекКатегория.Открыта Тогда
				списКатегории.Добавить(СокрЛП(ТекКатегория.Категория));
			КонецЕсли;
		КонецЦикла;
		списКатегории.СортироватьПоЗначению();
		
		Для Каждого ТекЭлем Из списКатегории Цикл
			ОткрытыеКатегории = ОткрытыеКатегории + ТекЭлем.Значение + ", ";
		КонецЦикла;
		Если НЕ ПустаяСтрока(ОткрытыеКатегории) Тогда
			ОткрытыеКатегории = Лев(ОткрытыеКатегории, СтрДлина(ОткрытыеКатегории)-2);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьВсеКатегории()
	
	МассивОткрытыхКатегорий = СтрРазделить(ОткрытыеКатегории, ", ");
	
	мсвКатегорииПоВиду = ВидДокумента.Категории.Выгрузить().ВыгрузитьКолонку("Категория");
	Для Каждого ТекКатегория Из мсвКатегорииПоВиду Цикл
		НоваяСтрока = Категории.Добавить();
		НоваяСтрока.Категория = ТекКатегория;
		Если ЗначениеЗаполнено(ОткрытыеКатегории) И МассивОткрытыхКатегорий.Найти(Строка(НоваяСтрока.Категория)) <> Неопределено Тогда
			НоваяСтрока.Открыта = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭтоГруппа Тогда
		Если НЕ ЗначениеЗаполнено(Наименование) Тогда 
			Наименование = уатНастройкиШаблонов.СформироватьНаименованиеПоШаблону("Справочник_уатРегистрационныеДокументы", ЭтотОбъект);
		КонецЕсли;
		Если Категории.Количество() = 0 И ВидДокумента.Категории.Выгрузить().ВыгрузитьКолонку("Категория").Количество() <> 0 Тогда
			ЗаполнитьВсеКатегории();
		Иначе
			ЗаполнитьОткрытыеКатегории();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли