
#Область ОбработчикиСобытийФормы
	
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ОбновитьДанныеФормы" Тогда
		МаршрутыЗадатьМаршрутНаКарте(Параметр);
		ЭтотОбъект.ОбновитьОтображениеДанных();
	ИначеЕсли ИмяСобытия = "ПереносПунктовВ_Маршрут" Тогда
		ДобавитьПункты(Параметр);
		ЭтотОбъект.ОбновитьОтображениеДанных();
	КонецЕсли; 
КонецПроцедуры
  
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗадатьМаршрутНаКарте(Команда)
	ДанныеМаршрута = СобратьДанныеМаршрута();
	ОткрытьФорму("ОбщаяФорма.ItobФормаПлановогоМаршрута", ДанныеМаршрута, ЭтаФорма);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СобратьДанныеМаршрута()
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	ItobТрекПлановогоМаршрута.ОбновитьТаблицуРеперыМаршрута(ТекущийОбъект);
	ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");
	
	
	Возврат ItobТрекПлановогоМаршрута.СобратьДанныеМаршрута(ТекущийОбъект);
	
КонецФункции

&НаСервере
Процедура МаршрутыЗадатьМаршрутНаКарте(Рез)
	
	ItobТрекПлановогоМаршрута.ПостроитьМаршрутДляПутевогоЛиста(Рез,ЭтаФорма.Объект);

КонецПроцедуры

// Процедура добавляет пункты в маршрут из подбора.
//
// Параметры:
//  ТаблицаПункты  - "ДанныеФормыКоллекция".
//
&НаСервере
Процедура ДобавитьПункты(ТаблицаПункты)
 Для каждого ТекСтрока Из ТаблицаПункты Цикл
    НоваяСтрокаСостав = Объект.Состав.Добавить();
 	НоваяСтрокаСостав.Адрес = ТекСтрока.ПунктНазначения;
	НоваяСтрокаСостав.ПребываниеПлан = ПолучитьВремяПребывания(ТекСтрока.ПунктНазначения);
КонецЦикла; 
КонецПроцедуры // ДобавитьПункты()

&НаКлиенте
Процедура СоставАдресПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Состав.ТекущиеДанные;
	Если Не ТекущиеДанные = Неопределено Тогда
	   ТекущиеДанные.ПребываниеПлан = ПолучитьВремяПребывания(ТекущиеДанные.Адрес);
	КонецЕсли; 
КонецПроцедуры

Функция ПолучитьВремяПребывания(ПунктНазначения)
	Если ЗначениеЗаполнено(ПунктНазначения.ВремяПребывания) Тогда
		Возврат ПунктНазначения.ВремяПребывания;
	Иначе	
		Возврат '00010101002000'
	КонецЕсли;  
КонецФункции

 
#КонецОбласти

