#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

	
#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
	Настройки.ПриПолученииСлужебныхРеквизитов = Ложь;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// Позволяет определить список заблокированных реквизитов.
// 
// Возвращаемое значение:
//  Массив - из Строка - строки в формате "ИмяРеквизита[;ИмяЭлементаФормы,...]",
//  где ИмяРеквизита - имя реквизита объекта, ИмяЭлементаФормы -
//  имя элемента формы, связанного с реквизитом. Например: "Объект.Автор", "ПолеАвтор".
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	БлокируемыеРеквизиты = Новый Массив();
	Возврат БлокируемыеРеквизиты;
	
КонецФункции

// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

// Выполняет заполнение предопределенных элементов справочника
//
Процедура ЗаполнитьПредопределенныеДанные() Экспорт
	
	СпрОбъект = Справочники.уатЗаключенияОРезультатахМедицинскогоОсмотра.Разрешено.ПолучитьОбъект();
	СпрОбъект.Содержание =
		"Отсутствие признаков воздействия вредных и (или) опасных производственных факторов, " +
		"состояний и заболеваний, препятствующих выполнению трудовых обязанностей, в том числе " +
		"алкогольного, наркотического или иного токсического опьянения и остаточных явлений такого опьянения";
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатЗаключенияОРезультатахМедицинскогоОсмотра.Запрещено.ПолучитьОбъект();
	СпрОбъект.Содержание =
		"Наличие признаков воздействия вредных и (или) опасных производственных факторов, " +
		"состояний и заболеваний, препятствующих выполнению трудовых обязанностей, в том числе " +
		"алкогольного, наркотического или иного токсического опьянения и остаточных явлений " +
		"такого опьянения (с указанием этих признаков)";
	СпрОбъект.Записать();
	
КонецПроцедуры

#КонецОбласти


#КонецЕсли

