
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Расстояние",                 Расстояние);
	Параметры.Свойство("ВремяВПути",                 ВремяВПути);
	Параметры.Свойство("ВесБрутто",                  ВесБрутто);
	Параметры.Свойство("Объем",                      Объем);
	Параметры.Свойство("КоличествоМест",             КоличествоМест);
	Параметры.Свойство("СтоимостьГруза",             СтоимостьГруза);
	Параметры.Свойство("ОтображатьСтоимость",        ОтображатьСтоимость);
	Параметры.Свойство("ВалютаТоваров",              ВалютаТоваров);
	Параметры.Свойство("ОтображатьВалюту",           ОтображатьВалюту);
	Параметры.Свойство("ВидДокумента",               ВидДокумента);
	Параметры.Свойство("FTL",                        FTL);
	Параметры.Свойство("ЗаказПеревозчику_ПоЗаказам", ЗаказПеревозчику_ПоЗаказам);
	Параметры.Свойство("Выработка1",                 Выработка1);
	Параметры.Свойство("Выработка2",                 Выработка2);
	Параметры.Свойство("ПараметрВыработки1",         ПарамВыработки1);
	Параметры.Свойство("ПараметрВыработки2",         ПарамВыработки2);
	
	Если Параметры.Свойство("ВесТары") Тогда 
		ВесТары = Параметры.ВесТары;
	Иначе 
		Элементы.ВесТары.Видимость = Ложь;
	КонецЕсли;
	
	Если ВидДокумента = "уатСтраховойСертификат_уэ" Тогда
		Элементы.ГруппаПробег.Видимость                  = Ложь;
		Элементы.ГруппаВремя.Видимость                   = Ложь;

	ИначеЕсли ВидДокумента = "уатМаршрутныйЛист" Тогда
		Элементы.ПробегПорожний.ТолькоПросмотр = Истина;
		Элементы.ПробегПорожний.ЦветРамки = ЦветаСтиля.ЦветФонаФормы; 
	ИначеЕсли ВидДокумента = "такЗаказТакси"
		ИЛИ ВидДокумента = "такАрендаТС" Тогда
		Элементы.ГруппаВесОбъем.Видимость       = Ложь;
		Элементы.ГруппаСтоимостьГруза.Видимость = Ложь;
		Элементы.ГруппаШапка.Видимость          = Ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("ВремяСтоянок") Тогда 
		ВремяСтоянок           = Параметры.ВремяСтоянок;
		ВремяОбщее             = уатЗащищенныеФункцииСервер.СложитьВремя(ВремяВПути, ВремяСтоянок);
		ОтображатьВремяСтоянок = Истина;
	Иначе 
		ОтображатьВремяСтоянок          = Ложь;
		Элементы.ВремяОбщее.Видимость   = Ложь;
		Элементы.ВремяСтоянок.Видимость = Ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("ПробегСГрузом") Тогда
		ОтображатьПробегСГрузом = Истина;
		ПробегСГрузом           = Параметры.ПробегСГрузом;
		ПробегПорожний          = Параметры.ПробегПорожний;
	Иначе
		ОтображатьПробегСГрузом            = Ложь;
		Элементы.ПробегСГрузом.Видимость   = Ложь;
		Элементы.ПробегПорожний.Видимость  = Ложь;
	КонецЕсли;
	
	Если Не ОтображатьСтоимость Тогда 
		Элементы.ГруппаСтоимостьГруза.Видимость = Ложь;
	ИначеЕсли Не ОтображатьВалюту Тогда 
		Элементы.ВалютаТоваров.Видимость = Ложь;
	КонецЕсли;
	
	ВремяОбщее = уатЗащищенныеФункцииСервер.СложитьВремя(ВремяВПути, ВремяСтоянок);
	
	Если Параметры.Свойство("ТолькоПросмотр") И Параметры.ТолькоПросмотр = Истина Тогда
		Элементы.ГруппаПробег.ТолькоПросмотр                  = Истина;
		Элементы.ГруппаВремя.ТолькоПросмотр                   = Истина;
		Элементы.ГруппаВесОбъем.ТолькоПросмотр                = Истина;
		Элементы.ГруппаСтоимостьГруза.ТолькоПросмотр          = Истина;
		Элементы.ФормаСохранитьДанные.Видимость               = Ложь;
	КонецЕсли;
	
	ЗаголовокРеквизитаКоличествоМест = Справочники.уатВидыУпаковки_уэ.ПолучитьОсновнойВидУпаковки().КраткоеНаименование;
	Элементы.КоличествоМест.Заголовок = ЗаголовокРеквизитаКоличествоМест;
	
	ПредставлениеЕдиницыИзмеренияВеса = уатОбщегоНазначенияПовтИсп.ПолучитьПредставлениеОсновнойЕдиницыИзмеренияВеса();
	Если ЗначениеЗаполнено(ПредставлениеЕдиницыИзмеренияВеса) Тогда
		Элементы.ВесБрутто.Заголовок = НСтр("en='Weight';ru='Вес'") + ", " + ПредставлениеЕдиницыИзмеренияВеса;
		Элементы.ВесТары.Заголовок = НСтр("en='Tare weight';ru='Вес тары'") + ", " + ПредставлениеЕдиницыИзмеренияВеса;
	КонецЕсли;
	
	ПредставлениеЕдиницыИзмеренияОбъема = уатОбщегоНазначенияПовтИсп.ПолучитьПредставлениеОсновнойЕдиницыИзмеренияОбъема();
	Если ЗначениеЗаполнено(ПредставлениеЕдиницыИзмеренияОбъема) Тогда
		Элементы.Объем.Заголовок = НСтр("en='Volume';ru='Объем'") + ", " + ПредставлениеЕдиницыИзмеренияОбъема;
	КонецЕсли;
	
	ОтображатьПланФакт = Ложь;
	Если ВидДокумента = "уатМаршрутныйЛист" Тогда
		Если Не ПравоДоступа("Редактирование", Метаданные.Документы.уатМаршрутныйЛист) Тогда
			Элементы.ФормаСохранитьДанные.Видимость = Ложь;
		КонецЕсли;
		Если Параметры.Свойство("Организация") И ЗначениеЗаполнено(Параметры.Организация) Тогда
			ОтображатьПланФакт = Константы.уатУчетПланФактаПоМаршрутуВМаршрутныхЛистах.Получить();
		КонецЕсли;
	КонецЕсли;
	
	//Элементы.ГруппаПробегПлан.Видимость        = ОтображатьПланФакт;
	//Элементы.ГруппаВремяПлан.Видимость         = ОтображатьПланФакт;
	//Элементы.ДекорацияПробегФакт.Видимость     = ОтображатьПланФакт;
	//Элементы.ДекорацияВремяФакт.Видимость      = ОтображатьПланФакт;
	Элементы.ВыработкаКоличествоПлан.Видимость = ОтображатьПланФакт;
	Элементы.ВыработкаКоличествоФакт.Заголовок = ?(ОтображатьПланФакт, "Количество (факт)", "Количество");
	
	ОтобразитьВыработкуПриОткрытииФормы();
	
	// сброс настроек размеров формы и положения окна до стандартны
	КлючОбъекта = "ОбщаяФорма.уатРедактированиеМаршрутныхПоказателей.Форма.Форма/НастройкиОкна";
	ХранилищеСистемныхНастроек.Удалить(КлючОбъекта,"", ИмяПользователя());
	КлючСохраненияПоложенияОкна = Строка(Новый УникальныйИдентификатор);	
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВремяВПутиПриИзменении(Элемент)
	
	ВремяОбщее = уатЗащищенныеФункцииСервер.СложитьВремя(ВремяВПути, ВремяСтоянок);
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяСтоянокПриИзменении(Элемент)
	
	ВремяОбщее = уатЗащищенныеФункцииСервер.СложитьВремя(ВремяВПути, ВремяСтоянок);
	
КонецПроцедуры

&НаКлиенте
Процедура ПробегСГрузомПриИзменении(Элемент)
	
	Расстояние = ПробегСГрузом + ПробегПорожний;
	
КонецПроцедуры

&НаКлиенте
Процедура ПробегПорожнийПриИзменении(Элемент)
	
	Расстояние = ПробегСГрузом + ПробегПорожний;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийТаблицыВыработка

&НаКлиенте
Процедура ВыработкаПередУдалением(Элемент, Отказ)
	ТекСтрока = Элементы.Выработка.ТекущиеДанные;
	Если НЕ ТекСтрока.РучнойВвод Тогда
		ТекстСообщ = "Запрещено удаление предопределенной выработки.";
		уатОбщегоНазначенияТиповые.СообщитьОбОшибке(ТекстСообщ, Отказ);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьДанные(Команда)
	
	ПараметрыЗакрытия = Новый Структура();
	ПараметрыЗакрытия.Вставить("Расстояние",     Расстояние);
	ПараметрыЗакрытия.Вставить("ВремяВПути",     ВремяВПути);
	ПараметрыЗакрытия.Вставить("ВесБрутто",      ВесБрутто);
	ПараметрыЗакрытия.Вставить("Объем",          Объем);
	ПараметрыЗакрытия.Вставить("КоличествоМест", КоличествоМест);
	
	Если ОтображатьВремяСтоянок Тогда 
		ПараметрыЗакрытия.Вставить("ВремяСтоянок", ВремяСтоянок);
	КонецЕсли;
	
	Если ОтображатьСтоимость Тогда 
		ПараметрыЗакрытия.Вставить("СтоимостьГруза", СтоимостьГруза);
	КонецЕсли;
	
	Если ОтображатьВалюту Тогда 
		ПараметрыЗакрытия.Вставить("ВалютаТоваров", ВалютаТоваров);
	КонецЕсли;
	
	Если ОтображатьПробегСГрузом Тогда 
		ПараметрыЗакрытия.Вставить("ПробегСГрузом",  ПробегСГрузом);
		ПараметрыЗакрытия.Вставить("ПробегПорожний", ПробегПорожний);
	КонецЕсли;
	
	мсвВыработкаТСиСотрудников = Новый Массив;
	Для Каждого ТекСтрока Из Выработка Цикл
		мсвВыработкаТСиСотрудников.Добавить(Новый Структура("ПараметрВыработки, КоличествоПлан, КоличествоФакт",
			ТекСтрока.ПараметрВыработки, ТекСтрока.КоличествоПлан, ТекСтрока.КоличествоФакт));
	КонецЦикла;
	ПараметрыЗакрытия.Вставить("ВыработкаТСиСотрудников", мсвВыработкаТСиСотрудников);
	
	Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

#Область Выработка

&НаСервере
Процедура ОтобразитьВыработкуПриОткрытииФормы()
	
	Если Не Параметры.Свойство("ВыработкаТСиСотрудников") Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекВыработка Из Параметры.ВыработкаТСиСотрудников Цикл
		НоваяСтрока = Выработка.Добавить();
		НоваяСтрока.ПараметрВыработки = ТекВыработка.ПараметрВыработки;
		НоваяСтрока.КоличествоПлан    = ТекВыработка.КоличествоПлан;
		НоваяСтрока.КоличествоФакт    = ТекВыработка.КоличествоФакт;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
