#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
	Настройки.ПриПолученииСлужебныхРеквизитов = Ложь;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// Выполняет заполнение предопределенных элементов справочника
//
Процедура ЗаполнитьПредопределенныеДанные() Экспорт
	
	СпрОбъект = Справочники.уатСтатьиРасходов.ТранспортныйНалог.ПолучитьОбъект();
	СпрОбъект.ВидЗатрат = Перечисления.уатВидыЗатрат.Прочие;
	СпрОбъект.ПорядокОтнесенияЗатрат = Перечисления.уатПорядкиОтнесенияРасходов.ПрямыеРасходы;

	НоваяСтрока = СпрОбъект.ПараметрыВыработкиРаспределенияМеждуАналитиками.Добавить();
	НоваяСтрока.СпособРаспределенияЗатратМеждуАналитиками = Перечисления.уатСпособыРаспределенияДоходовРасходовМеждуАналитиками.НеРаспределять;
		
	СпрОбъект.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли