////////////////////////////////////////////////////////////////////////////////
// Оперативный мониторинг (вызов сервера)
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Проверка доступности сервера CsmSvc
//  При этом запрашивается тестовая страница по протоколу HTTP.
//
// Параметры:
//  АдресСервера - Строка	 - Адрес сервера.
//  ПортСервера	 - Число	 - Порт сервера.
// 
// Возвращаемое значение:
//  Булево - Истина если доступен, Ложь если не доступен.
//
Функция ПроверитьДоступностьСервисаCsmSvc(АдресСервера=Неопределено, ПортСервера=Неопределено) Экспорт
	Возврат ItobОперативныйМониторинг.ПроверитьДоступностьСервисаCsmSvc(АдресСервера, ПортСервера);
КонецФункции // ПроверитьДоступностьСервисаCsmSvc()

// Производит установку часового пояса текущего сеанса.
//
// Параметры:
//  МестныйЧасовойПояс	 - Строка	 - Идентификатор часового пояса.
//
Процедура УстановкаЧасовогоПоясаСеанса(МестныйЧасовойПояс) Экспорт
	ItobОперативныйМониторинг.УстановкаЧасовогоПоясаСеанса(МестныйЧасовойПояс);
КонецПроцедуры

// Возвращает адрес карты.
//
// Параметры:
//  АтрибутыКарты	 - Строка	 - Атрибуты карты.
//  ДопСкриптHEAD	 - Строка	 - Дополнительный скрипт секции HEAD.
// 
// Возвращаемое значение:
//  Строка - Адрес карты.
//
Функция ПолучитьАдресКарты(АтрибутыКарты="", ДопСкриптHEAD = "") Экспорт
	
	Возврат ItobОперативныйМониторинг.ПолучитьАдресКарты(АтрибутыКарты, ДопСкриптHEAD);
	
КонецФункции

// Определяет адрес CsmSvc.
//
// Параметры:
//  СтрокаСоединенияКлиента	 - Строка	 - Строка соединения клиента.
// 
// Возвращаемое значение:
//  Неопределено - Неопределено.
//
Функция ОпределитьАдресCsmSvc(СтрокаСоединенияКлиента) Экспорт 
	Возврат ItobОперативныйМониторинг.ОпределитьАдресCsmSvc(СтрокаСоединенияКлиента);
КонецФункции // ОпределитьАдресCsmSvc()

// Формирует таблицу интервалов движения для заданного объекта мониторинга.
//
// Параметры:
//  Объект					 - СправочникаСсылка.ItobТранспортныеСредства	 - Ссылка на справочник "Транспортные средства".
//  НачДата					 - Дата											 - Период начала формирования интервалов.
//  КонДата					 - Дата											 - Период окончания формирования интервалов.
//  ГеокодироватьАдреса		 - Булево, Неопределено							 - Геокодировать адреса.
//  ВключатьДанныеДатчиков	 - Булево, Неопределено							 - Включать данные датчиков.
//  ПараметрыБулево			 - Структура, Неопределено						 - Параметры:
//  						* ИспользоватьДанныеРегистраИнтервалыДвижения - Булево - Использовать данные регистра интервалы движения.
//  						* ИспользоватьПоправочныйКоэффициент - Булево - Использовать поправочный коэффициент.
//  						* ВключатьДанныеТерминала - Булево - Включать данные терминала.
//  						* РассчитыватьДанныеВыработки - Булево - Рассчитывать данные выработки.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица интервалов.
//
Функция ПолучитьИнтервалыДвижения(Объект, НачДата, КонДата, ГеокодироватьАдреса=Ложь, ВключатьДанныеДатчиков=Неопределено, ПараметрыБулево = Неопределено) Экспорт
	Возврат ItobОперативныйМониторинг.ПолучитьИнтервалыДвижения(Объект, НачДата, КонДата, ГеокодироватьАдреса, ВключатьДанныеДатчиков, ПараметрыБулево);
КонецФункции // ПолучитьИнтервалыДвижения()

// Приводит переданную дату к универсальному времени.
//  (Стандартная функция некорректно работает с летним временем).
//
// Параметры:
//  ДатаВремя	 - Дата	 - Исходная дата.
// 
// Возвращаемое значение:
//  Дата - Дата по Гринвичу.
//
Функция ПривестиКДатеВремениПоГринвичу(ДатаВремя) Экспорт
	Возврат ItobОперативныйМониторинг.ПривестиКДатеВремениПоГринвичу(ДатаВремя);
КонецФункции // ПривестиКДатеВремениПоГринвичу()

// Формирует таблицу маршрута для заданного объекта мониторинга.
//
// Параметры:
//  Объект					 - СправочникСсылка.упСотрудники, СправочникСсылка.упТранспортныеСредства	 - Объект мониторинга.
//  НачДата					 - Дата																		 - Период начала маршрута.
//  КонДата					 - Дата																		 - Период окончания маршрута.
//  ВключатьДанныеДатчиков	 - Булево, Неопределено														 - Включать данные датчиков.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Маршрут объекта мониторинга.
//
Функция СформироватьМаршрутОбъектаМониторинга(Объект, НачДата, КонДата, ВключатьДанныеДатчиков=Неопределено) Экспорт
	Возврат ItobОперативныйМониторинг.СформироватьМаршрутОбъектаМониторинга(Объект, НачДата, КонДата, ВключатьДанныеДатчиков);
КонецФункции // СформироватьМаршрутОбъектаМониторинга()

// Возвращает параметры сдвига времени.
//
// Параметры:
//  УниверсальноеВремя	 - Дата, Неопределено	 - Текущая универсальная дата.
// 
// Возвращаемое значение:
//  Структура - Параметры сдвига времени.
//
Функция ПолучитьПараметрыСдвигаВремени(УниверсальноеВремя = Неопределено) Экспорт
	Возврат ItobОперативныйМониторинг.ПолучитьПараметрыСдвигаВремени(УниверсальноеВремя);
КонецФункции // ПолучитьПараметрыСдвигаВремени()

// Возвращает данные датчика объекта мониторинга.
//
// Параметры:
//  Объект								 - СправочникСсылка.упСотрудники, СправочникСсылка.упТранспортныеСредства	 - Объект мониторинга.
//  НачДата								 - Дата																		 - Период начала данных по датчику.
//  КонДата								 - Дата																		 - Период окончания данных по датчику.
//  Датчик								 - СправочникСсылка.ItobДатчики												 - Ссылка на справочник "Датчики".
//  РасширитьГраницыКоличествоЗаписей	 - Число																	 - Расширяет границу количества записей.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Данные датчика.
//
Функция ПолучитьДанныеДатчикаОбъекта(Объект, НачДата, КонДата, Датчик, РасширитьГраницыКоличествоЗаписей=0) Экспорт
	Возврат ItobОперативныйМониторинг.ПолучитьДанныеДатчикаОбъекта(Объект, НачДата, КонДата, Датчик, РасширитьГраницыКоличествоЗаписей);	
КонецФункции // ПолучитьДанныеДатчикаОбъекта()

// Возвращает терминал, привязанный к переданному объекту.
//
// Параметры:
//  ТекущийОбъект	 - СправочникСсылка.упСотрудники, СправочникСсылка.упТранспортныеСредства	 - Объект мониторинга.
//  НаДату			 - Дата																		 - Учетная дата.
// 
// Возвращаемое значение:
//  СправочникСсылка.ItobТерминалы - Привязанный терминал.
//
Функция ПолучитьПривязанныйТерминал(ТекущийОбъект, НаДату=Неопределено) Экспорт
	
	Возврат ItobОперативныйМониторинг.ПолучитьПривязанныйТерминал(ТекущийОбъект, НаДату);
	
КонецФункции

// Возвращает пробег объекта.
//
// Параметры:
//  ТекущийОбъект	 - СправочникСсылка.упСотрудники, СправочникСсылка.упТранспортныеСредства	 - Объект мониторинга.
//  НачДата			 - Дата																		 - Начала периода пробега.
//  КонДата			 - Дата																		 - Окончание периода пробега.
// 
// Возвращаемое значение:
//  Число - Пробег
//
Функция ПолучитьПробегОбъекта(ТекущийОбъект, НачДата, КонДата) Экспорт
	Возврат ItobОперативныйМониторинг.ПолучитьПробегОбъекта(ТекущийОбъект, НачДата, КонДата);	
КонецФункции // ПолучитьПробегОбъекта()

// Возвращает адрес сервиса CsmSvc.
// 
// Возвращаемое значение:
//  Строка - Адрес сервиса.
//
Функция ПолучитьАдресСервисаCsmSvcСервер() Экспорт
	Возврат ItobОперативныйМониторинг.ПолучитьАдресСервисаCsmSvcСервер();	
КонецФункции // ПолучитьАдресСервисаCsmSvcСервер()

#КонецОбласти 
