
////////////////////////////////////////////////////////////////////////////////
// Служебный программный модуль механизмов модификации конфигурации.
// Режим работы: вызов сервера.
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьЗначениеКонстанты(Знач ИмяКонстанты) Экспорт
	
	Возврат Константы[ИмяКонстанты].Получить();
	
КонецФункции // ПолучитьЗначениеКонстанты()

Функция ЕстьРасписаниеДвиженияПоУИДПунктаМаршрута(МаршрутСсылка, УИДПункта) Экспорт 
	
	Если Не ЗначениеЗаполнено(МаршрутСсылка) Тогда
		Возврат Ложь;
	
	ИначеЕсли уатРаботаСМетаданными.уатЕстьРегистрСведений("уатРасписаниеРейсов") Тогда
		НаборЗаписей = РегистрыСведений.уатРасписаниеРейсов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Маршрут.Установить(МаршрутСсылка);
		НаборЗаписей.Отбор.УИДПункта.Установить(УИДПункта);
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() > 0 Тогда
			Возврат Истина;
		Иначе 
			Возврат Ложь;
		КонецЕсли;
		
	Иначе 
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции 

Процедура УдалитьПунктПриУдаленииСтрокиМаршрута(МаршрутСсылка, УИДПункта) Экспорт
	
	Если Не ЗначениеЗаполнено(МаршрутСсылка) Тогда
		Возврат;
	Иначе
		НаборЗаписей = РегистрыСведений.уатРасписаниеРейсов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Маршрут.Установить(МаршрутСсылка);
		НаборЗаписей.Отбор.УИДПункта.Установить(УИДПункта);
		НаборЗаписей.Записать(Истина);
	КонецЕсли;
	
КонецПроцедуры

Функция ПравоРедактированиеОтчета() Экспорт
	
	Возврат ПравоДоступа("Использование", Метаданные.Отчеты.уатЗадолженностьПоКонтрагентам);
	
КонецФункции 

#КонецОбласти