
#Область ОбработчикиСобытийФормы

// Обработчик события "ПриСозданииНаСервере" формы
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
                                                                   
	Если ЗначениеЗаполнено(Параметры.СписокСобытий.Количество()) Тогда
		
		Для Каждого Эл Из Параметры.СписокСобытий Цикл
			СписокСобытий.Добавить(Эл.Значение,Эл.Представление);			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "ПриОткрытии" формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(СписокСобытий) Тогда
		Элементы.Период.Заголовок = СписокСобытий.Получить(0).Значение.Период;
		Элементы.Объект.Заголовок = СписокСобытий.Получить(0).Значение.Объект;
		Элементы.Событие.Заголовок =  СписокСобытий.Получить(0).Представление;
		
		Если СписокСобытий.Количество() = 1 Тогда
			Элементы.КнопкаСледующее.Доступность = Ложь;
		КонецЕсли;
		
	КонецЕсли;		
	 
КонецПроцедуры
	
#КонецОбласти 

#Область ОбработчикиКомандФормы
	
&НаКлиенте
Процедура КомандаСледующее(Команда)
				
	Если СписокСобытий.Количество() > 1 Тогда			
		СписокСобытий.Удалить(0);
		Элементы.Период.Заголовок = СписокСобытий.Получить(0).Значение.Период;
		Элементы.Объект.Заголовок = СписокСобытий.Получить(0).Значение.Объект;
		Элементы.Событие.Заголовок =  СписокСобытий.Получить(0).Представление;
		
	КонецЕсли;	
	
	Если СписокСобытий.Количество() = 1 Тогда
		Элементы.КнопкаСледующее.Доступность = Ложь;
		
 	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти 
