#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Выполняет заполнение предопределенных элементов справочника
//
Процедура ЗаполнитьПредопределенныеДанные() Экспорт
	Макет = Справочники.уатШаблоныЗаполненияПоУслугам.ПолучитьМакет("НастройкиПредопределенныхЭлементов");
	ОбластьНастроек = Макет.ПолучитьОбласть("Строки|Колонки");
	
	Для НомерСтроки = 1 По ОбластьНастроек.ВысотаТаблицы Цикл
		ИмяПредопрЭлемента = ОбластьНастроек.Область(НомерСтроки, 1, НомерСтроки, 1).Текст;
		
		Попытка
			ТекЭлемент = Справочники.уатШаблоныЗаполненияПоУслугам[ИмяПредопрЭлемента];
		Исключение
			Продолжить;
		КонецПопытки;
		
		СпрОбъект = ТекЭлемент.ПолучитьОбъект();
		
		СпрОбъект.ПолучательУслуг                        = Перечисления.уатПолучателиУслуг[ОбластьНастроек.Область(НомерСтроки, 2, НомерСтроки, 2).Текст];
		СпрОбъект.РежимЗаполнения                        = Число(ОбластьНастроек.Область(НомерСтроки, 3, НомерСтроки, 3).Текст);
		СпрОбъект.СворачиватьПоПолямДетализации          = Число(ОбластьНастроек.Область(НомерСтроки, 4, НомерСтроки, 4).Текст);
		СпрОбъект.ИспользоватьДанныеТТД                  = Число(ОбластьНастроек.Область(НомерСтроки, 5, НомерСтроки, 5).Текст);
		СпрОбъект.ИспользоватьДанныеЗаказНаТС            = Число(ОбластьНастроек.Область(НомерСтроки, 6, НомерСтроки, 6).Текст);
		Если НЕ уатОбщегоНазначенияПовтИсп.ВариантПоставкиСТД() Тогда
			СпрОбъект.ИспользоватьДанныеЗаказПеревозчику = Число(ОбластьНастроек.Область(НомерСтроки, 7, НомерСтроки, 7).Текст);
			СпрОбъект.ИспользоватьДанныеМаршрутныйЛист   = Число(ОбластьНастроек.Область(НомерСтроки, 10, НомерСтроки, 10).Текст);
		КонецЕсли;
		Если уатОбщегоНазначенияПовтИсп.ВариантПоставкиТакси() Тогда
			СпрОбъект.ИспользоватьДанныеЗаказТакси = Число(ОбластьНастроек.Область(НомерСтроки, 8, НомерСтроки, 8).Текст);
			СпрОбъект.ИспользоватьДанныеАрендаТС   = Число(ОбластьНастроек.Область(НомерСтроки, 9, НомерСтроки, 9).Текст);
		КонецЕсли;
		СпрОбъект.ИспользоватьДанныеКорректировкаЗаписей = Число(ОбластьНастроек.Область(НомерСтроки, 11, НомерСтроки, 11).Текст);
		СпрОбъект.СортировкаЗаказов                      = Число(ОбластьНастроек.Область(НомерСтроки, 12, НомерСтроки, 12).Текст);
		СпрОбъект.ИспользоватьДанныеРекламаций           = Число(ОбластьНастроек.Область(НомерСтроки, 13, НомерСтроки, 13).Текст);
		СпрОбъект.ИспользоватьДанныеСтраховойСертификат  = Число(ОбластьНастроек.Область(НомерСтроки, 14, НомерСтроки, 14).Текст);
		
		СпрОбъект.Записать();
	КонецЦикла;
КонецПроцедуры

// Функция возвращает строковое представление через запятую состава документов,
// данные которых используются в шаблоне заполнения услуг
//
// Параметры:
//  ШаблонЗаполнения - СправочникОбъект.уатШаблоныЗаполненияПоУслугам - шаблон заполнения
// 
// Возвращаемое значение:
//  Строка - состав видов документов
//
Функция ПредставлениеВидыДокументов(ШаблонЗаполнения) Экспорт
	
	НадписьВидыДокументов =
		?(ШаблонЗаполнения.ИспользоватьДанныеТТД, "ТТД, ", "") +
		?(ШаблонЗаполнения.ИспользоватьДанныеЗаказНаТС, "Заказ на ТС, ", "") +
		?(ШаблонЗаполнения.ИспользоватьДанныеЗаказПеревозчику, "Заказ перевозчику, ", "") +
		?(ШаблонЗаполнения.ИспользоватьДанныеМаршрутныйЛист, "Маршрутный лист, ", "") +
		?(ШаблонЗаполнения.ИспользоватьДанныеРекламаций, "Рекламация, ", "") +
		?(ШаблонЗаполнения.ИспользоватьДанныеСтраховойСертификат, "Страховой сертификат, ", "") +
		?(ШаблонЗаполнения.ИспользоватьДанныеЗаказТакси, "Заказ такси, ", "") +
		?(ШаблонЗаполнения.ИспользоватьДанныеАрендаТС, "Аренда ТС, ", "") +
		?(ШаблонЗаполнения.ИспользоватьДанныеКорректировкаЗаписей, "Корректировка записей регистров, ", "");
	Возврат НадписьВидыДокументов;
	
КонецФункции

#КонецОбласти

#КонецЕсли
