
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	уатЗащищенныеФункцииСервер.уатДокументФормаСпискаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
    ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	Если Не ПравоДоступа("Редактирование", Метаданные.Документы.уатНачислениеЗарплаты) Тогда 
		Элементы.ФормаИзменитьВыделенные.Видимость = Ложь;
		Элементы.СписокКонтекстноеМенюИзменитьВыделенные.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	уатЗащищенныеФункцииКлиент.уатДокументФормаСпискаПриОткрытии(Отказ, ЭтотОбъект, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормы_Список

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ИзменитьВыделенные(Команда)
	
	ГрупповоеИзменениеОбъектовКлиент.ИзменитьВыделенные(Элементы.Список, Список);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоШтрафам(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИзФормыСписка", Истина);
	Оповещ = Новый ОписаниеОповещения("ЗаполнитьПоШтрафамЗавершение", ЭтотОбъект);
    ОткрытьФорму("Документ.уатНачислениеУдержаний.Форма.ЗаполнениеПоШтрафам", ПараметрыФормы,,,,, Оповещ);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоШтрафамЗавершение(Результат, ДопПараметры) Экспорт
	Если ТипЗнч(Результат) = Тип("Структура") И Результат.Свойство("Штрафы")
		И ТипЗнч(Результат.Штрафы) = Тип("Массив") И Результат.Штрафы.Количество() > 0 Тогда
		
		мсвУдержаний = ПолучитьУдержанияПоДаннымШтрафов(Результат.Штрафы, Результат.ПериодНачисления);
		Если Результат.Свойство("Действие") И Результат.Действие = 1 Тогда
			ПровестиУдержанияПоШтрафам(мсвУдержаний);
			Элементы.Список.Обновить();
		Иначе
			Для Каждого ТекДок Из мсвУдержаний Цикл
				ОткрытьФорму("Документ.уатНачислениеУдержаний.ФормаОбъекта", ТекДок,, Новый УникальныйИдентификатор);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьУдержанияПоДаннымШтрафов(мсвШтрафы, ПериодНачисления)

	мсвОрганизации = Новый Массив;
	мсвСотрудники = Новый Массив;
	Для Каждого ТекСтрока Из мсвШтрафы Цикл
		Если мсвОрганизации.Найти(ТекСтрока.Организация) = Неопределено Тогда
			мсвОрганизации.Добавить(ТекСтрока.Организация);
		КонецЕсли;
		Если мсвСотрудники.Найти(ТекСтрока.Сотрудник) = Неопределено Тогда
			мсвСотрудники.Добавить(ТекСтрока.Сотрудник);
		КонецЕсли;
	КонецЦикла;
	    
	мсвРез = Новый Массив;
	Для Каждого ТекОрганизация Из мсвОрганизации Цикл
		Для Каждого ТекСотрудник Из мсвСотрудники Цикл
			мсвСтрокУдержания = Новый Массив;
			
			Для Каждого ТекСтрока Из мсвШтрафы Цикл
				Если ТекСтрока.Организация <> ТекОрганизация ИЛИ ТекСтрока.Сотрудник <> ТекСотрудник Тогда
					Продолжить;
				КонецЕсли;
				
				мсвСтрокУдержания.Добавить(ТекСтрока);
			КонецЦикла;
			
			СтруктураДокумента = Новый Структура;
			СтруктураДокумента.Вставить("Организация",      ТекОрганизация);
			СтруктураДокумента.Вставить("Сотрудник",        ТекСотрудник);
			СтруктураДокумента.Вставить("ПериодНачисления", ПериодНачисления);
			СтруктураДокумента.Вставить("Удержания",        мсвСтрокУдержания);
						
			мсвРез.Добавить(СтруктураДокумента);
		КонецЦикла;
	КонецЦикла;
	
	Возврат мсвРез;
	
КонецФункции

&НаСервере
Процедура ПровестиУдержанияПоШтрафам(мсвУдержаний)
	Для Каждого ТекДок Из мсвУдержаний Цикл
		ДокОбъект = Документы.уатНачислениеУдержаний.СоздатьДокумент();
		ДокОбъект.Заполнить(Неопределено);
		ДокОбъект.Дата = ТекущаяДата();
		ДокОбъект.Ответственный = уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(
			ПользователиКлиентСервер.АвторизованныйПользователь(), "ОсновнойОтветственный");
		ДокОбъект.Подразделение = уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(
			ПользователиКлиентСервер.АвторизованныйПользователь(), "ОсновноеПодразделениеОрганизации");
		ЗаполнитьЗначенияСвойств(ДокОбъект, ТекДок, , "Удержания");
		
		Для Каждого ТекСтрока Из ТекДок.Удержания Цикл
			НоваяСтрока = ДокОбъект.Удержания.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		КонецЦикла;
		ДокОбъект.СуммаДокумента = ДокОбъект.Удержания.Итог("Сумма");
		
		Если ДокОбъект.ПроверитьЗаполнение() Тогда
			Попытка
				ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				ОбщегоНазначения.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
 

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
