
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокАдресов = Неопределено;
	Если ЭтаФорма.Параметры.Свойство("НайденныеВарианты", СписокАдресов) Тогда
		
		Для каждого ЭлементСписка Из СписокАдресов Цикл
			ЗаполнитьЗначенияСвойств(ТаблицаВариантов.Добавить(), ЭлементСписка.Значение);
		
		КонецЦикла;
		
	
	КонецЕсли;
	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаВариантов

&НаКлиенте
Процедура ТаблицаВариантовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Рез = Новый Структура("Адрес,Широта,Долгота");
	ЗаполнитьЗначенияСвойств(Рез, ТаблицаВариантов[ВыбраннаяСтрока]);
	Рез.Вставить("Результат", Истина);
	ЭтаФорма.Закрыть(Рез);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	ТекущиеДанные = Элементы.ТаблицаВариантов.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Рез = Новый Структура("Адрес,Широта,Долгота");
		ЗаполнитьЗначенияСвойств(Рез, ТекущиеДанные);
		Рез.Вставить("Результат", Истина);
		ЭтаФорма.Закрыть(Рез);	
	
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти
