#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	

#Область СлужебныйПрограммныйИнтерфейс

// Заполняет услуги по выбранной табличной части
//  используется в УЭ
//
// Параметры:
//  ТЧ					 - 	 - табличная часть для заполнения
//  СтруктураПараметров	 - 	 - структура отбора для заполнения
//
Процедура ЗаполнитьУслугиПоТЧ(ТЧ, СтруктураПараметров) Экспорт
	Если Услуги.Количество() > 0 И СтруктураПараметров.Свойство("ОчиститьТаблицу") И СтруктураПараметров.ОчиститьТаблицу Тогда
		Услуги.Очистить();
	КонецЕсли;
	
	флПоЗаказам = Ложь;
	мВалютаРегламентированногоУчета = уатОбщегоНазначенияТиповые.ВалютаРегламентированногоУчета(Организация);
	СтруктураПараметров.Свойство("ПоЗаказам", флПоЗаказам);	
	
	Для Каждого СтрокаТЧ Из ТЧ Цикл
		НоваяСтрока = Услуги.Добавить();
		СтрокаСодержание = ?(уатОбщегоНазначения.уатЗначениеНеЗаполнено(СтрокаТЧ.Услуга), "", Строка(СтрокаТЧ.Услуга))
			+ ?(СтруктураПараметров.ПоЗаказам, " Заказ :" + Строка(СтрокаТЧ.Заказ), "" ) 
			+ ?(СтруктураПараметров.ПоОперациям, " Операция :" + Строка(СтрокаТЧ. Операция), "" );
		НоваяСтрока.Номенклатура     = СтрокаТЧ.Услуга;
		НоваяСтрока.Содержание       = СтрокаСодержание;
		НоваяСтрока.Количество       = СтрокаТч.Количество;
		НоваяСтрока.СтавкаНДС        = СтрокаТЧ.СтавкаНДС;
		
		мСуммаРегл 					 = СтрокаТЧ.СуммаРегл - ?(УчитыватьНДС И НЕ СуммаВключаетНДС, СтрокаТЧ.СуммаНДС, 0);
		НоваяСтрока.Сумма            = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(мСуммаРегл,
			мВалютаРегламентированногоУчета, ВалютаДокумента,
			Дата, Дата,,,, ЭтотОбъект);
		
		НоваяСтрока.СуммаНДС         = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(СтрокаТЧ.СуммаНДС,
			мВалютаРегламентированногоУчета, ВалютаДокумента,
			Дата, Дата,,,, ЭтотОбъект);
			
		НоваяСтрока.Цена 			 = НоваяСтрока.Сумма/НоваяСтрока.Количество;
		
		Если флПоЗаказам тогда
			НоваяСтрока.Заказ		 = СтрокаТЧ.Заказ;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	уатОбщегоНазначенияСервер.Заполнить(ЭтотОбъект, ДанныеЗаполнения);

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.уатСчетНаОплатуПокупателю") Тогда
		// Заполнение шапки
		Сделка                    = ДанныеЗаполнения;
		Организация 			  = ДанныеЗаполнения.Организация;
		ВалютаДокумента 		  = ДанныеЗаполнения.ВалютаДокумента;
		ДоговорКонтрагента 		  = ДанныеЗаполнения.ДоговорКонтрагента;
		Комментарий 			  = ДанныеЗаполнения.Комментарий;
		Контрагент 				  = ДанныеЗаполнения.Контрагент;
		//КратностьВзаиморасчетов = ДанныеЗаполнения.КратностьВзаиморасчетов;
		//КурсВзаиморасчетов 		= ДанныеЗаполнения.КурсВзаиморасчетов;	
		ВалютаДокументаКурсКратность = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(ВалютаДокумента, ДатаКурса, ЭтотОбъект);
		КурсВзаиморасчетов        = ВалютаДокументаКурсКратность.Курс;
		КратностьВзаиморасчетов   = ВалютаДокументаКурсКратность.Кратность;
		Ответственный 			  = уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(
						  ПользователиКлиентСервер.АвторизованныйПользователь(), "ОсновнойОтветственный");
		БанковскийСчетОрганизации = ДанныеЗаполнения.СтруктурнаяЕдиница;
		СуммаВключаетНДС 		  = ДанныеЗаполнения.СуммаВключаетНДС;
		СуммаДокумента 			  = ДанныеЗаполнения.СуммаДокумента;
		УчитыватьНДС 			  = ДанныеЗаполнения.УчитыватьНДС;
		ДокументОснование		  = ДанныеЗаполнения.Ссылка;
		ОбъектСтроительства       = ДанныеЗаполнения.ОбъектСтроительства;
		Для Каждого ТекСтрокаУслуги Из ДанныеЗаполнения.Услуги Цикл
			НоваяСтрока = Услуги.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаУслуги);
			Если НЕ ЗначениеЗаполнено(НоваяСтрока.СтатьяДоходов) Тогда
				НоваяСтрока.СтатьяДоходов = уатОбщегоНазначенияСервер.СтатьяДоходовНоменклатуры(НоваяСтрока.Номенклатура);
			КонецЕсли;
		КонецЦикла;
		СуммаДокумента = уатОбщегоНазначенияТиповые.уатПолучитьСуммуДокументаСНДС(ЭтотОбъект, "Услуги");
		ВалютаВзаиморасчетов = ДоговорКонтрагента.ВалютаВзаиморасчетов;
		КроссКурс            = уатОбщегоНазначенияСервер.ПолучитьКроссКурс(ВалютаДокумента, ВалютаВзаиморасчетов,
			ДатаКурса,, ЭтотОбъект);
		СуммаВзаиморасчетов  = уатОбщегоНазначения_проф.СуммаВзаиморасчетовДокумента(ЭтотОбъект);
		Если ПолучитьФункциональнуюОпцию("уатИспользоватьПлатежныйКалендарь") = Истина Тогда
			ЭтапОплаты = ДанныеЗаполнения.ЭтапОплаты;
		КонецЕсли;
		СтандартнаяОбработка = Ложь;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.уатРеестрПеревозок")
		И ЗначениеЗаполнено(ДанныеЗаполнения.Контрагент) Тогда
		Организация                  = ДанныеЗаполнения.Организация;
		Подразделение                = ДанныеЗаполнения.Подразделение;
		Контрагент                   = ДанныеЗаполнения.Контрагент;
		ДоговорКонтрагента           = ДанныеЗаполнения.ДоговорКонтрагента;
		СуммаДокумента               = ДанныеЗаполнения.СуммаДокумента;
		УчитыватьНДС                 = ДанныеЗаполнения.УчитыватьНДС; 
		СуммаВключаетНДС             = ДанныеЗаполнения.СуммаВключаетНДС;
		Комментарий                  = "Заполнен на основании " + ДанныеЗаполнения;
		ВалютаДокумента              = ДанныеЗаполнения.ВалютаДокумента;
		ВалютаДокументаКурсКратность = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(ВалютаДокумента, ДатаКурса, ЭтотОбъект);
		КурсВзаиморасчетов           = ВалютаДокументаКурсКратность.Курс;
		КратностьВзаиморасчетов      = ВалютаДокументаКурсКратность.Кратность;
		ДокументОснование            = ДанныеЗаполнения;
		ДатаНач                      = ДанныеЗаполнения.ДатаНач;
		ДатаКон                      = ДанныеЗаполнения.ДатаКон;
		
		КоличествоСтрокРекламаций = 0;
		Для Каждого ТекСтрока Из ДанныеЗаполнения.Услуги Цикл
			НоваяСтрока = Услуги.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
			Если ТекСтрока.Сумма < 0 Тогда
				КоличествоСтрокРекламаций = КоличествоСтрокРекламаций + 1;
			КонецЕсли;
		КонецЦикла;
		
		Если КоличествоСтрокРекламаций > 0 Тогда
			ТекстНСтр = НСтр("ru = 'При заполнении добавлены строки (%1 шт.) по рекламациям с отрицательной суммой."
"Необходимо вручную распределить эти суммы по строкам услуг соответствующих заказов.'; en = 'When filling out the form, rows (%1 item) were added for claims with negative amounts."
"These amounts must be manually distributed across the service lines of the corresponding orders.'");
			ТекстНСтр = СтрШаблон(ТекстНСтр, КоличествоСтрокРекламаций);
			ОбщегоНазначения.СообщитьПользователю(ТекстНСтр);
		КонецЕсли;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		уатОбщегоНазначения.ОбработкаЗаполненияФормаВыборКонтрагента(ДанныеЗаполнения, ДополнительныеСвойства);
		
	КонецЕсли;
	
	УПД = ДоговорКонтрагента.ДокументРеализацииУПД;
		
КонецПроцедуры // ОбработкаЗаполнения()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	уатПроведение_проф.ПолучитьСтарыеЗаказыПередЗаписью(ЭтотОбъект);
	
	// Посчитать суммы документа и записать ее в соответствующий реквизит шапки для показа в журналах
	СуммаДокумента = уатОбщегоНазначенияТиповые.уатПолучитьСуммуДокументаСНДС(ЭтотОбъект, "Услуги");
	
	Если НЕ Отказ И ПолучитьФункциональнуюОпцию("уатИспользоватьПлатежныйКалендарь")
		И (ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказамНаТС
		ИЛИ ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоНакладным)
		И ДоговорКонтрагента.ГрафикОплаты.Количество() = 1 Тогда
		ЭтапОплаты = ДоговорКонтрагента.ГрафикОплаты[0].ЭтапОплаты;
	КонецЕсли;
	
	Если НЕ Отказ И НЕ ЭтоНовый() Тогда
		ДополнительныеСвойства.Вставить("СсылкаПометкаУдаления", Ссылка.ПометкаУдаления);
	КонецЕсли;
КонецПроцедуры // ПередЗаписью

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		ПроверитьСоответствиеРеквизитовСчетаФактурыВыданного();
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	уатПроведение.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	Документы.уатРеализацияУслуг.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей.
	уатПроведение.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	уатПроведение.ОтразитьВыставленныеУслуги(ДополнительныеСвойства, Движения, Отказ);
	уатПроведение_проф.ОтразитьВзаиморасчетыСКонтрагентами(ДополнительныеСвойства, Движения, Отказ);
	уатПроведение_проф.ОтразитьРасчетыПоЗаказамНаТС(ДополнительныеСвойства, Движения, Отказ);
		
	уатПроведение.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	Документы.уатРеализацияУслуг.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ);
	
	Если НЕ Отказ Тогда
		уатПроведение_проф.ОбновитьПлатежныйКалендарьПриЗаписиДокумента(ЭтотОбъект);
	КонецЕсли;
		
	уатУчетОригиналовПервичныхДокументов.СформироватьДвиженияРеестрДокументов(Ссылка);
	
КонецПроцедуры // ОбработкаПроведения()

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для проведения документа
	уатПроведение.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	уатПроведение.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	уатПроведение.ЗаписатьНаборыЗаписей(ЭтотОбъект);

	// Контроль
	Документы.уатРеализацияУслуг.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ, Истина);
	
	Если НЕ Отказ Тогда
		уатПроведение_проф.ОбновитьПлатежныйКалендарьПриЗаписиДокумента(ЭтотОбъект);
	КонецЕсли;
			
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Заголовок = уатОбщегоНазначенияТиповые.уатПредставлениеДокументаПриПроведении(ЭтотОбъект);
	
	уатОбщегоНазначенияТиповые.уатПроверитьЧтоНетТоваров(ЭтотОбъект, "Услуги", , Отказ, Заголовок);
	
	Если УчитыватьНДС Тогда
		ПроверяемыеРеквизиты.Добавить("Услуги.СтавкаНДС");
	КонецЕсли;
	
	Если ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам Тогда
		ПроверяемыеРеквизиты.Добавить("Сделка");
	ИначеЕсли ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказамНаТС Тогда
		ПроверяемыеРеквизиты.Добавить("Услуги.Заказ");
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("уатМноговалютныйУчет") = Истина Тогда
		ПроверяемыеРеквизиты.Добавить("ВалютаВзаиморасчетов");
	КонецЕсли;
	
	// платежный календарь
	Если ПолучитьФункциональнуюОпцию("уатИспользоватьПлатежныйКалендарь") Тогда
		Если НЕ Отказ
			И (НЕ ЗначениеЗаполнено(ЭтапОплаты))
			И (ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказамНаТС
			ИЛИ ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоНакладным
			ИЛИ ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам)
			И ДоговорКонтрагента.ГрафикОплаты.Количество() > 0 Тогда
		
			ТекстНСтр = НСтр("ru = 'Не указан Этап оплаты'; en = 'Payment stage not specified'");
			ОбщегоНазначения.СообщитьПользователю(ТекстНСтр,, "Объект.ЭтапОплаты",, Отказ);
		КонецЕсли;
		Если НЕ Отказ Тогда
			ТекстСообщения = "";
			флОтказ = уатОбщегоНазначения_проф.НайтиДубльНакладнойСчетаПоЭтапуОплаты(ЭтотОбъект, ТекстСообщения);
			Если флОтказ Тогда
				уатОбщегоНазначенияТиповые.СообщитьОбОшибке(ТекстСообщения, Отказ, Заголовок);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Для НомерСтроки = 0 ПО Услуги.Количество()-1 Цикл
		ТекСтрока = Услуги[НомерСтроки];
		Если ТекСтрока.Сумма < 0 Тогда
			ТекстНСтр = НСтр("ru = 'Стоимость услуг должна быть положительной'; en = 'The cost of services must be positive'");
			ОбщегоНазначения.СообщитьПользователю(ТекстНСтр,, СтрШаблон("Объект.Услуги[%1].Сумма", НомерСтроки),, Отказ);
		КонецЕсли;
	КонецЦикла;
	
	уатОбщегоНазначения.ПроверкаЗаполненияПодразделения(Организация, Подразделение, Отказ, Заголовок);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ДатаПлатежа = '00010101';
	ДатаКурса   = '00010101';
	СтатусУПД = Неопределено;
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Процедура ОбработкаЗаполненияИзФормыВыбораКонтрагента(мДокументОснование, ДанныеЗаполнения) Экспорт
	
	Если ТипЗнч(мДокументОснование) = Тип("ДокументСсылка.уатМаршрутныйЛист") Тогда
		ОбработкаЗаполненияМЛ(мДокументОснование, ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(мДокументОснование) = Тип("ДокументСсылка.уатЗаказГрузоотправителя") Тогда
		ОбработкаЗаполненияЗГ(мДокументОснование, ДанныеЗаполнения); 
	ИначеЕсли уатОбщегоНазначенияПовтИсп.ВариантПоставкиТакси()
		И (ТипЗнч(мДокументОснование) = Тип("ДокументСсылка.такАрендаТС")
		ИЛИ ТипЗнч(мДокументОснование) = Тип("ДокументСсылка.такЗаказТакси")) Тогда 
		ОбработкаЗаполненияТакси(мДокументОснование, ДанныеЗаполнения);
	Иначе
		ОбработкаЗаполненияТТД(мДокументОснование, ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполненияТТД(мДокументОснование, ДанныеЗаполнения)
	
	Дата = ТекущаяДата();
	ДокументОснование       = мДокументОснование;
	Организация             = мДокументОснование.Организация;
	Подразделение           = мДокументОснование.Подразделение;
	Контрагент              = мДокументОснование.Контрагент;
	ДоговорКонтрагента      = мДокументОснование.ДоговорКонтрагента;
	УчитыватьНДС            = мДокументОснование.УчитыватьНДС; 
	СуммаВключаетНДС        = мДокументОснование.СуммаВключаетНДС;
	СуммаДокумента 			= мДокументОснование.СуммаДокумента;
	Комментарий             = "Заполнен на основании " + мДокументОснование;
	ВалютаДокумента 		= мДокументОснование.ВалютаДокумента;
	//КратностьВзаиморасчетов = ДанныеЗаполнения.КратностьВзаиморасчетов;
	//КурсВзаиморасчетов 		= ДанныеЗаполнения.КурсВзаиморасчетов;	
	ВалютаДокументаКурсКратность = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(ВалютаДокумента, ДатаКурса, ЭтотОбъект);
	КурсВзаиморасчетов      = ВалютаДокументаКурсКратность.Курс;
	КратностьВзаиморасчетов = ВалютаДокументаКурсКратность.Кратность;
	Если ДанныеЗаполнения.Количество() > 0 Тогда
		ОбъектСтроительства = ДанныеЗаполнения[0].ОбъектСтроительства;
	КонецЕсли;
	
	МассивСтрок = Новый Массив();
	Для Каждого ТекСтрока Из ДанныеЗаполнения Цикл
		МассивСтрок.Добавить(ТекСтрока.НомерСтроки);
	КонецЦикла;
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатЭкипажТС.ТС КАК ТС,
	|	МАКСИМУМ(уатЭкипажТС.Сотрудник) КАК Сотрудник
	|ПОМЕСТИТЬ ВодителиТС
	|ИЗ
	|	РегистрСведений.уатЭкипажТС КАК уатЭкипажТС
	|ГДЕ
	|	уатЭкипажТС.ЧленЭкипажа = ЗНАЧЕНИЕ(Перечисление.уатЧленыЭкипажа.ОсновнойВодитель)
	|
	|СГРУППИРОВАТЬ ПО
	|	уатЭкипажТС.ТС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗНАЧЕНИЕ(Перечисление.уатПолучателиУслуг.Контрагент) КАК ПолучательУслуг,
	|	уатТТДСтоимость.ПутЛист КАК ПутевойЛист,
	|	уатТТДСтоимость.ПутЛист.ТранспортноеСредство КАК ТС,
	|	уатТТДСтоимость.ПутЛист.ТранспортноеСредство.Модель КАК МодельТС,
	|	ВЫБОР
	|		КОГДА уатТТДСтоимость.ПутЛист.Водитель1 = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(ВодителиТС.Сотрудник, ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка))
	|		ИНАЧЕ уатТТДСтоимость.ПутЛист.Водитель1
	|	КОНЕЦ КАК Водитель,
	|	уатТТДСтоимость.ПараметрВыработки КАК ПараметрВыработки,
	|	уатТТДСтоимость.НоменклатураУслуги КАК Услуга,
	|	уатТТДСтоимость.Маршрут КАК Маршрут,
	|	уатТТДСтоимость.ОбъектСтроительства КАК ОбъектСтроительства,
	|	уатТТДСтоимость.Количество КАК Количество,
	|	уатТТДСтоимость.СтавкаНДС КАК СтавкаНДС,
	|	уатТТДСтоимость.Сумма КАК Сумма,
	|	уатТТДСтоимость.СуммаНДС КАК СуммаНДС,
	|	уатТТДСтоимость.Цена КАК Цена,
	|	уатТТДСтоимость.СтатьяДоходов КАК СтатьяДоходов,
	|	ЗНАЧЕНИЕ(Справочник.уатПунктыНазначения.ПустаяСсылка) КАК ПунктОтправления,
	|	ЗНАЧЕНИЕ(Справочник.уатПунктыНазначения.ПустаяСсылка) КАК ПунктПрибытия,
	|	ЗНАЧЕНИЕ(Документ.уатЗаказГрузоотправителя.ПустаяСсылка) КАК Заказ,
	|	ЗНАЧЕНИЕ(Документ.уатЗаказПеревозчику_уэ.ПустаяСсылка) КАК ЗаказПеревозчику,
	|	уатТТДСтоимость.Содержание КАК Содержание,
	|	уатТТДСтоимость.НомерСтроки КАК НомерСтроки,
	|	уатТТДСтоимость.Ссылка.НомерТТНКонтрагента КАК НомерТТНКонтрагента
	|ИЗ
	|	Документ.уатТТД.Стоимость КАК уатТТДСтоимость
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВодителиТС КАК ВодителиТС
	|		ПО уатТТДСтоимость.ПутЛист.ТранспортноеСредство = ВодителиТС.ТС
	|ГДЕ
	|	уатТТДСтоимость.Ссылка = &Ссылка
	|	И уатТТДСтоимость.НомерСтроки В(&МассивСтрок)";
	Запрос.УстановитьПараметр("Ссылка", мДокументОснование);
	Запрос.УстановитьПараметр("МассивСтрок", МассивСтрок);
	
	тблРезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	флМноговалютныйУчет = ПолучитьФункциональнуюОпцию("уатМноговалютныйУчет");
	КэшКурсов = Неопределено;

	уатОбщегоНазначения.УстановитьДопПоляДетализации(тблРезультатЗапроса, ДоговорКонтрагента,
		Перечисления.уатПолучателиУслуг.Контрагент,, мДокументОснование);
	
	Для Каждого ТекУслуга Из тблРезультатЗапроса Цикл
		НоваяСтрока = Услуги.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекУслуга);
		
		НоваяСтрока.Номенклатура = ТекУслуга.Услуга;
		
		НоваяСтрока.Содержание = уатОбщегоНазначения.ПолучитьСодержание(ТекУслуга, ДоговорКонтрагента,
			Перечисления.уатПолучателиУслуг.Контрагент);
			
		Если НЕ ЗначениеЗаполнено(НоваяСтрока.Содержание) Тогда
			НоваяСтрока.Содержание = ТекУслуга.Услуга.НаименованиеПолное;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(НоваяСтрока.СтатьяДоходов) Тогда
			НоваяСтрока.СтатьяДоходов = уатОбщегоНазначенияСервер.СтатьяДоходовНоменклатуры(НоваяСтрока.Номенклатура);
		КонецЕсли;
		
		Если флМноговалютныйУчет Тогда
			НоваяСтрока.Валюта           = ВалютаДокумента;
			НоваяСтрока.ЦенаВалютная     = НоваяСтрока.Цена;
			НоваяСтрока.СуммаВалютная    = НоваяСтрока.Сумма;
			НоваяСтрока.СуммаНДСвалютная = НоваяСтрока.СуммаНДС;
			НоваяСтрока.КроссКурс        = 1;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаЗаполненияМЛ(мДокументОснование, ДанныеЗаполнения) 
	
	Комментарий             = мДокументОснование.Комментарий;
	Организация             = мДокументОснование.Организация;
	Подразделение           = мДокументОснование.Подразделение;
	ДокументОснование       = мДокументОснование;
	Ответственный           = уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(
		Пользователи.АвторизованныйПользователь(), "ОсновнойОтветственный");
	
	ОбъектСтроительства = ДокументОснование.ОбъектСтроительства;
	
	ВалютаДокумента         = мДокументОснование.ВалютаДокумента;
	ВалютаДокументаКурсКратность = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(ВалютаДокумента, ДатаКурса, ЭтотОбъект);
	КурсВзаиморасчетов      = ВалютаДокументаКурсКратность.Курс;
	КратностьВзаиморасчетов = ВалютаДокументаКурсКратность.Кратность;
	
	Если ДанныеЗаполнения.Количество() > 0 Тогда
		ДоговорКонтрагента  = ДанныеЗаполнения[0].ЗаказНаТС.ДоговорКонтрагента;
		Контрагент          = ДанныеЗаполнения[0].ЗаказНаТС.Контрагент;
		УчитыватьНДС        = ДанныеЗаполнения[0].УчитыватьНДС;
		СуммаВключаетНДС    = ДанныеЗаполнения[0].СуммаВключаетНДС;
		Если ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказамНаТС Тогда
			Сделка = ДанныеЗаполнения[0].ЗаказНаТС;
		КонецЕсли;
	КонецЕсли;
	
	флМноговалютныйУчет = ПолучитьФункциональнуюОпцию("уатМноговалютныйУчет");
	КэшКурсов = Неопределено;
	
	уатОбщегоНазначения.УстановитьДопПоляДетализации(ДанныеЗаполнения, ДоговорКонтрагента,
		Перечисления.уатПолучателиУслуг.Контрагент,, мДокументОснование);
	
	Для Каждого ТекУслуга Из ДанныеЗаполнения Цикл
		НоваяСтрока = Услуги.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекУслуга,, "Валюта");
		
		НоваяСтрока.Номенклатура = ТекУслуга.Услуга;
		
		НоваяСтрока.Содержание = уатОбщегоНазначения.ПолучитьСодержание(ТекУслуга, ДоговорКонтрагента,
			Перечисления.уатПолучателиУслуг.Контрагент);
			
		Если Не ЗначениеЗаполнено(НоваяСтрока.Содержание) Тогда
			НоваяСтрока.Содержание = ТекУслуга.Услуга.НаименованиеПолное;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(НоваяСтрока.СтавкаНДС) Тогда
			НоваяСтрока.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(НоваяСтрока.СтатьяДоходов) Тогда
			НоваяСтрока.СтатьяДоходов = уатОбщегоНазначенияСервер.СтатьяДоходовНоменклатуры(НоваяСтрока.Номенклатура);
		КонецЕсли;
			
		ВалютаСтроки = ?(ЗначениеЗаполнено(ТекУслуга.Валюта), ТекУслуга.Валюта, мДокументОснование.ВалютаДокумента);
		
		Если флМноговалютныйУчет Тогда
			НоваяСтрока.Валюта           = ВалютаСтроки;
			НоваяСтрока.ЦенаВалютная     = НоваяСтрока.Цена;
			НоваяСтрока.СуммаВалютная    = НоваяСтрока.Сумма;
			НоваяСтрока.СуммаНДСвалютная = НоваяСтрока.СуммаНДС;
			НоваяСтрока.КроссКурс        = 1;
		КонецЕсли;
		Если ВалютаСтроки <> ВалютаДокумента Тогда
			СтруктураКурсКратность       = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(ВалютаСтроки, ДатаКурса, ЭтотОбъект);
		
			НоваяСтрока.Цена     = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(НоваяСтрока.Цена,
				ВалютаСтроки,                     ВалютаДокумента,
				СтруктураКурсКратность.Курс,      КурсВзаиморасчетов,
				СтруктураКурсКратность.Кратность, КратностьВзаиморасчетов,,
				ЭтотОбъект);
			НоваяСтрока.Сумма    = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(НоваяСтрока.Сумма,
				ВалютаСтроки,                     ВалютаДокумента,
				СтруктураКурсКратность.Курс,      КурсВзаиморасчетов,
				СтруктураКурсКратность.Кратность, КратностьВзаиморасчетов,,
				ЭтотОбъект);
			НоваяСтрока.СуммаНДС = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(НоваяСтрока.СуммаНДС,
				ВалютаСтроки,                     ВалютаДокумента,
				СтруктураКурсКратность.Курс,      КурсВзаиморасчетов,
				СтруктураКурсКратность.Кратность, КратностьВзаиморасчетов,,
				ЭтотОбъект);
				
			Если флМноговалютныйУчет Тогда
				НоваяСтрока.КроссКурс = уатОбщегоНазначенияСервер.ПолучитьКроссКурс(НоваяСтрока.Валюта, ВалютаДокумента,
					ДатаКурса, КэшКурсов, ЭтотОбъект);
			КонецЕсли;
		КонецЕсли;
		
		флИзменилсяУчетНДС = (ТекУслуга.УчитыватьНДС <> УчитыватьНДС ИЛИ ТекУслуга.СуммаВключаетНДС <> СуммаВключаетНДС);
		
		Если ТекУслуга.УчитыватьНДС <> УчитыватьНДС Тогда
			Если УчитыватьНДС Тогда
				НоваяСтрока.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
			КонецЕсли;
		ИначеЕсли ТекУслуга.СуммаВключаетНДС <> СуммаВключаетНДС Тогда
			Если СуммаВключаетНДС Тогда
				НоваяСтрока.Сумма = НоваяСтрока.Сумма + НоваяСтрока.СуммаНДС;
				Если флМноговалютныйУчет Тогда
					НоваяСтрока.СуммаВалютная = НоваяСтрока.СуммаВалютная + НоваяСтрока.СуммаНДСВалютная;
				КонецЕсли;
			Иначе
				НоваяСтрока.Сумма = НоваяСтрока.Сумма - НоваяСтрока.СуммаНДС;
				Если флМноговалютныйУчет Тогда
					НоваяСтрока.СуммаВалютная = НоваяСтрока.СуммаВалютная - НоваяСтрока.СуммаНДСВалютная;
				КонецЕсли;
			КонецЕсли;
			НоваяСтрока.Цена = ?(НоваяСтрока.Количество = 0, 0, НоваяСтрока.Сумма / НоваяСтрока.Количество);
			Если флМноговалютныйУчет Тогда
				НоваяСтрока.ЦенаВалютная = ?(НоваяСтрока.Количество = 0, 0, НоваяСтрока.СуммаВалютная / НоваяСтрока.Количество);
			КонецЕсли;
		КонецЕсли;
		
		Если флИзменилсяУчетНДС Тогда
			мСтавкаНДС = уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеСтавкиНДС(НоваяСтрока.СтавкаНДС);
			НоваяСтрока.СуммаНДС = ?(СуммаВключаетНДС, 
				НоваяСтрока.Сумма - (НоваяСтрока.Сумма) / ((мСтавкаНДС + 100) / 100),
				НоваяСтрока.Сумма * мСтавкаНДС / 100);
			Если флМноговалютныйУчет Тогда
				НоваяСтрока.СуммаНДСВалютная = ?(СуммаВключаетНДС, 
					НоваяСтрока.СуммаВалютная - (НоваяСтрока.СуммаВалютная) / ((мСтавкаНДС + 100) / 100),
					НоваяСтрока.СуммаВалютная * мСтавкаНДС / 100);
			КонецЕсли;

		КонецЕсли;
	КонецЦикла;
	
	СуммаДокумента = уатОбщегоНазначенияТиповые.уатПолучитьСуммуДокументаСНДС(ЭтотОбъект, "Услуги");
	ВалютаВзаиморасчетов = ДоговорКонтрагента.ВалютаВзаиморасчетов;
	КроссКурс            = уатОбщегоНазначенияСервер.ПолучитьКроссКурс(ВалютаДокумента, ВалютаВзаиморасчетов,
		ТекущаяДата(),, ЭтотОбъект);
	СуммаВзаиморасчетов  = уатОбщегоНазначения_проф.СуммаВзаиморасчетовДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаЗаполненияЗГ(мДокументОснование, ДанныеЗаполнения)
	
	Организация 			= мДокументОснование.Организация;
	Подразделение           = мДокументОснование.Подразделение;
	СуммаВключаетНДС 		= мДокументОснование.СуммаВключаетНДС;
	УчитыватьНДС 			= мДокументОснование.УчитыватьНДС;
	ДокументОснование 		= мДокументОснование.Ссылка;
	ОбъектСтроительства     = мДокументОснование.ОбъектСтроительства;
	Контрагент 				= мДокументОснование.Контрагент;
	ДоговорКонтрагента 		= мДокументОснование.ДоговорКонтрагента;
	ВалютаДокумента 		= мДокументОснование.ВалютаДокумента;
	ВалютаДокументаКурсКратность = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(ВалютаДокумента, ДатаКурса, ЭтотОбъект);
	КурсВзаиморасчетов      = ВалютаДокументаКурсКратность.Курс;
	КратностьВзаиморасчетов = ВалютаДокументаКурсКратность.Кратность;
	
	Ответственный 			= уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(
		ПользователиКлиентСервер.АвторизованныйПользователь(), "ОсновнойОтветственный");
	Комментарий 			= мДокументОснование.Комментарий;
	
	Если ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказамНаТС Тогда
		Сделка = ДокументОснование;
	КонецЕсли;
	
	ОбработкаЗаполненияЗГДобавитьСтрокиУслуг(ДанныеЗаполнения);
	
	СуммаДокумента       = уатОбщегоНазначенияТиповые.уатПолучитьСуммуДокументаСНДС(ЭтотОбъект, "Услуги");
	ВалютаВзаиморасчетов = ДоговорКонтрагента.ВалютаВзаиморасчетов;
	КроссКурс            = уатОбщегоНазначенияСервер.ПолучитьКроссКурс(ВалютаДокумента, ВалютаВзаиморасчетов,
		ДатаКурса,, ЭтотОбъект);
	СуммаВзаиморасчетов  = уатОбщегоНазначения_проф.СуммаВзаиморасчетовДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаЗаполненияТакси(мДокументОснование, ДанныеЗаполнения)
	
	Организация 			= мДокументОснование.Организация;
	Подразделение           = мДокументОснование.Подразделение;
	ВалютаДокумента 		= мДокументОснование.ВалютаДокумента;
	ВалютаДокументаКурсКратность = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(ВалютаДокумента, ДатаКурса, ЭтотОбъект);
	КурсВзаиморасчетов      = ВалютаДокументаКурсКратность.Курс;
	КратностьВзаиморасчетов = ВалютаДокументаКурсКратность.Кратность;
	Ответственный 			= уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(
		ПользователиКлиентСервер.АвторизованныйПользователь(), "ОсновнойОтветственный");
	СуммаВключаетНДС 		= мДокументОснование.СуммаВключаетНДС;
	УчитыватьНДС 			= мДокументОснование.УчитыватьНДС;
	ДокументОснование 		= мДокументОснование.Ссылка;
	Комментарий 			= мДокументОснование.Комментарий;   
	
	Если ТипЗнч(мДокументОснование) = Тип("ДокументСсылка.такЗаказТакси") Тогда
		Контрагент          = мДокументОснование.Заказчик;
		ДоговорКонтрагента  = мДокументОснование.ДоговорКонтрагента;
		ОбработкаЗаполненияЗаказТаксиДобавитьСтрокиУслуг(ДанныеЗаполнения);
	ИначеЕсли мДокументОснование.ВидАрендодателя = Перечисления.уатПолучателиУслуг.НашаОрганизация Тогда
		Контрагент          = мДокументОснование.Контрагент;
		ДоговорКонтрагента  = мДокументОснование.ДоговорКонтрагента;
		ОбработкаЗаполненияАрендаТСДобавитьСтрокиУслуг(ДанныеЗаполнения);
	КонецЕсли;
	
	СуммаДокумента = уатОбщегоНазначенияТиповые.уатПолучитьСуммуДокументаСНДС(ЭтотОбъект, "Услуги");
	
	Если ТипЗнч(мДокументОснование) = Тип("ДокументСсылка.такЗаказТакси")
		ИЛИ мДокументОснование.ВидАрендодателя = Перечисления.уатПолучателиУслуг.НашаОрганизация Тогда
		
		ВалютаВзаиморасчетов = ДоговорКонтрагента.ВалютаВзаиморасчетов;
		КроссКурс            = уатОбщегоНазначенияСервер.ПолучитьКроссКурс(ВалютаДокумента, ВалютаВзаиморасчетов,
			ДатаКурса,, ЭтотОбъект);
		СуммаВзаиморасчетов  = уатОбщегоНазначения_проф.СуммаВзаиморасчетовДокумента(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполненияЗГДобавитьСтрокиУслуг(СтрокиУслуг) Экспорт
	
	МассивСтрок = Новый Массив();
	Для Каждого ТекСтрока Из СтрокиУслуг Цикл
		МассивСтрок.Добавить(ТекСтрока.НомерСтроки);
	КонецЦикла;

	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗНАЧЕНИЕ(Перечисление.уатПолучателиУслуг.Контрагент) КАК ПолучательУслуг,
	|	ЗНАЧЕНИЕ(Документ.уатПутевойЛист.ПустаяСсылка) КАК ПутевойЛист,
	|	ЕСТЬNULL(уатЗаказГрузоотправителяУслуги.Тариф.ПараметрВыработки, ЗНАЧЕНИЕ(Справочник.уатПараметрыВыработки.ПустаяСсылка)) КАК ПараметрВыработки,
	|	уатЗаказГрузоотправителяУслуги.Номенклатура КАК Услуга,
	|	уатЗаказГрузоотправителяУслуги.Ссылка.Маршрут КАК Маршрут,
	|	уатЗаказГрузоотправителяУслуги.Ссылка.ОбъектСтроительства КАК ОбъектСтроительства,
	|	уатЗаказГрузоотправителяУслуги.Количество КАК Количество,
	|	уатЗаказГрузоотправителяУслуги.СтавкаНДС КАК СтавкаНДС,
	|	уатЗаказГрузоотправителяУслуги.Сумма КАК Сумма,
	|	уатЗаказГрузоотправителяУслуги.СуммаНДС КАК СуммаНДС,
	|	уатЗаказГрузоотправителяУслуги.СуммаСкидки КАК СуммаСкидки,
	|	уатЗаказГрузоотправителяУслуги.Цена КАК Цена,
	|	уатЗаказГрузоотправителяУслуги.Ссылка.АдресОтправления КАК ПунктОтправления,
	|	уатЗаказГрузоотправителяУслуги.Ссылка.АдресНазначения КАК ПунктПрибытия,
	|	уатЗаказГрузоотправителяУслуги.Ссылка КАК Заказ,
	|	ЗНАЧЕНИЕ(Документ.уатЗаказПеревозчику_уэ.ПустаяСсылка) КАК ЗаказПеревозчику,
	|	уатЗаказГрузоотправителяУслуги.Содержание КАК Содержание,
	|	уатЗаказГрузоотправителяУслуги.Валюта КАК Валюта,
	|	уатЗаказГрузоотправителяУслуги.СтатьяДоходов КАК СтатьяДоходов
	|ИЗ
	|	Документ.уатЗаказГрузоотправителя.Услуги КАК уатЗаказГрузоотправителяУслуги
	|ГДЕ
	|	уатЗаказГрузоотправителяУслуги.Ссылка = &Ссылка
	|	И уатЗаказГрузоотправителяУслуги.НомерСтроки В(&МассивСтрок)";
	Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
	Запрос.УстановитьПараметр("МассивСтрок", МассивСтрок);
	
	тблРезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	флМноговалютныйУчет = ПолучитьФункциональнуюОпцию("уатМноговалютныйУчет");
	КэшКурсов = Неопределено;
	
	уатОбщегоНазначения.УстановитьДопПоляДетализации(тблРезультатЗапроса, ДоговорКонтрагента,
		Перечисления.уатПолучателиУслуг.Контрагент,, ДокументОснование);
	
	Для Каждого ТекУслуга Из тблРезультатЗапроса Цикл
		НоваяСтрока = Услуги.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекУслуга,, "Валюта");
		
		НоваяСтрока.Номенклатура = ТекУслуга.Услуга;
		
		НоваяСтрока.Содержание = уатОбщегоНазначения.ПолучитьСодержание(ТекУслуга, ДоговорКонтрагента,
			Перечисления.уатПолучателиУслуг.Контрагент);
		
		Если Не ЗначениеЗаполнено(НоваяСтрока.Содержание) Тогда
			НоваяСтрока.Содержание = ТекУслуга.Услуга.НаименованиеПолное;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(НоваяСтрока.СтатьяДоходов) Тогда
			НоваяСтрока.СтатьяДоходов = уатОбщегоНазначенияСервер.СтатьяДоходовНоменклатуры(НоваяСтрока.Номенклатура);
		КонецЕсли;
		
		Если ТекУслуга.СуммаСкидки <> 0 И НоваяСтрока.Количество <> 0 Тогда
			НоваяСтрока.Цена = НоваяСтрока.Сумма / НоваяСтрока.Количество;
		КонецЕсли;
		
		ВалютаСтроки = ?(ЗначениеЗаполнено(ТекУслуга.Валюта), ТекУслуга.Валюта, ДокументОснование.ВалютаДокумента);
		
		Если флМноговалютныйУчет Тогда
			НоваяСтрока.Валюта           = ВалютаСтроки;
			НоваяСтрока.ЦенаВалютная     = НоваяСтрока.Цена;
			НоваяСтрока.СуммаВалютная    = НоваяСтрока.Сумма;
			НоваяСтрока.СуммаНДСвалютная = НоваяСтрока.СуммаНДС;
			НоваяСтрока.КроссКурс        = 1;
		КонецЕсли;
		Если ВалютаСтроки <> ВалютаДокумента Тогда
			СтруктураКурсКратность       = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(ВалютаСтроки, ДатаКурса, ЭтотОбъект);
		
			НоваяСтрока.Цена     = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(НоваяСтрока.Цена,
				ВалютаСтроки,                     ВалютаДокумента,
				СтруктураКурсКратность.Курс,      КурсВзаиморасчетов,
				СтруктураКурсКратность.Кратность, КратностьВзаиморасчетов,,
				ЭтотОбъект);
			НоваяСтрока.Сумма    = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(НоваяСтрока.Сумма,
				ВалютаСтроки,                     ВалютаДокумента,
				СтруктураКурсКратность.Курс,      КурсВзаиморасчетов,
				СтруктураКурсКратность.Кратность, КратностьВзаиморасчетов,,
				ЭтотОбъект);
			НоваяСтрока.СуммаНДС = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(НоваяСтрока.СуммаНДС,
				ВалютаСтроки,                     ВалютаДокумента,
				СтруктураКурсКратность.Курс,      КурсВзаиморасчетов,
				СтруктураКурсКратность.Кратность, КратностьВзаиморасчетов,,
				ЭтотОбъект);
				
			Если флМноговалютныйУчет Тогда
				НоваяСтрока.КроссКурс = уатОбщегоНазначенияСервер.ПолучитьКроссКурс(НоваяСтрока.Валюта, ВалютаДокумента,
					ДатаКурса, КэшКурсов, ЭтотОбъект);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаЗаполненияЗаказТаксиДобавитьСтрокиУслуг(СтрокиУслуг) Экспорт
	
	МассивСтрок = Новый Массив();
	Для Каждого ТекСтрока Из СтрокиУслуг Цикл
		МассивСтрок.Добавить(ТекСтрока.НомерСтроки);
	КонецЦикла;

	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗНАЧЕНИЕ(Перечисление.уатПолучателиУслуг.Контрагент) КАК ПолучательУслуг,
	|	ЕСТЬNULL(такЗаказТаксиУслуги.Тариф.ПараметрВыработки, ЗНАЧЕНИЕ(Справочник.уатПараметрыВыработки.ПустаяСсылка)) КАК ПараметрВыработки,
	|	такЗаказТаксиУслуги.Ссылка КАК Заказ,
	|	такЗаказТаксиУслуги.Номенклатура КАК Услуга,
	|	такЗаказТаксиУслуги.Количество КАК Количество,
	|	такЗаказТаксиУслуги.СтавкаНДС КАК СтавкаНДС,
	|	такЗаказТаксиУслуги.Сумма КАК Сумма,
	|	такЗаказТаксиУслуги.СуммаНДС КАК СуммаНДС,
	|	такЗаказТаксиУслуги.СуммаСкидки КАК СуммаСкидки,
	|	такЗаказТаксиУслуги.Цена КАК Цена,
	|	такЗаказТаксиУслуги.Ссылка.АдресПодачи КАК АдресПодачи,
	|	такЗаказТаксиУслуги.Ссылка.АдресНазначения КАК АдресНазначения,
	|	такЗаказТаксиУслуги.Содержание КАК Содержание,
	|	такЗаказТаксиУслуги.Валюта КАК Валюта,
	|	такЗаказТаксиУслуги.СтатьяДоходов КАК СтатьяДоходов
	|ИЗ
	|	Документ.такЗаказТакси.Услуги КАК такЗаказТаксиУслуги
	|ГДЕ
	|	такЗаказТаксиУслуги.Ссылка = &Ссылка
	|	И такЗаказТаксиУслуги.НомерСтроки В(&МассивСтрок)";
	Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
	Запрос.УстановитьПараметр("МассивСтрок", МассивСтрок);
	
	тблРезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	флМноговалютныйУчет = ПолучитьФункциональнуюОпцию("уатМноговалютныйУчет");
	КэшКурсов = Неопределено;
	
	уатОбщегоНазначения.УстановитьДопПоляДетализации(тблРезультатЗапроса, ДоговорКонтрагента,
		Перечисления.уатПолучателиУслуг.Контрагент,, ДокументОснование);
	
	Для Каждого ТекУслуга Из тблРезультатЗапроса Цикл
		НоваяСтрока = Услуги.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекУслуга,, "Валюта");
		
		НоваяСтрока.Номенклатура = ТекУслуга.Услуга;
		
		НоваяСтрока.Содержание = уатОбщегоНазначения.ПолучитьСодержание(ТекУслуга, ДоговорКонтрагента,
			Перечисления.уатПолучателиУслуг.Контрагент);
		
		Если НЕ ЗначениеЗаполнено(НоваяСтрока.Содержание) Тогда
			НоваяСтрока.Содержание = ТекУслуга.Услуга.НаименованиеПолное;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(НоваяСтрока.СтатьяДоходов) Тогда
			НоваяСтрока.СтатьяДоходов = уатОбщегоНазначенияСервер.СтатьяДоходовНоменклатуры(НоваяСтрока.Номенклатура);
		КонецЕсли;
		
		Если ТекУслуга.СуммаСкидки <> 0 И НоваяСтрока.Количество <> 0 Тогда
			НоваяСтрока.Цена = НоваяСтрока.Сумма / НоваяСтрока.Количество;
		КонецЕсли;
		
		ВалютаСтроки = ?(ЗначениеЗаполнено(ТекУслуга.Валюта), ТекУслуга.Валюта, ДокументОснование.ВалютаДокумента);
		
		Если флМноговалютныйУчет Тогда
			НоваяСтрока.Валюта           = ВалютаСтроки;
			НоваяСтрока.ЦенаВалютная     = НоваяСтрока.Цена;
			НоваяСтрока.СуммаВалютная    = НоваяСтрока.Сумма;
			НоваяСтрока.СуммаНДСвалютная = НоваяСтрока.СуммаНДС;
			НоваяСтрока.КроссКурс        = 1;
		КонецЕсли;
		Если ВалютаСтроки <> ВалютаДокумента Тогда
			СтруктураКурсКратность       = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(ВалютаСтроки, ДатаКурса, ЭтотОбъект);
		
			НоваяСтрока.Цена     = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(НоваяСтрока.Цена,
				ВалютаСтроки,                     ВалютаДокумента,
				СтруктураКурсКратность.Курс,      КурсВзаиморасчетов,
				СтруктураКурсКратность.Кратность, КратностьВзаиморасчетов,,
				ЭтотОбъект);
			НоваяСтрока.Сумма    = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(НоваяСтрока.Сумма,
				ВалютаСтроки,                     ВалютаДокумента,
				СтруктураКурсКратность.Курс,      КурсВзаиморасчетов,
				СтруктураКурсКратность.Кратность, КратностьВзаиморасчетов,,
				ЭтотОбъект);
			НоваяСтрока.СуммаНДС = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(НоваяСтрока.СуммаНДС,
				ВалютаСтроки,                     ВалютаДокумента,
				СтруктураКурсКратность.Курс,      КурсВзаиморасчетов,
				СтруктураКурсКратность.Кратность, КратностьВзаиморасчетов,,
				ЭтотОбъект);
				
			Если флМноговалютныйУчет Тогда
				НоваяСтрока.КроссКурс = уатОбщегоНазначенияСервер.ПолучитьКроссКурс(НоваяСтрока.Валюта, ВалютаДокумента,
					ДатаКурса, КэшКурсов, ЭтотОбъект);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаЗаполненияАрендаТСДобавитьСтрокиУслуг(СтрокиУслуг) Экспорт
	
	МассивСтрок = Новый Массив();
	Для Каждого ТекСтрока Из СтрокиУслуг Цикл
		МассивСтрок.Добавить(ТекСтрока.НомерСтроки);
	КонецЦикла;

	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗНАЧЕНИЕ(Перечисление.уатПолучателиУслуг.Контрагент) КАК ПолучательУслуг,
	|	ЕСТЬNULL(такАрендаТСУслуги.Тариф.ПараметрВыработки, ЗНАЧЕНИЕ(Справочник.уатПараметрыВыработки.ПустаяСсылка)) КАК ПараметрВыработки, 
	|	такАрендаТСУслуги.Ссылка КАК Заказ,
	|	такАрендаТСУслуги.Номенклатура КАК Услуга,
	|	такАрендаТСУслуги.Количество КАК Количество,
	|	такАрендаТСУслуги.СтавкаНДС КАК СтавкаНДС,
	|	такАрендаТСУслуги.Сумма КАК Сумма,
	|	такАрендаТСУслуги.СуммаНДС КАК СуммаНДС,
	|	такАрендаТСУслуги.СуммаСкидки КАК СуммаСкидки,
	|	такАрендаТСУслуги.Цена КАК Цена,
	|	такАрендаТСУслуги.Ссылка.ПунктВыдачи КАК ПунктВыдачи,
	|	такАрендаТСУслуги.Ссылка.ПунктВозврата КАК ПунктВозврата,
	|	такАрендаТСУслуги.Содержание КАК Содержание,
	|	такАрендаТСУслуги.Валюта КАК Валюта,
	|	такАрендаТСУслуги.СтатьяДоходов КАК СтатьяДоходов
	|ИЗ
	|	Документ.такАрендаТС.Услуги КАК такАрендаТСУслуги
	|ГДЕ
	|	такАрендаТСУслуги.Ссылка = &Ссылка
	|	И такАрендаТСУслуги.НомерСтроки В(&МассивСтрок)";
	Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
	Запрос.УстановитьПараметр("МассивСтрок", МассивСтрок);
	
	тблРезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	флМноговалютныйУчет = ПолучитьФункциональнуюОпцию("уатМноговалютныйУчет");
	КэшКурсов = Неопределено;
	
	уатОбщегоНазначения.УстановитьДопПоляДетализации(тблРезультатЗапроса, ДоговорКонтрагента,
		Перечисления.уатПолучателиУслуг.Контрагент,, ДокументОснование);
	
	Для Каждого ТекУслуга Из тблРезультатЗапроса Цикл
		НоваяСтрока = Услуги.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекУслуга,, "Валюта");
		
		НоваяСтрока.Номенклатура = ТекУслуга.Услуга;
		
		НоваяСтрока.Содержание = уатОбщегоНазначения.ПолучитьСодержание(ТекУслуга, ДоговорКонтрагента,
			Перечисления.уатПолучателиУслуг.Контрагент);
		
		Если НЕ ЗначениеЗаполнено(НоваяСтрока.Содержание) Тогда
			НоваяСтрока.Содержание = ТекУслуга.Услуга.НаименованиеПолное;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(НоваяСтрока.СтатьяДоходов) Тогда
			НоваяСтрока.СтатьяДоходов = уатОбщегоНазначенияСервер.СтатьяДоходовНоменклатуры(НоваяСтрока.Номенклатура);
		КонецЕсли;
		
		Если ТекУслуга.СуммаСкидки <> 0 И НоваяСтрока.Количество <> 0 Тогда
			НоваяСтрока.Цена = НоваяСтрока.Сумма / НоваяСтрока.Количество;
		КонецЕсли;
		
		ВалютаСтроки = ?(ЗначениеЗаполнено(ТекУслуга.Валюта), ТекУслуга.Валюта, ДокументОснование.ВалютаДокумента);
		
		Если флМноговалютныйУчет Тогда
			НоваяСтрока.Валюта           = ВалютаСтроки;
			НоваяСтрока.ЦенаВалютная     = НоваяСтрока.Цена;
			НоваяСтрока.СуммаВалютная    = НоваяСтрока.Сумма;
			НоваяСтрока.СуммаНДСвалютная = НоваяСтрока.СуммаНДС;
			НоваяСтрока.КроссКурс        = 1;
		КонецЕсли;
		Если ВалютаСтроки <> ВалютаДокумента Тогда
			СтруктураКурсКратность       = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(ВалютаСтроки, ДатаКурса, ЭтотОбъект);
		
			НоваяСтрока.Цена     = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(НоваяСтрока.Цена,
				ВалютаСтроки,                     ВалютаДокумента,
				СтруктураКурсКратность.Курс,      КурсВзаиморасчетов,
				СтруктураКурсКратность.Кратность, КратностьВзаиморасчетов,,
				ЭтотОбъект);
			НоваяСтрока.Сумма    = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(НоваяСтрока.Сумма,
				ВалютаСтроки,                     ВалютаДокумента,
				СтруктураКурсКратность.Курс,      КурсВзаиморасчетов,
				СтруктураКурсКратность.Кратность, КратностьВзаиморасчетов,,
				ЭтотОбъект);
			НоваяСтрока.СуммаНДС = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(НоваяСтрока.СуммаНДС,
				ВалютаСтроки,                     ВалютаДокумента,
				СтруктураКурсКратность.Курс,      КурсВзаиморасчетов,
				СтруктураКурсКратность.Кратность, КратностьВзаиморасчетов,,
				ЭтотОбъект);
				
			Если флМноговалютныйУчет Тогда
				НоваяСтрока.КроссКурс = уатОбщегоНазначенияСервер.ПолучитьКроссКурс(НоваяСтрока.Валюта, ВалютаДокумента,
					ДатаКурса, КэшКурсов, ЭтотОбъект);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьСоответствиеРеквизитовСчетаФактурыВыданного()
	ДокСчетФактура = Документы.уатРеализацияУслуг.НайтиСчетФактуруРеализации(Ссылка,
		ДополнительныеСвойства.Свойство("СсылкаПометкаУдаления") И ДополнительныеСвойства.СсылкаПометкаУдаления);
	Если НЕ ЗначениеЗаполнено(ДокСчетФактура) ИЛИ ДокСчетФактура.ДокументыОснования.Количество() > 1 Тогда
		Возврат;
	КонецЕсли;
	
	Если ПометкаУдаления Тогда // при пометке удаления Реализации нужно пометить на удаление связанную СФ
		СчетФактураОбъект = ДокСчетФактура.ПолучитьОбъект();
		СчетФактураОбъект.ПометкаУдаления = Истина;
		Попытка
			СчетФактураОбъект.ОбменДанными.Загрузка = Истина; // отключаем обработчики объекта ПередЗаписью и ПриЗаписи
			СчетФактураОбъект.Записать();
		Исключение
		КонецПопытки;
	Иначе
		// проверяем изменение ключевых реквизитов, если изменены - перезаполняем СФ
		флИзмененКлючевойРеквизит = (Контрагент <> ДокСчетФактура.Контрагент
			ИЛИ ДоговорКонтрагента <> ДокСчетФактура.ДоговорКонтрагента
			ИЛИ ВалютаДокумента <> ДокСчетФактура.ВалютаДокумента
			ИЛИ Организация <> ДокСчетФактура.Организация
			ИЛИ Подразделение <> ДокСчетФактура.Подразделение
			ИЛИ Дата <> ДокСчетФактура.Дата
			ИЛИ СуммаДокумента <> ДокСчетФактура.СуммаДокумента
			ИЛИ Услуги.Итог("СуммаНДС") <> ДокСчетФактура.СуммаНДС);
			
		Если флИзмененКлючевойРеквизит ИЛИ ПометкаУдаления <> ДокСчетФактура.ПометкаУдаления Тогда
			СчетФактураОбъект = ДокСчетФактура.ПолучитьОбъект();
			Если флИзмененКлючевойРеквизит Тогда
				СчетФактураОбъект.Заполнить(Ссылка);
			КонецЕсли;
			СчетФактураОбъект.ПометкаУдаления = ПометкаУдаления;
			Попытка
				СчетФактураОбъект.ОбменДанными.Загрузка = Истина; // отключаем обработчики объекта ПередЗаписью и ПриЗаписи
				СчетФактураОбъект.Записать();
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#КонецЕсли