#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
	Настройки.ПриПолученииСлужебныхРеквизитов = Ложь;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// Выполняет заполнение предопределенных элементов справочника
//
Процедура ЗаполнитьПредопределенныеДанные() Экспорт
	
	СпрОбъект = Справочники.уатСтатусы_уэ.Новый.ПолучитьОбъект();
	СпрОбъект.ДействуетНаСопроводительныеДокументы     = Истина;
	СпрОбъект.ДействуетНаЖурналыТранспортныхДокументов = Истина;
	СпрОбъект.ДействуетНаЗаказыГрузоотправителей       = Истина;
	СпрОбъект.ДействуетНаЗаказыПеревозчику             = Истина;
	СпрОбъект.ДействуетНаПотребностиВПеревозке         = Истина;
	СпрОбъект.ДействуетНаТендеры                       = Истина;
	СпрОбъект.ДействуетНаЗаявкиНаРемонт                = Истина;
	СпрОбъект.ДействуетНаОперацииСГрузами              = Истина;
	СпрОбъект.ДействуетНаАктыОтгрузки                  = Истина;
	СпрОбъект.ДействуетНаАктыПриемки                   = Истина;
	СпрОбъект.ДействуетНаСтраховыеСертификаты          = Истина;
	СпрОбъект.ДействуетНаАрендуТС                      = Истина;
	СпрОбъект.ЦветФонаПоУмолчанию                      = Новый ХранилищеЗначения(Новый Цвет(150, 180, 68), Новый СжатиеДанных(9));
	СпрОбъект.ВидВладельца = Перечисления.уатВидыВладельцевСопроводительныхДокументов.ОбщиеДокументы;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатСтатусы_уэ.Открыт.ПолучитьОбъект();
	СпрОбъект.ДействуетНаЗаказыГрузоотправителей = Истина;
	СпрОбъект.ДействуетНаЗаказыТакси             = Истина;
	СпрОбъект.ДействуетНаАрендуТС                = Истина;
	СпрОбъект.ЦветФонаПоУмолчанию                = Новый ХранилищеЗначения(Новый Цвет(225, 225, 190), Новый СжатиеДанных(9));
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатСтатусы_уэ.НазначенРемонт.ПолучитьОбъект();
	СпрОбъект.ДействуетНаЗаявкиНаРемонт          = Истина;
	СпрОбъект.ЦветФонаПоУмолчанию                = Новый ХранилищеЗначения(Новый Цвет(135, 206, 235), Новый СжатиеДанных(9));
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатСтатусы_уэ.РемонтВыполнен.ПолучитьОбъект();
	СпрОбъект.ДействуетНаЗаявкиНаРемонт          = Истина;
	СпрОбъект.ЦветФонаПоУмолчанию                = Новый ХранилищеЗначения(Новый Цвет(233, 150, 122), Новый СжатиеДанных(9));
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатСтатусы_уэ.МатериалыВыданы.ПолучитьОбъект();
	СпрОбъект.ДействуетНаЗаявкиНаРемонт          = Истина;
	СпрОбъект.ЦветФонаПоУмолчанию                = Новый ХранилищеЗначения(Новый Цвет(255, 209, 232), Новый СжатиеДанных(9));
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатСтатусы_уэ.Утвержден.ПолучитьОбъект();
	СпрОбъект.ДействуетНаЗаявкиНаРемонт          = Истина;
	СпрОбъект.ДействуетНаЗаказыТакси             = Истина;
	СпрОбъект.ЦветФонаПоУмолчанию                = Новый ХранилищеЗначения(Новый Цвет(255, 236, 139), Новый СжатиеДанных(9));
	СпрОбъект.Записать(); 
	
	СпрОбъект = Справочники.уатСтатусы_уэ.Размещен.ПолучитьОбъект();
	СпрОбъект.ДействуетНаЗаказыГрузоотправителей = Истина;
	СпрОбъект.ЦветФонаПоУмолчанию                = Новый ХранилищеЗначения(Новый Цвет(255, 247, 68), Новый СжатиеДанных(9));
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатСтатусы_уэ.Отправлен.ПолучитьОбъект();
	СпрОбъект.ДействуетНаЗаказыГрузоотправителей = Истина;
	СпрОбъект.ЦветФонаПоУмолчанию                = Новый ХранилищеЗначения(Новый Цвет(220, 166, 32), Новый СжатиеДанных(9));
	СпрОбъект.Записать();  
	
	СпрОбъект = Справочники.уатСтатусы_уэ.Доставлен.ПолучитьОбъект();
	СпрОбъект.ДействуетНаЗаказыГрузоотправителей = Истина;
	СпрОбъект.ЦветФонаПоУмолчанию                = Новый ХранилищеЗначения(Новый Цвет(255, 209, 232), Новый СжатиеДанных(9));
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатСтатусы_уэ.Составной.ПолучитьОбъект();
	СпрОбъект.ДействуетНаЗаказыГрузоотправителей = Истина;
	СпрОбъект.ЦветФонаПоУмолчанию                = Новый ХранилищеЗначения(Новый Цвет(78, 194, 194), Новый СжатиеДанных(9));
	СпрОбъект.ЦветТекстаПоУмолчанию              = Новый ХранилищеЗначения(Новый Цвет(10, 0, 233), Новый СжатиеДанных(9));
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатСтатусы_уэ.Закрыт.ПолучитьОбъект();
	СпрОбъект.ДействуетНаЗаказыГрузоотправителей = Истина;
	СпрОбъект.ДействуетНаЗаказыПеревозчику       = Истина;
	СпрОбъект.ДействуетНаПотребностиВПеревозке   = Истина;
	СпрОбъект.ДействуетНаТендеры                 = Истина;
	СпрОбъект.ДействуетНаЗаказыТакси             = Истина;
	СпрОбъект.ДействуетНаАрендуТС                = Истина;
	СпрОбъект.ЦветФонаПоУмолчанию                = Новый ХранилищеЗначения(Новый Цвет(166, 202, 240), Новый СжатиеДанных(9));
	СпрОбъект.Записать(); 
	
	СпрОбъект = Справочники.уатСтатусы_уэ.Отклонен.ПолучитьОбъект();
	СпрОбъект.ДействуетНаЗаказыГрузоотправителей = Истина;
	СпрОбъект.ДействуетНаПотребностиВПеревозке   = Истина;
	СпрОбъект.ДействуетНаЗаявкиНаРемонт          = Истина;
	СпрОбъект.ДействуетНаЗаказыТакси             = Истина;
	СпрОбъект.ДействуетНаАрендуТС                = Истина;
	СпрОбъект.ЦветФонаПоУмолчанию                = Новый ХранилищеЗначения(Новый Цвет(255, 128, 144), Новый СжатиеДанных(9));
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатСтатусы_уэ.Выполнен.ПолучитьОбъект();
	СпрОбъект.ДействуетНаОперацииСГрузами = Истина;
	СпрОбъект.ДействуетНаАктыОтгрузки     = Истина;
	СпрОбъект.ДействуетНаАктыПриемки      = Истина;
	СпрОбъект.ЦветФонаПоУмолчанию         = Новый ХранилищеЗначения(Новый Цвет(233, 150, 122), Новый СжатиеДанных(9));	
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатСтатусы_уэ.ВРаботе.ПолучитьОбъект();
	СпрОбъект.ДействуетНаОперацииСГрузами = Истина;
	СпрОбъект.ДействуетНаАктыОтгрузки     = Истина;
	СпрОбъект.ДействуетНаАктыПриемки      = Истина;
	СпрОбъект.ЦветФонаПоУмолчанию         = Новый ХранилищеЗначения(Новый Цвет(221, 160, 221), Новый СжатиеДанных(9));	
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатСтатусы_уэ.ПовреждениеГруза.ПолучитьОбъект();
	СпрОбъект.ДействуетНаЗаказыГрузоотправителей = Истина;
	СпрОбъект.ЦветФонаПоУмолчанию         = Новый ХранилищеЗначения(Новый Цвет(225, 40, 40), Новый СжатиеДанных(9));	
	СпрОбъект.Записать(); 
	
	СпрОбъект = Справочники.уатСтатусы_уэ.ПовреждениеУпаковки.ПолучитьОбъект();
	СпрОбъект.ДействуетНаЗаказыГрузоотправителей = Истина;
	СпрОбъект.ЦветФонаПоУмолчанию                = Новый ХранилищеЗначения(Новый Цвет(178, 34, 34), Новый СжатиеДанных(9));	
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатСтатусы_уэ.Скомплектован.ПолучитьОбъект();
	СпрОбъект.ДействуетНаЗаказыГрузоотправителей = Истина;
	СпрОбъект.ЦветФонаПоУмолчанию                = Новый ХранилищеЗначения(Новый Цвет(0, 150, 70), Новый СжатиеДанных(9));	
	СпрОбъект.Записать(); 
	
	СпрОбъект = Справочники.уатСтатусы_уэ.Разукомплектован.ПолучитьОбъект();
	СпрОбъект.ДействуетНаЗаказыГрузоотправителей = Истина;
	СпрОбъект.ЦветФонаПоУмолчанию                = Новый ХранилищеЗначения(Новый Цвет(100, 176, 16), Новый СжатиеДанных(9));	
	СпрОбъект.Записать(); 
	
	СпрОбъект = Справочники.уатСтатусы_уэ.Опубликовано.ПолучитьОбъект();
	СпрОбъект.ДействуетНаТендеры                 = Истина;
	СпрОбъект.ЦветФонаПоУмолчанию                = Новый ХранилищеЗначения(Новый Цвет(135, 206, 235), Новый СжатиеДанных(9));
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатСтатусы_уэ.Согласование.ПолучитьОбъект();
	СпрОбъект.ДействуетНаТендеры                 = Истина;
	СпрОбъект.ЦветФонаПоУмолчанию                = Новый ХранилищеЗначения(Новый Цвет(233, 150, 122), Новый СжатиеДанных(9));
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатСтатусы_уэ.ВИсполнении.ПолучитьОбъект();
	СпрОбъект.ДействуетНаТендеры                  = Истина;
	СпрОбъект.ЦветФонаПоУмолчанию                 = Новый ХранилищеЗначения(Новый Цвет(221, 160, 221), Новый СжатиеДанных(9));	
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатСтатусы_уэ.Завершено.ПолучитьОбъект();
	СпрОбъект.ДействуетНаТендеры                 = Истина;
	СпрОбъект.ЦветФонаПоУмолчанию                = Новый ХранилищеЗначения(Новый Цвет(255, 247, 68), Новый СжатиеДанных(9));
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатСтатусы_уэ.Архив.ПолучитьОбъект();
	СпрОбъект.ДействуетНаТендеры                 = Истина;
	СпрОбъект.ЦветФонаПоУмолчанию                = Новый ХранилищеЗначения(Новый Цвет(220, 220, 220), Новый СжатиеДанных(9));
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатСтатусы_уэ.Выпущен.ПолучитьОбъект();
	СпрОбъект.ДействуетНаСтраховыеСертификаты    = Истина;
	СпрОбъект.ЦветФонаПоУмолчанию                = Новый ХранилищеЗначения(Новый Цвет(233, 150, 122), Новый СжатиеДанных(9));
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатСтатусы_уэ.Подтвержден.ПолучитьОбъект();
	СпрОбъект.ДействуетНаЗаявкиНаРемонт             = Истина;
	СпрОбъект.ДоступенДляВыбораВМобильномПриложении = Истина;
	СпрОбъект.ЦветФонаПоУмолчанию                   = Новый ХранилищеЗначения(Новый Цвет(150, 180, 68), Новый СжатиеДанных(9));
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатСтатусы_уэ.ПодтвержденСЗамечаниями.ПолучитьОбъект();
	СпрОбъект.ДействуетНаЗаявкиНаРемонт             = Истина;
	СпрОбъект.ДоступенДляВыбораВМобильномПриложении = Истина;
	СпрОбъект.ЦветФонаПоУмолчанию                   = Новый ХранилищеЗначения(Новый Цвет(225, 40, 40), Новый СжатиеДанных(9));
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатСтатусы_уэ.НеПодтвержден.ПолучитьОбъект();
	СпрОбъект.ДействуетНаЗаявкиНаРемонт             = Истина;
	СпрОбъект.ДоступенДляВыбораВМобильномПриложении = Истина;
	СпрОбъект.ЦветФонаПоУмолчанию                   = Новый ХранилищеЗначения(Новый Цвет(221, 160, 221), Новый СжатиеДанных(9));
	СпрОбъект.Записать(); 
	
	СпрОбъект = Справочники.уатСтатусы_уэ.ДоставленНаСклад.ПолучитьОбъект();
	СпрОбъект.ДействуетНаЗаказыГрузоотправителей = Истина;
	СпрОбъект.ЦветФонаПоУмолчанию                = Новый ХранилищеЗначения(Новый Цвет(0, 128, 0), Новый СжатиеДанных(9));
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатСтатусы_уэ.ПринятИзРейса.ПолучитьОбъект();
	СпрОбъект.ДействуетНаЗаказыГрузоотправителей = Истина;
	СпрОбъект.ЦветФонаПоУмолчанию                = Новый ХранилищеЗначения(Новый Цвет(50, 180, 50), Новый СжатиеДанных(9));
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатСтатусы_уэ.ВыданВРейс.ПолучитьОбъект();
	СпрОбъект.ДействуетНаЗаказыГрузоотправителей = Истина;
	СпрОбъект.ЦветФонаПоУмолчанию                = Новый ХранилищеЗначения(Новый Цвет(200, 20, 120), Новый СжатиеДанных(9));
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатСтатусы_уэ.ВыданСоСклада.ПолучитьОбъект();
	СпрОбъект.ДействуетНаЗаказыГрузоотправителей = Истина;     
	СпрОбъект.ЦветФонаПоУмолчанию                = Новый ХранилищеЗначения(Новый Цвет(255, 20, 147), Новый СжатиеДанных(9));
	СпрОбъект.Записать();

	СпрОбъект = Справочники.уатСтатусы_уэ.ОбработкаЗавершена.ПолучитьОбъект();
	СпрОбъект.ДействуетНаСопроводительныеДокументы = Истина;
	СпрОбъект.ВидВладельца = Перечисления.уатВидыВладельцевСопроводительныхДокументов.ОбщиеДокументы;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатСтатусы_уэ.ОбработанВодителем.ПолучитьОбъект();
	СпрОбъект.ДействуетНаСопроводительныеДокументы = Истина;
	СпрОбъект.ВидВладельца = Перечисления.уатВидыВладельцевСопроводительныхДокументов.ОбщиеДокументы;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатСтатусы_уэ.Пройдено.ПолучитьОбъект();
	СпрОбъект.ДействуетНаЖурналыТранспортныхДокументов = Истина;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатСтатусы_уэ.НеПройдено.ПолучитьОбъект();
	СпрОбъект.ДействуетНаЖурналыТранспортныхДокументов = Истина;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатСтатусы_уэ.Аннулировано.ПолучитьОбъект();
	СпрОбъект.ДействуетНаЖурналыТранспортныхДокументов = Истина;
	СпрОбъект.Записать();
		
	СпрОбъект = Справочники.уатСтатусы_уэ.ОтменаРейса.ПолучитьОбъект();
	СпрОбъект.ДействуетНаЖурналыТранспортныхДокументов = Истина; 
	СпрОбъект.ДействуетНаПутевыеЛисты                  = Истина;
	СпрОбъект.ЦветФонаПоУмолчанию   = Новый ХранилищеЗначения(Новый Цвет(215, 197, 197), Новый СжатиеДанных(9));
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатСтатусы_уэ.РазмещениеВКонтейнере.ПолучитьОбъект();
	СпрОбъект.ДействуетНаЗаказыГрузоотправителей = Истина;
	СпрОбъект.ЦветФонаПоУмолчанию   = Новый ХранилищеЗначения(Новый Цвет(191, 220, 40), Новый СжатиеДанных(9));
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатСтатусы_уэ.ВыданСоСкладаКлиента.ПолучитьОбъект();
	СпрОбъект.ДействуетНаЗаказыГрузоотправителей = Истина;
	СпрОбъект.ЦветФонаПоУмолчанию   = Новый ХранилищеЗначения(Новый Цвет(220, 40, 140), Новый СжатиеДанных(9));
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатСтатусы_уэ.ПринятИзРейсаКлиентом.ПолучитьОбъект();
	СпрОбъект.ДействуетНаЗаказыГрузоотправителей = Истина;
	СпрОбъект.ЦветФонаПоУмолчанию   = Новый ХранилищеЗначения(Новый Цвет(70, 200, 70), Новый СжатиеДанных(9));
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатСтатусы_уэ.Рассчитан.ПолучитьОбъект(); 
	СпрОбъект.ДействуетНаПутевыеЛисты = Истина; 
	СпрОбъект.ЦветФонаПоУмолчанию     = Новый ХранилищеЗначения(Новый Цвет(150, 215, 148), Новый СжатиеДанных(9));
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатСтатусы_уэ.НеРассчитан.ПолучитьОбъект(); 
	СпрОбъект.ДействуетНаПутевыеЛисты = Истина; 
	СпрОбъект.ЦветФонаПоУмолчанию     = Новый ХранилищеЗначения(Новый Цвет(248, 205, 255), Новый СжатиеДанных(9)); 
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатСтатусы_уэ.ЭПЛ_Титул1.ПолучитьОбъект();
	СпрОбъект.ДействуетНаПутевыеЛисты = Истина;  
	СпрОбъект.ЦветФонаПоУмолчанию     = Новый ХранилищеЗначения(Новый Цвет(212, 197, 255), Новый СжатиеДанных(9));
	СпрОбъект.Записать(); 
	
	СпрОбъект = Справочники.уатСтатусы_уэ.ЭПЛ_Титул2.ПолучитьОбъект();
	СпрОбъект.ДействуетНаПутевыеЛисты = Истина;  
	СпрОбъект.ЦветФонаПоУмолчанию     = Новый ХранилищеЗначения(Новый Цвет(174, 207, 255), Новый СжатиеДанных(9));
	СпрОбъект.Записать();

	СпрОбъект = Справочники.уатСтатусы_уэ.ЭПЛ_Титул3.ПолучитьОбъект();
	СпрОбъект.ДействуетНаПутевыеЛисты = Истина;
	СпрОбъект.ЦветФонаПоУмолчанию     = Новый ХранилищеЗначения(Новый Цвет(138, 234, 255), Новый СжатиеДанных(9));
	СпрОбъект.Записать();

	СпрОбъект = Справочники.уатСтатусы_уэ.ЭПЛ_Титул4.ПолучитьОбъект();
	СпрОбъект.ДействуетНаПутевыеЛисты = Истина;
	СпрОбъект.ЦветФонаПоУмолчанию     = Новый ХранилищеЗначения(Новый Цвет(157, 255, 237), Новый СжатиеДанных(9));
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатСтатусы_уэ.ЭПЛ_Титул5.ПолучитьОбъект();
	СпрОбъект.ДействуетНаПутевыеЛисты = Истина;  
	СпрОбъект.ЦветФонаПоУмолчанию     = Новый ХранилищеЗначения(Новый Цвет(229, 255, 157), Новый СжатиеДанных(9));
	СпрОбъект.Записать(); 
	
	СпрОбъект = Справочники.уатСтатусы_уэ.ЭПЛ_Титул6.ПолучитьОбъект(); 
	СпрОбъект.ДействуетНаПутевыеЛисты = Истина;
	СпрОбъект.ЦветФонаПоУмолчанию     = Новый ХранилищеЗначения(Новый Цвет(174, 207, 255), Новый СжатиеДанных(9));
	СпрОбъект.Записать(); 
	
	// Статусы Такси
	СпрОбъект = Справочники.уатСтатусы_уэ.ВПути.ПолучитьОбъект(); 
	СпрОбъект.ДействуетНаЗаказыТакси = Истина;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатСтатусы_уэ.Нераспределенный.ПолучитьОбъект(); 
	СпрОбъект.ДействуетНаЗаказыТакси = Истина;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатСтатусы_уэ.ОжиданиеКлиента.ПолучитьОбъект(); 
	СпрОбъект.ДействуетНаЗаказыТакси = Истина;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатСтатусы_уэ.ПереданВАренду.ПолучитьОбъект(); 
	СпрОбъект.ДействуетНаЗаказыТакси = Истина;
	СпрОбъект.ДействуетНаАрендуТС    = Истина;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатСтатусы_уэ.ПодачаПоАдресу.ПолучитьОбъект(); 
	СпрОбъект.ДействуетНаЗаказыТакси = Истина;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатСтатусы_уэ.Предварительный.ПолучитьОбъект(); 
	СпрОбъект.ДействуетНаЗаказыТакси = Истина;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатСтатусы_уэ.Распределенный.ПолучитьОбъект(); 
	СпрОбъект.ДействуетНаЗаказыТакси = Истина;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатСтатусы_уэ.Сорван.ПолучитьОбъект(); 
	СпрОбъект.ДействуетНаЗаказыТакси = Истина;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатСтатусы_уэ.Забронирован.ПолучитьОбъект(); 
	СпрОбъект.ДействуетНаАрендуТС = Истина;
	СпрОбъект.Записать(); 
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли