
#Область ОбработчикиСобытийФормы  

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("Организация", Организация);
	Если УстановленыРешенияКонтур() Тогда
		Элементы.ГруппаДругиеОператоры.Показать();
		ОператорЭДО = 2;
	Иначе
		ОператорЭДО = 1;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Далее(Команда)
	
	Если ОператорЭДО = 1 Тогда
		МодульСинхронизацияЭДОКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("СинхронизацияЭДОКлиент"); 
		
		Если ЗначениеЗаполнено(Организация) Тогда
			ПараметрыСоздания = МодульСинхронизацияЭДОКлиент.НовыеПараметрыСозданияУчетнойЗаписи();
			ПараметрыСоздания.Организация   = Организация; 
			ПараметрыСоздания.ВладелецФормы = ЭтотОбъект;
			МодульСинхронизацияЭДОКлиент.СоздатьУчетнуюЗапись(ПараметрыСоздания);
		Иначе 
			МодульСинхронизацияЭДОКлиент.СоздатьУчетнуюЗапись1СЭДО();
		КонецЕсли;
	ИначеЕсли ОператорЭДО = 2 Тогда
		ОткрытьФорму("ОбщаяФорма.уатПодключениеЭПДКонтурДиадок");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция УстановленыРешенияКонтур()
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Модуль Логистика
	ОтборРасширения = Новый Структура;
	ОтборРасширения.Вставить("Имя", "РасширениеКонтурЛогистика");
	НайденныеРасширения = РасширенияКонфигурации.Получить(ОтборРасширения); 
	
	// Интеграция БЭД
	ОтборРасширения = Новый Структура;
	ОтборРасширения.Вставить("Имя", "КонтурЛогистика");
	НайденныеРасширенияБЭД = РасширенияКонфигурации.Получить(ОтборРасширения);  
	
	Уставновлено = (НайденныеРасширения.Количество() <> 0) ИЛИ (НайденныеРасширенияБЭД.Количество() <> 0);
	Возврат Уставновлено;
	
КонецФункции

#КонецОбласти
