#Область ПрограммныйИнтерфейс

// Открытие формы создаваемого документа.
// 
// Параметры:
//  ТипДокумента - ПеречислениеСсылка.ТипыДокументовРаспознаваниеДокументов
//  ПараметрыЗаполнения - Структура:
//  *Контрагент - СправочникСсылка.Контрагенты
//  *Организация - СправочникСсылка.Организации
//  *ИмяРеквизитаНомерДокумента - Строка
//  *ИмяРеквизитаДатаДокумента  - Строка 
//  Владелец - Форма
//
Процедура ОткрытиеФормыСоздаваемогоДокумента(ТипДокумента, ПараметрыЗаполнения, Владелец) Экспорт
	
	
КонецПроцедуры

// Открытие формы редактирования строки.
// 
// Параметры:
//  ЭтотОбъект - Форма 
//  ДанныеСтроки - СтрокаТабличнойЧасти
//
Процедура ОткрытиеФормыРедактированияСтроки(ЭтотОбъект, ДанныеСтроки) Экспорт
	
	
КонецПроцедуры

// Список возможных форм открытия аналитику учета
// 
// Параметры:
//  ФормыВыборкаАналитикиУчета - Массив Из Строка
//
Процедура ПриОпределенииФормВыборкаАналитикиУчета(ФормыВыборкаАналитикиУчета) Экспорт
	
КонецПроцедуры

Процедура ИмяФормыСозданияЭлемента(ИмяЭлемента, ИмяФормы) Экспорт
	
КонецПроцедуры

#КонецОбласти
