
// Эта функция возвращает список защищенных решений, которые были объединены в одну конфигурацию.
// Список состоит из имени защищенной обработки и имени конфигурации, для которой она предназначена.
// Имя конфигурации используется для показа информации о лицензировании.
// Имя обработки состоит из трех частей, разделенных точкой.
// XXX.YYY.ZZZ где:
// XXX - имя общего макета, в котором храниться обработка
// YYY - имя общего макета, в котором хранятся параметры лицензирования
// ZZZ - собственно имя защищенной обработки
// Количество объединенных решений не ограничено.

#Область ПрограммныйИнтерфейс

// Добавление списка защищенных решений
// 
// Возвращаемое значение:
//  Соответствие - Список защищенных решений.
//
Функция СписокРешений() Экспорт
	
	// {УАТ}	
	Список = Новый Соответствие;
	Если НЕ уатОбщегоНазначенияПовтИсп.ИспользоватьЗащитуСЛК() Тогда
		ИмяОбработки = уатОбщегоНазначенияПовтИсп.ПолучитьИмяЗащищеннойОбработкиПоУмолчанию();
		ИмяРешения = Метаданные.Синоним;
		Список.Вставить(ИмяОбработки, ИмяРешения);
	КонецЕсли;
	Возврат Список;
	// {/УАТ}
	
КонецФункции

// Эта функция добавляет в список решения, активация которых возможна из данной конфигурации
//
// Параметры:
//  Список - Соответствие - Список защищенных решений.
//
// Возвращаемое значение:
//  Отсутствует - Неопределено.
// 
Функция ДополнитьСписокРешенийДляАктивации(Список) Экспорт
	
	// {УАТ}	
	Если уатОбщегоНазначенияПовтИсп.ВариантПоставкиПРОФ() 
		ИЛИ уатОбщегоНазначенияПовтИсп.ВариантПоставкиТакси() 
		ИЛИ уатОбщегоНазначенияПовтИсп.ВариантПоставкиКОРП() Тогда
		ИмяОбработки = уатЗащищенныеФункцииСервер.ПолучитьИмяЗащищеннойОбработкиМобильноеПриложение();
		ИмяРешения = НСтр("en='Driver mobile application (connection via corporate server)';ru='Мобильное приложение ""Водитель УАТ"" - подключение через корпоративный (локальный) сервер'");
		Список.Вставить(ИмяОбработки, ИмяРешения);
	КонецЕсли;	
	// {/УАТ}
	
КонецФункции

#КонецОбласти
