
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ОптимизироватьМаршрутВМаршрутномЛисте.Видимость = уатОбщегоНазначенияПовтИсп.ВариантПоставкиКОРП();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ВладелецФормы = Неопределено Тогда
		Отказ = Истина;
		ПоказатьПредупреждение(Неопределено, НСтр("en='Immediate opening for this object is prohibited!';ru='Непосредственное открытие для данного объекта запрещено!'"));
		Возврат;
	КонецЕсли;
	
	СтруктураНастроек = СтруктураНастроекПоУмолчанию();
	ЗаполнитьЗначенияСвойств(СтруктураНастроек, ВладелецФормы);
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, СтруктураНастроек);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	ПараметрыЗакрытия = ПолучитьСтруктуруНастроек();
	Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция СтруктураНастроекПоУмолчанию() 
	Возврат Обработки.уатРедакторЦепочкиДокументов_уэ.СтруктураНастроекПоУмолчанию();
КонецФункции

&НаКлиенте
Функция ПолучитьСтруктуруНастроек() 
	
	СтруктураНастроек = СтруктураНастроекПоУмолчанию();
	
	ЗаполнитьЗначенияСвойств(СтруктураНастроек, ЭтаФорма);
	Возврат СтруктураНастроек;
	
КонецФункции

#КонецОбласти
