
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Результат = МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента();
	Если Результат Тогда
		ОткрытьФорму("Обработка.ТестированиеПодключаемогоОборудования.Форма", , ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	Иначе
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(НСтр("ru='Предварительно необходимо выбрать рабочее место подключаемого оборудования текущего сеанса.'"));
	КонецЕсли;
	
КонецПроцедуры
