
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ Параметры.Свойство("ИмяОбъектаВыбора") Тогда
		СтандартнаяОбработка = Ложь;
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ЭтоЗапрос = Истина;
	Если Параметры.ИмяОбъектаВыбора = "ПунктыНазначения" Тогда
		Заголовок = НСтр("ru = 'Выберите пункты выдачи'; en = 'Select pickup points'");
		Если ТипЗнч(Параметры.СписокОбъектов) = Тип("СписокЗначений") Тогда
			Для Каждого ТекСтрока Из Параметры.СписокОбъектов Цикл
				НоваяСтрока        = Список.Добавить();
				НоваяСтрока.Ссылка = Справочники.уатПунктыНазначения.ПолучитьСсылку(Новый УникальныйИдентификатор(ТекСтрока.Значение));
			КонецЦикла;
		КонецЕсли;
				
	Иначе
		СтандартнаяОбработка = Ложь;
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормы

&НаКлиенте
Процедура Выбрать(Команда)
	МассивОбъектов = Новый Массив();
	Для Каждого ТекСтрока Из Список Цикл
		МассивОбъектов.Добавить(ТекСтрока.Ссылка);
	КонецЦикла;
	Закрыть(МассивОбъектов);
КонецПроцедуры

#КонецОбласти
