
#Область ПрограммныйИнтерфейс

#Область ПереопределениеПодписокНаСобытие

// Процедура обработчик события подписки на событие записи транспортного средства.
//
// Параметры:
//  Источник - СправочникСсылка.ItobМаркиТранспорта	 - Исходный элемент справочника.
//  Отказ	 - Булево								 - Признак отказа от записи.
//  								Если в теле процедуры-обработчика установить данному параметру значение Истина,
//  								то запись выполнена не будет.
//	ИспользоватьОбработчикЦСМ - Булево - флаг использования обработчика ЦСМ. 
//
Процедура ЗаписьТС(Источник, Отказ, ИспользоватьОбработчикЦСМ) Экспорт
	
	// ЦСМ +++
	ИспользоватьОбработчикЦСМ = Ложь;
	
	Если ItobОбщегоНазначения.ЭтоЗаписьОбъектаПриЗагрузкеВМоделиСервиса(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	БылУстановленПривилегированныйРежим = Истина;
	Если Не ПривилегированныйРежим() Тогда
		БылУстановленПривилегированныйРежим = Ложь;
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли; 
	
	Если Источник.Метаданные().Имя = "уатТС" Тогда
		Запись = ItobОбщегоНазначения.ПолучитьЗаписьРегистраСведений("ItobСвойстваТранспортныхСредств", "ТранспортноеСредство", Источник.Ссылка);	
		Запись.МодельТС	= Источник.Модель;		
		Запись.Организация = Источник.Организация;
		Запись.ГосНомер = Источник.ГосударственныйНомер;
		Запись.Тип = Неопределено;
		Запись.ГаражныйНомер  = Источник.ГаражныйНомер;	
		Запись.Записать();			
	КонецЕсли;
	
	Если НЕ БылУстановленПривилегированныйРежим Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли; 
	// ЦСМ ---
	
КонецПроцедуры

// Процедура обработчик события подписки на событие записи марки транспорта.
//
// Параметры:
//  Источник - СправочникСсылка.ItobМаркиТранспорта	 - Исходный элемент справочника.
//  Отказ	 - Булево - Признак отказа от записи.
//						Если в теле процедуры-обработчика установить данному параметру значение Истина,
//						то запись выполнена не будет.
//	ИспользоватьОбработчикЦСМ - Булево - флаг использования обработчика ЦСМ. 
//
Процедура ЗаписьМаркиТС(Источник, Отказ, ИспользоватьОбработчикЦСМ) Экспорт
		
КонецПроцедуры

// Процедура обработчик события подписки на событие записи пункта назначения.
//
// Параметры:
//  Источник - СправочникСсылка.ItobМаркиТранспорта	 - Исходный элемент справочника.
//  Отказ	 - Булево								 - Признак отказа от записи.
//  								Если в теле процедуры-обработчика установить данному параметру значение Истина,
//  								то запись выполнена не будет.
//	ИспользоватьОбработчикЦСМ - Булево - флаг использования обработчика ЦСМ. 
//
Процедура ЗаписьПунктаНазначения(Источник, Отказ, ИспользоватьОбработчикЦСМ) Экспорт
	
	// ЦСМ +++
	ИспользоватьОбработчикЦСМ = Ложь;
	
	Если ItobОбщегоНазначения.ЭтоЗаписьОбъектаПриЗагрузкеВМоделиСервиса(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	БылУстановленПривилегированныйРежим = Истина;
	Если Не ПривилегированныйРежим() Тогда
		БылУстановленПривилегированныйРежим = Ложь;
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли; 
	
	Запись = РегистрыСведений.ItobСвойстваПунктовНазначения.СоздатьМенеджерЗаписи();
	Запись.ПунктНазначения = Источник.Ссылка;
	Запись.ИспользоватьРадиусФиксацииПосещения = Истина;
	Запись.ГеометрияФиксацииПосещения = Перечисления.ItobВидыГеометрииФиксацииПосещения.Окружность;
	Запись.РадиусФиксацииПосещения = Источник.РадиусПоиска;
	Запись.Широта = Источник.Лат;
	Запись.Долгота = Источник.Лон;
	Запись.Записать();
	
	Если НЕ БылУстановленПривилегированныйРежим Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли; 
	// ЦСМ ---
	
КонецПроцедуры

// Процедура обработчик события подписки на событие записи пункта назначения.
//
// Параметры:
//  Источник - СправочникСсылка.ItobМаркиТранспорта	 - Исходный элемент справочника.
//  Отказ	 - Булево								 - Признак отказа от записи.
//  								Если в теле процедуры-обработчика установить данному параметру значение Истина,
//  								то запись выполнена не будет.
//	ИспользоватьОбработчикЦСМ - Булево - флаг использования обработчика ЦСМ. 
//
Процедура ЗаписьГеографическойЗоны(Источник, Отказ, ИспользоватьОбработчикЦСМ) Экспорт
	
	// ЦСМ +++
	ИспользоватьОбработчикЦСМ = Ложь;
	
	Если ItobОбщегоНазначения.ЭтоЗаписьОбъектаПриЗагрузкеВМоделиСервиса(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	БылУстановленПривилегированныйРежим = Истина;
	Если Не ПривилегированныйРежим() Тогда
		БылУстановленПривилегированныйРежим = Ложь;
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли; 

	Запись = РегистрыСведений.ItobПараметрыГеографическихЗон.СоздатьМенеджерЗаписи();
	Запись.ГеографическаяЗона = Источник.Ссылка;
	Запись.ИспользоватьПриГеокодировании = Истина;
	Запись.Записать();
	
	Если НЕ БылУстановленПривилегированныйРежим Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли; 

	// ЦСМ ---
	
КонецПроцедуры


// Процедура обработчик события подписки на событие записи пункта назначения.
//
// Параметры:
//  Источник					 - СправочникСсылка.ItobМаркиТранспорта	 - Исходный элемент справочника.
//  Отказ						 - Булево								 - Признак отказа от записи.
//  								Если в теле процедуры-обработчика установить данному параметру значение Истина,
//  								то запись выполнена не будет.
//  РежимПроведения				 - РежимПроведенияДокумента				 - В данный параметр передается текущий режим проведения.
//  ИспользоватьОбработчикЦСМ	 - Булево								 - флаг использования обработчика ЦСМ.
//
Процедура ОбработкаПроведенияПутевогоЛиста(Источник, Отказ, РежимПроведения, ИспользоватьОбработчикЦСМ) Экспорт
		
КонецПроцедуры

// Процедура обработчик события подписки на событие записи пункта назначения.
//
// Параметры:
//  Источник - СправочникСсылка.ItobМаркиТранспорта	 - Исходный элемент справочника.
//  Отказ	 - Булево								 - Признак отказа от записи.
//  								Если в теле процедуры-обработчика установить данному параметру значение Истина,
//  								то запись выполнена не будет.
//	ИспользоватьОбработчикЦСМ - Булево - флаг использования обработчика ЦСМ. 
//
Процедура ОбработкаУдаленияПроведенияПутевогоЛиста(Источник, Отказ, ИспользоватьОбработчикЦСМ) Экспорт
		
КонецПроцедуры

// Процедура обработчик события подписки на событие записи пункта назначения.
//
// Параметры:
//  Источник - СправочникСсылка.ItobМаркиТранспорта	 - Исходный элемент справочника.
//  Отказ	 - Булево								 - Признак отказа от записи.
//  								Если в теле процедуры-обработчика установить данному параметру значение Истина,
//  								то запись выполнена не будет.
//	ИспользоватьОбработчикЦСМ - Булево - флаг использования обработчика ЦСМ. 
//
Процедура ЗаписьПутевогоЛиста(Источник, Отказ, ИспользоватьОбработчикЦСМ) Экспорт
	
	ИспользоватьОбработчикЦСМ = Ложь;
	
	Если ItobОбщегоНазначения.ЭтоЗаписьОбъектаПриЗагрузкеВМоделиСервиса(Источник) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

// Переопределяется стандартное поведение (в модуле ItobОбщегоНазначенияПовтИсп.ИмяРеквизитаМоделиУТС()).
//
// Параметры:
//  ТекущееИмя - Строка - если перезаполнить значение параметра "текущее имя"
//						  (ожидается имя реквизита модели у ТС, как в конфигураторе),
//  					  то именно этот реквизит будет использован при различных расчетах 
//						  (например, при расчете расхода топлива).
//
Процедура ПереопределитьИмяРеквизитаМодели(ТекущееИмя) Экспорт	
	
КонецПроцедуры

#КонецОбласти