#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	// необходима для подключения внешних ПФ
	Заглушка = Истина;
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

// СтандартныеПодсистемы.ВерсионированиеОбъектов
//  Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки	 - Структура - настройки подсистемы.
//
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.УправлениеДоступом

// Позволяет переопределить ограничение.
//
// Параметры:
//  Ограничение - Структура:
//    * Текст                             - Строка - ограничение доступа для пользователей.
//                                          Если пустая строка, значит, доступ разрешен.
//    * ТекстДляВнешнихПользователей      - Строка - ограничение доступа для внешних пользователей.
//                                          Если пустая строка, значит, доступ запрещен.
//    * ПоВладельцуБезЗаписиКлючейДоступа - Неопределено - определить автоматически.
//                                        - Булево - если Ложь, то всегда записывать ключи доступа,
//                                          если Истина, тогда не записывать ключи доступа,
//                                          а использовать ключи доступа владельца (требуется,
//                                          чтобы ограничение было строго по объекту-владельцу).
//   * ПоВладельцуБезЗаписиКлючейДоступаДляВнешнихПользователей - Неопределено, Булево - также
//                                          как у параметра ПоВладельцуБезЗаписиКлючейДоступа.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация, ПустаяСсылка КАК Истина, NULL КАК Истина)
	|	И ЗначениеРазрешено(Подразделение, ПустаяСсылка КАК Истина, NULL КАК Истина)";
	
	Ограничение.ТекстДляВнешнихПользователей = Ограничение.Текст;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// См. ИнтеграцияС1СДокументооборотБазоваяФункциональностьПереопределяемый.ЗаполнитьРеквизитыИзПотребителя.
Процедура ЗаполнитьРеквизитыОбъектаДокументооборота(Прокси, ОбъектXDTO, СсылкаНаПотребитель) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтеграцияС1СДокументооборотом") Тогда
		
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность = ОбщегоНазначения.ОбщийМодуль(
			"ИнтеграцияС1СДокументооборотБазоваяФункциональность");
		
		Если ТипЗнч(СсылкаНаПотребитель) = Тип("СправочникСсылка.Сотрудники")Тогда
			
			Если МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.ПроверитьТип(Прокси, ОбъектXDTO, "DMUser") Тогда
				
				// Найдем пользователя, соответствующего сотруднику.
				Запрос = Новый Запрос(
					"ВЫБРАТЬ РАЗЛИЧНЫЕ
					|	Пользователи.Ссылка КАК Пользователь
					|ИЗ
					|	Справочник.Сотрудники КАК Сотрудники
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
					|		ПО Сотрудники.ФизическоеЛицо = Пользователи.ФизическоеЛицо
					|ГДЕ
					|	Сотрудники.Ссылка = &Сотрудник
					|	И НЕ Пользователи.ПометкаУдаления");
				Запрос.УстановитьПараметр("Сотрудник", СсылкаНаПотребитель);
				
				Выборка = Запрос.Выполнить().Выбрать();
				
				Если Выборка.Количество() = 1 Тогда
					// Единственный пользователь найден, заполним его данные.
					Выборка.Следующий();
					МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.ЗаполнитьРеквизитыИзПотребителя(
						Прокси,
						ОбъектXDTO,
						Выборка.Пользователь);
				КонецЕсли;
								
			ИначеЕсли МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.ПроверитьТип(Прокси, ОбъектXDTO, "DMPrivatePerson") Тогда
				
				// Заполним физ. лицо по данным сотрудника.
				ФизическоеЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаПотребитель, "ФизическоеЛицо");
				МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.ЗаполнитьРеквизитыИзПотребителя(
					Прокси,
					ОбъектXDTO,
					ФизическоеЛицо);
				
			ИначеЕсли МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.ПроверитьТип(Прокси, ОбъектXDTO, "DMPartyRowContact")
					Или МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.ПроверитьТип(Прокси, ОбъектXDTO, "DMParty") Тогда
				
				// Сотрудник является стороной документа или контактным лицом стороны.
				// Заполним вспомогательные реквизиты объекта XDTO составного типа.
				уатИнтеграцияС1СДокументооборот.ЗаполнитьИнформациюОПользователе(Прокси, ОбъектXDTO, СсылкаНаПотребитель);
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ТипЗнч(СсылкаНаПотребитель) = Тип("СправочникСсылка.Пользователи") Тогда
			
			Если МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.ПроверитьТип(Прокси, ОбъектXDTO, "DMUser") Тогда
				
				// Заполним данные, указанные в карточке пользователя.
				Подразделение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаПотребитель, "Подразделение");
				уатИнтеграцияС1СДокументооборот.ЗаполнитьПодразделение(
					Подразделение,
					Прокси,
					ОбъектXDTO,
					Ложь,
					Ложь);
				
			ИначеЕсли МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.ПроверитьТип(Прокси, ОбъектXDTO, "DMEmployee") Тогда
				
				// Найдем сотрудника, соответствующего пользователю.
				Запрос = Новый Запрос(
					"ВЫБРАТЬ
					|	Пользователи.ФизическоеЛицо КАК ФизическоеЛицо,
					|	Пользователи.ФизическоеЛицо.ФИО КАК ФИО,
					|	Пользователи.Подразделение КАК Подразделение
					|ИЗ
					|	Справочник.Пользователи КАК Пользователи
					|ГДЕ
					|	Пользователи.Ссылка = &Пользователь");
				Запрос.УстановитьПараметр("Пользователь", СсылкаНаПотребитель);
				
				ВыборкаПользователь = Запрос.Выполнить().Выбрать();
				Если ВыборкаПользователь.Следующий() Тогда
					
					Сотрудник = Неопределено;
					
					Если ЗначениеЗаполнено(ВыборкаПользователь.ФизическоеЛицо) Тогда
						// Подходящего сотрудника будем искать по физ. лицу пользователя.
						СотрудникиФизическогоЛица = СотрудникиФизическихЛиц(
							ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВыборкаПользователь.ФизическоеЛицо));
						КолВоСотрудников = СотрудникиФизическогоЛица.Количество();
						Если КолВоСотрудников > 1 Тогда
							// Если по физ. лицу числится единственный сотрудник - выберем его.
							Сотрудник = СотрудникиФизическогоЛица[0].Сотрудник;
						КонецЕсли;
					КонецЕсли;
					
					Если ЗначениеЗаполнено(Сотрудник) Тогда
						// Заполним данные из найденного сотрудника.
						МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.ЗаполнитьРеквизитыИзПотребителя(
							Прокси,
							ОбъектXDTO,
							Сотрудник);
					КонецЕсли;
					
				КонецЕсли;
				
			ИначеЕсли МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.ПроверитьТип(Прокси, ОбъектXDTO, "DMPrivatePerson") Тогда
				
				// Заполним физ. лицо по данным пользователя.
				ФизическоеЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаПотребитель, "ФизическоеЛицо");
				МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.ЗаполнитьРеквизитыИзПотребителя(
					Прокси,
					ОбъектXDTO,
					ФизическоеЛицо);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// См. ИнтеграцияС1СДокументооборотБазоваяФункциональностьПереопределяемый.ДополнитьСоответствиеТипов.
Процедура ДополнитьСоответствиеТипов(Таблица) Экспорт
	
	Настройки = Неопределено;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтеграцияС1СДокументооборотом") Тогда
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера = ОбщегоНазначения.ОбщийМодуль(
			"ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера");
		Настройки = МодульИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ИспользоватьИнтеграцию();
	КонецЕсли;
	
	Если Настройки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Настройки.ИспользоватьИнтеграциюДО2 Тогда
		Если ОбщегоНазначения.ПодсистемаСуществует("ИнтеграцияС1СДокументооборотом") Тогда
			МодульИнтеграцияС1СДокументооборотБазоваяФункциональность = ОбщегоНазначения.ОбщийМодуль(
				"ИнтеграцияС1СДокументооборотБазоваяФункциональность");
			МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.ДобавитьСтрокуСоответствияТипов(
				Таблица, "DMUser", Тип("СправочникСсылка.Сотрудники"));
		КонецЕсли;
	ИначеЕсли Настройки.ИспользоватьИнтеграциюДО3 Тогда
		Если ОбщегоНазначения.ПодсистемаСуществует("ИнтеграцияС1СДокументооборотом") Тогда
			МодульИнтеграцияС1СДокументооборотБазоваяФункциональность = ОбщегоНазначения.ОбщийМодуль(
				"ИнтеграцияС1СДокументооборотБазоваяФункциональность");
			МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.ДобавитьСтрокуСоответствияТипов(
				Таблица, "DMEmployee", Тип("СправочникСсылка.Сотрудники"));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Формирует таблицу всех разрешенных сотрудников по физическим лицам.
// 
// Параметры:
// 	ФизическиеЛица - Массив - физические лица, для которых необходимо получить сотрудников.
// Возвращаемое значение:
// 	ТаблицаЗначений - таблица с колонками
//		* Сотрудник - СправочникСсылка.Сотрудники
//		* ФизическоеЛицо - СправочникСсылка.ФизическиеЛица
//
Функция СотрудникиФизическихЛиц(ФизическиеЛица) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ФизическиеЛица", ФизическиеЛица);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Ссылка КАК Сотрудник,
		|	ФизическоеЛицо
		|ИЗ
		|	Справочник.Сотрудники
		|ГДЕ
		|	ФизическоеЛицо В (&ФизическиеЛица)";
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

#КонецЕсли