#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДоступноИзменениеВалют = ПравоДоступа("Изменение", Метаданные.РегистрыСведений.уатОтносительныеКурсыВалют);
	Если ДоступноИзменениеВалют Тогда
		Элементы.СписокЗагрузитьИзТаблицы.Видимость = Истина;
	Иначе
		Элементы.СписокГруппаЗагрузить.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_ЗагрузкаОтносительныхКурсовВалют"
		Или ИмяСобытия = "Запись_ЗагрузкаКурсовВалют" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьИзТаблицы(Команда)
	
	ПараметрыФормы = Новый Структура("Источник", ОтборИсточник);
	ОткрытьФорму("РегистрСведений.уатОтносительныеКурсыВалют.Форма.ФормаЗагрузки", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОтборБазоваяВалютаПриИзменении(Элемент)
	УстановитьОтборСписка(ОтборБазоваяВалюта, "БазоваяВалюта");
КонецПроцедуры

&НаКлиенте
Процедура ОтборИсточникПриИзменении(Элемент)
	УстановитьОтборСписка(ОтборИсточник, "Источник");
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборСписка(Отбор, ИмяПоля)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		ИмяПоля,
		Отбор,
		ВидСравненияКомпоновкиДанных.Равно,
		,
		ЗначениеЗаполнено(Отбор));
	
КонецПроцедуры

#КонецОбласти
