
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("МаршрутныеЛисты") Тогда
		ВыбиратьТС = Ложь;
		НазначитьПеревозчикаВОдинМЛ = Ложь;
		Для Каждого ТекМаршрутныйЛист Из Параметры.МаршрутныеЛисты Цикл
			МаршрутныеЛисты.Добавить(ТекМаршрутныйЛист);
			НоваяСтрока = НазначенныеПеревозчики.Добавить();
			НоваяСтрока.МаршрутныйЛист = ТекМаршрутныйЛист;
			НоваяСтрока.Перевозчик = ТекМаршрутныйЛист.Контрагент;
			НоваяСтрока.Договор = ТекМаршрутныйЛист.ДоговорКонтрагента;
		КонецЦикла;
	ИначеЕсли Параметры.Свойство("МаршрутныйЛист") Тогда
		ВыбиратьТС = Истина;
		НазначитьПеревозчикаВОдинМЛ = Истина;
		МаршрутныеЛисты.Добавить(Параметры.МаршрутныйЛист);
	КонецЕсли;
	
	ОтборПоВидуПеревозки        = Истина;
	ОтборПоМаршруту             = Истина;
	ОтборПоМоделиТС             = Истина;
	ОтборПоНаправлениюПеревозки = Истина;
	ОтборПоОбъектуСтроительства = Истина;
	ОтборПоПунктуНазначения     = Истина;
	ОтборПоПунктуОтправления    = Истина;
	ОтборПоТипуТС               = Истина;
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатМаршрутныйЛист.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА уатМаршрутныйЛист.ДатаЗакрытия <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА уатМаршрутныйЛист.ДатаЗакрытия
	|		КОГДА уатМаршрутныйЛист.ДатаИВремяОтправления <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА уатМаршрутныйЛист.ДатаИВремяОтправления
	|		КОГДА уатМаршрутныйЛист.ДатаИВремяОтправленияПлан <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА уатМаршрутныйЛист.ДатаИВремяОтправленияПлан
	|		ИНАЧЕ уатМаршрутныйЛист.Дата
	|	КОНЕЦ КАК ДатаЗакрытия
	|ПОМЕСТИТЬ втМаршрутныеЛисты
	|ИЗ
	|	Документ.уатМаршрутныйЛист КАК уатМаршрутныйЛист
	|ГДЕ
	|	уатМаршрутныйЛист.Ссылка В(&МаршрутныеЛисты)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатМаршрутныйЛист.Ссылка КАК Ссылка,
	|	уатМаршрутныйЛист.Маршрут КАК Маршрут,
	|	уатМаршрутныйЛист.АдресОтправления КАК АдресОтправления,
	|	уатМаршрутныйЛист.АдресНазначения КАК АдресНазначения,
	|	уатМаршрутныйЛист.ОбъектСтроительства КАК ОбъектСтроительства,
	|	уатСценарииПланирования.Ссылка КАК Сценарий,
	|	уатМаршрутныйЛист.ВидПеревозки КАК ВидПеревозки,
	|	уатМаршрутныйЛист.НаправлениеПеревозки КАК НаправлениеПеревозки,
	|	уатМаршрутныйЛист.Организация КАК Организация,
	|	уатМаршрутныйЛист.Подразделение КАК Подразделение,
	|	уатПланированиеРаботыТС.Ссылка КАК ПланированиеРаботыТС,
	|	уатМаршрутныйЛист.ТС.Модель КАК МодельТС,
	|	уатМаршрутныйЛист.ТС.ТипТС КАК ТипТС,
	|	уатСценарииПланирования.ПараметрВыработки КАК ПараметрВыработки
	|ПОМЕСТИТЬ втДанныеМаршрутныхЛистов
	|ИЗ
	|	втМаршрутныеЛисты КАК втМаршрутныеЛисты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.уатМаршрутныйЛист КАК уатМаршрутныйЛист
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.уатПланированиеРаботыТС КАК уатПланированиеРаботыТС
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.уатСценарииПланирования КАК уатСценарииПланирования
	|				ПО уатПланированиеРаботыТС.Сценарий = уатСценарииПланирования.Ссылка
	|			ПО уатМаршрутныйЛист.Организация = уатПланированиеРаботыТС.Организация
	|				И уатМаршрутныйЛист.Подразделение = уатПланированиеРаботыТС.Подразделение
	|		ПО втМаршрутныеЛисты.Ссылка = уатМаршрутныйЛист.Ссылка
	|ГДЕ
	|	уатСценарииПланирования.Раздел = ЗНАЧЕНИЕ(Перечисление.уатРазделыПланирования.ОбъемыПеревозок)
	|	И уатПланированиеРаботыТС.Проведен = ИСТИНА
	|	И втМаршрутныеЛисты.ДатаЗакрытия МЕЖДУ уатПланированиеРаботыТС.ДатаПланирования И ВЫБОР
	|			КОГДА уатСценарииПланирования.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Декада)
	|				ТОГДА КОНЕЦПЕРИОДА(уатПланированиеРаботыТС.ДатаПланирования, ДЕКАДА)
	|			КОГДА уатСценарииПланирования.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц)
	|				ТОГДА КОНЕЦПЕРИОДА(уатПланированиеРаботыТС.ДатаПланирования, МЕСЯЦ)
	|			КОГДА уатСценарииПланирования.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Квартал)
	|				ТОГДА КОНЕЦПЕРИОДА(уатПланированиеРаботыТС.ДатаПланирования, КВАРТАЛ)
	|			КОГДА уатСценарииПланирования.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Полугодие)
	|				ТОГДА КОНЕЦПЕРИОДА(уатПланированиеРаботыТС.ДатаПланирования, ПОЛУГОДИЕ)
	|			КОГДА уатСценарииПланирования.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.год)
	|				ТОГДА КОНЕЦПЕРИОДА(уатПланированиеРаботыТС.ДатаПланирования, ГОД)
	|			ИНАЧЕ уатПланированиеРаботыТС.ДатаПланирования
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДанныеМаршрутныхЛистов.ПланированиеРаботыТС КАК ПланированиеРаботыТС
	|ИЗ
	|	втДанныеМаршрутныхЛистов КАК втДанныеМаршрутныхЛистов
	|
	|СГРУППИРОВАТЬ ПО
	|	втДанныеМаршрутныхЛистов.ПланированиеРаботыТС");
	Запрос.УстановитьПараметр("МаршрутныеЛисты", МаршрутныеЛисты);
	Выборка = Запрос.Выполнить().Выбрать();
	
	КоличествоДокументовПланирования = 0;
	ТекстОшибки = "";
	Пока Выборка.Следующий() Цикл
		КоличествоДокументовПланирования = КоличествоДокументовПланирования + 1;
		ПланированиеРаботыТС = Выборка.ПланированиеРаботыТС;
	КонецЦикла;
	Если КоличествоДокументовПланирования = 0 Тогда
		ТекстОшибки = НСтр("ru = 'Документ планирования работы ТС не найден. Не найден план по организации или дата отправления не попадает в период планирования.'; en = 'The vehicle work planning document was not found. The organization plan was not found, or the departure date does not fall within the planning period.'");
	ИначеЕсли КоличествоДокументовПланирования > 1 И НазначитьПеревозчикаВОдинМЛ Тогда
		ТекстОшибки = НСтр("ru = 'Документ планирования работы ТС не найден. Выбранные Маршрутные листы должны принадлежать к одной организации и иметь дату отправления в одном периоде планирования'; en = 'The vehicle work planning document was not found. The selected Route Sheets must belong to the same organization and have a departure date within the same planning period.'");
	КонецЕсли;
	
	СтруктураОбъектовНастроек = Новый Структура("Организация, Подразделение, Пользователь", 
		ПланированиеРаботыТС.Организация, ПланированиеРаботыТС.Подразделение, ПользователиКлиентСервер.АвторизованныйПользователь());
	ВидКонтроля = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(
		СтруктураОбъектовНастроек, "КонтрольЗакрепленияОбъемовЗаПеревозчиками");
	Если ВидКонтроля = Перечисления.уатВидыКонтроля.Запрещать Тогда
		ЗапрещатьПревышениеОбъемовПеревозок = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ТекстОшибки <> "" Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ОшибкаПриОткрытииФормыПослеЗавершения", ЭтотОбъект);
		ПоказатьПредупреждение(ОписаниеОповещения, ТекстОшибки);
	КонецЕсли;
	
	ОбновитьТаблицуПеревозчиковНаКлиенте();
	УстановитьВидимость();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборПоВидуПеревозкиПриИзменении(Элемент)
	ОбновитьТаблицуПеревозчиковНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоМаршрутуПриИзменении(Элемент)
	ОбновитьТаблицуПеревозчиковНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоПунктуОтправленияПриИзменении(Элемент)
	ОбновитьТаблицуПеревозчиковНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоПунктуНазначенияПриИзменении(Элемент)
	ОбновитьТаблицуПеревозчиковНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоМоделиТСПриИзменении(Элемент)
	ОбновитьТаблицуПеревозчиковНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоТипуТСПриИзменении(Элемент)
	ОбновитьТаблицуПеревозчиковНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоНаправлениюПеревозкиПриИзменении(Элемент)
	ОбновитьТаблицуПеревозчиковНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоОбъектуСтроительстваПриИзменении(Элемент)
	ОбновитьТаблицуПеревозчиковНаКлиенте();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормы_НазначенныеПеревозчики

&НаКлиенте
Процедура НазначенныеПеревозчикиПриАктивизацииСтроки(Элемент)
	ОбновитьТаблицуПеревозчиковНаКлиенте();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьПеревозчика(Команда)
	
	ТекСтрока = Элементы.ТаблицаПеревозчиков.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ЗакрытьФормуСВыбором(ТекСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПеревозчикаДляМаршрутногоЛиста(Команда)
	ТекущиеДанныеМЛ = Элементы.НазначенныеПеревозчики.ТекущиеДанные;
	ТекущиеДанныеПеревозчика = Элементы.ТаблицаПеревозчиков.ТекущиеДанные;
	Если ТекущиеДанныеМЛ <> Неопределено И ТекущиеДанныеПеревозчика <> Неопределено Тогда
		ТекущиеДанныеМЛ.Перевозчик = ТекущиеДанныеПеревозчика.Перевозчик;
		ТекущиеДанныеМЛ.Договор = ТекущиеДанныеПеревозчика.Договор;
		Для Каждого ТекСтрока Из ТаблицаПеревозчиков Цикл
			Если ТекСтрока.Перевозчик = ТекущиеДанныеМЛ.Перевозчик
				И ТекСтрока.Договор = ТекущиеДанныеМЛ.Договор Тогда
				ТекСтрока.Выбран = 0;
			Иначе
				ТекСтрока.Выбран = 2;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТаблицуПеревозчиков(Команда)
	ОбновитьТаблицуПеревозчиковНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура НазначитьПеревозчиков(Команда)
	
	РезультатОптимизации = НазначитьПеревозчиковНаСервере();
	
	Если НазначитьПеревозчикаВОдинМЛ Тогда
		Если ЗначениеЗаполнено(РезультатОптимизации.Перевозчик) Тогда
			ТекстВопроса = НСтр("ru = 'Оптимальный перевозчик найден. Подставить в документ?'; en = 'The optimal carrier has been found. Should I add it to the document?'");
			ОповещениеОЗавершении = Новый ОписаниеОповещения("НазначитьПеревозчиковЗавершение",
				ЭтотОбъект, РезультатОптимизации);
			ПоказатьВопрос(ОповещениеОЗавершении, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
		Иначе
			ТекстНСтр = НСтр("ru = 'Оптимальный перевозчик не найден. Возможно, запрещено превышение объемов перевозок или не заполнена плановая выработка.'; en = 'The optimal carrier was not found. Exceeding the transportation volume may be prohibited, or the planned capacity may not be met.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстНСтр);
		КонецЕсли;
	Иначе
		ТекущиеДанныеМЛ = Элементы.НазначенныеПеревозчики.ТекущиеДанные;
		Если ТекущиеДанныеМЛ <> Неопределено Тогда
			Для Каждого ТекСтрока Из ТаблицаПеревозчиков Цикл
				Если ТекСтрока.Перевозчик = ТекущиеДанныеМЛ.Перевозчик
					И ТекСтрока.Договор = ТекущиеДанныеМЛ.Договор Тогда
					ТекСтрока.Выбран = 0;
				Иначе
					ТекСтрока.Выбран = 2;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	ЗаписатьНаСервере();
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура АлгоритмОптимизацииПолныйПеребор(Команда)
	Элементы.ФормаАлгоритмОптимизацииПолныйПеребор.Пометка = Истина;
	Элементы.ФормаАлгортимОптимизацииЖадныйАлгоритм.Пометка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура АлгортимОптимизацииЖадныйАлгоритм(Команда)
	Элементы.ФормаАлгоритмОптимизацииПолныйПеребор.Пометка = Ложь;
	Элементы.ФормаАлгортимОптимизацииЖадныйАлгоритм.Пометка = Истина;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимость();
	
	СценарийПланирования = ПланированиеРаботыТС.Сценарий;
	ХарактеристикиСценария = уатОбщегоНазначения_проф.ЗаполнитьХарактеристикиСценария(СценарийПланирования);
	
	Элементы.ОтборПоВидуПеревозки.Видимость        = ХарактеристикиСценария.флВидПеревозки;
	Элементы.ОтборПоМаршруту.Видимость             = ХарактеристикиСценария.флМаршрут
		И ХарактеристикиСценария.ВариантАналитикиМаршрут = Перечисления.уатВариантыАналитик.Маршрут;
	Элементы.ОтборПоМоделиТС.Видимость             = ХарактеристикиСценария.флТС
		И ХарактеристикиСценария.ВариантАналитикиТС = Перечисления.уатВариантыАналитик.МодельТС;
	Элементы.ОтборПоНаправлениюПеревозки.Видимость = ХарактеристикиСценария.флНаправлениеПеревозки;
	Элементы.ОтборПоОбъектуСтроительства.Видимость = ХарактеристикиСценария.флОбъектСтроительства;
	Элементы.ОтборПоПунктуНазначения.Видимость     = ХарактеристикиСценария.флМаршрут
		И ХарактеристикиСценария.ВариантАналитикиТС = Перечисления.уатВариантыАналитик.ПунктНазначения;
	Элементы.ОтборПоПунктуОтправления.Видимость    = ХарактеристикиСценария.флМаршрут
		И ХарактеристикиСценария.ВариантАналитикиТС = Перечисления.уатВариантыАналитик.ПунктОтправления;
	Элементы.ОтборПоТипуТС.Видимость               = ХарактеристикиСценария.флТС
		И ХарактеристикиСценария.ВариантАналитикиТС = Перечисления.уатВариантыАналитик.ТипТС;
	
	Элементы.ТаблицаПеревозчиковТС.Видимость = ВыбиратьТС;
	Элементы.ТаблицаПеревозчиковВидПеревозки.Видимость = ХарактеристикиСценария.флВидПеревозки;
	Элементы.ТаблицаПеревозчиковМаршрут.Видимость = ХарактеристикиСценария.флМаршрут
		И ХарактеристикиСценария.ВариантАналитикиМаршрут = Перечисления.уатВариантыАналитик.Маршрут;
	Элементы.ТаблицаПеревозчиковМодельТС.Видимость = ХарактеристикиСценария.флТС
		И ХарактеристикиСценария.ВариантАналитикиТС = Перечисления.уатВариантыАналитик.МодельТС;
	Элементы.ТаблицаПеревозчиковНаправлениеПеревозки.Видимость = ХарактеристикиСценария.флНаправлениеПеревозки;
	Элементы.ТаблицаПеревозчиковОбъектСтроительства.Видимость = ХарактеристикиСценария.флОбъектСтроительства;
	Элементы.ТаблицаПеревозчиковПунктНазначения.Видимость = ХарактеристикиСценария.флМаршрут
		И ХарактеристикиСценария.ВариантАналитикиТС = Перечисления.уатВариантыАналитик.ПунктНазначения;
	Элементы.ТаблицаПеревозчиковПунктОтправления.Видимость = ХарактеристикиСценария.флМаршрут
		И ХарактеристикиСценария.ВариантАналитикиТС = Перечисления.уатВариантыАналитик.ПунктОтправления;
	Элементы.ТаблицаПеревозчиковТипТС.Видимость = ХарактеристикиСценария.флТС
		И ХарактеристикиСценария.ВариантАналитикиТС = Перечисления.уатВариантыАналитик.ТипТС;
	
	Элементы.ТаблицаПеревозчиковКоличествоПоПлану.Видимость = Не ХарактеристикиСценария.ПланированиеОбъемовВПроцентах;
	Элементы.ТаблицаПеревозчиковКоличествоПоПлануПроцент.Видимость = ХарактеристикиСценария.ПланированиеОбъемовВПроцентах;
	
	ЕдиницаИзмерения = ПолучитьЕдиницуИзмеренияКоличестваВыработки(ХарактеристикиСценария.МассивПараметровВыработки);
	Элементы.ТаблицаПеревозчиковКоличествоПоПлану.Заголовок = НСтр("ru = 'По плану, '; en = 'According to plan,'") + Строка(ЕдиницаИзмерения);
	Элементы.ТаблицаПеревозчиковКоличествоПоФакту.Заголовок = НСтр("ru = 'По факту, '; en = 'In fact,'") + Строка(ЕдиницаИзмерения);
	Элементы.ТаблицаПеревозчиковКоличествоПоМЛ.Заголовок = НСтр("ru = 'По Маршрутному листу, '; en = 'According to the route sheet, '") + Строка(ЕдиницаИзмерения);
	
	
	Элементы.ТаблицаПеревозчиковВыбран.Видимость             = Не НазначитьПеревозчикаВОдинМЛ;
	Элементы.ФормаЗаписать.Видимость                         = Не НазначитьПеревозчикаВОдинМЛ;
	Элементы.ВыбратьПеревозчикаДляМаршрутногоЛиста.Видимость = Не НазначитьПеревозчикаВОдинМЛ;
	Элементы.НазначенныеПеревозчики.Видимость                = Не НазначитьПеревозчикаВОдинМЛ;
	Элементы.ФормаВыбратьПеревозчика.Видимость               = НазначитьПеревозчикаВОдинМЛ;
	Элементы.ФормаНазначитьПеревозчиков.Видимость            = Не НазначитьПеревозчикаВОдинМЛ;
	Элементы.НазначитьПеревозчика.Видимость                  = НазначитьПеревозчикаВОдинМЛ;
	Если НазначитьПеревозчикаВОдинМЛ Тогда
		Элементы.ФормаВыбратьПеревозчика.КнопкаПоУмолчанию = Истина;
	Иначе
		Элементы.ФормаЗаписать.КнопкаПоУмолчанию = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТаблицуПеревозчиковНаКлиенте()
	
	ТекущийМаршрутныйЛист = Неопределено;
	ТекущийПеревозчик     = Неопределено;
	ТекущийДоговор        = Неопределено;
	
	Если НазначитьПеревозчикаВОдинМЛ Тогда
		ТекущийМаршрутныйЛист = МаршрутныеЛисты[0].Значение;
	Иначе
		ТекущиеДанные = Элементы.НазначенныеПеревозчики.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено И МаршрутныеЛисты.Количество() > 0 Тогда
			ТекущийМаршрутныйЛист = МаршрутныеЛисты[0].Значение;
		ИначеЕсли ТекущиеДанные = Неопределено Тогда
			ТаблицаПеревозчиков.Очистить();
			Возврат;
		Иначе
			ТекущийМаршрутныйЛист = ТекущиеДанные.МаршрутныйЛист;
			ТекущийПеревозчик     = ТекущиеДанные.Перевозчик;
			ТекущийДоговор        = ТекущиеДанные.Договор;
		КонецЕсли;
	КонецЕсли;
	
	ОбновитьТаблицуПеревозчиковНаСервере(ТекущийМаршрутныйЛист, ТекущийПеревозчик, ТекущийДоговор);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьТаблицуПеревозчиковНаСервере(ТекущийМаршрутныйЛист, ТекущийПеревозчик, ТекущийДоговор)
	
	ТекущиеМаршрутныеЛисты = Новый Массив;
	ТекущиеМаршрутныеЛисты.Добавить(ТекущийМаршрутныйЛист);
	ДанныеЗапроса = ПолучитьДанныеПеревозчиков(ТекущиеМаршрутныеЛисты, ТекущийПеревозчик, ТекущийДоговор);
	
	ТаблицаПеревозчиков.Очистить();
	Для Каждого ТекСтрока Из ДанныеЗапроса Цикл
		НоваяСтрока = ТаблицаПеревозчиков.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		НоваяСтрока.Выбран = ТекСтрока.ФлагВыбран;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеПеревозчиков(ТекущиеМаршрутныеЛисты, ТекущийПеревозчик = Неопределено, ТекущийДоговор = Неопределено)
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатОбъемыПеревозокОбороты.Организация КАК Организация,
	|	уатОбъемыПеревозокОбороты.Подразделение КАК Подразделение,
	|	уатОбъемыПеревозокОбороты.Перевозчик КАК Перевозчик,
	|	уатОбъемыПеревозокОбороты.Договор КАК Договор,
	|	уатОбъемыПеревозокОбороты.Сценарий КАК Сценарий,
	|	уатОбъемыПеревозокОбороты.Маршрут КАК Маршрут,
	|	уатОбъемыПеревозокОбороты.ВидПеревозки КАК ВидПеревозки,
	|	уатОбъемыПеревозокОбороты.НаправлениеПеревозки КАК НаправлениеПеревозки,
	|	уатОбъемыПеревозокОбороты.ОбъектСтроительства КАК ОбъектСтроительства,
	|	уатОбъемыПеревозокОбороты.ВидТС КАК ВидТС,
	|	уатОбъемыПеревозокОбороты.ПланированиеРаботыТС КАК ПланированиеРаботыТС,
	|	уатОбъемыПеревозокОбороты.ПереданоРейсовОборот КАК ПереданоРейсовОборот,
	|	уатОбъемыПеревозокОбороты.ВыполненоРейсовОборот КАК ВыполненоРейсовОборот,
	|	уатОбъемыПеревозокОбороты.ПереданоВыработкиОборот КАК ПереданоВыработкиОборот,
	|	уатОбъемыПеревозокОбороты.ВыполненоВыработкиОборот КАК ВыполненоВыработкиОборот,
	|	ВЫБОР
	|		КОГДА уатОбъемыПеревозокОбороты.Сценарий.ПланированиеОбъемовВПроцентах
	|			ТОГДА 0
	|		ИНАЧЕ уатПланированиеРаботыТССоставПлана.Количество
	|	КОНЕЦ КАК КоличествоВыработкаПлан,
	|	ВЫБОР
	|		КОГДА уатОбъемыПеревозокОбороты.Сценарий.ПланированиеОбъемовВПроцентах
	|			ТОГДА уатПланированиеРаботыТССоставПлана.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПроцентКоличествоВыработкаПлан,
	|	ВЫБОР
	|		КОГДА уатОбъемыПеревозокОбороты.ПереданоРейсовОборот = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(100 * уатОбъемыПеревозокОбороты.ВыполненоРейсовОборот / уатОбъемыПеревозокОбороты.ПереданоРейсовОборот КАК ЧИСЛО(7, 1))
	|	КОНЕЦ КАК ПроцентВыполненияРейсов,
	|	ВЫБОР
	|		КОГДА уатОбъемыПеревозокОбороты.ПереданоВыработкиОборот = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(100 * уатОбъемыПеревозокОбороты.ВыполненоВыработкиОборот / уатОбъемыПеревозокОбороты.ПереданоВыработкиОборот КАК ЧИСЛО(7, 1))
	|	КОНЕЦ КАК ПроцентВыполненияВыработки,
	|	ВЫБОР
	|		КОГДА уатОбъемыПеревозокОбороты.ПереданоРейсовОборот = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(100 - 100 * уатОбъемыПеревозокОбороты.ВыполненоРейсовОборот / уатОбъемыПеревозокОбороты.ПереданоРейсовОборот КАК ЧИСЛО(7, 1))
	|	КОНЕЦ КАК ПроцентНевыполненияРейсов,
	|	ВЫБОР
	|		КОГДА уатОбъемыПеревозокОбороты.ПереданоВыработкиОборот = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(100 - 100 * уатОбъемыПеревозокОбороты.ВыполненоВыработкиОборот / уатОбъемыПеревозокОбороты.ПереданоВыработкиОборот КАК ЧИСЛО(7, 1))
	|	КОНЕЦ КАК ПроцентНевыполненияВыработки,
	|	уатПланированиеРаботыТССоставПлана.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ втВыполнениеПлана
	|ИЗ
	|	РегистрНакопления.уатОбъемыПеревозок_уэ.Обороты(
	|			,
	|			,
	|			,
	|			Сценарий = &Сценарий
	|				И ПланированиеРаботыТС = &ПланированиеРаботыТС) КАК уатОбъемыПеревозокОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.уатПланированиеРаботыТС.СоставПлана КАК уатПланированиеРаботыТССоставПлана
	|		ПО уатОбъемыПеревозокОбороты.ПланированиеРаботыТС = уатПланированиеРаботыТССоставПлана.Ссылка
	|			И уатОбъемыПеревозокОбороты.Перевозчик = уатПланированиеРаботыТССоставПлана.Контрагент
	|			И уатОбъемыПеревозокОбороты.Договор = уатПланированиеРаботыТССоставПлана.Договор
	|			И (уатОбъемыПеревозокОбороты.Маршрут = уатПланированиеРаботыТССоставПлана.Маршрут
	|				ИЛИ (уатОбъемыПеревозокОбороты.Маршрут = ЗНАЧЕНИЕ(Справочник.уатМаршруты.ПустаяСсылка)
	|					ИЛИ уатОбъемыПеревозокОбороты.Маршрут = ЗНАЧЕНИЕ(Справочник.уатПунктыНазначения.ПустаяСсылка)
	|					ИЛИ уатОбъемыПеревозокОбороты.Маршрут = НЕОПРЕДЕЛЕНО)
	|					И (уатПланированиеРаботыТССоставПлана.Маршрут = ЗНАЧЕНИЕ(Справочник.уатМаршруты.ПустаяСсылка)
	|						ИЛИ уатПланированиеРаботыТССоставПлана.Маршрут = ЗНАЧЕНИЕ(Справочник.уатПунктыНазначения.ПустаяСсылка)
	|						ИЛИ уатОбъемыПеревозокОбороты.Маршрут = ЗНАЧЕНИЕ(Справочник.уатМаршруты.ПустаяСсылка)))
	|			И (уатОбъемыПеревозокОбороты.ВидПеревозки = уатПланированиеРаботыТССоставПлана.ВидПеревозки
	|				ИЛИ уатПланированиеРаботыТССоставПлана.ВидПеревозки = ЗНАЧЕНИЕ(Справочник.уатВидыПеревозок.ПустаяСсылка))
	|			И (уатОбъемыПеревозокОбороты.НаправлениеПеревозки = уатПланированиеРаботыТССоставПлана.НаправлениеПеревозки
	|				ИЛИ уатПланированиеРаботыТССоставПлана.НаправлениеПеревозки = ЗНАЧЕНИЕ(Справочник.уатНаправленияПеревозок.ПустаяСсылка))
	|			И (уатОбъемыПеревозокОбороты.ОбъектСтроительства = уатПланированиеРаботыТССоставПлана.ОбъектСтроительства
	|				ИЛИ уатПланированиеРаботыТССоставПлана.ОбъектСтроительства = ЗНАЧЕНИЕ(Справочник.уатОбъектыСтроительства.ПустаяСсылка))
	|			И (уатОбъемыПеревозокОбороты.ВидТС = уатПланированиеРаботыТССоставПлана.ДетализацияПланирования
	|				ИЛИ (уатПланированиеРаботыТССоставПлана.ДетализацияПланирования = ЗНАЧЕНИЕ(Справочник.уатМоделиТС.ПустаяСсылка)
	|					ИЛИ уатПланированиеРаботыТССоставПлана.ДетализацияПланирования = ЗНАЧЕНИЕ(Справочник.уатТипыТС.ПустаяСсылка)
	|					ИЛИ уатПланированиеРаботыТССоставПлана.ДетализацияПланирования = НЕОПРЕДЕЛЕНО)
	|					И (уатОбъемыПеревозокОбороты.ВидТС = ЗНАЧЕНИЕ(Справочник.уатМоделиТС.ПустаяСсылка)
	|						ИЛИ уатОбъемыПеревозокОбороты.ВидТС = ЗНАЧЕНИЕ(Справочник.уатТипыТС.ПустаяСсылка)
	|						ИЛИ уатОбъемыПеревозокОбороты.ВидТС = НЕОПРЕДЕЛЕНО))
	|ГДЕ
	|	уатПланированиеРаботыТССоставПлана.Ссылка = &ПланированиеРаботыТС
	|
	|СГРУППИРОВАТЬ ПО
	|	уатОбъемыПеревозокОбороты.ВидПеревозки,
	|	уатОбъемыПеревозокОбороты.Маршрут,
	|	уатОбъемыПеревозокОбороты.ВидТС,
	|	уатОбъемыПеревозокОбороты.НаправлениеПеревозки,
	|	уатОбъемыПеревозокОбороты.Подразделение,
	|	уатОбъемыПеревозокОбороты.Перевозчик,
	|	уатОбъемыПеревозокОбороты.Договор,
	|	уатОбъемыПеревозокОбороты.Организация,
	|	уатОбъемыПеревозокОбороты.ПланированиеРаботыТС,
	|	уатОбъемыПеревозокОбороты.Сценарий,
	|	уатОбъемыПеревозокОбороты.ОбъектСтроительства,
	|	уатОбъемыПеревозокОбороты.ПереданоРейсовОборот,
	|	уатОбъемыПеревозокОбороты.ВыполненоРейсовОборот,
	|	уатОбъемыПеревозокОбороты.ПереданоВыработкиОборот,
	|	уатОбъемыПеревозокОбороты.ВыполненоВыработкиОборот,
	|	ВЫБОР
	|		КОГДА уатОбъемыПеревозокОбороты.Сценарий.ПланированиеОбъемовВПроцентах
	|			ТОГДА 0
	|		ИНАЧЕ уатПланированиеРаботыТССоставПлана.Количество
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА уатОбъемыПеревозокОбороты.Сценарий.ПланированиеОбъемовВПроцентах
	|			ТОГДА уатПланированиеРаботыТССоставПлана.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	уатПланированиеРаботыТССоставПлана.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатМаршрутныйЛист.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА уатМаршрутныйЛист.ДатаЗакрытия <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА уатМаршрутныйЛист.ДатаЗакрытия
	|		КОГДА уатМаршрутныйЛист.ДатаИВремяОтправления <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА уатМаршрутныйЛист.ДатаИВремяОтправления
	|		КОГДА уатМаршрутныйЛист.ДатаИВремяОтправленияПлан <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА уатМаршрутныйЛист.ДатаИВремяОтправленияПлан
	|		ИНАЧЕ уатМаршрутныйЛист.Дата
	|	КОНЕЦ КАК ДатаЗакрытия
	|ПОМЕСТИТЬ втМаршрутныеЛисты
	|ИЗ
	|	Документ.уатМаршрутныйЛист КАК уатМаршрутныйЛист
	|ГДЕ
	|	уатМаршрутныйЛист.Ссылка В(&МаршрутныеЛисты)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатМаршрутныйЛист.Ссылка КАК Ссылка,
	|	уатМаршрутныйЛист.Маршрут КАК Маршрут,
	|	уатМаршрутныйЛист.АдресОтправления КАК АдресОтправления,
	|	уатМаршрутныйЛист.АдресНазначения КАК АдресНазначения,
	|	уатМаршрутныйЛист.ОбъектСтроительства КАК ОбъектСтроительства,
	|	уатСценарииПланирования.Ссылка КАК Сценарий,
	|	уатМаршрутныйЛист.ВидПеревозки КАК ВидПеревозки,
	|	уатМаршрутныйЛист.НаправлениеПеревозки КАК НаправлениеПеревозки,
	|	уатМаршрутныйЛист.Организация КАК Организация,
	|	уатМаршрутныйЛист.Подразделение КАК Подразделение,
	|	уатПланированиеРаботыТС.Ссылка КАК ПланированиеРаботыТС,
	|	уатМаршрутныйЛист.ТС.Модель КАК МодельТС,
	|	уатМаршрутныйЛист.ТС.ТипТС КАК ТипТС,
	|	уатСценарииПланирования.ПараметрВыработки КАК ПараметрВыработки
	|ПОМЕСТИТЬ втСценарийПланирования
	|ИЗ
	|	втМаршрутныеЛисты КАК втМаршрутныеЛисты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.уатМаршрутныйЛист КАК уатМаршрутныйЛист
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.уатПланированиеРаботыТС КАК уатПланированиеРаботыТС
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.уатСценарииПланирования КАК уатСценарииПланирования
	|				ПО уатПланированиеРаботыТС.Сценарий = уатСценарииПланирования.Ссылка
	|			ПО уатМаршрутныйЛист.Организация = уатПланированиеРаботыТС.Организация
	|				И уатМаршрутныйЛист.Подразделение = уатПланированиеРаботыТС.Подразделение
	|		ПО втМаршрутныеЛисты.Ссылка = уатМаршрутныйЛист.Ссылка
	|ГДЕ
	|	уатСценарииПланирования.Раздел = ЗНАЧЕНИЕ(Перечисление.уатРазделыПланирования.ОбъемыПеревозок)
	|	И уатПланированиеРаботыТС.Проведен = ИСТИНА
	|	И втМаршрутныеЛисты.ДатаЗакрытия МЕЖДУ уатПланированиеРаботыТС.ДатаПланирования И ВЫБОР
	|			КОГДА уатСценарииПланирования.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Декада)
	|				ТОГДА КОНЕЦПЕРИОДА(уатПланированиеРаботыТС.ДатаПланирования, ДЕКАДА)
	|			КОГДА уатСценарииПланирования.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц)
	|				ТОГДА КОНЕЦПЕРИОДА(уатПланированиеРаботыТС.ДатаПланирования, МЕСЯЦ)
	|			КОГДА уатСценарииПланирования.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Квартал)
	|				ТОГДА КОНЕЦПЕРИОДА(уатПланированиеРаботыТС.ДатаПланирования, КВАРТАЛ)
	|			КОГДА уатСценарииПланирования.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Полугодие)
	|				ТОГДА КОНЕЦПЕРИОДА(уатПланированиеРаботыТС.ДатаПланирования, ПОЛУГОДИЕ)
	|			КОГДА уатСценарииПланирования.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.год)
	|				ТОГДА КОНЕЦПЕРИОДА(уатПланированиеРаботыТС.ДатаПланирования, ГОД)
	|			ИНАЧЕ уатПланированиеРаботыТС.ДатаПланирования
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	втСценарийПланирования.Организация КАК Организация,
	|	втСценарийПланирования.Подразделение КАК Подразделение,
	|	втСценарийПланирования.Сценарий КАК Сценарий,
	|	втСценарийПланирования.ПланированиеРаботыТС КАК ПланированиеРаботыТС,
	|	ВЫБОР
	|		КОГДА уатСценарииПланированияРазрезМаршрут.РазрезПланирования ЕСТЬ NULL
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		КОГДА уатСценарииПланированияРазрезМаршрут.ВариантАналитики = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.Маршрут)
	|				И уатСценарииПланированияРазрезМаршрут.ПланированиеПоГруппам
	|			ТОГДА втСценарийПланирования.Маршрут.Родитель
	|		КОГДА уатСценарииПланированияРазрезМаршрут.ВариантАналитики = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.Маршрут)
	|			ТОГДА втСценарийПланирования.Маршрут
	|		КОГДА уатСценарииПланированияРазрезМаршрут.ВариантАналитики = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.ПунктОтправления)
	|				И уатСценарииПланированияРазрезМаршрут.ПланированиеПоГруппам
	|			ТОГДА втСценарийПланирования.АдресОтправления.Родитель
	|		КОГДА уатСценарииПланированияРазрезМаршрут.ВариантАналитики = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.ПунктОтправления)
	|			ТОГДА втСценарийПланирования.АдресОтправления
	|		КОГДА уатСценарииПланированияРазрезМаршрут.ВариантАналитики = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.ПунктНазначения)
	|				И уатСценарииПланированияРазрезМаршрут.ПланированиеПоГруппам
	|			ТОГДА втСценарийПланирования.АдресНазначения.Родитель
	|		КОГДА уатСценарииПланированияРазрезМаршрут.ВариантАналитики = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.ПунктНазначения)
	|			ТОГДА втСценарийПланирования.АдресНазначения
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Маршрут,
	|	ВЫБОР
	|		КОГДА уатСценарииПланированияРазрезВидПеревозки.РазрезПланирования ЕСТЬ NULL
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ втСценарийПланирования.ВидПеревозки
	|	КОНЕЦ КАК ВидПеревозки,
	|	ВЫБОР
	|		КОГДА уатСценарииПланированияРазрезНаправлениеПеревозки.РазрезПланирования ЕСТЬ NULL
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		КОГДА уатСценарииПланированияРазрезНаправлениеПеревозки.ПланированиеПоГруппам
	|			ТОГДА втСценарийПланирования.НаправлениеПеревозки.Родитель
	|		ИНАЧЕ втСценарийПланирования.НаправлениеПеревозки
	|	КОНЕЦ КАК НаправлениеПеревозки,
	|	ВЫБОР
	|		КОГДА уатСценарииПланированияРазрезОбъектСтроительства.РазрезПланирования ЕСТЬ NULL
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		КОГДА уатСценарииПланированияРазрезОбъектСтроительства.ПланированиеПоГруппам
	|			ТОГДА втСценарийПланирования.ОбъектСтроительства.Родитель
	|		ИНАЧЕ втСценарийПланирования.ОбъектСтроительства
	|	КОНЕЦ КАК ОбъектСтроительства,
	|	ВЫБОР
	|		КОГДА уатСценарииПланированияРазрезВидТранспорта.РазрезПланирования ЕСТЬ NULL
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		КОГДА уатСценарииПланированияРазрезВидТранспорта.ВариантАналитики = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.МодельТС)
	|				И уатСценарииПланированияРазрезВидТранспорта.ПланированиеПоГруппам
	|			ТОГДА втСценарийПланирования.МодельТС.Родитель
	|		КОГДА уатСценарииПланированияРазрезВидТранспорта.ВариантАналитики = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.МодельТС)
	|			ТОГДА втСценарийПланирования.МодельТС
	|		КОГДА уатСценарииПланированияРазрезВидТранспорта.ВариантАналитики = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.ТипТС)
	|				И уатСценарииПланированияРазрезВидТранспорта.ПланированиеПоГруппам
	|			ТОГДА втСценарийПланирования.ТипТС.Родитель
	|		КОГДА уатСценарииПланированияРазрезВидТранспорта.ВариантАналитики = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.ТипТС)
	|			ТОГДА втСценарийПланирования.ТипТС
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВидТС,
	|	уатМаршрутныйЛистВыработкаТСиСотрудников.Ссылка КАК МаршрутныйЛист,
	|	ВЫБОР
	|		КОГДА уатСценарииПланированияРазрезМаршрут.РазрезПланирования ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		КОГДА уатСценарииПланированияРазрезМаршрут.ВариантАналитики = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.Маршрут)
	|			ТОГДА &ОтборПоМаршруту
	|		КОГДА уатСценарииПланированияРазрезМаршрут.ВариантАналитики = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.ПунктОтправления)
	|			ТОГДА &ОтборПоПунктуОтправления
	|		КОГДА уатСценарииПланированияРазрезМаршрут.ВариантАналитики = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.ПунктНазначения)
	|			ТОГДА &ОтборПоПунктуНазначения
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПроверятьМаршрут,
	|	ВЫБОР
	|		КОГДА уатСценарииПланированияРазрезВидПеревозки.РазрезПланирования ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ &ОтборПоВидуПеревозки
	|	КОНЕЦ КАК ПроверятьВидПеревозки,
	|	ВЫБОР
	|		КОГДА уатСценарииПланированияРазрезНаправлениеПеревозки.РазрезПланирования ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ &ОтборПоНаправлениюПеревозки
	|	КОНЕЦ КАК ПроверятьНаправлениеПеревозки,
	|	ВЫБОР
	|		КОГДА уатСценарииПланированияРазрезОбъектСтроительства.РазрезПланирования ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ &ОтборПоОбъектуСтроительства
	|	КОНЕЦ КАК ПроверятьОбъектСтроительства,
	|	ВЫБОР
	|		КОГДА уатСценарииПланированияРазрезВидТранспорта.РазрезПланирования ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		КОГДА уатСценарииПланированияРазрезВидТранспорта.ВариантАналитики = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.МодельТС)
	|			ТОГДА &ОтборПоМоделиТС
	|		КОГДА уатСценарииПланированияРазрезВидТранспорта.ВариантАналитики = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.ТипТС)
	|			ТОГДА &ОтборПоТипуТС
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПроверятьТС,
	|	СУММА(ЕСТЬNULL(уатМаршрутныйЛистВыработкаТСиСотрудников.КоличествоПлан, 0)) КАК КоличествоПоМЛ
	|ПОМЕСТИТЬ втМаршрутныйЛистСПланом
	|ИЗ
	|	втСценарийПланирования КАК втСценарийПланирования
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.уатСценарииПланирования.РазрезыПланирования КАК уатСценарииПланированияРазрезМаршрут
	|		ПО втСценарийПланирования.Сценарий = уатСценарииПланированияРазрезМаршрут.Ссылка
	|			И (уатСценарииПланированияРазрезМаршрут.РазрезПланирования = ЗНАЧЕНИЕ(Перечисление.уатРазрезыПланирования.Маршрут))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.уатСценарииПланирования.РазрезыПланирования КАК уатСценарииПланированияРазрезВидПеревозки
	|		ПО втСценарийПланирования.Сценарий = уатСценарииПланированияРазрезВидПеревозки.Ссылка
	|			И (уатСценарииПланированияРазрезВидПеревозки.РазрезПланирования = ЗНАЧЕНИЕ(Перечисление.уатРазрезыПланирования.ВидПеревозки))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.уатСценарииПланирования.РазрезыПланирования КАК уатСценарииПланированияРазрезНаправлениеПеревозки
	|		ПО втСценарийПланирования.Сценарий = уатСценарииПланированияРазрезНаправлениеПеревозки.Ссылка
	|			И (уатСценарииПланированияРазрезНаправлениеПеревозки.РазрезПланирования = ЗНАЧЕНИЕ(Перечисление.уатРазрезыПланирования.НаправлениеПеревозки))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.уатСценарииПланирования.РазрезыПланирования КАК уатСценарииПланированияРазрезОбъектСтроительства
	|		ПО втСценарийПланирования.Сценарий = уатСценарииПланированияРазрезОбъектСтроительства.Ссылка
	|			И (уатСценарииПланированияРазрезОбъектСтроительства.РазрезПланирования = ЗНАЧЕНИЕ(Перечисление.уатРазрезыПланирования.ОбъектСтроительства))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.уатСценарииПланирования.РазрезыПланирования КАК уатСценарииПланированияРазрезВидТранспорта
	|		ПО втСценарийПланирования.Сценарий = уатСценарииПланированияРазрезВидТранспорта.Ссылка
	|			И (уатСценарииПланированияРазрезВидТранспорта.РазрезПланирования = ЗНАЧЕНИЕ(Перечисление.уатРазрезыПланирования.ТС))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уатМаршрутныйЛист.ВыработкаТСиСотрудников КАК уатМаршрутныйЛистВыработкаТСиСотрудников
	|		ПО втСценарийПланирования.ПараметрВыработки = уатМаршрутныйЛистВыработкаТСиСотрудников.ПараметрВыработки
	|			И втСценарийПланирования.Ссылка = уатМаршрутныйЛистВыработкаТСиСотрудников.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	втСценарийПланирования.Организация,
	|	втСценарийПланирования.Подразделение,
	|	втСценарийПланирования.Сценарий,
	|	втСценарийПланирования.ПланированиеРаботыТС,
	|	ВЫБОР
	|		КОГДА уатСценарииПланированияРазрезМаршрут.РазрезПланирования ЕСТЬ NULL
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		КОГДА уатСценарииПланированияРазрезМаршрут.ВариантАналитики = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.Маршрут)
	|				И уатСценарииПланированияРазрезМаршрут.ПланированиеПоГруппам
	|			ТОГДА втСценарийПланирования.Маршрут.Родитель
	|		КОГДА уатСценарииПланированияРазрезМаршрут.ВариантАналитики = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.Маршрут)
	|			ТОГДА втСценарийПланирования.Маршрут
	|		КОГДА уатСценарииПланированияРазрезМаршрут.ВариантАналитики = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.ПунктОтправления)
	|				И уатСценарииПланированияРазрезМаршрут.ПланированиеПоГруппам
	|			ТОГДА втСценарийПланирования.АдресОтправления.Родитель
	|		КОГДА уатСценарииПланированияРазрезМаршрут.ВариантАналитики = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.ПунктОтправления)
	|			ТОГДА втСценарийПланирования.АдресОтправления
	|		КОГДА уатСценарииПланированияРазрезМаршрут.ВариантАналитики = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.ПунктНазначения)
	|				И уатСценарииПланированияРазрезМаршрут.ПланированиеПоГруппам
	|			ТОГДА втСценарийПланирования.АдресНазначения.Родитель
	|		КОГДА уатСценарииПланированияРазрезМаршрут.ВариантАналитики = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.ПунктНазначения)
	|			ТОГДА втСценарийПланирования.АдресНазначения
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА уатСценарииПланированияРазрезВидПеревозки.РазрезПланирования ЕСТЬ NULL
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ втСценарийПланирования.ВидПеревозки
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА уатСценарииПланированияРазрезНаправлениеПеревозки.РазрезПланирования ЕСТЬ NULL
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		КОГДА уатСценарииПланированияРазрезНаправлениеПеревозки.ПланированиеПоГруппам
	|			ТОГДА втСценарийПланирования.НаправлениеПеревозки.Родитель
	|		ИНАЧЕ втСценарийПланирования.НаправлениеПеревозки
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА уатСценарииПланированияРазрезОбъектСтроительства.РазрезПланирования ЕСТЬ NULL
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		КОГДА уатСценарииПланированияРазрезОбъектСтроительства.ПланированиеПоГруппам
	|			ТОГДА втСценарийПланирования.ОбъектСтроительства.Родитель
	|		ИНАЧЕ втСценарийПланирования.ОбъектСтроительства
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА уатСценарииПланированияРазрезВидТранспорта.РазрезПланирования ЕСТЬ NULL
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		КОГДА уатСценарииПланированияРазрезВидТранспорта.ВариантАналитики = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.МодельТС)
	|				И уатСценарииПланированияРазрезВидТранспорта.ПланированиеПоГруппам
	|			ТОГДА втСценарийПланирования.МодельТС.Родитель
	|		КОГДА уатСценарииПланированияРазрезВидТранспорта.ВариантАналитики = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.МодельТС)
	|			ТОГДА втСценарийПланирования.МодельТС
	|		КОГДА уатСценарииПланированияРазрезВидТранспорта.ВариантАналитики = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.ТипТС)
	|				И уатСценарииПланированияРазрезВидТранспорта.ПланированиеПоГруппам
	|			ТОГДА втСценарийПланирования.ТипТС.Родитель
	|		КОГДА уатСценарииПланированияРазрезВидТранспорта.ВариантАналитики = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.ТипТС)
	|			ТОГДА втСценарийПланирования.ТипТС
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	уатМаршрутныйЛистВыработкаТСиСотрудников.Ссылка,
	|	ВЫБОР
	|		КОГДА уатСценарииПланированияРазрезМаршрут.РазрезПланирования ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		КОГДА уатСценарииПланированияРазрезМаршрут.ВариантАналитики = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.Маршрут)
	|			ТОГДА &ОтборПоМаршруту
	|		КОГДА уатСценарииПланированияРазрезМаршрут.ВариантАналитики = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.ПунктОтправления)
	|			ТОГДА &ОтборПоПунктуОтправления
	|		КОГДА уатСценарииПланированияРазрезМаршрут.ВариантАналитики = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.ПунктНазначения)
	|			ТОГДА &ОтборПоПунктуНазначения
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА уатСценарииПланированияРазрезВидПеревозки.РазрезПланирования ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ &ОтборПоВидуПеревозки
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА уатСценарииПланированияРазрезНаправлениеПеревозки.РазрезПланирования ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ &ОтборПоНаправлениюПеревозки
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА уатСценарииПланированияРазрезОбъектСтроительства.РазрезПланирования ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ &ОтборПоОбъектуСтроительства
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА уатСценарииПланированияРазрезВидТранспорта.РазрезПланирования ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		КОГДА уатСценарииПланированияРазрезВидТранспорта.ВариантАналитики = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.МодельТС)
	|			ТОГДА &ОтборПоМоделиТС
	|		КОГДА уатСценарииПланированияРазрезВидТранспорта.ВариантАналитики = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.ТипТС)
	|			ТОГДА &ОтборПоТипуТС
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	втМаршрутныйЛистСПланом.Организация КАК Организация,
	|	втМаршрутныйЛистСПланом.Подразделение КАК Подразделение,
	|	уатПланированиеРаботыТССоставПлана.Контрагент КАК Перевозчик,
	|	втМаршрутныйЛистСПланом.МаршрутныйЛист КАК МаршрутныйЛист,
	|	уатПланированиеРаботыТССоставПлана.Маршрут КАК Маршрут,
	|	уатПланированиеРаботыТССоставПлана.ВидПеревозки КАК ВидПеревозки,
	|	уатПланированиеРаботыТССоставПлана.НаправлениеПеревозки КАК НаправлениеПеревозки,
	|	уатПланированиеРаботыТССоставПлана.ОбъектСтроительства КАК ОбъектСтроительства,
	|	уатПланированиеРаботыТССоставПлана.Количество КАК Количество,
	|	уатПланированиеРаботыТССоставПлана.Ссылка КАК ПланированиеРаботыТС,
	|	уатПланированиеРаботыТССоставПлана.Договор КАК Договор,
	|	втМаршрутныйЛистСПланом.ПроверятьТС КАК ПроверятьТС,
	|	втМаршрутныйЛистСПланом.ВидТС КАК ВидТС,
	|	уатПланированиеРаботыТССоставПлана.ДетализацияПланирования КАК ДетализацияПланирования,
	|	уатПланированиеРаботыТССоставПлана.НомерСтроки КАК НомерСтрокиПлана,
	|	втМаршрутныйЛистСПланом.КоличествоПоМЛ КАК КоличествоПоМЛ,
	|	ВЫБОР
	|		КОГДА уатПланированиеРаботыТССоставПлана.Контрагент = &ТекущийПеревозчик
	|				И уатПланированиеРаботыТССоставПлана.Договор = &ТекущийДоговор
	|			ТОГДА 0
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК ФлагВыбран
	|ПОМЕСТИТЬ втПланированиеСДаннымиМЛ
	|ИЗ
	|	втМаршрутныйЛистСПланом КАК втМаршрутныйЛистСПланом
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.уатПланированиеРаботыТС.СоставПлана КАК уатПланированиеРаботыТССоставПлана
	|		ПО втМаршрутныйЛистСПланом.ПланированиеРаботыТС = уатПланированиеРаботыТССоставПлана.Ссылка
	|			И (втМаршрутныйЛистСПланом.Маршрут = уатПланированиеРаботыТССоставПлана.Маршрут
	|				ИЛИ втМаршрутныйЛистСПланом.ПроверятьМаршрут = ЛОЖЬ
	|				ИЛИ уатПланированиеРаботыТССоставПлана.Маршрут = ЗНАЧЕНИЕ(Справочник.уатМаршруты.ПустаяСсылка)
	|				ИЛИ уатПланированиеРаботыТССоставПлана.Маршрут = ЗНАЧЕНИЕ(Справочник.уатПунктыНазначения.ПустаяСсылка)
	|				ИЛИ уатПланированиеРаботыТССоставПлана.Маршрут = НЕОПРЕДЕЛЕНО)
	|			И (втМаршрутныйЛистСПланом.ВидПеревозки = уатПланированиеРаботыТССоставПлана.ВидПеревозки
	|				ИЛИ втМаршрутныйЛистСПланом.ПроверятьВидПеревозки = ЛОЖЬ
	|				ИЛИ уатПланированиеРаботыТССоставПлана.ВидПеревозки = ЗНАЧЕНИЕ(Справочник.уатВидыПеревозок.ПустаяСсылка))
	|			И (втМаршрутныйЛистСПланом.НаправлениеПеревозки = уатПланированиеРаботыТССоставПлана.НаправлениеПеревозки
	|				ИЛИ втМаршрутныйЛистСПланом.ПроверятьНаправлениеПеревозки = ЛОЖЬ
	|				ИЛИ уатПланированиеРаботыТССоставПлана.НаправлениеПеревозки = ЗНАЧЕНИЕ(Справочник.уатНаправленияПеревозок.ПустаяСсылка))
	|			И (втМаршрутныйЛистСПланом.ОбъектСтроительства = уатПланированиеРаботыТССоставПлана.ОбъектСтроительства
	|				ИЛИ втМаршрутныйЛистСПланом.ПроверятьОбъектСтроительства = ЛОЖЬ
	|				ИЛИ уатПланированиеРаботыТССоставПлана.ОбъектСтроительства = ЗНАЧЕНИЕ(Справочник.уатОбъектыСтроительства.ПустаяСсылка))
	|
	|СГРУППИРОВАТЬ ПО
	|	втМаршрутныйЛистСПланом.Организация,
	|	втМаршрутныйЛистСПланом.Подразделение,
	|	втМаршрутныйЛистСПланом.ПланированиеРаботыТС,
	|	уатПланированиеРаботыТССоставПлана.Контрагент,
	|	втМаршрутныйЛистСПланом.МаршрутныйЛист,
	|	уатПланированиеРаботыТССоставПлана.Количество,
	|	уатПланированиеРаботыТССоставПлана.Ссылка,
	|	уатПланированиеРаботыТССоставПлана.Маршрут,
	|	уатПланированиеРаботыТССоставПлана.ВидПеревозки,
	|	уатПланированиеРаботыТССоставПлана.НаправлениеПеревозки,
	|	уатПланированиеРаботыТССоставПлана.ОбъектСтроительства,
	|	уатПланированиеРаботыТССоставПлана.Договор,
	|	втМаршрутныйЛистСПланом.ПроверятьТС,
	|	уатПланированиеРаботыТССоставПлана.ДетализацияПланирования,
	|	втМаршрутныйЛистСПланом.ВидТС,
	|	уатПланированиеРаботыТССоставПлана.НомерСтроки,
	|	втМаршрутныйЛистСПланом.КоличествоПоМЛ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	втПланированиеСДаннымиМЛ.Организация КАК Организация,
	|	втПланированиеСДаннымиМЛ.Подразделение КАК Подразделение,
	|	втПланированиеСДаннымиМЛ.Перевозчик КАК Перевозчик,
	|	втПланированиеСДаннымиМЛ.МаршрутныйЛист КАК МаршрутныйЛист,
	|	втПланированиеСДаннымиМЛ.Маршрут КАК Маршрут,
	|	втПланированиеСДаннымиМЛ.ВидПеревозки КАК ВидПеревозки,
	|	втПланированиеСДаннымиМЛ.НаправлениеПеревозки КАК НаправлениеПеревозки,
	|	втПланированиеСДаннымиМЛ.ОбъектСтроительства КАК ОбъектСтроительства,
	|	втПланированиеСДаннымиМЛ.Количество КАК КоличествоПоПлану,
	|	втПланированиеСДаннымиМЛ.Количество КАК КоличествоПоПлануПроцент,
	|	втПланированиеСДаннымиМЛ.ПланированиеРаботыТС КАК ПланированиеРаботыТС,
	|	втПланированиеСДаннымиМЛ.Договор КАК Договор,
	|	ЕСТЬNULL(уатТС.Ссылка, ЗНАЧЕНИЕ(Справочник.уатТС.ПустаяСсылка)) КАК ТС,
	|	ВЫБОР
	|		КОГДА &ВыбиратьТС
	|			ТОГДА уатТС.Модель
	|		ИНАЧЕ ВЫРАЗИТЬ(втПланированиеСДаннымиМЛ.ДетализацияПланирования КАК Справочник.уатМоделиТС)
	|	КОНЕЦ КАК МодельТС,
	|	ВЫБОР
	|		КОГДА &ВыбиратьТС
	|			ТОГДА уатТС.ТипТС
	|		ИНАЧЕ ВЫРАЗИТЬ(втПланированиеСДаннымиМЛ.ДетализацияПланирования КАК Справочник.уатТипыТС)
	|	КОНЕЦ КАК ТипТС,
	|	ЕСТЬNULL(втВыполнениеПлана.ПереданоВыработкиОборот, 0) КАК КоличествоПоФакту,
	|	втПланированиеСДаннымиМЛ.КоличествоПоМЛ КАК КоличествоПоМЛ,
	|	втПланированиеСДаннымиМЛ.ФлагВыбран КАК ФлагВыбран,
	|	втПланированиеСДаннымиМЛ.НомерСтрокиПлана КАК НомерСтрокиПлана
	|ИЗ
	|	втПланированиеСДаннымиМЛ КАК втПланированиеСДаннымиМЛ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.уатТС КАК уатТС
	|		ПО (уатТС.ПринадлежностьТС = ЗНАЧЕНИЕ(Перечисление.уатПринадлежностьТС.Привлеченное))
	|			И втПланированиеСДаннымиМЛ.Перевозчик = уатТС.ВладелецТС
	|			И (&ВыбиратьТС)
	|			И (уатТС.ПринадлежностьТС = ЗНАЧЕНИЕ(Перечисление.уатПринадлежностьТС.Привлеченное))
	|			И втПланированиеСДаннымиМЛ.Перевозчик = уатТС.ВладелецТС
	|			И (втПланированиеСДаннымиМЛ.ПроверятьТС = ЛОЖЬ
	|				ИЛИ (втПланированиеСДаннымиМЛ.ДетализацияПланирования = уатТС.Модель
	|					ИЛИ втПланированиеСДаннымиМЛ.ДетализацияПланирования = уатТС.ТипТС
	|					ИЛИ втПланированиеСДаннымиМЛ.ДетализацияПланирования = НЕОПРЕДЕЛЕНО))
	|		ЛЕВОЕ СОЕДИНЕНИЕ втВыполнениеПлана КАК втВыполнениеПлана
	|		ПО втПланированиеСДаннымиМЛ.ПланированиеРаботыТС = втВыполнениеПлана.ПланированиеРаботыТС
	|			И втПланированиеСДаннымиМЛ.НомерСтрокиПлана = втВыполнениеПлана.НомерСтроки
	|ГДЕ
	|	(НЕ втПланированиеСДаннымиМЛ.ПроверятьТС
	|			ИЛИ &ВыбиратьТС
	|				И НЕ уатТС.Ссылка ЕСТЬ NULL
	|			ИЛИ НЕ &ВыбиратьТС
	|				И втПланированиеСДаннымиМЛ.ВидТС = втПланированиеСДаннымиМЛ.ДетализацияПланирования)");
	Запрос.УстановитьПараметр("МаршрутныеЛисты",   ТекущиеМаршрутныеЛисты);
	Запрос.УстановитьПараметр("ТекущийПеревозчик", ТекущийПеревозчик);
	Запрос.УстановитьПараметр("ТекущийДоговор",    ТекущийДоговор);
	Запрос.УстановитьПараметр("ОтборПоВидуПеревозки",        ОтборПоВидуПеревозки);
	Запрос.УстановитьПараметр("ОтборПоМаршруту",             ОтборПоМаршруту);
	Запрос.УстановитьПараметр("ОтборПоМоделиТС",             ОтборПоМоделиТС);
	Запрос.УстановитьПараметр("ОтборПоНаправлениюПеревозки", ОтборПоНаправлениюПеревозки);
	Запрос.УстановитьПараметр("ОтборПоОбъектуСтроительства", ОтборПоОбъектуСтроительства);
	Запрос.УстановитьПараметр("ОтборПоПунктуНазначения",     ОтборПоПунктуНазначения);
	Запрос.УстановитьПараметр("ОтборПоПунктуОтправления",    ОтборПоПунктуОтправления);
	Запрос.УстановитьПараметр("ОтборПоТипуТС",               ОтборПоТипуТС);
	Запрос.УстановитьПараметр("ВыбиратьТС",                  ВыбиратьТС);
	Запрос.УстановитьПараметр("Сценарий",             ПланированиеРаботыТС.Сценарий);
	Запрос.УстановитьПараметр("ПланированиеРаботыТС", ПланированиеРаботыТС);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ЗакрытьФормуСВыбором(ВыбраннаяСтрока)
	Если ВыбиратьТС Тогда
		Результат = Новый Структура("Перевозчик, Договор, ТС", ВыбраннаяСтрока.Перевозчик, ВыбраннаяСтрока.Договор,
			ВыбраннаяСтрока.ТС);
	Иначе
		Результат = Новый Структура("Перевозчик, Договор", ВыбраннаяСтрока.Перевозчик, ВыбраннаяСтрока.Договор,);
	КонецЕсли;
	Закрыть(Результат);
КонецПроцедуры

&НаСервере
Функция НазначитьПеревозчиковНаСервере()
	
	Результат = Неопределено;
	
	ТекущиеМаршрутныеЛисты = МаршрутныеЛисты.ВыгрузитьЗначения();
	ДанныеПеревозчиков = ПолучитьДанныеПеревозчиков(ТекущиеМаршрутныеЛисты);
	
	Если Элементы.ФормаАлгоритмОптимизацииПолныйПеребор.Пометка Тогда
		ОптимальнаяТаблицаНазначенныхПеревозчиков = НазначитьПеревозчиковПолнымПеребором(ДанныеПеревозчиков,
			ПланированиеРаботыТС.Сценарий.ПланированиеОбъемовВПроцентах, ЗапрещатьПревышениеОбъемовПеревозок);
	Иначе
		ОптимальнаяТаблицаНазначенныхПеревозчиков = НазначитьПеревозчиковЖаднымАлгоритмом(ДанныеПеревозчиков,
			ПланированиеРаботыТС.Сценарий.ПланированиеОбъемовВПроцентах, ЗапрещатьПревышениеОбъемовПеревозок);
	КонецЕсли;
	
	Если ТипЗнч(ОптимальнаяТаблицаНазначенныхПеревозчиков) = Тип("ТаблицаЗначений") Тогда
		Если НазначитьПеревозчикаВОдинМЛ Тогда
			Результат = Новый Структура("Перевозчик, Договор");
			Если ОптимальнаяТаблицаНазначенныхПеревозчиков.Количество() > 0 Тогда
				ЗаполнитьЗначенияСвойств(Результат, ОптимальнаяТаблицаНазначенныхПеревозчиков[0]);
			КонецЕсли;
		Иначе
			ВсегоМаршрутныхЛистов = НазначенныеПеревозчики.Количество();
			ЗаполненоПеревозчиков = 0;
			
			Для Каждого ТекСтрока Из ОптимальнаяТаблицаНазначенныхПеревозчиков Цикл
				НайденныеСтроки = НазначенныеПеревозчики.НайтиСтроки(Новый Структура("МаршрутныйЛист", ТекСтрока.МаршрутныйЛист));
				Если НайденныеСтроки.Количество() > 0 Тогда
					НайденныеСтроки[0].Перевозчик = ТекСтрока.Перевозчик;
					НайденныеСтроки[0].Договор = ТекСтрока.Договор;
					Если ЗначениеЗаполнено(ТекСтрока.Перевозчик) Тогда
						ЗаполненоПеревозчиков = ЗаполненоПеревозчиков + 1;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
			Если ЗаполненоПеревозчиков > 1 Тогда
				ТекстНСтр = НСтр("ru = 'Оптимальные перевозчики назначены в %1 маршрутных листах из %2'; en = 'Optimal carriers are assigned in %1 route sheets out of %2'");
			Иначе
				ТекстНСтр = НСтр("ru = 'Оптимальные перевозчики назначены в %1 маршрутном листе из %2'; en = 'Optimal carriers are assigned in %1 route sheet from %2'");
			КонецЕсли;
			Если ЗаполненоПеревозчиков < ВсегоМаршрутныхЛистов Тогда
				ТекстНСтр = ТекстНСтр + НСтр("ru = '. Возможно, запрещено превышение объемов перевозок или в некоторых маршрутных листах не заполнена плановая выработка.'; en = 'Perhaps exceeding transportation volumes is prohibited, or some route sheets do not have planned output.'");
			КонецЕсли;
			ТекстНСтр = СтрШаблон(ТекстНСтр, ЗаполненоПеревозчиков, ВсегоМаршрутныхЛистов);
			ОбщегоНазначения.СообщитьПользователю(ТекстНСтр);
		КонецЕсли;
	Иначе
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Оптимальные перевозчики не назначены. Возможно, запрещено превышение объемов перевозок или в некоторых маршрутных листах не заполнена плановая выработка.'; en = 'Optimal carriers have not been assigned. Exceeding transportation volumes may be prohibited, or some route sheets may not have planned throughput.'"));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция НазначитьПеревозчиковПолнымПеребором(ДанныеПеревозчиков, ПланированиеОбъемовВПроцентах, ЗапрещатьПревышениеОбъемовПеревозок)
	
	НеНазначенныеМаршрутныеЛисты = Новый Массив;
	Для Каждого ТекСтрока ИЗ ДанныеПеревозчиков Цикл
		Если ЗначениеЗаполнено(ТекСтрока.МаршрутныйЛист)
			И НеНазначенныеМаршрутныеЛисты.Найти(ТекСтрока.МаршрутныйЛист) = Неопределено Тогда
			// Строки с пустыми МЛ - те, по которым нулевая выработка, то есть не рассчитаны итоги.
			// На них нельзя назначить перевозчика автоматически.
			НеНазначенныеМаршрутныеЛисты.Добавить(ТекСтрока.МаршрутныйЛист);
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаНазначенныхПеревозчиков = Новый ТаблицаЗначений;
	ТаблицаНазначенныхПеревозчиков.Колонки.Добавить("МаршрутныйЛист", Новый ОписаниеТипов("ДокументСсылка.уатМаршрутныйЛист"));
	ТаблицаНазначенныхПеревозчиков.Колонки.Добавить("Перевозчик", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблицаНазначенныхПеревозчиков.Колонки.Добавить("Договор", Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	
	ОптимальнаяТаблицаНазначенныхПеревозчиков = ВыполнитьРекурсию(НеНазначенныеМаршрутныеЛисты, ДанныеПеревозчиков,
		ТаблицаНазначенныхПеревозчиков, ПланированиеОбъемовВПроцентах, ЗапрещатьПревышениеОбъемовПеревозок);
	
	Возврат ОптимальнаяТаблицаНазначенныхПеревозчиков;
	
КонецФункции

&НаСервереБезКонтекста
Функция ВыполнитьРекурсию(НеНазначенныеМаршрутныеЛисты, ТаблицаМаршрутныхЛистовСПланами, ТаблицаНазначенныхПеревозчиков,
	ПланированиеОбъемовВПроцентах, ЗапрещатьПревышениеОбъемовПеревозок,
	Знач МаршрутныйЛист = Неопределено, Знач Договор = Неопределено, Знач Перевозчик = Неопределено);
	
	Если ЗначениеЗаполнено(МаршрутныйЛист) Тогда
		НоваяСтрока = ТаблицаНазначенныхПеревозчиков.Добавить();
		НоваяСтрока.МаршрутныйЛист = МаршрутныйЛист;
		НоваяСтрока.Перевозчик = Перевозчик;
		НоваяСтрока.Договор = Договор;
	КонецЕсли;
	
	Если НеНазначенныеМаршрутныеЛисты.Количество() > 0 Тогда
		МаршрутныйЛист = НеНазначенныеМаршрутныеЛисты[0];
		НовыеНеназначенныеМаршрутныеЛисты = Новый Массив;
		Для Сч = 1 По НеНазначенныеМаршрутныеЛисты.Количество()-1 Цикл
			НовыеНеназначенныеМаршрутныеЛисты.Добавить(НеНазначенныеМаршрутныеЛисты[Сч]);
		КонецЦикла;
		НайденныеСтроки = ТаблицаМаршрутныхЛистовСПланами.НайтиСтроки(Новый Структура("МаршрутныйЛист", МаршрутныйЛист));
		ОптимальноеЗначение = Неопределено;
		ОптимальнаяТаблицаНазначенныхПеревозчиков = Неопределено;
		Для Каждого ТекСтрока Из НайденныеСтроки Цикл
			Перевозчик = ТекСтрока.Перевозчик;
			Договор = ТекСтрока.Договор;
			
			НоваяТаблицаНазначенныхПеревозчиков = ТаблицаНазначенныхПеревозчиков.Скопировать();
			ВременнаяТаблицаНазначенныхПеревозчиков = ВыполнитьРекурсию(НовыеНеназначенныеМаршрутныеЛисты,
				ТаблицаМаршрутныхЛистовСПланами, НоваяТаблицаНазначенныхПеревозчиков, ЗапрещатьПревышениеОбъемовПеревозок,
				МаршрутныйЛист, Договор, Перевозчик);
			ТекущееОптимальноеЗначение = РассчитатьЗначениеОптимизируемойФункции(ВременнаяТаблицаНазначенныхПеревозчиков,
				ТаблицаМаршрутныхЛистовСПланами, ПланированиеОбъемовВПроцентах, ЗапрещатьПревышениеОбъемовПеревозок);
			Если ТекущееОптимальноеЗначение <> Неопределено
				И (ОптимальноеЗначение = Неопределено
				Или ТекущееОптимальноеЗначение < ОптимальноеЗначение) Тогда
				ОптимальнаяТаблицаНазначенныхПеревозчиков = ВременнаяТаблицаНазначенныхПеревозчиков;
				ОптимальноеЗначение = ТекущееОптимальноеЗначение;
			КонецЕсли;
		КонецЦикла;
		
		Возврат ОптимальнаяТаблицаНазначенныхПеревозчиков;
		
	Иначе
		Возврат ТаблицаНазначенныхПеревозчиков;
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция НазначитьПеревозчиковЖаднымАлгоритмом(ДанныеПеревозчиков, ПланированиеОбъемовВПроцентах, ЗапрещатьПревышениеОбъемовПеревозок)
	
	ТаблицаНазначенныхПеревозчиков = Новый ТаблицаЗначений;
	ТаблицаНазначенныхПеревозчиков.Колонки.Добавить("МаршрутныйЛист", Новый ОписаниеТипов("ДокументСсылка.уатМаршрутныйЛист"));
	ТаблицаНазначенныхПеревозчиков.Колонки.Добавить("Перевозчик", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблицаНазначенныхПеревозчиков.Колонки.Добавить("Договор", Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	ТаблицаНазначенныхПеревозчиков.Колонки.Добавить("КоличествоВыработки", Новый ОписаниеТипов("Число"));
	
	Для Каждого ТекСтрока Из ДанныеПеревозчиков Цикл
		СтруктураОтбора = Новый Структура("МаршрутныйЛист", ТекСтрока.МаршрутныйЛист);
		НайденныеСтроки = ТаблицаНазначенныхПеревозчиков.НайтиСтроки(СтруктураОтбора);
		Если НайденныеСтроки.Количество() = 0 Тогда
			НоваяСтрока = ТаблицаНазначенныхПеревозчиков.Добавить();
			НоваяСтрока.МаршрутныйЛист = ТекСтрока.МаршрутныйЛист;
			НоваяСтрока.КоличествоВыработки = ТекСтрока.КоличествоПоМЛ;
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаНазначенныхПеревозчиков.Сортировать("КоличествоВыработки Убыв");
	
	Для Каждого ТекСтрока Из ТаблицаНазначенныхПеревозчиков Цикл
		Если ТекСтрока.КоличествоВыработки = 0 Тогда
			// Выработка нулевая - скорее всего, МЛ не рассчитан.
			Продолжить;
		КонецЕсли;
		СтруктураОтбора = Новый Структура("МаршрутныйЛист", ТекСтрока.МаршрутныйЛист);
		НайденныеСтроки = ДанныеПеревозчиков.НайтиСтроки(СтруктураОтбора);
		ОптимальноеЗначение = Неопределено;
		ОптимальнаяСтрокаТаблицы = Неопределено;
		Для Каждого ТекСтрокаПеревозчика Из НайденныеСтроки Цикл
			ТекСтрока.Перевозчик = ТекСтрокаПеревозчика.Перевозчик;
			ТекСтрока.Договор = ТекСтрокаПеревозчика.Договор;
			
			ТекущееОптимальноеЗначение = РассчитатьЗначениеОптимизируемойФункции(ТаблицаНазначенныхПеревозчиков,
				ДанныеПеревозчиков, ПланированиеОбъемовВПроцентах, ЗапрещатьПревышениеОбъемовПеревозок);
			Если ТекущееОптимальноеЗначение <> Неопределено
				И (ОптимальноеЗначение = Неопределено
				Или ТекущееОптимальноеЗначение < ОптимальноеЗначение) Тогда
				ОптимальноеЗначение = ТекущееОптимальноеЗначение;
				ОптимальнаяСтрокаТаблицы = ТекСтрокаПеревозчика;
			КонецЕсли;
		КонецЦикла;
		
		Если ОптимальнаяСтрокаТаблицы <> Неопределено Тогда
			ТекСтрока.Перевозчик = ОптимальнаяСтрокаТаблицы.Перевозчик;
			ТекСтрока.Договор = ОптимальнаяСтрокаТаблицы.Договор;
		Иначе
			ТекСтрока.Перевозчик = Справочники.Контрагенты.ПустаяСсылка();
			ТекСтрока.Договор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТаблицаНазначенныхПеревозчиков;
	
КонецФункции

&НаСервереБезКонтекста
Функция РассчитатьЗначениеОптимизируемойФункции(ТаблицаНазначенныхПеревозчиков, ТаблицаМаршрутныхЛистовСПланами,
	ПланированиеОбъемовВПроцентах, ЗапрещатьПревышениеОбъемовПеревозок)
	
	Результат = уатЗащищенныеФункцииСервер_уэ.РассчитатьЗначениеОптимизируемойФункции(ТаблицаНазначенныхПеревозчиков,
		ТаблицаМаршрутныхЛистовСПланами, ПланированиеОбъемовВПроцентах, ЗапрещатьПревышениеОбъемовПеревозок);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаписатьНаСервере()
	
	ТаблицаНазначенныеПеревозчики = Новый ТаблицаЗначений;
	ТаблицаНазначенныеПеревозчики.Колонки.Добавить("МаршрутныйЛист", Новый ОписаниеТипов("ДокументСсылка.уатМаршрутныйЛист"));
	ТаблицаНазначенныеПеревозчики.Колонки.Добавить("Перевозчик", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	
	Для Каждого ТекСтрока Из НазначенныеПеревозчики Цикл
		Если ЗначениеЗаполнено(ТекСтрока.Перевозчик)
			И (ТекСтрока.МаршрутныйЛист.Контрагент <> ТекСтрока.Перевозчик
			Или ТекСтрока.МаршрутныйЛист.ДоговорКонтрагента <> ТекСтрока.Договор) Тогда
			
			ДокМЛОбъект = ТекСтрока.МаршрутныйЛист.ПолучитьОбъект();
			
			Если ДокМЛОбъект.ПринадлежностьПеревозки = Перечисления.уатПринадлежностьТС.Виртуальное Тогда
				// Сохранение информации о виртуальном ТС, чтобы ей мог воспользоваться, например, перевозчик.
				Документы.уатМаршрутныйЛист.ЗакрепитьПеревозчикаЗаМаршрутнымЛистом(ДокМЛОбъект);
			КонецЕсли;
			
			ДокМЛОбъект.Контрагент = ТекСтрока.Перевозчик;
			ДокМЛОбъект.ДоговорКонтрагента = ТекСтрока.Договор;
			
			ДокМЛОбъект.ПринадлежностьПеревозки = Перечисления.уатПринадлежностьТС.Привлеченное;
			Если ДокМЛОбъект.ТС.ВладелецТС <> ТекСтрока.Перевозчик Тогда
				ДокМЛОбъект.ТС = Справочники.уатТС.ПустаяСсылка();
			КонецЕсли;
			
			ДокМЛОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Документы.уатМаршрутныйЛист.ЗакрепитьПеревозчикаЗаМаршрутнымЛистом(ДокМЛОбъект);
			
			НоваяСтрока = ТаблицаНазначенныеПеревозчики.Добавить();
			НоваяСтрока.МаршрутныйЛист = ТекСтрока.МаршрутныйЛист;
			НоваяСтрока.Перевозчик = ТекСтрока.Перевозчик;
		КонецЕсли;
	КонецЦикла;
	
	Если ПолучитьФункциональнуюОпцию("уатИспользоватьУведомления_уэ") Тогда
		Перевозчики = ТаблицаНазначенныеПеревозчики.Скопировать(, "Перевозчик");
		Перевозчики.Свернуть("Перевозчик");
		Для Каждого ТекПеревозчик Из Перевозчики Цикл
			НайденныеСтроки = ТаблицаНазначенныеПеревозчики.НайтиСтроки(Новый Структура("Перевозчик", ТекПеревозчик.Перевозчик));
			Если НайденныеСтроки.Количество() > 0 Тогда
				МассивМаршрутныхЛистов = Новый Массив;
				Для Каждого ТекСтрока Из НайденныеСтроки Цикл
					МассивМаршрутныхЛистов.Добавить(ТекСтрока.МаршрутныйЛист);
				КонецЦикла;
				ХранилищеМаршрутныхЛистов = Новый ХранилищеЗначения(МассивМаршрутныхЛистов);
				ДополнительныеПараметрыУведомления = Новый Структура("НазначенныеМаршрутныеЛисты", ХранилищеМаршрутныхЛистов);
				уатОбщегоНазначения_уэ.СформироватьУведомление(НайденныеСтроки[0].МаршрутныйЛист,
					Перечисления.уатТипыСобытийДляУведомления_уэ.НазначениеПеревозчиковНаМаршрутныеЛисты,
					ДополнительныеПараметрыУведомления);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НазначитьПеревозчиковЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	СтруктураОтбора = Новый Структура("Перевозчик, Договор");
	ЗаполнитьЗначенияСвойств(СтруктураОтбора, ДополнительныеПараметры);
	НайденныеСтроки = ТаблицаПеревозчиков.НайтиСтроки(СтруктураОтбора);
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗакрытьФормуСВыбором(НайденныеСтроки[0]);
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		
		НайденныеСтроки = ТаблицаПеревозчиков.НайтиСтроки(СтруктураОтбора);
		Если НайденныеСтроки.Количество() > 0 Тогда
			Элементы.ТаблицаПеревозчиков.ТекущаяСтрока = НайденныеСтроки[0].ПолучитьИдентификатор();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЕдиницуИзмеренияКоличестваВыработки(МассивПараметровВыработки)
	Если МассивПараметровВыработки.Количество() <> 1 Тогда
		Возврат "";
	Иначе
		Возврат МассивПараметровВыработки[0].ЕдиницаИзмерения;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ОшибкаПриОткрытииФормыПослеЗавершения(Результат) Экспорт
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти
