#Область ПрограммныйИнтерфейс

// Поставляемые панели конфигурации к установке и обновлению на сервере 1С:Аналитика.
// 
// Параметры:
//  МассивПанелей - Массив - Массив имен общих макетов, содержащих поставляемые панели.
// 
// Возвращаемое значение:
//  Структура - Поставляемые панели конфигурации к установке и обновлению:
// 	 * КУстановке 	- Массив - Массив имен общих макетов, содержащих поставляемые панели к установке.
// 	 * КОбновлению 	- Массив - Массив имен общих макетов, содержащих поставляемые панели к обновлению.
//
Функция ПоставляемыеПанелиКонфигурацииКУстановкеИОбновлению(МассивПанелей = Неопределено)	Экспорт
	
	Возврат анлПоставляемыеПанели.ПоставляемыеПанелиКонфигурацииКУстановкеИОбновлению(МассивПанелей);
	
КонецФункции

// Установить поставляемые панели на сервере 1С:Аналитика.
//
// Параметры:
//  МассивПанелей	 - Массив	 - Массив имен общих макетов, содержащих поставляемые панели.
//  Ошибки			 - Структура - Информация об ошибках.
// 
// Возвращаемое значение:
//  Массив - Установленные на сервере 1С:Аналитике поставляемые панели.
//
Функция УстановитьПоставляемыеПанели(МассивПанелей, Ошибки)	Экспорт
	
	Возврат анлПоставляемыеПанели.УстановитьПоставляемыеПанели(МассивПанелей, Ошибки);
	
КонецФункции

// Обновить поставляемые панели на сервере 1С:Аналитика.
//
// Параметры:
//  МассивПанелей	 - Массив	 - Массив имен общих макетов, содержащих поставляемые панели.
//  Ошибки			 - Структура - Информация об ошибках.
// 
// Возвращаемое значение:
//  Массив - Обновленные на сервере 1С:Аналитике поставляемые панели.
//
Функция ОбновитьПоставляемыеПанели(МассивПанелей = Неопределено, Ошибки)	Экспорт
	
	Возврат анлПоставляемыеПанели.ОбновитьПоставляемыеПанели(МассивПанелей, Ошибки);
	
КонецФункции

// Доступность сервера системы 1С:Аналитика.
// 
// Возвращаемое значение:
//  Булево - Сервер системы 1С:Аналитика доступен.
//
Функция СерверСистемыАналитикиДоступен() Экспорт
	
	Возврат анлАналитика.СерверСистемыАналитикиДоступен();

КонецФункции

#КонецОбласти
