// Регистрация УАТ Логистика КОРП: Синхронизация данных через универсальный формат от 23.09.2025 16:31:13
#Область ПрограммныйИнтерфейс

// Возвращает представление регистрации.
// Возвращаемое значение:
//  Строка.
Функция ИнформацияОПравилах() Экспорт

	Параметры = ПараметрыРегистрации();
	ШаблонТекста = НСтр("ru = 'Правила регистрации объектов этой информационной базы (%1 версия %2) от %3'; en = 'Registration rules of objects of this infobase (%1 version %2) from %3'");
	
	Возврат СтроковыеФункции.ФорматированнаяСтрока(ШаблонТекста, 
		Параметры.СинонимКонфигурации, Параметры.ВерсияКонфигурации, Параметры.ДатаВремяСоздания);	
	
КонецФункции

// Возвращает ключевые параметры регистрации в виде структуры.
// Возвращаемое значение:
//  Структура.
Функция ПараметрыРегистрации() Экспорт
	Результат = Новый Структура();
	Результат.Вставить("Наименование", НСтр("ru = 'УАТ Логистика КОРП: Синхронизация данных через универсальный формат'; en = 'UAT Logistics CORP: Data synchronization via a universal format'"));
	Результат.Вставить("ДатаВремяСоздания", Дата(2025,9,23,16,31,0));
	Результат.Вставить("ПланаОбмена", "СинхронизацияДанныхЧерезУниверсальныйФормат");
	Результат.Вставить("Конфигурация", "ТЛЭиУправлениеАвтотранспортомКОРП");
	Результат.Вставить("СинонимКонфигурации", НСтр("ru = '1С:Транспортная логистика, экспедирование и управление автотранспортом КОРП, редакция 1.1'; en = '1C: Transport Logistics, Forwarding, and Vehicle Management CORP, Version 1.1'"));
	Результат.Вставить("ВерсияКонфигурации", "1.1.33.3");

    Возврат Результат;
КонецФункции

// Заполняет таблицу правил регистрации объектов.
//
// Параметры:
//  ПравилаРегистрацииОбъектов - ТаблицаЗначений - таблица значений, в которую добавляются правила
//  ИмяМенеджераРегистрации - Строка - Имя модуля менеджера правил регистрации объектов 
Процедура ИнициализацияПравилРегистрации(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации) Экспорт
	ДобавитьПРО_Документ_уатСчетНаОплатуПоставщика(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Документ_уатСчетНаОплатуПокупателю(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Документ_уатНачислениеЗарплаты(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Документ_уатИнвентаризацияТоваров(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Документ_уатВыдачаРасходныхМатериалов(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Документ_уатТТД(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Документ_уатСписаниеТоваров(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Документ_уатРемонтныйЛист(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Документ_уатРеализацияУслуг(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Документ_уатРасходныйКассовыйОрдер(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Документ_уатПутевойЛист(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Документ_уатПриходныйКассовыйОрдер(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Документ_уатПоступлениеТоваровУслуг(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Документ_уатПлатежноеПоручениеИсходящее(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Документ_уатПлатежноеПоручениеВходящее(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Документ_уатПеремещениеТоваров(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Документ_уатОперацииСТехническимиЖидкостями(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Документ_уатЗаправкаГСМ(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Документ_уатАвансовыйОтчет(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Документ_уатСливГСМ(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Документ_уатВозвратТоваров(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Документ_уатОприходованиеТоваров(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Документ_уатСчетФактураВыданный(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_Банки(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_Валюты(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_КлассификаторЕдиницИзмерения(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_СтраныМира(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_уатСтатьиРасходов(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_уатПараметрыВыработки(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_БанковскиеСчета(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_ДоговорыКонтрагентов(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_Контрагенты(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_Номенклатура(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_Организации(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_ПодразделенияОрганизаций(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_Пользователи(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_Склады(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_СтатьиДвиженияДенежныхСредств(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_ФизическиеЛица(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_ВидыНоменклатуры(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_НоменклатурныеГруппы(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_ЕдиницыИзмерения(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_ОсновныеСредства(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_Сотрудники(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_КонтактныеЛица(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_РегистрСведений_ДокументыФизическихЛиц(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_РегистрСведений_уатКадроваяИсторияСотрудников(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
КонецПроцедуры


// Обработчик события ПередОбработкой правила регистрации 
// Параметры:
//  ПРО - СтрокаТаблицыЗначений - Правило регистрации объекта
//  Отказ - Булево - Отказ от выполнения правила регистрации.
//  Объект - КонстантаМенеджерЗначения
//         - СправочникОбъект
//         - ДокументОбъект
//         - ПланВидовХарактеристикОбъект
//         - ПланСчетовОбъект
//         - ПланВидовРасчетаОбъект
//         - БизнесПроцессОбъект
//         - ЗадачаОбъект
//         - РегистрСведенийНаборЗаписей
//         - РегистрНакопленияНаборЗаписей
//         - РегистрБухгалтерииНаборЗаписей
//         - РегистрРасчетаНаборЗаписей - объект для которого выполняется правило регистрации.
//  ОбъектМетаданных - ОбъектМетаданных - Объект метаданных, соответствующий объекту.
//  Выгрузка - Булево - контекст выполнения правила регистрации, если Истина то происходит выгрузка объекта.
Процедура ПередОбработкой(ПРО, Отказ, Объект, ОбъектМетаданных, Выгрузка) Экспорт
	Если ПРО.Идентификатор = "Документ_уатТТД" Тогда 
		ПРО_Документ_уатТТД_ПередОбработкой(ПРО, Отказ, Объект, ОбъектМетаданных, Выгрузка);
	ИначеЕсли ПРО.Идентификатор = "Справочник_ОсновныеСредства" Тогда 
		ПРО_Справочник_ОсновныеСредства_ПередОбработкой(ПРО, Отказ, Объект, ОбъектМетаданных, Выгрузка);
	КонецЕсли;
КонецПроцедуры

// Обработчик события ПослеОбработки правила регистрации 
// Параметры:    
//  ПРО - СтрокаТаблицыЗначений - Правило регистрации объекта
//  Отказ - Булево - Отказ от выполнения правила регистрации.
//  Объект - КонстантаМенеджерЗначения
//         - СправочникОбъект
//         - ДокументОбъект
//         - ПланВидовХарактеристикОбъект
//         - ПланСчетовОбъект
//         - ПланВидовРасчетаОбъект
//         - БизнесПроцессОбъект
//         - ЗадачаОбъект
//         - РегистрСведенийНаборЗаписей
//         - РегистрНакопленияНаборЗаписей
//         - РегистрБухгалтерииНаборЗаписей
//         - РегистрРасчетаНаборЗаписей - объект для которого выполняется правило регистрации.
//  ОбъектМетаданных - ОбъектМетаданных - Объект метаданных, соответствующий объекту.
//  Получатели - Массив - список узлов-получателей, на которых будет зарегистрирован объект.
//  Выгрузка - Булево - контекст выполнения правила регистрации, если Истина то происходит выгрузка объекта.
Процедура ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка) Экспорт
	Если ПРО.Идентификатор = "Документ_уатСчетНаОплатуПоставщика" Тогда 
		ПРО_Документ_уатСчетНаОплатуПоставщика_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка);
	ИначеЕсли ПРО.Идентификатор = "Документ_уатСчетНаОплатуПокупателю" Тогда 
		ПРО_Документ_уатСчетНаОплатуПокупателю_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка);
	ИначеЕсли ПРО.Идентификатор = "Документ_уатНачислениеЗарплаты" Тогда 
		ПРО_Документ_уатНачислениеЗарплаты_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка);
	ИначеЕсли ПРО.Идентификатор = "Документ_уатИнвентаризацияТоваров" Тогда 
		ПРО_Документ_уатИнвентаризацияТоваров_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка);
	ИначеЕсли ПРО.Идентификатор = "Документ_уатВыдачаРасходныхМатериалов" Тогда 
		ПРО_Документ_уатВыдачаРасходныхМатериалов_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка);
	ИначеЕсли ПРО.Идентификатор = "Документ_уатТТД" Тогда 
		ПРО_Документ_уатТТД_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка);
	ИначеЕсли ПРО.Идентификатор = "Документ_уатСписаниеТоваров" Тогда 
		ПРО_Документ_уатСписаниеТоваров_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка);
	ИначеЕсли ПРО.Идентификатор = "Документ_уатРемонтныйЛист" Тогда 
		ПРО_Документ_уатРемонтныйЛист_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка);
	ИначеЕсли ПРО.Идентификатор = "Документ_уатРеализацияУслуг" Тогда 
		ПРО_Документ_уатРеализацияУслуг_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка);
	ИначеЕсли ПРО.Идентификатор = "Документ_уатРасходныйКассовыйОрдер" Тогда 
		ПРО_Документ_уатРасходныйКассовыйОрдер_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка);
	ИначеЕсли ПРО.Идентификатор = "Документ_уатПутевойЛист" Тогда 
		ПРО_Документ_уатПутевойЛист_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка);
	ИначеЕсли ПРО.Идентификатор = "Документ_уатПриходныйКассовыйОрдер" Тогда 
		ПРО_Документ_уатПриходныйКассовыйОрдер_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка);
	ИначеЕсли ПРО.Идентификатор = "Документ_уатПоступлениеТоваровУслуг" Тогда 
		ПРО_Документ_уатПоступлениеТоваровУслуг_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка);
	ИначеЕсли ПРО.Идентификатор = "Документ_уатПлатежноеПоручениеИсходящее" Тогда 
		ПРО_Документ_уатПлатежноеПоручениеИсходящее_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка);
	ИначеЕсли ПРО.Идентификатор = "Документ_уатПлатежноеПоручениеВходящее" Тогда 
		ПРО_Документ_уатПлатежноеПоручениеВходящее_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка);
	ИначеЕсли ПРО.Идентификатор = "Документ_уатПеремещениеТоваров" Тогда 
		ПРО_Документ_уатПеремещениеТоваров_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка);
	ИначеЕсли ПРО.Идентификатор = "Документ_уатОперацииСТехническимиЖидкостями" Тогда 
		ПРО_Документ_уатОперацииСТехническимиЖидкостями_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка);
	ИначеЕсли ПРО.Идентификатор = "Документ_уатЗаправкаГСМ" Тогда 
		ПРО_Документ_уатЗаправкаГСМ_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка);
	ИначеЕсли ПРО.Идентификатор = "Документ_уатАвансовыйОтчет" Тогда 
		ПРО_Документ_уатАвансовыйОтчет_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка);
	ИначеЕсли ПРО.Идентификатор = "Документ_уатСливГСМ" Тогда 
		ПРО_Документ_уатСливГСМ_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка);
	ИначеЕсли ПРО.Идентификатор = "Документ_уатВозвратТоваров" Тогда 
		ПРО_Документ_уатВозвратТоваров_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка);
	ИначеЕсли ПРО.Идентификатор = "Документ_уатОприходованиеТоваров" Тогда 
		ПРО_Документ_уатОприходованиеТоваров_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка);
	ИначеЕсли ПРО.Идентификатор = "Документ_уатСчетФактураВыданный" Тогда 
		ПРО_Документ_уатСчетФактураВыданный_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка);
	КонецЕсли;
КонецПроцедуры


#КонецОбласти
#Область СлужебныеПроцедурыИФункции
Процедура УстановитьОтборы(ПравилоРегистрации, ОтборПоСвойствамПланаОбмена, ОтборПоСвойствамОбъекта) 
	
	Обработка = Обработки.ЗагрузкаПравилРегистрацииОбъектов.Создать();
	
	ПравилаXML = Новый ЧтениеXML;
	
	//ОтборПоСвойствамПланаОбмена
	ПравилоРегистрации.ОтборПоСвойствамПланаОбмена = ОбменДаннымиСервер.ИнициализацияТаблицыОтборПоСвойствамПланаОбмена().Скопировать();
	
	ПравилаXML.УстановитьСтроку(ОтборПоСвойствамПланаОбмена);
	ПравилаXML.Прочитать();
	Обработка.ЗагрузитьДеревоОтбораПоСвойствамПланаОбмена(ПравилаXML, ПравилоРегистрации.ОтборПоСвойствамПланаОбмена);
	
	Обработка.Регистрация = Новый Структура("ИмяПланаОбмена", ПравилоРегистрации.ИмяПланаОбмена);
	Обработка.ПодготовитьПравилоРегистрацииПоСвойствамПланаОбмена(ПравилоРегистрации);
	
	//ОтборПоСвойствамОбъекта	
	ПравилаXML.УстановитьСтроку(ОтборПоСвойствамОбъекта);
	ПравилаXML.Прочитать();
	
	ПравилоРегистрации.ОтборПоСвойствамОбъекта = ОбменДаннымиСервер.ИнициализацияТаблицыОтборПоСвойствамОбъекта().Скопировать();
	Обработка.ЗагрузитьДеревоОтбораПоСвойствамОбъекта(ПравилаXML, ПравилоРегистрации.ОтборПоСвойствамОбъекта);

КонецПроцедуры 


#Область Документ_уатСчетНаОплатуПоставщика
Процедура ДобавитьПРО_Документ_уатСчетНаОплатуПоставщика(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Документ_уатСчетНаОплатуПоставщика";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Документ.уатСчетНаОплатуПоставщика";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиДокументов";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Истина;
		
	УстановитьОтборы(НовоеПравило, 
		ОтборПоСвойствамПланаОбмена_1(),
		ОтборПоСвойствамОбъекта_1());
КонецПроцедуры



Процедура ПРО_Документ_уатСчетНаОплатуПоставщика_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка)

	СчУзлов = Получатели.Количество();
	Пока СчУзлов > 0 Цикл
		СчУзлов = СчУзлов - 1;
		
		ТаблЗапрещенных = Получатели[СчУзлов].ЗапрещенныеКОтправке;
		
		флОтказВСчетПоставщика  = Ложь;
		флОтказВЗаказПоставщику = Ложь;
		
		Если Не ТаблЗапрещенных.Найти("СчетНаОплатуПоставщика_ВСчетПоставщика", "Имя") = Неопределено Тогда 
			флОтказВСчетПоставщика = Истина;
		КонецЕсли;
		
		Если Не ТаблЗапрещенных.Найти("СчетНаОплатуПоставщика_ВЗаказПоставщику", "Имя") = Неопределено Тогда 
			флОтказВЗаказПоставщику = Истина;
		КонецЕсли;
		
		Если флОтказВСчетПоставщика И флОтказВЗаказПоставщику Тогда 
			Получатели.Удалить(СчУзлов);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
#Область Документ_уатСчетНаОплатуПокупателю
Процедура ДобавитьПРО_Документ_уатСчетНаОплатуПокупателю(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Документ_уатСчетНаОплатуПокупателю";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Документ.уатСчетНаОплатуПокупателю";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиДокументов";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Истина;
		
	УстановитьОтборы(НовоеПравило, 
		ОтборПоСвойствамПланаОбмена_1(),
		ОтборПоСвойствамОбъекта_1());
КонецПроцедуры



Процедура ПРО_Документ_уатСчетНаОплатуПокупателю_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка)

	СчУзлов = Получатели.Количество();
	Пока СчУзлов > 0 Цикл
		СчУзлов = СчУзлов - 1;
		
		ТаблЗапрещенных = Получатели[СчУзлов].ЗапрещенныеКОтправке;
		
		флОтказВСчетПокупателю = Ложь;
		флОтказВЗаказКлиента   = Ложь;
		
		Если Не ТаблЗапрещенных.Найти("СчетНаОплатуПокупателю_ВСчетПокупателю", "Имя") = Неопределено Тогда 
			флОтказВСчетПокупателю = Истина;
		КонецЕсли;
		
		Если Не ТаблЗапрещенных.Найти("СчетНаОплатуПокупателю_ВЗаказКлиента", "Имя") = Неопределено Тогда 
			флОтказВЗаказКлиента = Истина;
		КонецЕсли;
		
		Если флОтказВСчетПокупателю И флОтказВЗаказКлиента Тогда 
			Получатели.Удалить(СчУзлов);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
#Область Документ_уатНачислениеЗарплаты
Процедура ДобавитьПРО_Документ_уатНачислениеЗарплаты(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Документ_уатНачислениеЗарплаты";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Документ.уатНачислениеЗарплаты";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиДокументов";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Истина;
		
	УстановитьОтборы(НовоеПравило, 
		ОтборПоСвойствамПланаОбмена_1(),
		ОтборПоСвойствамОбъекта_1());
КонецПроцедуры



Процедура ПРО_Документ_уатНачислениеЗарплаты_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка)

	СчУзлов = Получатели.Количество();
	Пока СчУзлов > 0 Цикл
		СчУзлов = СчУзлов - 1;
		
		ТаблЗапрещенных = Получатели[СчУзлов].ЗапрещенныеКОтправке;
		
		РегистрацияЗапрещена = Ложь;
		
		Если Не ТаблЗапрещенных.Найти("НачислениеЗарплаты", "Имя") = Неопределено Тогда 
			РегистрацияЗапрещена = Истина;
		КонецЕсли;
		
		Если РегистрацияЗапрещена Тогда 
			Получатели.Удалить(СчУзлов);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
#Область Документ_уатИнвентаризацияТоваров
Процедура ДобавитьПРО_Документ_уатИнвентаризацияТоваров(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Документ_уатИнвентаризацияТоваров";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Документ.уатИнвентаризацияТоваров";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиДокументов";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Истина;
		
	УстановитьОтборы(НовоеПравило, 
		ОтборПоСвойствамПланаОбмена_1(),
		ОтборПоСвойствамОбъекта_1());
КонецПроцедуры



Процедура ПРО_Документ_уатИнвентаризацияТоваров_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка)

	СчУзлов = Получатели.Количество();
	Пока СчУзлов > 0 Цикл
		СчУзлов = СчУзлов - 1;
		
		ТаблЗапрещенных = Получатели[СчУзлов].ЗапрещенныеКОтправке;
		
		флИнвентаризацияТоваровЗапрещено = Ложь;
		флПересчетТоваровЗапрещено = Ложь;
		РегистрацияЗапрещена = Ложь;
		
		Если Не ТаблЗапрещенных.Найти("ИнвентаризацияТоваров", "Имя") = Неопределено Тогда 
			флИнвентаризацияТоваровЗапрещено = Истина;
		КонецЕсли;
		
		Если Не ТаблЗапрещенных.Найти("ИнвентаризацияТоваровВПересчетТоваров", "Имя") = Неопределено Тогда 
			флПересчетТоваровЗапрещено = Истина;
		КонецЕсли;
		
		Если флИнвентаризацияТоваровЗапрещено И флПересчетТоваровЗапрещено Тогда
			РегистрацияЗапрещена = Истина;
		КонецЕсли;
		
		Если РегистрацияЗапрещена Тогда 
			Получатели.Удалить(СчУзлов);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
#Область Документ_уатВыдачаРасходныхМатериалов
Процедура ДобавитьПРО_Документ_уатВыдачаРасходныхМатериалов(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Документ_уатВыдачаРасходныхМатериалов";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Документ.уатВыдачаРасходныхМатериалов";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиДокументов";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Истина;
		
	УстановитьОтборы(НовоеПравило, 
		ОтборПоСвойствамПланаОбмена_1(),
		ОтборПоСвойствамОбъекта_2());
КонецПроцедуры



Процедура ПРО_Документ_уатВыдачаРасходныхМатериалов_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка)

	СчУзлов = Получатели.Количество();
	Пока СчУзлов > 0 Цикл
		СчУзлов = СчУзлов - 1;
		
		ТаблЗапрещенных = Получатели[СчУзлов].ЗапрещенныеКОтправке;
		
		флОтказПередМатВПроизводство = Ложь;
		флОтказПередМатВЭксплуатацию = Ложь;
		
		Если Не ТаблЗапрещенных.Найти("ВыдачаРасходныхМатериалов_ПередМатВПроизводство", "Имя") = Неопределено Тогда 
			флОтказПередМатВПроизводство = Истина;
		КонецЕсли;
		
		Если Не ТаблЗапрещенных.Найти("ВыдачаРасходныхМатериалов_ПередМатВЭксплуатацию", "Имя") = Неопределено Тогда 
			флОтказПередМатВЭксплуатацию = Истина;
		КонецЕсли;
		
		Если флОтказПередМатВПроизводство И флОтказПередМатВЭксплуатацию Тогда 
			Получатели.Удалить(СчУзлов);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
#Область Документ_уатТТД
Процедура ДобавитьПРО_Документ_уатТТД(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Документ_уатТТД";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Документ.уатТТД";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиДокументов";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Истина;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Истина;
		
	УстановитьОтборы(НовоеПравило, 
		ОтборПоСвойствамПланаОбмена_1(),
		Документ_уатТТД_ОтборПоСвойствамОбъекта());
КонецПроцедуры


Функция Документ_уатТТД_ОтборПоСвойствамОбъекта()
	Возврат "<ОтборПоСвойствамОбъекта>
			|	<ЭлементОтбора>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>Проведен</СвойствоОбъекта>
			|		<Вид>ЗначениеКонстанты</Вид>
			|		<ЗначениеКонстанты>true</ЗначениеКонстанты>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Проведен</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|	</ЭлементОтбора>
			|	<ЭлементОтбора>
			|		<ТипСвойстваОбъекта>ПеречислениеСсылка.уатВидыОперацийТТД</ТипСвойстваОбъекта>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>ВидОперации</СвойствоОбъекта>
			|		<Вид>АлгоритмЗначения</Вид>
			|		<ЗначениеКонстанты>Значение = Перечисления.уатВидыОперацийТТД.ПоПутевомуЛисту;</ЗначениеКонстанты>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>ВидОперации</Наименование>
			|				<Тип>ПеречислениеСсылка.уатВидыОперацийТТД</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|	</ЭлементОтбора>
			|</ОтборПоСвойствамОбъекта>";
КонецФункции

Процедура ПРО_Документ_уатТТД_ПередОбработкой(ПРО, Отказ, Объект, ОбъектМетаданных, Выгрузка)

	Если Объект.Стоимость.Количество() = 0 Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры
Процедура ПРО_Документ_уатТТД_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка)

	СчУзлов = Получатели.Количество();
	Пока СчУзлов > 0 Цикл
		СчУзлов = СчУзлов - 1;
		
		ТаблЗапрещенных = Получатели[СчУзлов].ЗапрещенныеКОтправке;
		
		РегистрацияЗапрещена = Ложь;
		
		Если Не ТаблЗапрещенных.Найти("ТТД", "Имя") = Неопределено Тогда 
			РегистрацияЗапрещена = Истина;
		КонецЕсли;
		
		Если РегистрацияЗапрещена Тогда 
			Получатели.Удалить(СчУзлов);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
#Область Документ_уатСписаниеТоваров
Процедура ДобавитьПРО_Документ_уатСписаниеТоваров(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Документ_уатСписаниеТоваров";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Документ.уатСписаниеТоваров";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиДокументов";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Истина;
		
	УстановитьОтборы(НовоеПравило, 
		ОтборПоСвойствамПланаОбмена_1(),
		ОтборПоСвойствамОбъекта_2());
КонецПроцедуры



Процедура ПРО_Документ_уатСписаниеТоваров_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка)

	СчУзлов = Получатели.Количество();
	Пока СчУзлов > 0 Цикл
		СчУзлов = СчУзлов - 1;
		
		ТаблЗапрещенных = Получатели[СчУзлов].ЗапрещенныеКОтправке;
		
		РегистрацияЗапрещена = Ложь;
		
		Если Не ТаблЗапрещенных.Найти("СписаниеТоваров", "Имя") = Неопределено Тогда 
			РегистрацияЗапрещена = Истина;
		КонецЕсли;
		
		Если РегистрацияЗапрещена Тогда 
			Получатели.Удалить(СчУзлов);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
#Область Документ_уатРемонтныйЛист
Процедура ДобавитьПРО_Документ_уатРемонтныйЛист(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Документ_уатРемонтныйЛист";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Документ.уатРемонтныйЛист";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиДокументов";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Истина;
		
	УстановитьОтборы(НовоеПравило, 
		ОтборПоСвойствамПланаОбмена_1(),
		ОтборПоСвойствамОбъекта_4());
КонецПроцедуры



Процедура ПРО_Документ_уатРемонтныйЛист_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка)

	ЕстьПоступленияМатериаловИУслуг = Объект.ПоступленияМатериаловИУслуг.Количество() > 0;
	
	СчУзлов = Получатели.Количество();
	Пока СчУзлов > 0 Цикл
		СчУзлов = СчУзлов - 1;
		
		ТаблЗапрещенных = Получатели[СчУзлов].ЗапрещенныеКОтправке;
		
		флОтказВыработкаСотрудников             = Ложь;
		флОтказРемЗона_СписаниеЗапасов          = Ложь;
		флОтказРемЗона_ПередМатВПроизводство    = Ложь;
		флОтказРемЗона_ПередМатВЭксплуатацию    = Ложь;
		флОтказАвтосервис_СписаниеЗапасов       = Ложь;
		флОтказАвтосервис_ПередМатВПроизводство = Ложь;
		флОтказАвтосервис_ПередМатВЭксплуатацию = Ложь;
		флОтказАвтосервис_ПоступлениеМатериалов = Ложь;
		
		Если Не ТаблЗапрещенных.Найти("РемонтныйЛист_ВыработкаСотрудников", "Имя") = Неопределено Тогда 
			флОтказВыработкаСотрудников = Истина;
		КонецЕсли;
		
		Если Не ТаблЗапрещенных.Найти("РемонтныйЛист_РемЗона_СписаниеЗапасов", "Имя") = Неопределено Тогда 
			флОтказРемЗона_СписаниеЗапасов = Истина;
		КонецЕсли;
		
		Если Не ТаблЗапрещенных.Найти("РемонтныйЛист_РемЗона_ПередМатВПроизводство", "Имя") = Неопределено Тогда 
			флОтказРемЗона_ПередМатВПроизводство = Истина;
		КонецЕсли;
		
		Если Не ТаблЗапрещенных.Найти("РемонтныйЛист_РемЗона_ПередМатВЭксплуатацию", "Имя") = Неопределено Тогда 
			флОтказРемЗона_ПередМатВЭксплуатацию = Истина;
		КонецЕсли;
		
		Если Не ТаблЗапрещенных.Найти("РемонтныйЛист_Автосервис_СписаниеЗапасов", "Имя") = Неопределено Тогда 
			флОтказАвтосервис_СписаниеЗапасов = Истина;
		КонецЕсли;
		
		Если Не ТаблЗапрещенных.Найти("РемонтныйЛист_Автосервис_ПередМатВПроизводство", "Имя") = Неопределено Тогда 
			флОтказАвтосервис_ПередМатВПроизводство = Истина;
		КонецЕсли;
		
		Если Не ТаблЗапрещенных.Найти("РемонтныйЛист_Автосервис_ПередМатВЭксплуатацию", "Имя") = Неопределено Тогда 
			флОтказАвтосервис_ПередМатВЭксплуатацию = Истина;
		КонецЕсли;
		
		Если Не ТаблЗапрещенных.Найти("РемонтныйЛист_Автосервис_ПоступлениеМатериалов", "Имя") = Неопределено
			Или ЕстьПоступленияМатериаловИУслуг Тогда 
			флОтказАвтосервис_ПоступлениеМатериалов = Истина;
		КонецЕсли;
		
		Если флОтказВыработкаСотрудников
			И флОтказРемЗона_СписаниеЗапасов И флОтказРемЗона_ПередМатВПроизводство И флОтказРемЗона_ПередМатВЭксплуатацию
			И флОтказАвтосервис_СписаниеЗапасов И флОтказАвтосервис_ПередМатВПроизводство И флОтказАвтосервис_ПередМатВЭксплуатацию И флОтказАвтосервис_ПоступлениеМатериалов Тогда 
			Получатели.Удалить(СчУзлов);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
#Область Документ_уатРеализацияУслуг
Процедура ДобавитьПРО_Документ_уатРеализацияУслуг(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Документ_уатРеализацияУслуг";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Документ.уатРеализацияУслуг";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиДокументов";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Истина;
		
	УстановитьОтборы(НовоеПравило, 
		ОтборПоСвойствамПланаОбмена_1(),
		ОтборПоСвойствамОбъекта_2());
КонецПроцедуры



Процедура ПРО_Документ_уатРеализацияУслуг_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка)

	СчУзлов = Получатели.Количество();
	Пока СчУзлов > 0 Цикл
		СчУзлов = СчУзлов - 1;
		
		ТаблЗапрещенных = Получатели[СчУзлов].ЗапрещенныеКОтправке;
		
		РегистрацияЗапрещена = Ложь;
		
		Если Не ТаблЗапрещенных.Найти("РеализацияУслуг", "Имя") = Неопределено Тогда 
			РегистрацияЗапрещена = Истина;
		КонецЕсли;
		
		Если РегистрацияЗапрещена Тогда 
			Получатели.Удалить(СчУзлов);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
#Область Документ_уатРасходныйКассовыйОрдер
Процедура ДобавитьПРО_Документ_уатРасходныйКассовыйОрдер(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Документ_уатРасходныйКассовыйОрдер";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Документ.уатРасходныйКассовыйОрдер";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиДокументов";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Истина;
		
	УстановитьОтборы(НовоеПравило, 
		ОтборПоСвойствамПланаОбмена_1(),
		ОтборПоСвойствамОбъекта_2());
КонецПроцедуры



Процедура ПРО_Документ_уатРасходныйКассовыйОрдер_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка)

	СчУзлов = Получатели.Количество();
	Пока СчУзлов > 0 Цикл
		СчУзлов = СчУзлов - 1;
		
		ТаблЗапрещенных = Получатели[СчУзлов].ЗапрещенныеКОтправке;
		
		РегистрацияЗапрещена = Ложь;
		
		ВидОперации = Объект.ВидОперации;
		
		Если ВидОперации = Перечисления.уатВидыОперацийРКО.ОплатаПоставщику Тогда 
			Если Не ТаблЗапрещенных.Найти("РасходныйКассовыйОрдер_ОплатаПоставщику", "Имя") = Неопределено Тогда 
				РегистрацияЗапрещена = Истина;
			КонецЕсли;
			
		ИначеЕсли ВидОперации = Перечисления.уатВидыОперацийРКО.РасходДенежныхСредствПрочее Тогда 
			Если Не ТаблЗапрещенных.Найти("РасходныйКассовыйОрдер_РасходДенежныхСредствПрочее", "Имя") = Неопределено Тогда 
				РегистрацияЗапрещена = Истина;
			КонецЕсли;
			
		ИначеЕсли ВидОперации = Перечисления.уатВидыОперацийРКО.ПрочиеРасчетыСКонтрагентами Тогда 
			Если Не ТаблЗапрещенных.Найти("РасходныйКассовыйОрдер_ПрочиеРасчетыСКонтрагентами", "Имя") = Неопределено Тогда 
				РегистрацияЗапрещена = Истина;
			КонецЕсли;
			
		ИначеЕсли ВидОперации = Перечисления.уатВидыОперацийРКО.ВыдачаПодотчетнику Тогда 
			Если Не ТаблЗапрещенных.Найти("РасходныйКассовыйОрдер_ВыдачаПодотчетнику", "Имя") = Неопределено Тогда 
				РегистрацияЗапрещена = Истина;
			КонецЕсли;
			
		ИначеЕсли ВидОперации = Перечисления.уатВидыОперацийРКО.ВозвратПокупателю Тогда 
			Если Не ТаблЗапрещенных.Найти("РасходныйКассовыйОрдер_ВозвратПокупателю", "Имя") = Неопределено Тогда 
				РегистрацияЗапрещена = Истина;
			КонецЕсли;
					
		Иначе 
			РегистрацияЗапрещена = Истина;
			
		КонецЕсли;
		
		Если РегистрацияЗапрещена Тогда 
			Получатели.Удалить(СчУзлов);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
#Область Документ_уатПутевойЛист
Процедура ДобавитьПРО_Документ_уатПутевойЛист(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Документ_уатПутевойЛист";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Документ.уатПутевойЛист";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиДокументов";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Истина;
		
	УстановитьОтборы(НовоеПравило, 
		ОтборПоСвойствамПланаОбмена_2(),
		Документ_уатПутевойЛист_ОтборПоСвойствамОбъекта());
КонецПроцедуры


Функция Документ_уатПутевойЛист_ОтборПоСвойствамОбъекта()
	Возврат "<ОтборПоСвойствамОбъекта>
			|	<ЭлементОтбора>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>Проведен</СвойствоОбъекта>
			|		<Вид>ЗначениеКонстанты</Вид>
			|		<ЗначениеКонстанты>true</ЗначениеКонстанты>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Проведен</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|	</ЭлементОтбора>
			|	<ЭлементОтбора>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>Рассчитан</СвойствоОбъекта>
			|		<Вид>ЗначениеКонстанты</Вид>
			|		<ЗначениеКонстанты>true</ЗначениеКонстанты>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Рассчитан</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|	</ЭлементОтбора>
			|</ОтборПоСвойствамОбъекта>";
КонецФункции

Процедура ПРО_Документ_уатПутевойЛист_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка)

	СчУзлов = Получатели.Количество();
	Пока СчУзлов > 0 Цикл
		СчУзлов = СчУзлов - 1;
		
		ТаблЗапрещенных = Получатели[СчУзлов].ЗапрещенныеКОтправке;
		
		флОтказВыработкаСотрудников            = Ложь;
		флОтказРасходГСМ_Списание              = Ложь;
		флОтказРасходГСМ_ПередМатВПроизводство = Ложь;
		флОтказРасходГСМ_ПередМатВЭксплуатацию = Ложь;
		
		Если Не ТаблЗапрещенных.Найти("ПутевойЛист_ВыработкаСотрудников", "Имя") = Неопределено Тогда 
			флОтказВыработкаСотрудников = Истина;
		КонецЕсли;
		
		Если Не ТаблЗапрещенных.Найти("ПутевойЛист_РасходГСМ_Списание", "Имя") = Неопределено Тогда 
			флОтказРасходГСМ_Списание = Истина;
		КонецЕсли;
		
		Если Не ТаблЗапрещенных.Найти("ПутевойЛист_РасходГСМ_ПередМатВПроизводство", "Имя") = Неопределено Тогда 
			флОтказРасходГСМ_ПередМатВПроизводство = Истина;
		КонецЕсли;
		
		Если Не ТаблЗапрещенных.Найти("ПутевойЛист_РасходГСМ_ПередМатВЭксплуатацию", "Имя") = Неопределено Тогда 
			флОтказРасходГСМ_ПередМатВЭксплуатацию = Истина;
		КонецЕсли;
		
		Если флОтказВыработкаСотрудников И флОтказРасходГСМ_Списание И флОтказРасходГСМ_ПередМатВПроизводство И флОтказРасходГСМ_ПередМатВЭксплуатацию Тогда 
			Получатели.Удалить(СчУзлов);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
#Область Документ_уатПриходныйКассовыйОрдер
Процедура ДобавитьПРО_Документ_уатПриходныйКассовыйОрдер(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Документ_уатПриходныйКассовыйОрдер";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Документ.уатПриходныйКассовыйОрдер";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиДокументов";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Истина;
		
	УстановитьОтборы(НовоеПравило, 
		ОтборПоСвойствамПланаОбмена_1(),
		ОтборПоСвойствамОбъекта_2());
КонецПроцедуры



Процедура ПРО_Документ_уатПриходныйКассовыйОрдер_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка)

	СчУзлов = Получатели.Количество();
	Пока СчУзлов > 0 Цикл
		СчУзлов = СчУзлов - 1;
		
		ТаблЗапрещенных = Получатели[СчУзлов].ЗапрещенныеКОтправке;
		
		РегистрацияЗапрещена = Ложь;
		
		ВидОперации = Объект.ВидОперации;
		
		Если ВидОперации = Перечисления.уатВидыОперацийПКО.ОплатаПокупателя
			Или ВидОперации = Перечисления.уатВидыОперацийПКО.ВозвратОтПоставщика Тогда 
			Если Не ТаблЗапрещенных.Найти("ПриходныйКассовыйОрдер_ОплатаПокупателя", "Имя") = Неопределено Тогда 
				РегистрацияЗапрещена = Истина;
			КонецЕсли;
			
		ИначеЕсли ВидОперации = Перечисления.уатВидыОперацийПКО.ПриходДенежныхСредствПрочее Тогда 
			Если Не ТаблЗапрещенных.Найти("ПриходныйКассовыйОрдер_ПриходДенежныхСредствПрочее", "Имя") = Неопределено Тогда 
				РегистрацияЗапрещена = Истина;
			КонецЕсли;
			
		ИначеЕсли ВидОперации = Перечисления.уатВидыОперацийПКО.ПрочиеРасчетыСКонтрагентами Тогда 
			Если Не ТаблЗапрещенных.Найти("ПриходныйКассовыйОрдер_ПрочиеРасчетыСКонтрагентами", "Имя") = Неопределено Тогда 
				РегистрацияЗапрещена = Истина;
			КонецЕсли;
			
		ИначеЕсли ВидОперации = Перечисления.уатВидыОперацийПКО.ВозвратОтПодотчетника Тогда 
			Если Не ТаблЗапрещенных.Найти("ПриходныйКассовыйОрдер_ВозвратОтПодотчетника", "Имя") = Неопределено Тогда 
				РегистрацияЗапрещена = Истина;
			КонецЕсли;
		
		Иначе 
			РегистрацияЗапрещена = Истина;
			
		КонецЕсли;
		
		Если РегистрацияЗапрещена Тогда 
			Получатели.Удалить(СчУзлов);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
#Область Документ_уатПоступлениеТоваровУслуг
Процедура ДобавитьПРО_Документ_уатПоступлениеТоваровУслуг(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Документ_уатПоступлениеТоваровУслуг";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Документ.уатПоступлениеТоваровУслуг";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиДокументов";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Истина;
		
	УстановитьОтборы(НовоеПравило, 
		ОтборПоСвойствамПланаОбмена_1(),
		ОтборПоСвойствамОбъекта_4());
КонецПроцедуры



Процедура ПРО_Документ_уатПоступлениеТоваровУслуг_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка)

	СчУзлов = Получатели.Количество();
	Пока СчУзлов > 0 Цикл
		СчУзлов = СчУзлов - 1;
		
		ТаблЗапрещенных = Получатели[СчУзлов].ЗапрещенныеКОтправке;
		
		РегистрацияЗапрещена = Ложь;
		
		Если Не ТаблЗапрещенных.Найти("ПоступлениеТоваровУслуг", "Имя") = Неопределено Тогда 
			РегистрацияЗапрещена = Истина;
		КонецЕсли;
		
		Если РегистрацияЗапрещена Тогда 
			Получатели.Удалить(СчУзлов);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
#Область Документ_уатПлатежноеПоручениеИсходящее
Процедура ДобавитьПРО_Документ_уатПлатежноеПоручениеИсходящее(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Документ_уатПлатежноеПоручениеИсходящее";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Документ.уатПлатежноеПоручениеИсходящее";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиДокументов";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Истина;
		
	УстановитьОтборы(НовоеПравило, 
		ОтборПоСвойствамПланаОбмена_1(),
		ОтборПоСвойствамОбъекта_2());
КонецПроцедуры



Процедура ПРО_Документ_уатПлатежноеПоручениеИсходящее_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка)

	СчУзлов = Получатели.Количество();
	Пока СчУзлов > 0 Цикл
		СчУзлов = СчУзлов - 1;
		
		ТаблЗапрещенных = Получатели[СчУзлов].ЗапрещенныеКОтправке;
		
		РегистрацияЗапрещена = Ложь;
		
		ВидОперации = Объект.ВидОперации;
		
		Если ВидОперации = Перечисления.уатВидыОперацийПлатежноеПоручениеИсходящее.ОплатаПоставщику Тогда 
			Если Не ТаблЗапрещенных.Найти("ПлатежноеПоручениеИсходящее_ОплатаПоставщику", "Имя") = Неопределено
				И Не ТаблЗапрещенных.Найти("ПлатежноеПоручениеИсходящее_ОплатаПоставщику_ВПлатежноеПоручение", "Имя") = Неопределено Тогда 
				РегистрацияЗапрещена = Истина;
			КонецЕсли;
			
		ИначеЕсли ВидОперации = Перечисления.уатВидыОперацийПлатежноеПоручениеИсходящее.РасходДенежныхСредствПрочее Тогда 
			Если Не ТаблЗапрещенных.Найти("ПлатежноеПоручениеИсходящее_РасходДенежныхСредствПрочее", "Имя") = Неопределено Тогда 
				РегистрацияЗапрещена = Истина;
			КонецЕсли;
			
		ИначеЕсли ВидОперации = Перечисления.уатВидыОперацийПлатежноеПоручениеИсходящее.ПрочиеРасчетыСКонтрагентами Тогда 
			Если Не ТаблЗапрещенных.Найти("ПлатежноеПоручениеИсходящее_ПрочиеРасчетыСКонтрагентами", "Имя") = Неопределено
				И Не ТаблЗапрещенных.Найти("ПлатежноеПоручениеИсходящее_ПрочиеРасчетыСКонтрагентами_ВПлатежноеПоручение", "Имя") = Неопределено Тогда 
				РегистрацияЗапрещена = Истина;
			КонецЕсли;
			
		ИначеЕсли ВидОперации = Перечисления.уатВидыОперацийПлатежноеПоручениеИсходящее.ВыдачаПодотчетнику Тогда 
			Если Не ТаблЗапрещенных.Найти("ПлатежноеПоручениеИсходящее_ВыдачаПодотчетнику", "Имя") = Неопределено Тогда 
				РегистрацияЗапрещена = Истина;
			КонецЕсли;
			
		ИначеЕсли ВидОперации = Перечисления.уатВидыОперацийПлатежноеПоручениеИсходящее.ВозвратПокупателю Тогда 
			Если Не ТаблЗапрещенных.Найти("ПлатежноеПоручениеИсходящее_ВозвратПокупателю", "Имя") = Неопределено Тогда 
				РегистрацияЗапрещена = Истина;
			КонецЕсли;
			
		ИначеЕсли ВидОперации = Перечисления.уатВидыОперацийПлатежноеПоручениеИсходящее.ПереводНаДругойСчет Тогда 
			Если Не ТаблЗапрещенных.Найти("ПлатежноеПоручениеИсходящее_ПереводНаДругойСчет", "Имя") = Неопределено Тогда 
				РегистрацияЗапрещена = Истина;
			КонецЕсли;
			
		Иначе 
			РегистрацияЗапрещена = Истина;
			
		КонецЕсли;
		
		Если РегистрацияЗапрещена Тогда 
			Получатели.Удалить(СчУзлов);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
#Область Документ_уатПлатежноеПоручениеВходящее
Процедура ДобавитьПРО_Документ_уатПлатежноеПоручениеВходящее(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Документ_уатПлатежноеПоручениеВходящее";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Документ.уатПлатежноеПоручениеВходящее";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиДокументов";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Истина;
		
	УстановитьОтборы(НовоеПравило, 
		ОтборПоСвойствамПланаОбмена_1(),
		ОтборПоСвойствамОбъекта_2());
КонецПроцедуры



Процедура ПРО_Документ_уатПлатежноеПоручениеВходящее_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка)

	СчУзлов = Получатели.Количество();
	Пока СчУзлов > 0 Цикл
		СчУзлов = СчУзлов - 1;
		
		ТаблЗапрещенных = Получатели[СчУзлов].ЗапрещенныеКОтправке;
		
		РегистрацияЗапрещена = Ложь;
		
		ВидОперации = Объект.ВидОперации;
		
		Если ВидОперации = Перечисления.уатВидыОперацийПлатежноеПоручениеВходящее.ОплатаПокупателя
			Или ВидОперации = Перечисления.уатВидыОперацийПлатежноеПоручениеВходящее.ВозвратОтПоставщика Тогда 
			Если Не ТаблЗапрещенных.Найти("ПлатежноеПоручениеВходящее_ОплатаПокупателя", "Имя") = Неопределено Тогда 
				РегистрацияЗапрещена = Истина;
			КонецЕсли;
			
		ИначеЕсли ВидОперации = Перечисления.уатВидыОперацийПлатежноеПоручениеВходящее.ПриходДенежныхСредствПрочее Тогда 
			Если Не ТаблЗапрещенных.Найти("ПлатежноеПоручениеВходящее_ПриходДенежныхСредствПрочее", "Имя") = Неопределено Тогда 
				РегистрацияЗапрещена = Истина;
			КонецЕсли;
			
		ИначеЕсли ВидОперации = Перечисления.уатВидыОперацийПлатежноеПоручениеВходящее.ПрочиеРасчетыСКонтрагентами Тогда 
			Если Не ТаблЗапрещенных.Найти("ПлатежноеПоручениеВходящее_ПрочиеРасчетыСКонтрагентами", "Имя") = Неопределено Тогда 
				РегистрацияЗапрещена = Истина;
			КонецЕсли;
			
		ИначеЕсли ВидОперации = Перечисления.уатВидыОперацийПлатежноеПоручениеВходящее.ВозвратОтПодотчетника Тогда 
			Если Не ТаблЗапрещенных.Найти("ПлатежноеПоручениеВходящее_ВозвратОтПодотчетника", "Имя") = Неопределено Тогда 
				РегистрацияЗапрещена = Истина;
			КонецЕсли;
			
		Иначе 
			РегистрацияЗапрещена = Истина;
			
		КонецЕсли;
		
		Если РегистрацияЗапрещена Тогда 
			Получатели.Удалить(СчУзлов);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
#Область Документ_уатПеремещениеТоваров
Процедура ДобавитьПРО_Документ_уатПеремещениеТоваров(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Документ_уатПеремещениеТоваров";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Документ.уатПеремещениеТоваров";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиДокументов";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Истина;
		
	УстановитьОтборы(НовоеПравило, 
		ОтборПоСвойствамПланаОбмена_1(),
		ОтборПоСвойствамОбъекта_2());
КонецПроцедуры



Процедура ПРО_Документ_уатПеремещениеТоваров_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка)

	СчУзлов = Получатели.Количество();
	Пока СчУзлов > 0 Цикл
		СчУзлов = СчУзлов - 1;
		
		ТаблЗапрещенных = Получатели[СчУзлов].ЗапрещенныеКОтправке;
		
		РегистрацияЗапрещена = Ложь;
		
		Если Не ТаблЗапрещенных.Найти("ПеремещениеТоваров", "Имя") = Неопределено Тогда 
			РегистрацияЗапрещена = Истина;
		КонецЕсли;
		
		Если РегистрацияЗапрещена Тогда 
			Получатели.Удалить(СчУзлов);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
#Область Документ_уатОперацииСТехническимиЖидкостями
Процедура ДобавитьПРО_Документ_уатОперацииСТехническимиЖидкостями(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Документ_уатОперацииСТехническимиЖидкостями";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Документ.уатОперацииСТехническимиЖидкостями";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиДокументов";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Истина;
		
	УстановитьОтборы(НовоеПравило, 
		ОтборПоСвойствамПланаОбмена_1(),
		Документ_уатОперацииСТехническимиЖидкостями_ОтборПоСвойствамОбъекта());
КонецПроцедуры


Функция Документ_уатОперацииСТехническимиЖидкостями_ОтборПоСвойствамОбъекта()
	Возврат "<ОтборПоСвойствамОбъекта>
			|	<ЭлементОтбора>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>Проведен</СвойствоОбъекта>
			|		<Вид>ЗначениеКонстанты</Вид>
			|		<ЗначениеКонстанты>true</ЗначениеКонстанты>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Проведен</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|	</ЭлементОтбора>
			|	<ЭлементОтбора>
			|		<ТипСвойстваОбъекта>ПеречислениеСсылка.уатВидыОперацийСТехническимиЖидкостями</ТипСвойстваОбъекта>
			|		<ВидСравнения>НеРавно</ВидСравнения>
			|		<СвойствоОбъекта>ВидОперации</СвойствоОбъекта>
			|		<Вид>АлгоритмЗначения</Вид>
			|		<ЗначениеКонстанты>Значение = Перечисления.уатВидыОперацийСТехническимиЖидкостями.Слив;</ЗначениеКонстанты>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>ВидОперации</Наименование>
			|				<Тип>ПеречислениеСсылка.уатВидыОперацийСТехническимиЖидкостями</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|	</ЭлементОтбора>
			|</ОтборПоСвойствамОбъекта>";
КонецФункции

Процедура ПРО_Документ_уатОперацииСТехническимиЖидкостями_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка)

	СчУзлов = Получатели.Количество();
	Пока СчУзлов > 0 Цикл
		СчУзлов = СчУзлов - 1;
		
		ТаблЗапрещенных = Получатели[СчУзлов].ЗапрещенныеКОтправке;
		
		флОтказПередМатВПроизводство = Ложь;
		флОтказПередМатВЭксплуатацию = Ложь;
		флОтказПеремещениеТоваров = Ложь;
		
		Если ТаблЗапрещенных.Найти("ОперацииСТехническимиЖидкостями_ПередМатВПроизводство", "Имя") <> Неопределено Тогда 
			флОтказПередМатВПроизводство = Истина;
		КонецЕсли;
		
		Если ТаблЗапрещенных.Найти("ОперацииСТехническимиЖидкостями_ПередМатВЭксплуатацию", "Имя") <> Неопределено Тогда 
			флОтказПередМатВЭксплуатацию = Истина;
		КонецЕсли;
		
		Если ТаблЗапрещенных.Найти("ОперацииСТехническимиЖидкостями_ПеремещениеТоваров", "Имя") <> Неопределено Тогда 
			флОтказПеремещениеТоваров = Истина;
		КонецЕсли;
		
		Если флОтказПередМатВПроизводство И флОтказПередМатВЭксплуатацию И флОтказПеремещениеТоваров Тогда 
			Получатели.Удалить(СчУзлов);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
#Область Документ_уатЗаправкаГСМ
Процедура ДобавитьПРО_Документ_уатЗаправкаГСМ(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Документ_уатЗаправкаГСМ";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Документ.уатЗаправкаГСМ";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиДокументов";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Истина;
		
	УстановитьОтборы(НовоеПравило, 
		ОтборПоСвойствамПланаОбмена_2(),
		ОтборПоСвойствамОбъекта_2());
КонецПроцедуры



Процедура ПРО_Документ_уатЗаправкаГСМ_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка)

	СчУзлов = Получатели.Количество();
	Пока СчУзлов > 0 Цикл
		СчУзлов = СчУзлов - 1;
		
		ТаблЗапрещенных = Получатели[СчУзлов].ЗапрещенныеКОтправке;
		
		РегистрацияЗапрещена = Ложь;
		
		ВидОперации = Объект.ВидДвиженияГСМ;
		
		Если ВидОперации = Перечисления.уатВидыДвиженияГСМ.ЗаправкаНаличные Тогда 
			Если Не ТаблЗапрещенных.Найти("ЗаправкаГСМ_Наличные", "Имя") = Неопределено Тогда 
				РегистрацияЗапрещена = Истина;
			КонецЕсли;
			
		ИначеЕсли ВидОперации = Перечисления.уатВидыДвиженияГСМ.ЗаправкаСклад 
			Или ВидОперации = Перечисления.уатВидыДвиженияГСМ.ЗаправкаПластиковаяКартаСклад 
			Или ВидОперации = Перечисления.уатВидыДвиженияГСМ.ЗаправкаТалоны Тогда 
			флОтказСкладТалон_ПередМатВПроизводство = Ложь;
			флОтказСкладТалон_ПередМатВЭксплуатацию = Ложь;
			флОтказСкладТалон_Перемещение           = Ложь;
			флОтказСкладТалон_Списание              = Ложь;
			
			Если Не ТаблЗапрещенных.Найти("ЗаправкаГСМ_СкладТалон_ПередМатВПроизводство", "Имя") = Неопределено Тогда 
				флОтказСкладТалон_ПередМатВПроизводство = Истина;
			КонецЕсли;
			
			Если Не ТаблЗапрещенных.Найти("ЗаправкаГСМ_СкладТалон_ПередМатВЭксплуатацию", "Имя") = Неопределено Тогда 
				флОтказСкладТалон_ПередМатВЭксплуатацию = Истина;
			КонецЕсли;
			
			Если Не ТаблЗапрещенных.Найти("ЗаправкаГСМ_СкладТалон_Перемещение", "Имя") = Неопределено Тогда 
				флОтказСкладТалон_Перемещение = Истина;
			КонецЕсли;
			
			Если Не ТаблЗапрещенных.Найти("ЗаправкаГСМ_СкладТалон_СписаниеЗапасов", "Имя") = Неопределено Тогда 
				флОтказСкладТалон_Списание = Истина;
			КонецЕсли;
			
			Если флОтказСкладТалон_ПередМатВПроизводство И флОтказСкладТалон_ПередМатВЭксплуатацию И флОтказСкладТалон_Перемещение И флОтказСкладТалон_Списание Тогда 
				РегистрацияЗапрещена = Истина;
			КонецЕсли;
			
		ИначеЕсли ВидОперации = Перечисления.уатВидыДвиженияГСМ.ЗаправкаПоставщик Или ВидОперации = Перечисления.уатВидыДвиженияГСМ.ЗаправкаПластиковаяКарта Тогда 
			Если Не ТаблЗапрещенных.Найти("ЗаправкаГСМ_Поставщик", "Имя") = Неопределено Тогда 
				РегистрацияЗапрещена = Истина;
			КонецЕсли;
			
		Иначе 
			РегистрацияЗапрещена = Истина;
		КонецЕсли;
		
		Если РегистрацияЗапрещена Тогда 
			Получатели.Удалить(СчУзлов);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
#Область Документ_уатАвансовыйОтчет
Процедура ДобавитьПРО_Документ_уатАвансовыйОтчет(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Документ_уатАвансовыйОтчет";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Документ.уатАвансовыйОтчет";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиДокументов";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Истина;
		
	УстановитьОтборы(НовоеПравило, 
		ОтборПоСвойствамПланаОбмена_1(),
		ОтборПоСвойствамОбъекта_2());
КонецПроцедуры



Процедура ПРО_Документ_уатАвансовыйОтчет_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка)

	СчУзлов = Получатели.Количество();
	Пока СчУзлов > 0 Цикл
		СчУзлов = СчУзлов - 1;
		
		ТаблЗапрещенных = Получатели[СчУзлов].ЗапрещенныеКОтправке;
		
		РегистрацияЗапрещена = Ложь;
		
		Если Не ТаблЗапрещенных.Найти("АвансовыйОтчет", "Имя") = Неопределено Тогда 
			РегистрацияЗапрещена = Истина;
		КонецЕсли;
		
		Если РегистрацияЗапрещена Тогда 
			Получатели.Удалить(СчУзлов);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
#Область Документ_уатСливГСМ
Процедура ДобавитьПРО_Документ_уатСливГСМ(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Документ_уатСливГСМ";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Документ.уатСливГСМ";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиДокументов";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Истина;
		
	УстановитьОтборы(НовоеПравило, 
		ОтборПоСвойствамПланаОбмена_1(),
		Документ_уатСливГСМ_ОтборПоСвойствамОбъекта());
КонецПроцедуры


Функция Документ_уатСливГСМ_ОтборПоСвойствамОбъекта()
	Возврат "<ОтборПоСвойствамОбъекта>
			|	<ЭлементОтбора>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>Проведен</СвойствоОбъекта>
			|		<Вид>ЗначениеКонстанты</Вид>
			|		<ЗначениеКонстанты>true</ЗначениеКонстанты>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Проведен</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|	</ЭлементОтбора>
			|	<ЭлементОтбора>
			|		<ТипСвойстваОбъекта>ПеречислениеСсылка.уатВидыОперацийСливГСМ</ТипСвойстваОбъекта>
			|		<ВидСравнения>НеРавно</ВидСравнения>
			|		<СвойствоОбъекта>ВидОперации</СвойствоОбъекта>
			|		<Вид>АлгоритмЗначения</Вид>
			|		<ЗначениеКонстанты>Значение = Перечисления.уатВидыОперацийСливГСМ.НаТС;</ЗначениеКонстанты>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>ВидОперации</Наименование>
			|				<Тип>ПеречислениеСсылка.уатВидыОперацийСливГСМ</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|	</ЭлементОтбора>
			|</ОтборПоСвойствамОбъекта>";
КонецФункции

Процедура ПРО_Документ_уатСливГСМ_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка)

	СчУзлов = Получатели.Количество();
	Пока СчУзлов > 0 Цикл
		СчУзлов = СчУзлов - 1;
		
		ТаблЗапрещенных = Получатели[СчУзлов].ЗапрещенныеКОтправке;
		
		РегистрацияЗапрещена = Ложь;
		
		ВидОперации = Объект.ВидОперации;
		
		Если ВидОперации = Перечисления.уатВидыОперацийСливГСМ.НаАЗС Тогда 
			Если Не ТаблЗапрещенных.Найти("СливГСМ_НаАЗС", "Имя") = Неопределено Тогда 
				РегистрацияЗапрещена = Истина;
			КонецЕсли;
			
		ИначеЕсли ВидОперации = Перечисления.уатВидыОперацийСливГСМ.НаСклад Тогда 
			Если Не ТаблЗапрещенных.Найти("СливГСМ_НаСклад", "Имя") = Неопределено Тогда 
				РегистрацияЗапрещена = Истина;
			КонецЕсли;
			
		Иначе 
			РегистрацияЗапрещена = Истина;
		КонецЕсли;
		
		Если РегистрацияЗапрещена Тогда 
			Получатели.Удалить(СчУзлов);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
#Область Документ_уатВозвратТоваров
Процедура ДобавитьПРО_Документ_уатВозвратТоваров(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Документ_уатВозвратТоваров";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Документ.уатВозвратТоваров";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиДокументов";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Истина;
		
	УстановитьОтборы(НовоеПравило, 
		ОтборПоСвойствамПланаОбмена_1(),
		ОтборПоСвойствамОбъекта_2());
КонецПроцедуры



Процедура ПРО_Документ_уатВозвратТоваров_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка)

	СчУзлов = Получатели.Количество();
	Пока СчУзлов > 0 Цикл
		СчУзлов = СчУзлов - 1;
		
		ТаблЗапрещенных = Получатели[СчУзлов].ЗапрещенныеКОтправке;
		
		РегистрацияЗапрещена = Ложь;
		
		Если Не ТаблЗапрещенных.Найти("ВозвратТоваров", "Имя") = Неопределено Тогда 
			РегистрацияЗапрещена = Истина;
		КонецЕсли;
		
		Если РегистрацияЗапрещена Тогда 
			Получатели.Удалить(СчУзлов);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
#Область Документ_уатОприходованиеТоваров
Процедура ДобавитьПРО_Документ_уатОприходованиеТоваров(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Документ_уатОприходованиеТоваров";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Документ.уатОприходованиеТоваров";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиДокументов";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Истина;
		
	УстановитьОтборы(НовоеПравило, 
		Документ_уатОприходованиеТоваров_ОтборПоСвойствамПланаОбмена(),
		ОтборПоСвойствамОбъекта_2());
КонецПроцедуры

Функция Документ_уатОприходованиеТоваров_ОтборПоСвойствамПланаОбмена()
	Возврат "<ОтборПоСвойствамПланаОбмена>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Дата</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ДатаНачалаВыгрузкиДокументов</СвойствоПланаОбмена>
			|		<ВидСравнения>БольшеИлиРавно</ВидСравнения>
			|		<СвойствоОбъекта>Дата</СвойствоОбъекта>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Дата</Наименование>
			|				<Тип>Дата</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ДатаНачалаВыгрузкиДокументов</Наименование>
			|				<Тип>Дата</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<Группа>
			|		<БулевоЗначениеГруппы>ИЛИ</БулевоЗначениеГруппы>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>СправочникСсылка.Организации</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>Организации.Организация</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>Организация</СвойствоОбъекта>
			|			<ТаблицаСвойствОбъекта>
			|				<Свойство>
			|					<Наименование>Организация</Наименование>
			|					<Тип>СправочникСсылка.Организации</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>[Организации]</Наименование>
			|					<Вид>ТабличнаяЧасть</Вид>
			|				</Свойство>
			|				<Свойство>
			|					<Наименование>Организация</Наименование>
			|					<Тип>СправочникСсылка.Организации</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>ИспользоватьОтборПоОрганизациям</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>false</СвойствоОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>ИспользоватьОтборПоОрганизациям</Наименование>
			|					<Тип>Булево</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|	</Группа>
			|</ОтборПоСвойствамПланаОбмена>";
КонецФункции


Процедура ПРО_Документ_уатОприходованиеТоваров_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка)

	СчУзлов = Получатели.Количество();
	Пока СчУзлов > 0 Цикл
		СчУзлов = СчУзлов - 1;
		
		ТаблЗапрещенных = Получатели[СчУзлов].ЗапрещенныеКОтправке;
		
		РегистрацияЗапрещена = Ложь;
		
		Если Не ТаблЗапрещенных.Найти("ОприходованиеТоваров", "Имя") = Неопределено Тогда 
			РегистрацияЗапрещена = Истина;
		КонецЕсли;
		
		Если РегистрацияЗапрещена Тогда 
			Получатели.Удалить(СчУзлов);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
#Область Документ_уатСчетФактураВыданный
Процедура ДобавитьПРО_Документ_уатСчетФактураВыданный(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Документ_уатСчетФактураВыданный";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Документ.уатСчетФактураВыданный";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиДокументов";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Истина;
		
	УстановитьОтборы(НовоеПравило, 
		ОтборПоСвойствамПланаОбмена_1(),
		Документ_уатСчетФактураВыданный_ОтборПоСвойствамОбъекта());
КонецПроцедуры


Функция Документ_уатСчетФактураВыданный_ОтборПоСвойствамОбъекта()
	Возврат "<ОтборПоСвойствамОбъекта>
			|	<ЭлементОтбора>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>ПометкаУдаления</СвойствоОбъекта>
			|		<Вид>ЗначениеКонстанты</Вид>
			|		<ЗначениеКонстанты>false</ЗначениеКонстанты>
			|	</ЭлементОтбора>
			|</ОтборПоСвойствамОбъекта>";
КонецФункции

Процедура ПРО_Документ_уатСчетФактураВыданный_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка)

	СчУзлов = Получатели.Количество();
	Пока СчУзлов > 0 Цикл
		СчУзлов = СчУзлов - 1;
		
		ТаблЗапрещенных = Получатели[СчУзлов].ЗапрещенныеКОтправке;
		
		РегистрацияЗапрещена = Ложь;
		
		Если Не ТаблЗапрещенных.Найти("СчетФактураВыданный", "Имя") = Неопределено Тогда 
			РегистрацияЗапрещена = Истина;
		КонецЕсли;
		
		Если РегистрацияЗапрещена Тогда 
			Получатели.Удалить(СчУзлов);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
#Область Справочник_Банки
Процедура ДобавитьПРО_Справочник_Банки(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_Банки";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.Банки";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиПриНеобходимости";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		ПустойОтборПоСвойствамПланаОбмена(),
		ОтборПоСвойствамОбъекта_1());
КонецПроцедуры



#КонецОбласти
#Область Справочник_Валюты
Процедура ДобавитьПРО_Справочник_Валюты(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_Валюты";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.Валюты";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиПриНеобходимости";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		ПустойОтборПоСвойствамПланаОбмена(),
		ОтборПоСвойствамОбъекта_1());
КонецПроцедуры



#КонецОбласти
#Область Справочник_КлассификаторЕдиницИзмерения
Процедура ДобавитьПРО_Справочник_КлассификаторЕдиницИзмерения(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_КлассификаторЕдиницИзмерения";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.КлассификаторЕдиницИзмерения";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиПриНеобходимости";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		ПустойОтборПоСвойствамПланаОбмена(),
		ОтборПоСвойствамОбъекта_1());
КонецПроцедуры



#КонецОбласти
#Область Справочник_СтраныМира
Процедура ДобавитьПРО_Справочник_СтраныМира(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_СтраныМира";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.СтраныМира";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиПриНеобходимости";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		ПустойОтборПоСвойствамПланаОбмена(),
		ОтборПоСвойствамОбъекта_1());
КонецПроцедуры



#КонецОбласти
#Область Справочник_уатСтатьиРасходов
Процедура ДобавитьПРО_Справочник_уатСтатьиРасходов(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_уатСтатьиРасходов";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.уатСтатьиРасходов";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиСправочников";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		ПустойОтборПоСвойствамПланаОбмена(),
		ОтборПоСвойствамОбъекта_3());
КонецПроцедуры



#КонецОбласти
#Область Справочник_уатПараметрыВыработки
Процедура ДобавитьПРО_Справочник_уатПараметрыВыработки(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_уатПараметрыВыработки";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.уатПараметрыВыработки";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиСправочников";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		ПустойОтборПоСвойствамПланаОбмена(),
		Справочник_уатПараметрыВыработки_ОтборПоСвойствамОбъекта());
КонецПроцедуры


Функция Справочник_уатПараметрыВыработки_ОтборПоСвойствамОбъекта()
	Возврат "<ОтборПоСвойствамОбъекта>
			|	<ЭлементОтбора>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>ПометкаУдаления</СвойствоОбъекта>
			|		<Вид>ЗначениеКонстанты</Вид>
			|		<ЗначениеКонстанты>false</ЗначениеКонстанты>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>ПометкаУдаления</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|	</ЭлементОтбора>
			|	<ЭлементОтбора>
			|		<ТипСвойстваОбъекта>СправочникСсылка.ВидыРаботСотрудников</ТипСвойстваОбъекта>
			|		<ВидСравнения>НеРавно</ВидСравнения>
			|		<СвойствоОбъекта>ВидРаботыСотрудника</СвойствоОбъекта>
			|		<Вид>АлгоритмЗначения</Вид>
			|		<ЗначениеКонстанты>Значение = Справочники.ВидыРаботСотрудников.ПустаяСсылка();</ЗначениеКонстанты>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>ВидРаботыСотрудника</Наименование>
			|				<Тип>СправочникСсылка.ВидыРаботСотрудников</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|	</ЭлементОтбора>
			|</ОтборПоСвойствамОбъекта>";
КонецФункции

#КонецОбласти
#Область Справочник_БанковскиеСчета
Процедура ДобавитьПРО_Справочник_БанковскиеСчета(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_БанковскиеСчета";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.БанковскиеСчета";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиСправочников";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		ПустойОтборПоСвойствамПланаОбмена(),
		ОтборПоСвойствамОбъекта_1());
КонецПроцедуры



#КонецОбласти
#Область Справочник_ДоговорыКонтрагентов
Процедура ДобавитьПРО_Справочник_ДоговорыКонтрагентов(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_ДоговорыКонтрагентов";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.ДоговорыКонтрагентов";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиСправочников";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		ПустойОтборПоСвойствамПланаОбмена(),
		ОтборПоСвойствамОбъекта_3());
КонецПроцедуры



#КонецОбласти
#Область Справочник_Контрагенты
Процедура ДобавитьПРО_Справочник_Контрагенты(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_Контрагенты";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.Контрагенты";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиСправочников";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		ПустойОтборПоСвойствамПланаОбмена(),
		ОтборПоСвойствамОбъекта_1());
КонецПроцедуры



#КонецОбласти
#Область Справочник_Номенклатура
Процедура ДобавитьПРО_Справочник_Номенклатура(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_Номенклатура";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.Номенклатура";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиСправочников";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		ПустойОтборПоСвойствамПланаОбмена(),
		ОтборПоСвойствамОбъекта_1());
КонецПроцедуры



#КонецОбласти
#Область Справочник_Организации
Процедура ДобавитьПРО_Справочник_Организации(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_Организации";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.Организации";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиСправочников";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		ПустойОтборПоСвойствамПланаОбмена(),
		ОтборПоСвойствамОбъекта_1());
КонецПроцедуры



#КонецОбласти
#Область Справочник_ПодразделенияОрганизаций
Процедура ДобавитьПРО_Справочник_ПодразделенияОрганизаций(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_ПодразделенияОрганизаций";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.ПодразделенияОрганизаций";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиСправочников";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		ПустойОтборПоСвойствамПланаОбмена(),
		ОтборПоСвойствамОбъекта_1());
КонецПроцедуры



#КонецОбласти
#Область Справочник_Пользователи
Процедура ДобавитьПРО_Справочник_Пользователи(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_Пользователи";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.Пользователи";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиПриНеобходимости";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		ПустойОтборПоСвойствамПланаОбмена(),
		ОтборПоСвойствамОбъекта_1());
КонецПроцедуры



#КонецОбласти
#Область Справочник_Склады
Процедура ДобавитьПРО_Справочник_Склады(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_Склады";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.Склады";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиСправочников";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		ПустойОтборПоСвойствамПланаОбмена(),
		ОтборПоСвойствамОбъекта_1());
КонецПроцедуры



#КонецОбласти
#Область Справочник_СтатьиДвиженияДенежныхСредств
Процедура ДобавитьПРО_Справочник_СтатьиДвиженияДенежныхСредств(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_СтатьиДвиженияДенежныхСредств";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.СтатьиДвиженияДенежныхСредств";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиСправочников";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		ПустойОтборПоСвойствамПланаОбмена(),
		ОтборПоСвойствамОбъекта_1());
КонецПроцедуры



#КонецОбласти
#Область Справочник_ФизическиеЛица
Процедура ДобавитьПРО_Справочник_ФизическиеЛица(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_ФизическиеЛица";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.ФизическиеЛица";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиСправочников";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		ПустойОтборПоСвойствамПланаОбмена(),
		ОтборПоСвойствамОбъекта_1());
КонецПроцедуры



#КонецОбласти
#Область Справочник_ВидыНоменклатуры
Процедура ДобавитьПРО_Справочник_ВидыНоменклатуры(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_ВидыНоменклатуры";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.ВидыНоменклатуры";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиСправочников";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		ПустойОтборПоСвойствамПланаОбмена(),
		ОтборПоСвойствамОбъекта_1());
КонецПроцедуры



#КонецОбласти
#Область Справочник_НоменклатурныеГруппы
Процедура ДобавитьПРО_Справочник_НоменклатурныеГруппы(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_НоменклатурныеГруппы";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.НоменклатурныеГруппы";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиСправочников";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		ПустойОтборПоСвойствамПланаОбмена(),
		ОтборПоСвойствамОбъекта_1());
КонецПроцедуры



#КонецОбласти
#Область Справочник_ЕдиницыИзмерения
Процедура ДобавитьПРО_Справочник_ЕдиницыИзмерения(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_ЕдиницыИзмерения";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.ЕдиницыИзмерения";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиПриНеобходимости";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		ПустойОтборПоСвойствамПланаОбмена(),
		ОтборПоСвойствамОбъекта_1());
КонецПроцедуры



#КонецОбласти
#Область Справочник_ОсновныеСредства
Процедура ДобавитьПРО_Справочник_ОсновныеСредства(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_ОсновныеСредства";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.ОсновныеСредства";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиСправочников";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Истина;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		ПустойОтборПоСвойствамПланаОбмена(),
		ОтборПоСвойствамОбъекта_1());
КонецПроцедуры



Процедура ПРО_Справочник_ОсновныеСредства_ПередОбработкой(ПРО, Отказ, Объект, ОбъектМетаданных, Выгрузка)

	Если Не ЗначениеЗаполнено(Объект.ИнвентарныйНомер) Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
#Область Справочник_Сотрудники
Процедура ДобавитьПРО_Справочник_Сотрудники(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_Сотрудники";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.Сотрудники";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиСправочников";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		ПустойОтборПоСвойствамПланаОбмена(),
		ОтборПоСвойствамОбъекта_3());
КонецПроцедуры



#КонецОбласти
#Область Справочник_КонтактныеЛица
Процедура ДобавитьПРО_Справочник_КонтактныеЛица(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_КонтактныеЛица";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.КонтактныеЛица";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиСправочников";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		ПустойОтборПоСвойствамПланаОбмена(),
		ОтборПоСвойствамОбъекта_1());
КонецПроцедуры



#КонецОбласти
#Область РегистрСведений_ДокументыФизическихЛиц
Процедура ДобавитьПРО_РегистрСведений_ДокументыФизическихЛиц(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "РегистрСведений_ДокументыФизическихЛиц";
	
	НовоеПравило.ОбъектМетаданныхИмя = "РегистрСведений.ДокументыФизическихЛиц";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиСправочников";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		ПустойОтборПоСвойствамПланаОбмена(),
		РегистрСведений_ДокументыФизическихЛиц_ОтборПоСвойствамОбъекта());
КонецПроцедуры


Функция РегистрСведений_ДокументыФизическихЛиц_ОтборПоСвойствамОбъекта()
	Возврат "<ОтборПоСвойствамОбъекта>
			|	<ЭлементОтбора>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>Физлицо.ПометкаУдаления</СвойствоОбъекта>
			|		<Вид>ЗначениеКонстанты</Вид>
			|		<ЗначениеКонстанты>false</ЗначениеКонстанты>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Физлицо</Наименование>
			|				<Тип>СправочникСсылка.ФизическиеЛица</Тип>
			|				<Вид>Измерение</Вид>
			|			</Свойство>
			|			<Свойство>
			|				<Наименование>ПометкаУдаления</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|	</ЭлементОтбора>
			|</ОтборПоСвойствамОбъекта>";
КонецФункции

#КонецОбласти
#Область РегистрСведений_уатКадроваяИсторияСотрудников
Процедура ДобавитьПРО_РегистрСведений_уатКадроваяИсторияСотрудников(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "РегистрСведений_уатКадроваяИсторияСотрудников";
	
	НовоеПравило.ОбъектМетаданныхИмя = "РегистрСведений.уатКадроваяИсторияСотрудников";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиСправочников";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		ПустойОтборПоСвойствамПланаОбмена(),
		РегистрСведений_уатКадроваяИсторияСотрудников_ОтборПоСвойствамОбъекта());
КонецПроцедуры


Функция РегистрСведений_уатКадроваяИсторияСотрудников_ОтборПоСвойствамОбъекта()
	Возврат "<ОтборПоСвойствамОбъекта>
			|	<ЭлементОтбора>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>Сотрудник.ПометкаУдаления</СвойствоОбъекта>
			|		<Вид>ЗначениеКонстанты</Вид>
			|		<ЗначениеКонстанты>false</ЗначениеКонстанты>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Сотрудник</Наименование>
			|				<Тип>СправочникСсылка.Сотрудники</Тип>
			|				<Вид>Измерение</Вид>
			|			</Свойство>
			|			<Свойство>
			|				<Наименование>ПометкаУдаления</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|	</ЭлементОтбора>
			|</ОтборПоСвойствамОбъекта>";
КонецФункции

#КонецОбласти

Функция ОтборПоСвойствамОбъекта_1()
	Возврат "<ОтборПоСвойствамОбъекта>
			|	<ЭлементОтбора>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>ПометкаУдаления</СвойствоОбъекта>
			|		<Вид>ЗначениеКонстанты</Вид>
			|		<ЗначениеКонстанты>false</ЗначениеКонстанты>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>ПометкаУдаления</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|	</ЭлементОтбора>
			|</ОтборПоСвойствамОбъекта>" ;
КонецФункции


Функция ОтборПоСвойствамОбъекта_2()
	Возврат "<ОтборПоСвойствамОбъекта>
			|	<ЭлементОтбора>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>Проведен</СвойствоОбъекта>
			|		<Вид>ЗначениеКонстанты</Вид>
			|		<ЗначениеКонстанты>true</ЗначениеКонстанты>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Проведен</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|	</ЭлементОтбора>
			|</ОтборПоСвойствамОбъекта>" ;
КонецФункции


Функция ОтборПоСвойствамОбъекта_3()
	Возврат "<ОтборПоСвойствамОбъекта>
			|	<ЭлементОтбора>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>ПометкаУдаления</СвойствоОбъекта>
			|		<Вид>ЗначениеКонстанты</Вид>
			|		<ЗначениеКонстанты>false</ЗначениеКонстанты>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>ПометкаУдаления</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|	</ЭлементОтбора>
			|	<ЭлементОтбора>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>ЭтоГруппа</СвойствоОбъекта>
			|		<Вид>ЗначениеКонстанты</Вид>
			|		<ЗначениеКонстанты>false</ЗначениеКонстанты>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>ЭтоГруппа</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|	</ЭлементОтбора>
			|</ОтборПоСвойствамОбъекта>" ;
КонецФункции


Функция ОтборПоСвойствамОбъекта_4()
	Возврат "<ОтборПоСвойствамОбъекта>
			|	<ЭлементОтбора>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>Проведен</СвойствоОбъекта>
			|		<Вид>ЗначениеКонстанты</Вид>
			|		<ЗначениеКонстанты>true</ЗначениеКонстанты>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Проведен</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|	</ЭлементОтбора>
			|	<ЭлементОтбора>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>НеОтражаетсяВУчете</СвойствоОбъекта>
			|		<Вид>ЗначениеКонстанты</Вид>
			|		<ЗначениеКонстанты>false</ЗначениеКонстанты>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>НеОтражаетсяВУчете</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|	</ЭлементОтбора>
			|</ОтборПоСвойствамОбъекта>" ;
КонецФункции


Функция ОтборПоСвойствамПланаОбмена_1()
	Возврат "<ОтборПоСвойствамПланаОбмена>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Дата</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ДатаНачалаВыгрузкиДокументов</СвойствоПланаОбмена>
			|		<ВидСравнения>БольшеИлиРавно</ВидСравнения>
			|		<СвойствоОбъекта>Дата</СвойствоОбъекта>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Дата</Наименование>
			|				<Тип>Дата</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ДатаНачалаВыгрузкиДокументов</Наименование>
			|				<Тип>Дата</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<Группа>
			|		<БулевоЗначениеГруппы>ИЛИ</БулевоЗначениеГруппы>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>СправочникСсылка.Организации</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>[Организации].Организация</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>Организация</СвойствоОбъекта>
			|			<ТаблицаСвойствОбъекта>
			|				<Свойство>
			|					<Наименование>Организация</Наименование>
			|					<Тип>СправочникСсылка.Организации</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>[Организации]</Наименование>
			|					<Вид>ТабличнаяЧасть</Вид>
			|				</Свойство>
			|				<Свойство>
			|					<Наименование>Организация</Наименование>
			|					<Тип>СправочникСсылка.Организации</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>ИспользоватьОтборПоОрганизациям</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>false</СвойствоОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>ИспользоватьОтборПоОрганизациям</Наименование>
			|					<Тип>Булево</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|	</Группа>
			|</ОтборПоСвойствамПланаОбмена>" ;
КонецФункции


Функция ОтборПоСвойствамПланаОбмена_2()
	Возврат "<ОтборПоСвойствамПланаОбмена>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Дата</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ДатаНачалаВыгрузкиДокументов</СвойствоПланаОбмена>
			|		<ВидСравнения>БольшеИлиРавно</ВидСравнения>
			|		<СвойствоОбъекта>Дата</СвойствоОбъекта>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Дата</Наименование>
			|				<Тип>Дата</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ДатаНачалаВыгрузкиДокументов</Наименование>
			|				<Тип>Дата</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<Группа>
			|		<БулевоЗначениеГруппы>ИЛИ</БулевоЗначениеГруппы>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>СправочникСсылка.Организации</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>[Организации].Организация</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>Организация</СвойствоОбъекта>
			|			<ТаблицаСвойствОбъекта>
			|				<Свойство>
			|					<Наименование>Организация</Наименование>
			|					<Тип>СправочникСсылка.Организации</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>[Организации]</Наименование>
			|					<Вид>ТабличнаяЧасть</Вид>
			|				</Свойство>
			|				<Свойство>
			|					<Наименование>Организация</Наименование>
			|					<Тип>СправочникСсылка.Организации</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>ИспользоватьОтборПоОрганизациям</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>false</СвойствоОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>ИспользоватьОтборПоОрганизациям</Наименование>
			|					<Тип>Булево</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|	</Группа>
			|</ОтборПоСвойствамПланаОбмена>" ;
КонецФункции

Функция ПустойОтборПоСвойствамПланаОбмена()
	Возврат "<ОтборПоСвойствамПланаОбмена/>" ;
КонецФункции

#КонецОбласти
