
#Область СлужебныеПроцедурыИФункции

Функция СписокДоступныхВидовОбластиДействия(ВидНачисления, РасчетПоСтрокам, Применение, ПараметрВыработки = Неопределено) Экспорт
	Рез = Новый СписокЗначений;
	
	Если Применение = 5 Тогда
		Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.Тягач, НСтр("en = 'Vehicle'; ru = 'ТС'"));   
		Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.КлассТягача, НСтр("en='Vehicle class';ru='Класс ТС'"));
		Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.МодельТягача, НСтр("en='Vehicle model';ru='Модель ТС'"));
		Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.ТипТягача, НСтр("en='Vehicle type';ru='Тип ТС'"));
		Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.ФормаОплаты);
		Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.ИсточникЗаказа);
		Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.ПунктОтправления);
		Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.ПунктНазначения);
		Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.ГеозонаОтправления);
		Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.ГеозонаНазначения);
	Иначе
		Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.Тягач, НСтр("en='Vehicle';ru='ТС (тягач) / прицеп'")); 
		Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.КлассТягача, НСтр("en='Vehicle class';ru='Класс ТС (тягача) / прицепа'"));
		Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.МодельТягача, НСтр("en='Vehicle model';ru='Модель ТС (тягача) / прицепа'"));
		Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.ТипТягача, НСтр("en='Vehicle type';ru='Тип ТС (тягача) / прицепа'"));
	КонецЕсли;
	
	Если ВидНачисления = ПланыВидовРасчета.уатОсновныеНачисления.ОплатаЗаРемонт Тогда
		Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.ВидРемонта);
		
	ИначеЕсли ВидНачисления <> Неопределено И ВидНачисления.СпособРасчетаОплатыТруда = Перечисления.уатСпособыРасчетаОплатыТруда.ПроцентомОтВыручки Тогда 
		Если Применение = 5 Тогда
			Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.Контрагент);
		Иначе
			Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.Маршрут);
			Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.Контрагент);
			
			Если НЕ уатОбщегоНазначенияПовтИсп.ВариантПоставкиСТД() Тогда
				Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.ОбъектСтроительства);
				Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.ВидПеревозки);
				Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.НаправлениеПеревозки);
			КонецЕсли;
		КонецЕсли;

	ИначеЕсли РасчетПоСтрокам ИЛИ Применение = 1 Тогда
		Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.Маршрут);
		Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.Контрагент);
		Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.Подразделение);
		
		Если НЕ уатОбщегоНазначенияПовтИсп.ВариантПоставкиСТД() Тогда
			Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.ОбъектСтроительства);
			Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.ВидПеревозки);
			Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.НаправлениеПеревозки);
		КонецЕсли;
		
		Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.ПунктОтправления);
		Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.ПунктНазначения);
		Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.Номенклатура);
		
		Если НЕ уатОбщегоНазначенияПовтИсп.ВариантПоставкиСТД() Тогда
			Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.ГеозонаОтправления);
			Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.ГеозонаНазначения);
			Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.ВидГруза);
			Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.ГрузовоеМесто);
		КонецЕсли;
		
	КонецЕсли;
	
	Если Применение = 0 И ВидНачисления = ПланыВидовРасчета.уатОсновныеНачисления.СдельнаяОплата 
		И ПараметрВыработки = Справочники.уатПараметрыВыработки.ВремяВПростое Тогда
		Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.ВидПростоя);
	КонецЕсли;
	
	Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.КлассВодителя);
	
	Возврат Рез;
КонецФункции

#КонецОбласти
