
#Область ПрограммныйИнтерфейс

// Возвращает статистику репликации
//
Функция ПолучитьСтатистикуРепликации()
	
	СтатистикаРепликацииТип        = ФабрикаXDTO.Тип("http://www.itob.ru/csm/statisticsdata", "СтатистикаРепликации");
	ЭлементСтатистикиРепликацииТип = ФабрикаXDTO.Тип("http://www.itob.ru/csm/statisticsdata", "ЭлементСтатистикиРепликации");
	
	СтатистикаРепликации = ФабрикаXDTO.Создать(СтатистикаРепликацииТип);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ItobСтатистикаРепликации.Поток,
	               |	ItobСтатистикаРепликации.ПериодКрайнейРепликации,
	               |	ItobСтатистикаРепликации.ЗаписейВсего,
	               |	ItobСтатистикаРепликации.ЗаписейЗаМесяц,
	               |	ItobСтатистикаРепликации.ЗаписейЗаСутки,
	               |	ItobСтатистикаРепликации.ЗаписейЗаЧас
	               |ИЗ
	               |	РегистрСведений.ItobСтатистикаРепликации КАК ItobСтатистикаРепликации";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ЭлементСтатистики = ФабрикаXDTO.Создать(ЭлементСтатистикиРепликацииТип);
		ЭлементСтатистики.Поток                   = Выборка.Поток;
		ЭлементСтатистики.ПериодКрайнейРепликации = Выборка.ПериодКрайнейРепликации;
		ЭлементСтатистики.ЗаписейВсего            = Выборка.ЗаписейВсего;
		ЭлементСтатистики.ЗаписейЗаМесяц          = Выборка.ЗаписейЗаМесяц;
		ЭлементСтатистики.ЗаписейЗаСутки          = Выборка.ЗаписейЗаСутки;
		ЭлементСтатистики.ЗаписейЗаЧас            = Выборка.ЗаписейЗаЧас;
		
		СтатистикаРепликации.Состав.Добавить(ЭлементСтатистики);		
	
	КонецЦикла;	
	
	Возврат СтатистикаРепликации;
	
КонецФункции

#КонецОбласти

