///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Определение настроек отображения информации при запуске.
//
// Параметры:
//   Настройки - Структура:
//       * Показывать - Булево - показывать ли информацию в текущем сеансе.
//           Истина - Информация будет показана после входа в программу.
//           Ложь - Информация не будет показана.
//
Процедура ОпределитьНастройки(Настройки) Экспорт
	
	// {УАТ}
	// начало блока стандартных операций
	Отказ = Ложь;
	ДопПараметрыОткрытие = Новый Структура("ИмяФормы", "Обработка.ИнформацияПриЗапуске.Форма.Форма");
	уатЗащищенныеФункцииСервер.уатОбработкаФормаПриСозданииНаСервере(Отказ, Истина, ДопПараметрыОткрытие);
	Если ДопПараметрыОткрытие.Свойство("ОшибкаИнициализацииСервер")
		И ДопПараметрыОткрытие.ОшибкаИнициализацииСервер тогда
		Настройки.Показывать = Ложь;
	КонецЕсли;
	// конец блока стандартных операций

	Если уатОбщегоНазначенияПовтИсп.ВариантПоставкиКОРП()
		ИЛИ уатОбщегоНазначенияПовтИсп.ВариантПоставкиТакси()
		ИЛИ уатОбщегоНазначенияПовтИсп.ВариантПоставкиПРОФ() Тогда
		МодульУатОбщегоНазначения_проф = ОбщегоНазначения.ОбщийМодуль("уатОбщегоНазначения_проф");
		Если МодульУатОбщегоНазначения_проф.НеобходимоОткрытиеТерминалаПЛприСтарте() Тогда
			// Не показывать в терминале
			Настройки.Показывать = Ложь; 
		КонецЕсли;
		
		АвторизованныйПользователь = ПользователиКлиентСервер.АвторизованныйПользователь();
		Если ТипЗнч(АвторизованныйПользователь) = Тип("СправочникСсылка.ВнешниеПользователи") Тогда 
			// Не показывать внешнему пользователю
			Настройки.Показывать = Ложь; 
		КонецЕсли;
	КонецЕсли;
	// {/УАТ}
	
КонецПроцедуры

#КонецОбласти
