
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	уатОбщегоНазначенияСервер.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.уатПутевойЛист") Тогда
		ДокументОснование = ДанныеЗаполнения;
		Организация       = ДанныеЗаполнения.Организация;
		Подразделение     = ДанныеЗаполнения.Подразделение;
		ВидОперации       = Перечисления.уатВидыОперацийАктПриемаПередачи.ПередачаВодителю;
		ТС                = ДанныеЗаполнения.ТранспортноеСредство;
		Принял            = ДанныеЗаполнения.Водитель1;
		ПутевойЛист2      = ДанныеЗаполнения;
		Одометр           = ДанныеЗаполнения.СпидометрВыезда;
		ДатаОсмотра       = ДанныеЗаполнения.ДатаВыезда;
		
		ОснТопливо = ТС.Модель.ОсновноеТопливо;
		мсвСтрокиПоиск = ДанныеЗаполнения.РасходГСМ.НайтиСтроки(Новый Структура("ТС, ГСМ", ТС, ОснТопливо));
		Если мсвСтрокиПоиск.Количество() > 0 Тогда
			ОстатокТоплива = мсвСтрокиПоиск[0].ОстатокПриВыезде;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.уатДТП") Тогда
		ДокументОснование = ДанныеЗаполнения;
		Организация       = ДанныеЗаполнения.Организация;
		Подразделение     = ДанныеЗаполнения.Подразделение;
		ВидОперации       = Перечисления.уатВидыОперацийАктПриемаПередачи.Осмотр;
		ТС                = ДанныеЗаполнения.ТС;
		Если ТипЗнч(ДанныеЗаполнения.ДокументОснование) = Тип("ДокументСсылка.уатПутевойЛист")
			И ЗначениеЗаполнено(ДанныеЗаполнения.ДокументОснование) Тогда
			ПутевойЛист1 = ДанныеЗаполнения.ДокументОснование;
		КонецЕсли;
		Если ЗначениеЗаполнено(ПутевойЛист1) Тогда
			Одометр = ПутевойЛист1.СпидометрВозвращения;
			
			ОснТопливо = ТС.Модель.ОсновноеТопливо;
			мсвСтрокиПоиск = ПутевойЛист1.РасходГСМ.НайтиСтроки(Новый Структура("ТС, ГСМ", ТС, ОснТопливо));
			Если мсвСтрокиПоиск.Количество() > 0 Тогда
				ОстатокТоплива = мсвСтрокиПоиск[0].ОстатокПриВозвращении;
			КонецЕсли;
		КонецЕсли;
		
		Для Каждого ТекСтрока Из ДанныеЗаполнения.КузовныеЭлементы Цикл
			Если ТекСтрока.НаличиеПовреждений Тогда
				НоваяСтрока						= КузовныеЭлементы.Добавить();
				НоваяСтрока.ТС		            = ДанныеЗаполнения.ТС;
				НоваяСтрока.КузовнойЭлемент		= ТекСтрока.КузовнойЭлемент;
				НоваяСтрока.Состояние 			= ТекСтрока.Состояние;
				НоваяСтрока.НаличиеПовреждений  = ТекСтрока.НаличиеПовреждений;
				НоваяСтрока.ХарактерПовреждений = ТекСтрока.ХарактерПовреждений;
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.уатЗаявкаНаРемонт") Тогда
		ДокументОснование = ДанныеЗаполнения;
		Организация       = ДанныеЗаполнения.Организация;
		Подразделение     = ДанныеЗаполнения.Подразделение;
		ВидОперации       = Перечисления.уатВидыОперацийАктПриемаПередачи.Осмотр;
		ТС                = ДанныеЗаполнения.ТС;
		Если ТипЗнч(ДанныеЗаполнения.ДокументОснование.ДокументОснование) = Тип("ДокументСсылка.уатПутевойЛист")
			И ЗначениеЗаполнено(ДанныеЗаполнения.ДокументОснование.ДокументОснование) Тогда
			ПутевойЛист1 = ДанныеЗаполнения.ДокументОснование.ДокументОснование;
		КонецЕсли;
		Если ЗначениеЗаполнено(ПутевойЛист1) Тогда
			Одометр = ПутевойЛист1.СпидометрВозвращения;
			
			ОснТопливо = ТС.Модель.ОсновноеТопливо;
			мсвСтрокиПоиск = ПутевойЛист1.РасходГСМ.НайтиСтроки(Новый Структура("ТС, ГСМ", ТС, ОснТопливо));
			Если мсвСтрокиПоиск.Количество() > 0 Тогда
				ОстатокТоплива = мсвСтрокиПоиск[0].ОстатокПриВозвращении;
			КонецЕсли;
		КонецЕсли;
		
		Для Каждого ТекСтрока Из ДанныеЗаполнения.КузовныеЭлементы Цикл
			Если ТекСтрока.НаличиеПовреждений Тогда
				НоваяСтрока						= КузовныеЭлементы.Добавить();
				НоваяСтрока.ТС		            = ДанныеЗаполнения.ТС;
				НоваяСтрока.КузовнойЭлемент		= ТекСтрока.КузовнойЭлемент;
				НоваяСтрока.Состояние 			= ТекСтрока.Состояние;
				НоваяСтрока.НаличиеПовреждений  = ТекСтрока.НаличиеПовреждений;
				НоваяСтрока.ХарактерПовреждений = ТекСтрока.ХарактерПовреждений;
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли уатОбщегоНазначенияПовтИсп.ВариантПоставкиТакси()
		И ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.такАрендаТС") Тогда
		
		ДокументОснование = ДанныеЗаполнения;
		Организация       = ДанныеЗаполнения.Организация;
		Подразделение     = ДанныеЗаполнения.Подразделение;
		ТС                = ДанныеЗаполнения.ТС;
		МодультакЗащищенныеФункцииСервер = ОбщегоНазначения.ОбщийМодуль("такЗащищенныеФункцииСервер");
		СозданныеДокументы = МодультакЗащищенныеФункцииСервер.СозданныеДокументыАктПриемаПередачиТСДляАренды(ДанныеЗаполнения); 
		Если СозданныеДокументы.ПередачаАрендатору <> Неопределено И СозданныеДокументы.ПриемОтАрендатора = Неопределено Тогда
			ВидОперации = Перечисления.уатВидыОперацийАктПриемаПередачи.ПриемОтАрендатора;
			
			ПунктОсмотраТС  = ДокументОснование.ПунктВозврата;
			ДатаОсмотра     = ?(ЗначениеЗаполнено(ДокументОснование.ДатаВозвратаФактическая), ДокументОснование.ДатаВозвратаФактическая,
				ДокументОснование.ДатаОкончанияПлановая);
			Одометр        = ДокументОснование.ОдометрВозврат;
			ОстатокТоплива = ДокументОснование.ОстатокТопливаВозврат;
		Иначе
			ВидОперации = Перечисления.уатВидыОперацийАктПриемаПередачи.ПередачаАрендатору;
			
			ПунктОсмотраТС  = ДокументОснование.ПунктВыдачи;
			ДатаОсмотра     = ?(ЗначениеЗаполнено(ДокументОснование.ДатаВыдачиФактическая), ДокументОснование.ДатаВыдачиФактическая,
				ДокументОснование.ДатаНачалаПлановая);
			Одометр        = ДокументОснование.ОдометрВыдачи;
			ОстатокТоплива = ДокументОснование.ОстатокТопливаВыезд;
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// Инициализация дополнительных свойств для проведения документа.
	уатПроведение.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	Документы.уатАктПриемаПередачиТС.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	уатПроведение.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	уатПроведение.ОтразитьАгрегатыТС(ДополнительныеСвойства, Движения, Отказ);
	уатПроведение_проф.ОтразитьКузовныеЭлементыТС(ДополнительныеСвойства, Движения, Отказ);
	Если уатОбщегоНазначенияПовтИсп.ВариантПоставкиКОРП() Тогда
		ОМ_уатПроведение_уэ = ОбщегоНазначения.ОбщийМодуль("уатПроведение_уэ");
		ОМ_уатПроведение_уэ.ОтразитьЭлементыКомплектации(ДополнительныеСвойства, Движения, Отказ);
	КонецЕсли;
	уатПроведение_проф.ОтразитьРезультатыОсмотраАгрегатовИЭлементов(ДополнительныеСвойства, Движения, Отказ);
		
	уатПроведение.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	Документы.уатАктПриемаПередачиТС.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ДатаОсмотра = Неопределено;
	Шины.Очистить();
	Агрегаты.Очистить();
	КузовныеЭлементы.Очистить();
	ЭлементыКомплектации.Очистить();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
