
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	Если НЕ ПолучитьФункциональнуюОпцию("уатИспользоватьДокументооборот") Тогда
		Если ДанныеВыбора = Неопределено Тогда
			ДанныеВыбора = Новый СписокЗначений;
		КонецЕсли;
		
		Для Каждого ТекЗначение Из Метаданные.Перечисления.уатВариантыОтсчетаДатыПлатежа.ЗначенияПеречисления Цикл
			Если ТекЗначение <> Перечисления.уатВариантыОтсчетаДатыПлатежа.ПослеПолученияСопроводительныхДокументов Тогда
				ДанныеВыбора.Добавить(Перечисления.уатВариантыОтсчетаДатыПлатежа[ТекЗначение.Имя]);
			КонецЕсли;
		КонецЦикла;
		
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти