///////////////////////////////////////////////////////////////////////////////////////////////////////
// Формирование траспортов для различных видов обмен
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// При появлении новых направлений обмена, необходимо добавить 
// вид настройки и функцию получения транспорта

Функция ПодключениеКВебСервисуБухгалтерия(Узел = Неопределено) Экспорт
	
	ВидНастройки = Перечисления.GDS_ВидыНастроекВнешнихСоединений.Бухгалтерия;
	
	Настройки = GDS_ОбменДаннымиНастройки.Прочитать(ВидНастройки, Узел);
	
	Возврат ПодключениеКВебСервису(Настройки);
	
КонецФункции

Функция ПодключениеКВебСервисуЗУП(Узел = Неопределено) Экспорт
	
	ВидНастройки = Перечисления.GDS_ВидыНастроекВнешнихСоединений.ЗУП;
	
	Настройки = GDS_ОбменДаннымиНастройки.Прочитать(ВидНастройки, Узел);
	
	Возврат ПодключениеКВебСервису(Настройки);
	
КонецФункции

Функция ПодключениеКВебСервисуТранспортнаяЛогистика(Узел = Неопределено) Экспорт
	
	ВидНастройки = Перечисления.GDS_ВидыНастроекВнешнихСоединений.ТранспортнаяЛогистика;
	
	Настройки = GDS_ОбменДаннымиНастройки.Прочитать(ВидНастройки, Узел);
	
	Возврат ПодключениеКВебСервису(Настройки);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПодключениеКВебСервису(Настройки)
	
	ЧастиАдреса = Новый Массив;
	ЧастиАдреса.Добавить(Настройки.АдресСервера);
	ЧастиАдреса.Добавить(Настройки.ИмяБазы);
	ЧастиАдреса.Добавить(Настройки.АдресРесурса);
	АдресПодключения = СтрСоединить(ЧастиАдреса, "/");
	
	Определения = Новый WSОпределения(АдресПодключения, Настройки.Логин, Настройки.Пароль);
	
	Прокси = Новый WSПрокси(Определения, "http://mecamineft.com/","МеКаМи_XMLОбменДанными", "МеКаМи_XMLОбменДаннымиSoap");
	Прокси.Пользователь = Настройки.Логин;
	Прокси.Пароль = Настройки.Пароль;
	
	Возврат Прокси;
	
КонецФункции

#КонецОбласти

