
#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Если НЕ Константы.уатУчетПланФактаПоМаршрутуВМаршрутныхЛистах.Получить() Тогда
		НаборДанных1 = СхемаКомпоновкиДанных.НаборыДанных.Найти("НаборДанных1");
		
		Если НаборДанных1 <> Неопределено Тогда
			ПолеКоличество = НаборДанных1.Поля.Найти("Количество");
			Если ПолеКоличество <> Неопределено Тогда
				ПолеКоличество.Заголовок = "Количество";
			КонецЕсли;
			
			ПолеКоличествоПлан = НаборДанных1.Поля.Найти("КоличествоПлан");
			Если ПолеКоличествоПлан <> Неопределено Тогда
				ПолеКоличествоПлан.ОграничениеИспользования.Поле = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
			
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ДокументРезультат.АвтоМасштаб = Истина;
	
КонецПроцедуры

#КонецОбласти
