#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает массив состояний исполнения.
// 
// Возвращаемое значение:
//  Массив из ПеречислениеСсылка.СостоянияДокументов - Состояния исполнения.
//
Функция СостоянияИсполнения() Экспорт
	
	СостоянияИсполнения = Новый Массив;
	
	СостоянияИсполнения.Добавить(НаРассмотрении);
	СостоянияИсполнения.Добавить(Рассмотрен);
	
	СостоянияИсполнения.Добавить(НаИсполнении);
	СостоянияИсполнения.Добавить(Исполнен);
	СостоянияИсполнения.Добавить(НаДоработке);
	
	Возврат СостоянияИсполнения;
	
КонецФункции

// Возвращает массив состояний исполнения.
// 
// Возвращаемое значение:
//  Массив из ПеречислениеСсылка.СостоянияДокументов - Состояния исполнения.
//
Функция СостоянияИсполненияБезРассмотрения() Экспорт
	
	СостоянияИсполнения = Новый Массив;
	
	СостоянияИсполнения.Добавить(НаИсполнении);
	СостоянияИсполнения.Добавить(Исполнен);
	СостоянияИсполнения.Добавить(НаДоработке);
	
	Возврат СостоянияИсполнения;
	
КонецФункции

// Возвращает массив состояний ознакомления.
// 
// Возвращаемое значение:
//  Массив из ПеречислениеСсылка.СостоянияДокументов - Состояния ознакомления.
//
Функция СостоянияОзнакомления() Экспорт
	
	СостоянияОзнакомления = Новый Массив;
	СостоянияОзнакомления.Добавить(НаОзнакомлении);
	СостоянияОзнакомления.Добавить(ОзнакомлениеЗавершено);
	
	Возврат СостоянияОзнакомления;
	
КонецФункции

// Возвращает массив состояний подписания.
// 
// Возвращаемое значение:
//  Массив из ПеречислениеСсылка.СостоянияДокументов - Состояния подписания.
//
Функция СостоянияПодписания() Экспорт
	
	СостоянияПодписания = Новый Массив;
	СостоянияПодписания.Добавить(НаПодписании);
	СостоянияПодписания.Добавить(Подписан);
	СостоянияПодписания.Добавить(Отклонен);
	
	Возврат СостоянияПодписания;
	
КонецФункции

// Возвращает массив состояний рассмотрения.
// 
// Возвращаемое значение:
//  Массив из ПеречислениеСсылка.СостоянияДокументов - Состояния рассмотрения.
//
Функция СостоянияРассмотрения() Экспорт
	
	СостоянияРассмотрения = Новый Массив;
	СостоянияРассмотрения.Добавить(НаРассмотрении);
	СостоянияРассмотрения.Добавить(Рассмотрен);
	
	Возврат СостоянияРассмотрения;
	
КонецФункции

// Возвращает массив состояний регистрации.
// 
// Возвращаемое значение:
//  Массив из ПеречислениеСсылка.СостоянияДокументов - Состояния регистрации.
//
Функция СостоянияРегистрации() Экспорт
	
	СостоянияРегистрации = Новый Массив;
	СостоянияРегистрации.Добавить(НаРегистрации);
	СостоянияРегистрации.Добавить(Зарегистрирован);
	СостоянияРегистрации.Добавить(НеЗарегистрирован);
	
	Возврат СостоянияРегистрации;
	
КонецФункции

// Возвращает массив состояний согласования.
// 
// Возвращаемое значение:
//  Массив из ПеречислениеСсылка.СостоянияДокументов - Состояния согласования.
//
Функция СостоянияСогласования() Экспорт
	
	СостоянияСогласования = Новый Массив;
	СостоянияСогласования.Добавить(НаСогласовании);
	СостоянияСогласования.Добавить(Согласован);
	СостоянияСогласования.Добавить(НеСогласован);
	
	Возврат СостоянияСогласования;
	
КонецФункции

// Возвращает массив состояний утверждения.
// 
// Возвращаемое значение:
//  Массив из ПеречислениеСсылка.СостоянияДокументов - Состояния утверждения.
//
Функция СостоянияУтверждения() Экспорт
	
	СостоянияУтверждения = Новый Массив;
	СостоянияУтверждения.Добавить(НаУтверждении);
	СостоянияУтверждения.Добавить(Утвержден);
	СостоянияУтверждения.Добавить(НеУтвержден);
	
	Возврат СостоянияУтверждения;
	
КонецФункции

// Возвращает представление состояния ознакомлен.
// 
// Возвращаемое значение:
//  Строка - Состояния ознакомлен.
//
Функция ПредставлениеОзнакомлен() Экспорт
	
	Возврат НСтр("ru = 'Ознакомление завершено'");
	
КонецФункции

// Все возможные состояния этого типа.
// 
// Параметры:
//  Состояние - ПеречислениеСсылка.СостоянияДокументов - Состояние, для которого нужно 
//  	получить все варианты того же типа. Например, Согласовано - Не согласовано - На согласовании
// 
// Возвращаемое значение:
//  Массив из ПеречислениеСсылка.СостоянияДокументов - Все возможные состояния этого типа
Функция ВсеВозможныеСостоянияЭтогоТипа(Состояние) Экспорт
	
	МассивыСостояний = Новый Массив;
	
	МассивыСостояний.Добавить(СостоянияИсполненияБезРассмотрения());
	МассивыСостояний.Добавить(СостоянияРассмотрения());
	МассивыСостояний.Добавить(СостоянияОзнакомления());
	МассивыСостояний.Добавить(СостоянияПодписания());
	МассивыСостояний.Добавить(СостоянияРегистрации());
	МассивыСостояний.Добавить(СостоянияСогласования());
	МассивыСостояний.Добавить(СостоянияУтверждения());
	
	Для Каждого МассивСостояний Из МассивыСостояний Цикл
		
		Если МассивСостояний.Найти(Состояние) <> Неопределено Тогда
			Возврат МассивСостояний;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Новый Массив;
	
КонецФункции


#КонецОбласти

#КонецЕсли

