
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.Свойство("АдресСпискаАналитик") Тогда
		Возврат;
	КонецЕсли;
	
	АналитикиШапки = ПолучитьИзВременногоХранилища(Параметры.АдресСпискаАналитик);
	Список.ЗагрузитьЗначения(АналитикиШапки.ВыгрузитьКолонку("ВидАналитики"));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗавершитьРедактирование(Команда)
	
	Результат = ОбщегоНазначенияКлиентСервер.СвернутьМассив(Список.ВыгрузитьЗначения());
	Если Результат.Количество() > 6 Тогда
		ТекстНСТР = НСтр("en='Количество аналитик не может превышать 6';ru='Количество аналитик не может превышать 6'");
		ПоказатьПредупреждение(, ТекстНСТР);
		Возврат;
	КонецЕсли;
	
	Закрыть(Результат);
	
КонецПроцедуры

#КонецОбласти

