

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// перезапуск защиты
	ОтключитьсяОтСервераЛицензирования();
	ОбновитьПовторноИспользуемыеЗначения();
	Ошибка = Ложь;
	ПодключитьсяКСерверуЛицензирования(Ошибка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиентеНаСервереБезКонтекста

Функция СформироватьОписаниеСостоянияСистемыЗащиты(ОписаниеОшибки)
	Если ПустаяСтрока(ОписаниеОшибки) Тогда
		ОписаниеОшибки = НСтр("en='License received from the server: ""';ru='Лицензия получена от сервера: ""'") + ЛицензированиеСервер.ПараметрСеансаАдресСервераЛицензирования() + """";
	КонецЕсли;
		
	Возврат "[" + ТекущаяДата() + "]: " + ОписаниеОшибки;
КонецФункции

&НаСервере
Процедура ПодключитьсяКСерверуЛицензирования(Ошибка=Ложь)
	СписокРешений = ЛицензированиеПоддержка.СписокРешений();
	РезультатыЗапуска = новый Массив;
	//Ошибка = Ложь;
	
	Для Каждого Решение Из СписокРешений Цикл
		
		ОписаниеОшибки = "";
		КодОшибки = 0;
		
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			
			// Проверка и разбор длинного имени
			ИмяОбработки = Решение.Ключ;
			ИмяМакетаХранилища = "";
			ИмяМакетаПараметровЛицензирования = "";
			КороткоеИмяОбработки = "";
			Если НЕ ЛицензированиеСервер.РазделитьИмяОбработки(ИмяОбработки, ИмяМакетаХранилища, ИмяМакетаПараметровЛицензирования, КороткоеИмяОбработки) Тогда
				ОписаниеОшибки = НСтр("en='Invalid name format of data processor:';ru='Неверный формат имени обработки:'") + Символы.ПС+ИмяОбработки;
				КодОшибки = 1;
				Возврат;
			КонецЕсли;	
			КлючПродукта = ИмяМакетаХранилища + "." + ИмяМакетаПараметровЛицензирования;
			
			Если НЕ ЛицензированиеКлиент.ВыполнитьПривязкуКлиента(КлючПродукта, ОписаниеОшибки) Тогда
				ОписаниеОшибки = СформироватьОписаниеСостоянияСистемыЗащиты(ОписаниеОшибки);
				Возврат;
			КонецЕсли;
			
		#КонецЕсли
		
		РезультатОписаниеОшибки = "";
		//КодОшибки = 0;
		ЛицензированиеСервер.НачалоРаботыСистемыЛицензирования(Решение.Ключ, РезультатОписаниеОшибки, КодОшибки);
		Если РезультатОписаниеОшибки<>"" Тогда
			Ошибка = Истина;
		КонецЕсли;
		ПараметрыФормы = Новый Структура("ОписаниеОшибки,КодОшибки, ПрограммноеОткрытиеФормы, ИмяОбработки, ИмяРешения",РезультатОписаниеОшибки,КодОшибки,Истина, Решение.Ключ, Решение.Значение);
		РезультатыЗапуска.Добавить(ПараметрыФормы); 
		
	КонецЦикла;
	
	Для Каждого РезультатЗапуска из РезультатыЗапуска Цикл
		Результат = РезультатЗапуска.ОписаниеОшибки;
		КодОшибки = РезультатЗапуска.КодОшибки;
		
		Если ПустаяСтрока(Результат) Тогда
			Результат = СформироватьОписаниеСостоянияСистемыЗащиты(Результат);
		КонецЕсли;
		
		Если ОписаниеОшибки<>"" Тогда
			ОписаниеОшибки = ОписаниеОшибки + Символы.ПС+Символы.ПС;	
		КонецЕсли;	
		
		ОписаниеОшибки = ОписаниеОшибки + РезультатЗапуска.ИмяРешения + Символы.ПС + Результат;
	КонецЦикла;
	
	ОписаниеОшибки = СформироватьОписаниеСостоянияСистемыЗащиты(ОписаниеОшибки);
	
КонецПроцедуры

&НаСервере
Процедура ОтключитьсяОтСервераЛицензирования()
	
	ОписаниеОшибки = "";
	
	СписокРешений = ЛицензированиеПоддержка.СписокРешений();
	Для Каждого Решение Из СписокРешений Цикл
		ЛицензированиеСервер.ОсвободитьЛицензию(Решение.Ключ, ОписаниеОшибки);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

