#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	КоличествоВсего = Заправки.Итог("Количество");
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	КоличествоВсего = Заправки.Итог("Количество");
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр МеКаМи_ДанныеЗаправочнойВедомостиИЗаправок 
	Движения.GDS_ДанныеЗаправочнойВедомостиИЗаправок.Записывать = Истина;
	Для Каждого ТекСтрокаЗаправки Из Заправки Цикл
		Движение = Движения.GDS_ДанныеЗаправочнойВедомостиИЗаправок.Добавить();
		Движение.Период = Дата;
		Движение.АЗС = АЗС;
		Движение.ГСМ = ГСМ;
		Движение.Локация = Локация;
		Движение.МОЛ = МОЛ;
		Движение.ТС = ТекСтрокаЗаправки.ТС;
		Движение.ПутевойЛист = ТекСтрокаЗаправки.ПЛ;
		Движение.КоличествоЛитры = ТекСтрокаЗаправки.Количество;
		Движение.Плотность = ТекСтрокаЗаправки.Плотность;
		Движение.КоличествоКГ = ТекСтрокаЗаправки.Количество * ТекСтрокаЗаправки.Плотность;
		Движение.КоличествоАвтограф = ТекСтрокаЗаправки.КоличествоИзАвтограф;
		Движение.КоличествоАвтографБак = ТекСтрокаЗаправки.КоличествоЗаправленоИзАвтограф;
	КонецЦикла;

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Для Каждого Строка Из Заправки Цикл
		Строка.КоличествоИзАвтограф = 0;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли

