
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция СтруктураНастроекПоУмолчанию() Экспорт
	
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("ОптимизироватьМаршрутВМаршрутномЛисте", Ложь);
	СтруктураНастроек.Вставить("ОткрыватьФормыДокументов", Ложь);
	
	Возврат СтруктураНастроек;
	
КонецФункции

Процедура РаспределитьЗаказыВМаршрутномЛисте(АдресВременногоХранилища, ПараметрыОптимизации) Экспорт
	
	уатЗащищенныеФункцииСервер_уэ.РаспределитьЗаказыВМаршрутномЛисте(
		АдресВременногоХранилища,
		ПараметрыОптимизации.ХарактеристикиСцепки.Грузоподъемность,
		ПараметрыОптимизации.ХарактеристикиСцепки.ОбъемКузова,
		ПараметрыОптимизации.ХарактеристикиСцепки.МаксимальноеКоличествоУпаковок,
		ПараметрыОптимизации.ХарактеристикиСцепки.ТипТС,
		ПараметрыОптимизации.ДанныеПоЗаказам.Заказы,
		ПараметрыОптимизации.мсвДопАдреса,
		ПараметрыОптимизации.ДанныеПоЗаказам.Гараж,
		ПараметрыОптимизации.ДанныеПоЗаказам.УчитыватьГаражВозвращения,
		ПараметрыОптимизации.ДанныеПоЗаказам.ДатаВыезда,
		ПараметрыОптимизации.НастройкиМаршрутизации.Оптимизация_НастройкаРежимОптимизации,
		ПараметрыОптимизации.НастройкиМаршрутизации.Оптимизация_НастройкаУчитыватьОкнаПоЗаказам
	);
	
КонецПроцедуры

Функция ДокументыИзменяемыеРедакторомЦепочкиДокументов() Экспорт
	
	Результат = Новый Массив;
	
	Результат.Добавить(Тип("ДокументСсылка.уатЗаказГрузоотправителя"));
	Результат.Добавить(Тип("ДокументСсылка.уатМаршрутныйЛист"));
	Результат.Добавить(Тип("ДокументСсылка.уатДоверенность"));
	Результат.Добавить(Тип("ДокументСсылка.уатЗаказПеревозчику_уэ"));
	Результат.Добавить(Тип("ДокументСсылка.уатПоступлениеТоваровУслуг"));
	Результат.Добавить(Тип("ДокументСсылка.уатПутевойЛист"));
	Результат.Добавить(Тип("ДокументСсылка.уатРеализацияУслуг"));
	Результат.Добавить(Тип("ДокументСсылка.уатСчетНаОплатуПокупателю"));
	Результат.Добавить(Тип("ДокументСсылка.уатСчетНаОплатуПоставщика"));
	Результат.Добавить(Тип("ДокументСсылка.уатТТД"));
	
	Если уатОбщегоНазначенияПовтИсп.ВариантПоставкиКОРП() Тогда
		Результат.Добавить(Тип("ДокументСсылка.уатАктОтгрузки_уэ"));
		Результат.Добавить(Тип("ДокументСсылка.уатАктПриемки_уэ"));
		Результат.Добавить(Тип("ДокументСсылка.уатОперацияСГрузом_уэ"));
		Результат.Добавить(Тип("ДокументСсылка.уатРекламация_уэ"));
		Результат.Добавить(Тип("ДокументСсылка.уатСтраховойСертификат_уэ"));
		Результат.Добавить(Тип("ДокументСсылка.уатТендер_уэ"));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли