#Область ПрограммныйИнтерфейс

// Определяет состав реквизитов для 
// 
// Параметры:
//  ТипДокумента - ПеречислениеСсылка.ТипыДокументовРаспознаваниеДокументов
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Получить сопоставление реквизитов и свойств JSON:
// * ИмяРеквизита - Строка - Так реквизит будет назван в РаспознанныйДокумент.РеквизитыДокумента.ИмяРеквизита
// * ОписаниеТипа - ОписаниеТипов - Тип реквизита, определяет тип РаспознанныйДокумент.РеквизитыДокумента.Значение
// * Адрес - Строка - для v1 показывает откуда из старого формата взять значение
// * НеОтображать - Булево - где-то используется
// * НетНаПечатнойФорме - Булево - где-то используется
// * КлассСущности - Строка - для v2 для поиска среди сущностей
// * ПодклассСущности - Строка - для v2 для поиска среди сущностей
// * Путь - Строка - для v2 для поиска среди сущностей
//
Функция ПолучитьСопоставлениеРеквизитовИСвойствJSON(ТипДокумента) Экспорт
	
	Типы = РаспознаваниеДокументовТипы.Типы();
	
	РеквизитыДокумента = Новый ТаблицаЗначений;
	РеквизитыДокумента.Колонки.Добавить("ИмяРеквизита", Типы.ИмяРеквизита);
	РеквизитыДокумента.Колонки.Добавить("ОписаниеТипа");
	РеквизитыДокумента.Колонки.Добавить("Адрес", Типы.Строка);
	
	РеквизитыДокумента.Колонки.Добавить("НеОтображать", Типы.Булево);
	РеквизитыДокумента.Колонки.Добавить("НетНаПечатнойФорме", Типы.Булево);
	РеквизитыДокумента.Колонки.Добавить("ЭтоРеквизитТабличнойЧасти", Типы.Булево);
	
	// Новые колонки универсального формата
	РеквизитыДокумента.Колонки.Добавить("КлассСущности", Типы.Строка);
	РеквизитыДокумента.Колонки.Добавить("ПодклассСущности", Типы.Строка);
	РеквизитыДокумента.Колонки.Добавить("Путь", Типы.Строка);
	
	РеквизитыДокумента.Индексы.Добавить("КлассСущности");
	РеквизитыДокумента.Индексы.Добавить("Путь");
	
	ИспользоватьНовыйФормат = Ложь;
	
	// ВНИМАНИЕ!
	// Важен порядок добавления реквизитов
	// Необходимо обязательно сохранить правильный индекс реквизита для обратной совместимости
	
	#Область ЛегасиФормат_v1
	
	Если ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипыДокументовРаспознаваниеДокументов.УПД") Тогда
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "СчетФактура.Номер", "НомерДокумента", Типы.Строка);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "СчетФактура.Дата", "ДатаДокумента", Типы.Дата);
		
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Продавец.Наименование", "Продавец", Типы.Контрагент);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Покупатель.Наименование", "Покупатель", Типы.Контрагент);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Грузоотправитель.Наименование", "Грузоотправитель", Типы.Контрагент);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Грузополучатель.Наименование.Наименование", "Грузополучатель", Типы.Контрагент);
		
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "ОснованиеПередачи.Основание", "Договор", Типы.Договор);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Склад", "Склад", Типы.Склад, , Истина);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Продавец.Наименование", "ПродавецОрганизация", Типы.Организация);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Покупатель.Наименование", "ПокупательОрганизация", Типы.Организация);
		
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.ВсегоКОплате.Стоимость", "ИтогоСумма", Типы.ДенежнаяСумма);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.ВсегоКОплате.СуммаНДС", "ИтогоСуммаНДС", Типы.ДенежнаяСумма);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.ВсегоКОплате.Всего", "ИтогоВсего", Типы.ДенежнаяСумма);
		
		// Прочие реквизиты
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Продавец.ИНН", "ИННКПППродавца", Типы.Строка, Истина);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Покупатель.ИНН", "ИННКПППокупателя", Типы.Строка, Истина);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "ОснованиеПередачи.Основание.НомерДоговора", "НомерДоговора", Типы.Строка, Истина);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "ОснованиеПередачи.Основание.ДатаДоговора", "ДатаДоговора", Типы.Дата, Истина);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Итог.ВТомЧислеНДС", "СуммаВключаетНДС", Типы.Булево);
		
		// Таблица
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.ТоварНаименование", "Номенклатура", Типы.Номенклатура);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.Количество", "Количество", Типы.Количество);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.ЕдиницаИзмерения", "ЕдиницаИзмерения", Типы.ЕдиницаИзмерения, Истина);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.Цена", "Цена", Типы.ДенежнаяСумма);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.Стоимость", "Сумма", Типы.ДенежнаяСумма);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.СтавкаНДС", "СтавкаНДС", Типы.СтавкаНДС);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.СуммаНДС", "СуммаНДС", Типы.ДенежнаяСумма);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.Всего", "Всего", Типы.ДенежнаяСумма);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.ПредставлениеСтраны", "СтранаПроисхождения", Типы.СтраныМира);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.ПредставлениеГТД", "НомерГТД", Типы.НомераГТД);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.ТоварКод", "Артикул", Типы.Строка, Истина);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.ЕдиницаИзмеренияКод", "КодЕдиницыИзмерения", Типы.Строка, Истина);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.СтранаПроисхожденияКод", "КодСтраныПроисхождения", Типы.Строка, Истина);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.ТоварНаименование", "Содержание", Типы.Строка);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.Характеристика", "Характеристика", Типы.ХарактеристикаНоменклатуры);
		
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипыДокументовРаспознаваниеДокументов.ТОРГ12") Тогда
		
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "ТаблицаТоварнаяНакладная.НомерДокумента", "НомерДокумента", Типы.Строка);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "ТаблицаТоварнаяНакладная.ДатаСоставления", "ДатаДокумента", Типы.Дата);
		
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "КонтейнерПоставщик.ПредставлениеПоставщика.Наименование", "Продавец", Типы.Контрагент);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "КонтейнерПлательщик.ПредставлениеПлательщика.Наименование", "Покупатель", Типы.Контрагент);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "КонтейнерИнформацияОбОрганизации.КонтейнерОрганизация.ПредставлениеОрганизации.Наименование", "Грузоотправитель", Типы.Контрагент);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "КонтейнерГрузополучатель.ПредставлениеГрузополучателя.Наименование", "Грузополучатель", Типы.Контрагент);
		
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "КонтейнерОснование.Основание", "Договор", Типы.Договор);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Склад", "Склад", Типы.Склад);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "КонтейнерПоставщик.ПредставлениеПоставщика.Наименование", "ПродавецОрганизация", Типы.Организация);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "КонтейнерПлательщик.ПредставлениеПлательщика.Наименование", "ПокупательОрганизация", Типы.Организация);
		
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Всего по накладной.СуммаБезНДС", "ИтогоСумма", Типы.ДенежнаяСумма);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Всего по накладной.СуммаНДС", "ИтогоСуммаНДС", Типы.ДенежнаяСумма);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Всего по накладной.СуммаСНДС", "ИтогоВсего", Типы.ДенежнаяСумма);
		
		// Прочие реквизиты
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "КонтейнерПоставщик.ПредставлениеПоставщика.ИНН", "ИННПродавца", Типы.Строка, Истина);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "КонтейнерПлательщик.ПредставлениеПлательщика.ИНН", "ИННПокупателя", Типы.Строка, Истина);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "КонтейнерИнформацияОбОрганизации.КонтейнерОрганизация.ПредставлениеОрганизации.ИНН", "ИННГрузоотправителя", Типы.Строка, Истина);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "КонтейнерГрузополучатель.ПредставлениеГрузополучателя.ИНН", "ИННГрузополучателя", Типы.Строка, Истина);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "КонтейнерОснование.Основание.НомерДоговора", "НомерДоговора", Типы.Строка, Истина);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "КонтейнерОснование.Основание.ДатаДоговора", "ДатаДоговора", Типы.Дата, Истина);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "КонтейнерПоставщик.ПредставлениеПоставщика.КПП", "КПППродавца", Типы.Строка, Истина);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "КонтейнерПлательщик.ПредставлениеПлательщика.КПП", "КПППокупателя", Типы.Строка, Истина);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "КонтейнерИнформацияОбОрганизации.КонтейнерОрганизация.ПредставлениеОрганизации.КПП", "КППГрузоотправителя", Типы.Строка, Истина);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "КонтейнерГрузополучатель.ПредставлениеГрузополучателя.КПП", "КППГрузополучателя", Типы.Строка, Истина);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Итог.ВТомЧислеНДС", "СуммаВключаетНДС", Типы.Булево);
		
		// Таблица
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.НаименованиеТовара", "Номенклатура", Типы.Номенклатура);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.КоличествНетто", "Количество", Типы.Количество);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.наименование", "ЕдиницаИзмерения", Типы.ЕдиницаИзмерения, Истина);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.Цена", "Цена", Типы.ДенежнаяСумма);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.СуммаБезНДС", "Сумма", Типы.ДенежнаяСумма);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.СтавкаНДС", "СтавкаНДС", Типы.СтавкаНДС);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.СуммаНДС", "СуммаНДС", Типы.ДенежнаяСумма);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.СуммаСНДС", "Всего", Типы.ДенежнаяСумма);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.код", "Артикул", Типы.Строка, Истина);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.кодПоОКЕИ", "КодЕдиницыИзмерения", Типы.Строка, Истина);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.НаименованиеТовара", "Содержание", Типы.Строка);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.Характеристика", "Характеристика", Типы.ХарактеристикаНоменклатуры);
		
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипыДокументовРаспознаваниеДокументов.СчетФактура") Тогда
		
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Номер_к.Номер", "НомерДокумента", Типы.Строка);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Номер_к.Дата", "ДатаДокумента", Типы.Дата);
		
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Продавец_к.ПредставлениеПоставщика", "Продавец", Типы.Контрагент);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Покупатель_к.ПредставлениеПокупателя", "Покупатель", Типы.Контрагент);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Грузоотправитель_к.ПредставлениеГрузоотправителя", "Грузоотправитель", Типы.Контрагент);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Грузополучатель_к.ПредставлениеГрузополучателя.Наименование", "Грузополучатель", Типы.Контрагент);
		
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Договор", "Договор", Типы.Договор);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Склад", "Склад", Типы.Склад, , Истина);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Продавец_к.ПредставлениеПоставщика", "ПродавецОрганизация", Типы.Организация);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Покупатель_к.ПредставлениеПокупателя", "ПокупательОрганизация", Типы.Организация);
		
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.НадписьВсего.Стоимость", "ИтогоСумма", Типы.ДенежнаяСумма);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.НадписьВсего.СуммаНДС", "ИтогоСуммаНДС", Типы.ДенежнаяСумма);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.НадписьВсего.Всего", "ИтогоВсего", Типы.ДенежнаяСумма);
		
		// Прочие реквизиты
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Продавец_к.ИННПоставщика", "ИННКПППродавца", Типы.Строка, Истина);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Покупатель_к.ИННПокупателя", "ИННКПППокупателя", Типы.Строка, Истина);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Итог.ВТомЧислеНДС", "СуммаВключаетНДС", Типы.Булево);
		
		// Таблица
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.ТоварНаименование", "Номенклатура", Типы.Номенклатура);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.Количество", "Количество", Типы.Количество);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.ЕдиницаИзмерения", "ЕдиницаИзмерения", Типы.ЕдиницаИзмерения, Истина);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.Цена", "Цена", Типы.ДенежнаяСумма);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.Стоимость", "Сумма", Типы.ДенежнаяСумма);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.СтавкаНДС", "СтавкаНДС", Типы.СтавкаНДС);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.СуммаНДС", "СуммаНДС", Типы.ДенежнаяСумма);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.Всего", "Всего", Типы.ДенежнаяСумма);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.ПредставлениеСтраны", "СтранаПроисхождения", Типы.СтраныМира);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.ПредставлениеГТД", "НомерГТД", Типы.НомераГТД);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.ЕдиницаИзмеренияКод", "КодЕдиницыИзмерения", Типы.Строка, Истина);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.СтранаПроисхожденияКод", "КодСтраныПроисхождения", Типы.Строка, Истина);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.ТоварНаименование", "Содержание", Типы.Строка);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.Характеристика", "Характеристика", Типы.ХарактеристикаНоменклатуры);
		
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипыДокументовРаспознаваниеДокументов.АктОбОказанииУслуг") Тогда
		
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Заголовок.Номер", "НомерДокумента", Типы.Строка);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Заголовок.Дата", "ДатаДокумента", Типы.Дата);
		
		// КонтейнерПоставщик.ПредставлениеПоставщика
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Исполнитель.Реквизиты.Наименование", "Продавец", Типы.Контрагент);
		// КонтейнерПлательщик.ПредставлениеПлательщика
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Заказчик.Реквизиты.Наименование", "Покупатель", Типы.Контрагент);
		
		// Нет на печатной форме
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Грузоотправитель", "Грузоотправитель", Типы.Контрагент, Истина, Истина);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Грузополучатель", "Грузополучатель", Типы.Контрагент, Истина, Истина);
		
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Основание.Наименование", "Договор", Типы.Договор);
		
		// Нет на печатной форме
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Склад", "Склад", Типы.Склад, Истина, Истина);
		
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Исполнитель.Реквизиты.Наименование", "ПродавецОрганизация", Типы.Организация);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Заказчик.Реквизиты.Наименование", "ПокупательОрганизация", Типы.Организация);
		
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Итог.Итого", "ИтогоСумма", Типы.ДенежнаяСумма);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Итог.НДС", "ИтогоСуммаНДС", Типы.ДенежнаяСумма);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Сумма.Значение", "ИтогоВсего", Типы.ДенежнаяСумма);
		
		// Прочие реквизиты
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Исполнитель.Реквизиты.ИНН", "ИННПродавца", Типы.Строка, Истина);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Заказчик.Реквизиты.ИНН", "ИННПокупателя", Типы.Строка, Истина);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Основание.Наименование.НомерДоговора", "НомерДоговора", Типы.Строка, Истина);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Основание.Наименование.ДатаДоговора", "ДатаДоговора", Типы.Дата, Истина);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Итог.ВТомЧислеНДС", "СуммаВключаетНДС", Типы.Булево);
		
		// Таблица
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.Наименование", "Номенклатура", Типы.Номенклатура);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.Количество", "Количество", Типы.Количество);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.Единиц", "ЕдиницаИзмерения", Типы.ЕдиницаИзмерения, Истина);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.Цена", "Цена", Типы.ДенежнаяСумма);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.Сумма", "Сумма", Типы.ДенежнаяСумма);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.Характеристика", "Характеристика", Типы.ХарактеристикаНоменклатуры);
		
		// Нет на печатной форме
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.СтавкаНДС", "СтавкаНДС", Типы.СтавкаНДС, , Истина);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.СуммаНДС", "СуммаНДС", Типы.ДенежнаяСумма, , Истина);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.СуммаСНДС", "Всего", Типы.ДенежнаяСумма, , Истина);
		
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.Артикул", "Артикул", Типы.Строка, Истина);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.Наименование", "Содержание", Типы.Строка);
		
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипыДокументовРаспознаваниеДокументов.СчетНаОплату") Тогда
		
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Заголовок.Номер", "НомерДокумента", Типы.Строка);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Заголовок.Дата", "ДатаДокумента", Типы.Дата);
		
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "БанковскиеРеквизиты.Получатель.Наименование.НаименованиеОрганизации", "Продавец", Типы.Контрагент);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Заказчик.Реквизиты.Наименование", "Покупатель", Типы.Контрагент);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "БанковскиеРеквизиты.Получатель.КПП.Номер", "КПППродавца", Типы.Строка, Истина);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Заказчик.Реквизиты.КПП", "КПППокупателя", Типы.Строка, Истина);
		
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Основание.Наименование", "Договор", Типы.Договор);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "СрокОплаты.Дата", "СрокОплаты", Типы.Дата);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "БанковскиеРеквизиты.Получатель.Наименование.НаименованиеОрганизации", "ПродавецОрганизация", Типы.Организация);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Заказчик.Реквизиты.Наименование", "ПокупательОрганизация", Типы.Организация);
		
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Итог.Итого", "ИтогоСумма", Типы.ДенежнаяСумма);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Итог.НДС", "ИтогоСуммаНДС", Типы.ДенежнаяСумма);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Итог.Всего", "ИтогоВсего", Типы.ДенежнаяСумма);
		
		// Прочие реквизиты
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "БанковскиеРеквизиты.Получатель.ИНН.Номер", "ИННПродавца", Типы.Строка, Истина);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Заказчик.Реквизиты.ИНН", "ИННПокупателя", Типы.Строка, Истина);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Основание.Наименование.НомерДоговора", "НомерДоговора", Типы.Строка, Истина);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Основание.Наименование.ДатаДоговора", "ДатаДоговора", Типы.Дата, Истина);
		
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Исполнитель.Реквизиты.Наименование", "Исполнитель", Типы.Организация);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Исполнитель.Реквизиты.ИНН", "ИННИсполнителя", Типы.Строка, Истина);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Исполнитель.Реквизиты.КПП", "КППИсполнителя", Типы.Строка, Истина);
		
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Итог.Скидка.Сумма", "ИтогоСуммаСкидки", Типы.ДенежнаяСуммаЛюбогоЗнака, Истина);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "БанковскиеРеквизиты.Получатель.Счет.Номер", "БанковскийСчетКонтрагента", Типы.БанковскиеСчета);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "БанковскиеРеквизиты.Получатель.Счет.Номер", "БанковскийСчетОрганизации", Типы.БанковскиеСчета);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "БанковскиеРеквизиты.Банк.Наименование.НаименованиеБанка", "БанкНаименование", Типы.Строка, Истина);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "БанковскиеРеквизиты.Банк.СчётБанка.Номер", "БанкСчет", Типы.Строка, Истина);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "БанковскиеРеквизиты.Банк.БИК.Номер", "Банк", Типы.Банк, Истина);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Итог.ВТомЧислеНДС", "СуммаВключаетНДС", Типы.Булево);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Итог.ВидСкидки", "ВидСкидки", Типы.ВидСкидки);
		
		// Таблица
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.Товары", "Номенклатура", Типы.Номенклатура);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.Количество", "Количество", Типы.Количество);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.Единицы", "ЕдиницаИзмерения", Типы.ЕдиницаИзмерения, Истина);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.Цена", "Цена", Типы.ДенежнаяСумма);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.Сумма", "Сумма", Типы.ДенежнаяСумма);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.Скидка", "СуммаСкидки", Типы.ДенежнаяСуммаЛюбогоЗнака);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.Характеристика", "Характеристика", Типы.ХарактеристикаНоменклатуры);
		
		// Нет на печатной форме
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.ПроцентСкидки", "ПроцентСкидки", Типы.ДенежнаяСумма, , Истина);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.СтавкаНДС", "СтавкаНДС", Типы.СтавкаНДС, , Истина);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.СуммаНДС", "СуммаНДС", Типы.ДенежнаяСумма, , Истина);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.СуммаСНДС", "Всего", Типы.ДенежнаяСумма, , Истина);
		
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.Артикул", "Артикул", Типы.Строка, Истина);
		РаспознаваниеДокументов.ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.Товары", "Содержание", Типы.Строка);
		
	Иначе
		ИспользоватьНовыйФормат = Истина;
	КонецЕсли;
	
	#КонецОбласти
	
	Если ИспользоватьНовыйФормат Тогда
		
		// Универсальный документ: УКД, КассовыйЧек, НеопределенныйДокумент
		
		// РЕКВИЗИТЫ
		
		// "Р_0"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "НомерДокумента";
		Правило.ОписаниеТипа = Типы.Строка;
		Правило.КлассСущности = "ЗаголовокДокумента";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Номер";
		
		// "Р_1"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "ДатаДокумента";
		Правило.ОписаниеТипа = Типы.Дата;
		Правило.КлассСущности = "ЗаголовокДокумента";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Дата";
		
		// "Р_2"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "Продавец";
		Правило.ОписаниеТипа = Типы.Контрагент;
		Правило.КлассСущности = "Поставщик";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Компания.Наименование";
		
		// "Р_3"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "Покупатель";
		Правило.ОписаниеТипа = Типы.Контрагент;
		Правило.КлассСущности = "Покупатель";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Компания.Наименование";
		
		// "Р_4"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "Грузоотправитель";
		Правило.ОписаниеТипа = Типы.Контрагент;
		Правило.КлассСущности = "Грузоотправитель";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Компания.Наименование";
		
		// "Р_5"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "Грузополучатель";
		Правило.ОписаниеТипа = Типы.Контрагент;
		Правило.КлассСущности = "Грузополучатель";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Компания.Наименование";
		
		// "Р_6"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "Договор";
		Правило.ОписаниеТипа = Типы.Договор;
		Правило.КлассСущности = "ДокументОснование";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Компания.Номер";
		
		// "Р_7"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "Склад";
		Правило.ОписаниеТипа = Типы.Склад;
		//Правило.КлассСущности = "";
		//Правило.ПодклассСущности = "";
		//Правило.Путь = "";
		//Правило.НетНаПечатнойФорме = Истина;
		
		// "Р_8"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "ПродавецОрганизация";
		Правило.ОписаниеТипа = Типы.Организация;
		Правило.КлассСущности = "Поставщик";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Компания.Наименование";
		
		// "Р_9"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "ПокупательОрганизация";
		Правило.ОписаниеТипа = Типы.Организация;
		Правило.КлассСущности = "Покупатель";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Компания.Наименование";
		
		// "Р_10"
		Правило = РеквизитыДокумента.Добавить(); 
		Правило.ИмяРеквизита = "ИтогоСумма";
		Правило.ОписаниеТипа = Типы.ДенежнаяСумма;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "ПодвалИтого";
		Правило.Путь = "Сумма";
		
		// "Р_10_1"
		Правило = РеквизитыДокумента.Добавить(); // Переопределит ПодвалИтого.Сумма
		Правило.ИмяРеквизита = "ИтогоСумма";
		Правило.ОписаниеТипа = Типы.ДенежнаяСумма;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "ПодвалИтого";
		Правило.Путь = "СуммаБезНДС";
		
		// "Р_11"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "ИтогоСуммаНДС";
		Правило.ОписаниеТипа = Типы.ДенежнаяСумма;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "ПодвалИтого";
		Правило.Путь = "СуммаНДС";
		
		// "Р_11_1"
		Правило = РеквизитыДокумента.Добавить(); // Переопределит ПодвалИтого.СуммаНДС
		Правило.ИмяРеквизита = "ИтогоСуммаНДС";
		Правило.ОписаниеТипа = Типы.ДенежнаяСумма;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "ПодвалСуммаНДС";
		Правило.Путь = "Сумма";
		
		// "Р_11_2"
		Правило = РеквизитыДокумента.Добавить(); // Переопределит ПодвалСуммаНДС.Сумма
		Правило.ИмяРеквизита = "ИтогоСуммаНДС";
		Правило.ОписаниеТипа = Типы.ДенежнаяСумма;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "ПодвалВТомЧислеНДС";
		Правило.Путь = "Сумма";
		
		// "Р_12"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "ИтогоВсего";
		Правило.ОписаниеТипа = Типы.ДенежнаяСумма;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "ПодвалИтого";
		Правило.Путь = "СуммаСНДС";
		
		// "Р_13"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "ИННПродавца";
		Правило.ОписаниеТипа = Типы.Строка;
		Правило.КлассСущности = "Поставщик";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Компания.ИНН";
		//Правило.НеОтображать = Истина;
		
		// "Р_14"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "ИННПокупателя";
		Правило.ОписаниеТипа = Типы.Строка;
		Правило.КлассСущности = "Покупатель";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Компания.ИНН";
		
		// "Р_15"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "НомерДоговора";
		Правило.ОписаниеТипа = Типы.Строка;
		Правило.КлассСущности = "ДокументОснование";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Номер";
		
		// "Р_16"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "ДатаДоговора";
		Правило.ОписаниеТипа = Типы.Дата;
		Правило.КлассСущности = "ДокументОснование";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Дата";
		
		// "Р_17
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "Исполнитель";
		Правило.ОписаниеТипа = Типы.Организация;
		Правило.КлассСущности = "Поставщик";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Компания.Наименование";
		
		// "Р_18
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "ИННИсполнителя";
		Правило.ОписаниеТипа = Типы.Строка;
		Правило.КлассСущности = "Поставщик";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Компания.ИНН";
		//Правило.НеОтображать = Истина;
		
		// "Р_19"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "КППИсполнителя";
		Правило.ОписаниеТипа = Типы.Строка;
		Правило.КлассСущности = "Поставщик";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Компания.КПП";
		//Правило.НеОтображать = Истина;
		
		// "Р_20"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "ИтогоСуммаСкидки";
		Правило.ОписаниеТипа = Типы.ДенежнаяСуммаЛюбогоЗнака;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "ПодвалИтого";
		Правило.Путь = "Скидка";
		
		// "Р_21"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "БанковскийСчетКонтрагента";
		Правило.ОписаниеТипа = Типы.БанковскиеСчета;
		Правило.КлассСущности = "Поставщик";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Компания.БанковскийСчет.НомерСчета";
		
		// "Р_22"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "БанковскийСчетОрганизации";
		Правило.ОписаниеТипа = Типы.БанковскиеСчета;
		Правило.КлассСущности = "Поставщик";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Компания.БанковскийСчет.НомерСчета";
		
		// "Р_23"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "БанкСчет";
		Правило.ОписаниеТипа = Типы.Строка;
		Правило.КлассСущности = "Поставщик";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Компания.БанковскийСчет.НомерСчетаКорреспондента";
		
		// "Р_24"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "Банк";
		Правило.ОписаниеТипа = Типы.Банк;
		Правило.КлассСущности = "Поставщик";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Компания.БанковскийСчет.БИК";
		
		// "Р_25"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "СуммаВключаетНДС";
		Правило.ОписаниеТипа = Типы.Булево;
		//Правило.КлассСущности = "";
		//Правило.ПодклассСущности = "";
		//Правило.Путь = "";
		
		// "Р_26"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "ВидСкидки";
		Правило.ОписаниеТипа = Типы.ВидСкидки;
		//Правило.КлассСущности = "";
		//Правило.ПодклассСущности = "";
		//Правило.Путь = "";
		
		// "Р_27"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "ДокументОснованиеКорректировки";
		Правило.ОписаниеТипа = Типы.ДокументОснованиеКорректировки;
		Правило.КлассСущности = "НомераСчетовФактурКорректировки";
		//Правило.ПодклассСущности = "";
		Правило.Путь = "";
		
		// "Р_28"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "НомераПередаточныхКорректировки";
		Правило.ОписаниеТипа = Типы.ДокументОснованиеКорректировки;
		Правило.КлассСущности = "НомераПередаточныхКорректировки";
		//Правило.ПодклассСущности = "";
		Правило.Путь = "";
		
		// "Р_29"
		Правило = РеквизитыДокумента.Добавить(); 
		Правило.ИмяРеквизита = "ИтогоСуммаУменьшение";
		Правило.ОписаниеТипа = Типы.ДенежнаяСумма;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "ПодвалИтогоУменьшение";
		Правило.Путь = "СуммаБезНДС";
		
		// "Р_30"
		Правило = РеквизитыДокумента.Добавить(); 
		Правило.ИмяРеквизита = "ИтогоСуммаНДСУменьшение";
		Правило.ОписаниеТипа = Типы.ДенежнаяСумма;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "ПодвалИтогоУменьшение";
		Правило.Путь = "СуммаНДС";
		
		// "Р_31"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "ИтогоВсегоУменьшение";
		Правило.ОписаниеТипа = Типы.ДенежнаяСумма;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "ПодвалИтогоУменьшение";
		Правило.Путь = "СуммаСНДС";
		
		// "Р_32"
		Правило = РеквизитыДокумента.Добавить(); 
		Правило.ИмяРеквизита = "ИтогоСуммаУвеличение";
		Правило.ОписаниеТипа = Типы.ДенежнаяСумма;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "ПодвалИтогоУвеличение";
		Правило.Путь = "СуммаБезНДС";
		
		// "Р_33"
		Правило = РеквизитыДокумента.Добавить(); 
		Правило.ИмяРеквизита = "ИтогоСуммаНДСУвеличение";
		Правило.ОписаниеТипа = Типы.ДенежнаяСумма;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "ПодвалИтогоУвеличение";
		Правило.Путь = "СуммаНДС";
		
		// "Р_34"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "ИтогоВсегоУвеличение";
		Правило.ОписаниеТипа = Типы.ДенежнаяСумма;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "ПодвалИтогоУвеличение";
		Правило.Путь = "СуммаСНДС";
		
		// "Р_?"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "ИННГрузоотправителя";
		Правило.ОписаниеТипа = Типы.Строка;
		Правило.КлассСущности = "Грузоотправитель";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Компания.ИНН";
		
		// "Р_?"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "КППГрузоотправителя";
		Правило.ОписаниеТипа = Типы.Строка;
		Правило.КлассСущности = "Грузоотправитель";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Компания.КПП";
		
		// "Р_?"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "ИННГрузополучателя";
		Правило.ОписаниеТипа = Типы.Строка;
		Правило.КлассСущности = "Грузополучатель";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Компания.ИНН";
		
		// "Р_?"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "КППГрузополучателя";
		Правило.ОписаниеТипа = Типы.Строка;
		Правило.КлассСущности = "Грузополучатель";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Компания.КПП";
		
		// "Р_?"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "ИННКПППродавца";
		Правило.ОписаниеТипа = Типы.Строка;
		Правило.КлассСущности = "Поставщик";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Компания.ИНН";
		//Правило.НеОтображать = Истина;
		
		// "Р_?"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "КПППродавца";
		Правило.ОписаниеТипа = Типы.Строка;
		Правило.КлассСущности = "Поставщик";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Компания.КПП";
		//Правило.НеОтображать = Истина;
		
		// "Р_?"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "ИННКПППокупателя";
		Правило.ОписаниеТипа = Типы.Строка;
		Правило.КлассСущности = "Покупатель";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Компания.ИНН";
		
		// "Р_?"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "КПППокупателя";
		Правило.ОписаниеТипа = Типы.Строка;
		Правило.КлассСущности = "Покупатель";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Компания.КПП";
		
		// "Р_?"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "БанкНаименование";
		Правило.ОписаниеТипа = Типы.Строка;
		Правило.КлассСущности = "Поставщик";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Компания.БанковскийСчет.НаименованиеБанка";
		
		// ТАБЛИЦА
		
		Правило = РеквизитыДокумента.Добавить();
		Правило.ЭтоРеквизитТабличнойЧасти = Истина;
		Правило.ИмяРеквизита = "НомерИсходнойСтроки";
		Правило.ОписаниеТипа = Типы.Строка;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "Строки";
		Правило.Путь = "НомерИсходнойСтроки";
		
		Правило = РеквизитыДокумента.Добавить();
		Правило.ЭтоРеквизитТабличнойЧасти = Истина;
		Правило.ИмяРеквизита = "ДокументОснованиеКорректировки";
		Правило.ОписаниеТипа = Типы.ДокументОснованиеКорректировки;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "Строки";
		Правило.Путь = "ДокументОснованиеКорректировки";
		
		Правило = РеквизитыДокумента.Добавить();
		Правило.ЭтоРеквизитТабличнойЧасти = Истина;
		Правило.ИмяРеквизита = "Номенклатура";
		Правило.ОписаниеТипа = Типы.Номенклатура;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "Строки";
		Правило.Путь = "НаименованиеНоменклатуры";
		
		Правило = РеквизитыДокумента.Добавить();
		Правило.ЭтоРеквизитТабличнойЧасти = Истина;
		Правило.ИмяРеквизита = "Характеристика";
		Правило.ОписаниеТипа = Типы.ХарактеристикаНоменклатуры;
		
		Правило = РеквизитыДокумента.Добавить();
		Правило.ЭтоРеквизитТабличнойЧасти = Истина;
		Правило.ИмяРеквизита = "Артикул";
		Правило.ОписаниеТипа = Типы.Строка;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "Строки";
		Правило.Путь = "АртикулНоменклатуры";
		
		Правило = РеквизитыДокумента.Добавить();
		Правило.ЭтоРеквизитТабличнойЧасти = Истина;
		Правило.ИмяРеквизита = "Содержание";
		Правило.ОписаниеТипа = Типы.Строка;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "Строки";
		Правило.Путь = "НаименованиеНоменклатуры";
		
		Правило = РеквизитыДокумента.Добавить();
		Правило.ЭтоРеквизитТабличнойЧасти = Истина;
		Правило.ИмяРеквизита = "КоличествоДоКорректировки";
		Правило.ОписаниеТипа = Типы.Количество;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "Строки";
		Правило.Путь = "КоличествоДоКорректировки";
		
		Правило = РеквизитыДокумента.Добавить();
		Правило.ЭтоРеквизитТабличнойЧасти = Истина;
		Правило.ИмяРеквизита = "Количество";
		Правило.ОписаниеТипа = Типы.Количество;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "Строки";
		Правило.Путь = "Количество";
		
		Правило = РеквизитыДокумента.Добавить();
		Правило.ЭтоРеквизитТабличнойЧасти = Истина;
		Правило.ИмяРеквизита = "ЦенаДоКорректировки";
		Правило.ОписаниеТипа = Типы.ДенежнаяСумма;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "Строки";
		Правило.Путь = "ЦенаДоКорректировки";
		
		Правило = РеквизитыДокумента.Добавить();
		Правило.ЭтоРеквизитТабличнойЧасти = Истина;
		Правило.ИмяРеквизита = "Цена";
		Правило.ОписаниеТипа = Типы.ДенежнаяСумма;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "Строки";
		Правило.Путь = "Цена";
		
		Правило = РеквизитыДокумента.Добавить();
		Правило.ЭтоРеквизитТабличнойЧасти = Истина;
		Правило.ИмяРеквизита = "СуммаДоКорректировки";
		Правило.ОписаниеТипа = Типы.ДенежнаяСумма;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "Строки";
		Правило.Путь = "СуммаДоКорректировки";
		
		Правило = РеквизитыДокумента.Добавить(); // Переопределит СуммаДоКорректировки
		Правило.ЭтоРеквизитТабличнойЧасти = Истина;
		Правило.ИмяРеквизита = "СуммаДоКорректировки";
		Правило.ОписаниеТипа = Типы.ДенежнаяСумма;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "Строки";
		Правило.Путь = "СуммаБезНДСДоКорректировки";
		
		Правило = РеквизитыДокумента.Добавить();
		Правило.ЭтоРеквизитТабличнойЧасти = Истина;
		Правило.ИмяРеквизита = "Сумма";
		Правило.ОписаниеТипа = Типы.ДенежнаяСумма;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "Строки";
		Правило.Путь = "Сумма";
		
		Правило = РеквизитыДокумента.Добавить(); // Переопределит Сумма
		Правило.ЭтоРеквизитТабличнойЧасти = Истина;
		Правило.ИмяРеквизита = "Сумма";
		Правило.ОписаниеТипа = Типы.ДенежнаяСумма;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "Строки";
		Правило.Путь = "СуммаБезНДС";
		
		Правило = РеквизитыДокумента.Добавить();
		Правило.ЭтоРеквизитТабличнойЧасти = Истина;
		Правило.ИмяРеквизита = "СтавкаНДСДоКорректировки";
		Правило.ОписаниеТипа = Типы.СтавкаНДС;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "Строки";
		Правило.Путь = "СтавкаНДСДоКорректировки";
		
		Правило = РеквизитыДокумента.Добавить(); // Переопределит СтавкаНДСДоКорректировки
		Правило.ЭтоРеквизитТабличнойЧасти = Истина;
		Правило.ИмяРеквизита = "СтавкаНДСДоКорректировки";
		Правило.ОписаниеТипа = Типы.СтавкаНДС;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "Строки";
		Правило.Путь = "СтавкаНДСТипДоКорректировки";
		
		Правило = РеквизитыДокумента.Добавить();
		Правило.ЭтоРеквизитТабличнойЧасти = Истина;
		Правило.ИмяРеквизита = "СтавкаНДС";
		Правило.ОписаниеТипа = Типы.СтавкаНДС;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "Строки";
		Правило.Путь = "СтавкаНДС";
		
		Правило = РеквизитыДокумента.Добавить(); // Переопределит СтавкаНДС
		Правило.ЭтоРеквизитТабличнойЧасти = Истина;
		Правило.ИмяРеквизита = "СтавкаНДС";
		Правило.ОписаниеТипа = Типы.СтавкаНДС;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "Строки";
		Правило.Путь = "СтавкаНДСТип";
		
		Правило = РеквизитыДокумента.Добавить();
		Правило.ЭтоРеквизитТабличнойЧасти = Истина;
		Правило.ИмяРеквизита = "СуммаНДСДоКорректировки";
		Правило.ОписаниеТипа = Типы.ДенежнаяСумма;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "Строки";
		Правило.Путь = "СуммаНДСДоКорректировки";
		
		Правило = РеквизитыДокумента.Добавить();
		Правило.ЭтоРеквизитТабличнойЧасти = Истина;
		Правило.ИмяРеквизита = "СуммаНДС";
		Правило.ОписаниеТипа = Типы.ДенежнаяСумма;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "Строки";
		Правило.Путь = "СуммаНДС";
		
		Правило = РеквизитыДокумента.Добавить();
		Правило.ЭтоРеквизитТабличнойЧасти = Истина;
		Правило.ИмяРеквизита = "ВсегоДоКорректировки";
		Правило.ОписаниеТипа = Типы.ДенежнаяСумма;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "Строки";
		Правило.Путь = "СуммаСНДСДоКорректировки";
		
		Правило = РеквизитыДокумента.Добавить();
		Правило.ЭтоРеквизитТабличнойЧасти = Истина;
		Правило.ИмяРеквизита = "Всего";
		Правило.ОписаниеТипа = Типы.ДенежнаяСумма;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "Строки";
		Правило.Путь = "СуммаСНДС";
		
		Правило = РеквизитыДокумента.Добавить();
		Правило.ЭтоРеквизитТабличнойЧасти = Истина;
		Правило.ИмяРеквизита = "СуммаСкидки";
		Правило.ОписаниеТипа = Типы.ДенежнаяСуммаЛюбогоЗнака;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "Строки";
		Правило.Путь = "Скидка";
		
		Правило = РеквизитыДокумента.Добавить();
		Правило.ЭтоРеквизитТабличнойЧасти = Истина;
		Правило.ИмяРеквизита = "ЕдиницаИзмерения";
		Правило.ОписаниеТипа = Типы.ЕдиницаИзмерения;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "Строки";
		Правило.Путь = "НаименованиеЕдиницыИзмерения";
		
		Правило = РеквизитыДокумента.Добавить();
		Правило.ЭтоРеквизитТабличнойЧасти = Истина;
		Правило.ИмяРеквизита = "КодЕдиницыИзмерения";
		Правило.ОписаниеТипа = Типы.Строка;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "Строки";
		Правило.Путь = "КодЕдиницыИзмерения";
		
		Правило = РеквизитыДокумента.Добавить();
		Правило.ЭтоРеквизитТабличнойЧасти = Истина;
		Правило.ИмяРеквизита = "СтранаПроисхожденияДоКорректировки";
		Правило.ОписаниеТипа = Типы.СтраныМира;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "Строки";
		Правило.Путь = "НаименованиеСтраныПроисхожденияДоКорректировки";
		
		Правило = РеквизитыДокумента.Добавить();
		Правило.ЭтоРеквизитТабличнойЧасти = Истина;
		Правило.ИмяРеквизита = "СтранаПроисхождения";
		Правило.ОписаниеТипа = Типы.СтраныМира;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "Строки";
		Правило.Путь = "НаименованиеСтраныПроисхождения";
		
		Правило = РеквизитыДокумента.Добавить();
		Правило.ЭтоРеквизитТабличнойЧасти = Истина;
		Правило.ИмяРеквизита = "КодСтраныПроисхожденияДоКорректировки";
		Правило.ОписаниеТипа = Типы.Строка;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "Строки";
		Правило.Путь = "КодСтраныПроисхожденияДоКорректировки";
		
		Правило = РеквизитыДокумента.Добавить();
		Правило.ЭтоРеквизитТабличнойЧасти = Истина;
		Правило.ИмяРеквизита = "КодСтраныПроисхождения";
		Правило.ОписаниеТипа = Типы.Строка;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "Строки";
		Правило.Путь = "КодСтраныПроисхождения";
		
		Правило = РеквизитыДокумента.Добавить();
		Правило.ЭтоРеквизитТабличнойЧасти = Истина;
		Правило.ИмяРеквизита = "НомерГТД";
		Правило.ОписаниеТипа = Типы.НомераГТД;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "Строки";
		Правило.Путь = "НомерГТД";
		
	КонецЕсли;
	
	РаспознаваниеДокументовПереопределяемый.ПриСопоставленииРеквизитовДокумента(ТипДокумента, РеквизитыДокумента);
	
	Возврат РеквизитыДокумента;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ЗаполненнаяТаблицаДокумента(ДокументОбъект) Экспорт
	
	ТаблицаРезультат = Новый ТаблицаЗначений;
	ТаблицаРезультат.Колонки.Добавить("ПорядокСтроки", Новый ОписаниеТипов("Число"));
	ТаблицаРезультат.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
	
	Если ДокументОбъект.РеквизитыТабличныхЧастей.Количество() = 0 Тогда
		Возврат ТаблицаРезультат;
	КонецЕсли;
	
	ОписаниеДоступныхТипов = ОпределяемыеТипыРаспознаваемыеРеквизитыДокументаБРД();
	КвалификаторЧислаБРД = ОписаниеДоступныхТипов.КвалификаторыЧисла;
	КвалификаторСтрокиБРД = ОписаниеДоступныхТипов.КвалификаторыСтроки;
	КвалификаторДатыБРД = ОписаниеДоступныхТипов.КвалификаторыДаты;
	
	Если ДокументОбъект.РеквизитыТабличныхЧастей[0].СтрокаУдалена Тогда
		Отбор = Новый Структура("СтрокаУдалена", Ложь);
		НайденныеЗаписи = ДокументОбъект.РеквизитыТабличныхЧастей.НайтиСтроки(Отбор);
		Если НайденныеЗаписи.Количество() = 0 Тогда
			// Все строки удалены.
		Иначе
			ИзменяемаяСтрока = ТаблицаРезультат.Добавить();
			ИзменяемаяСтрока.ПорядокСтроки = НайденныеЗаписи[0].ПорядокСтроки;
			ИзменяемаяСтрока.НомерСтроки = НайденныеЗаписи[0].НомерСтрокиТЧ;
		КонецЕсли;
	Иначе
		ИзменяемаяСтрока = ТаблицаРезультат.Добавить();
		ИзменяемаяСтрока.ПорядокСтроки = ДокументОбъект.РеквизитыТабличныхЧастей[0].ПорядокСтроки;
		ИзменяемаяСтрока.НомерСтроки = ДокументОбъект.РеквизитыТабличныхЧастей[0].НомерСтрокиТЧ;
	КонецЕсли;
	
	Для Каждого Запись Из ДокументОбъект.РеквизитыТабличныхЧастей Цикл
		Если ТаблицаРезультат.Колонки.Найти(Запись.ИмяРеквизита) = Неопределено Тогда
			МассивТипов = Новый Массив;
			МассивТипов.Добавить(ТипЗнч(Запись.Значение));
			ТипКолонки = Новый ОписаниеТипов(МассивТипов, КвалификаторЧислаБРД, КвалификаторСтрокиБРД, КвалификаторДатыБРД);
			
			ТаблицаРезультат.Колонки.Добавить(Запись.ИмяРеквизита, ТипКолонки);
		КонецЕсли;
		
		Если Запись.СтрокаУдалена Тогда
			Продолжить;
		КонецЕсли;
		
		Если ИзменяемаяСтрока.НомерСтроки <> Запись.НомерСтрокиТЧ Тогда
			
			Отбор = Новый Структура("НомерСтроки", Запись.НомерСтрокиТЧ);
			НайденныеСтроки = ТаблицаРезультат.НайтиСтроки(Отбор);
			Если НайденныеСтроки.Количество() = 0 Тогда
				ИзменяемаяСтрока = ТаблицаРезультат.Добавить();
				Если Запись.ПорядокСтроки = 0 Тогда
					ИзменяемаяСтрока.ПорядокСтроки = Запись.НомерСтрокиТЧ;
				Иначе
					ИзменяемаяСтрока.ПорядокСтроки = Запись.ПорядокСтроки;
				КонецЕсли;
				ИзменяемаяСтрока.НомерСтроки = Запись.НомерСтрокиТЧ;
			Иначе
				ИзменяемаяСтрока = НайденныеСтроки[0];
			КонецЕсли;
			
		КонецЕсли;
		
		// ИзменяемаяСтрока определена
		
		ИзменяемаяСтрока[Запись.ИмяРеквизита] = Запись.Значение;
	КонецЦикла;
	
	ТаблицаРезультат.Сортировать("ПорядокСтроки");
	
	// Читаемое из Базы
	ТаблицаРезультат.Колонки.Добавить("ЭтоУслуга", Новый ОписаниеТипов("Булево"));
	
	СписокНоменклатур = ТаблицаРезультат.ВыгрузитьКолонку("Номенклатура");
	СписокУслугиПоНоменклатурам = Новый Соответствие;
	
	РаспознаваниеДокументовПереопределяемый.ЗаполнитьСписокУслугиПоНоменклатурам(СписокНоменклатур, СписокУслугиПоНоменклатурам);
	
	Для Каждого СтрокаТаблицы Из ТаблицаРезультат Цикл
		ЭтоУслуга = СписокУслугиПоНоменклатурам.Получить(СтрокаТаблицы.Номенклатура);
		Если ЭтоУслуга = Неопределено Тогда
			ЭтоУслуга = Ложь;
		КонецЕсли;
		
		СтрокаТаблицы.ЭтоУслуга = ЭтоУслуга;
	КонецЦикла;
	
	Возврат ТаблицаРезультат;
	
КонецФункции

Процедура СохранитьТаблицуДокумента(ДокументОбъект, ТаблицаДокумента) Экспорт
	
	Документы.РаспознанныйДокумент.ВосстановлениеТаблицыРеквизитовДоПолнойТаблицы(ДокументОбъект);
	
	// Собираем информацию о добавленных и удаленных строках
	ИзмененныеСтроки = Новый Массив;
	ДобавленныеСтроки = Новый Массив;
	Для Каждого СтрокаТаблицы Из ТаблицаДокумента Цикл
		Если СтрокаТаблицы.НомерСтроки = 0 Тогда
			ДобавленныеСтроки.Добавить(СтрокаТаблицы);
		Иначе
			ИзмененныеСтроки.Добавить(СтрокаТаблицы.НомерСтроки);
		КонецЕсли;
	КонецЦикла;
	
	// Заполним ключи у добавленных строк
	Если ДобавленныеСтроки.Количество() <> 0 Тогда
		МаксимальныйНомерСтроки = 0;
		Для Каждого СтрокаТЧ Из ДокументОбъект.РеквизитыТабличныхЧастей Цикл
			Если СтрокаТЧ.НомерСтрокиТЧ > МаксимальныйНомерСтроки Тогда
				МаксимальныйНомерСтроки = СтрокаТЧ.НомерСтрокиТЧ;
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого ДобавленнаяСтрока Из ДобавленныеСтроки Цикл
			МаксимальныйНомерСтроки = МаксимальныйНомерСтроки + 1;
			ДобавленнаяСтрока.НомерСтроки = МаксимальныйНомерСтроки;
		КонецЦикла;
	КонецЕсли;
	
	// Помечаем удаленными из РеквизитыТабличныхЧастей строки, удаленные в ТаблицаДокумента
	ТекущийИндекс = ДокументОбъект.РеквизитыТабличныхЧастей.Количество();
	Пока ТекущийИндекс > 0 Цикл
		ТекущийИндекс = ТекущийИндекс - 1;
		СтрокаТЧ = ДокументОбъект.РеквизитыТабличныхЧастей[ТекущийИндекс];
		Если ИзмененныеСтроки.Найти(СтрокаТЧ.НомерСтрокиТЧ) = Неопределено Тогда
			СтрокаТЧ.СтрокаУдалена = Истина;
			СтрокаТЧ.ПорядокСтроки = 0;
		КонецЕсли;
	КонецЦикла;
	
	Если ТаблицаДокумента.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Записать измененные строки
	
	ТаблицаДокумента.Сортировать("НомерСтроки");
	ИзмененнаяСтрока = ТаблицаДокумента[0];
	
	Для Каждого ИзменяемаяЗапись Из ДокументОбъект.РеквизитыТабличныхЧастей Цикл
		
		Если ИзменяемаяЗапись.СтрокаУдалена Тогда
			// Строка помечена как удаленная.
			Продолжить;
		КонецЕсли;
		
		Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТаблицаДокумента.Колонки, ИзменяемаяЗапись.ИмяРеквизита) Тогда
			// В измененной таблице не найдена колонка текущей изменяемой записи
			// Такую запись не нужно обновлять.
			Продолжить;
		КонецЕсли;
		
		Если ИзмененнаяСтрока.НомерСтроки <> ИзменяемаяЗапись.НомерСтрокиТЧ Тогда
			
			НуженПоискСтроки = (ТаблицаДокумента.Количество() < ИзменяемаяЗапись.НомерСтрокиТЧ);
			
			Если Не НуженПоискСтроки Тогда
				ИзмененнаяСтрока = ТаблицаДокумента[ИзменяемаяЗапись.НомерСтрокиТЧ - 1];
				Если ИзмененнаяСтрока.НомерСтроки <> ИзменяемаяЗапись.НомерСтрокиТЧ Тогда
					
					НуженПоискСтроки = Истина;
				КонецЕсли;
			КонецЕсли;
			
			Если НуженПоискСтроки Тогда
				
				Отбор = Новый Структура("НомерСтроки", ИзменяемаяЗапись.НомерСтрокиТЧ);
				НайденныеСтроки = ТаблицаДокумента.НайтиСтроки(Отбор);
				Если НайденныеСтроки.Количество() = 0 Тогда
					// Встретили запись, которая не отображена в таблицу документа
					// Такую запись не нужно обновлять.
					Продолжить;
				Иначе
					ИзмененнаяСтрока = НайденныеСтроки[0];
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		// ИзмененнаяСтрока определена
		
		ИзменяемаяЗапись.Значение = ИзмененнаяСтрока[ИзменяемаяЗапись.ИмяРеквизита];
		ИзменяемаяЗапись.ПорядокСтроки = ИзмененнаяСтрока.ПорядокСтроки;
		
		ИмяРеквизита = ИзменяемаяЗапись.ИмяРеквизита + "ЗаполненоВручную";
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТаблицаДокумента.Колонки, ИмяРеквизита) Тогда
			ИзменяемаяЗапись.ЗаполненоВручную = ИзмененнаяСтрока[ИмяРеквизита];
		КонецЕсли;
		
		ИмяРеквизита = ИзменяемаяЗапись.ИмяРеквизита + "ЭлементСоздан";
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТаблицаДокумента.Колонки, ИмяРеквизита) Тогда
			ИзменяемаяЗапись.ЭлементСоздан = ИзмененнаяСтрока[ИмяРеквизита];
		КонецЕсли;
		
	КонецЦикла;
	
	// Записать добавленные строки
	
	СохраняемыеРеквизиты = ПолучитьСопоставлениеРеквизитовИСвойствJSON(ДокументОбъект.ТипДокумента);
	
	Для Каждого ДобавленнаяСтрока Из ДобавленныеСтроки Цикл
		
		Для Каждого Колонка Из ТаблицаДокумента.Колонки Цикл
			
			ИмяРеквизита = Колонка.Имя;
			
			Если ИмяРеквизита = "НомерСтроки"
				Или ИмяРеквизита = "ПорядокСтроки"
				Или СтрЗаканчиваетсяНа(ИмяРеквизита, "ЗаполненоВручную") 
				Или СтрЗаканчиваетсяНа(ИмяРеквизита, "ЭлементСоздан") Тогда
				
				Продолжить; // Пропускаем известные захардкоженные имена колонок
			КонецЕсли;
			
			Отбор = Новый Структура;
			Отбор.Вставить("ИмяРеквизита", ИмяРеквизита);
			Отбор.Вставить("ЭтоРеквизитТабличнойЧасти", Истина);
			
			СохраняемыйРеквизит = СохраняемыеРеквизиты.НайтиСтроки(Отбор);
			Если СохраняемыйРеквизит.Количество() = 0 Тогда
				Продолжить; // Пропускаем неизвестные динамически добавленные колонки, которые не требуется сохранять.
			КонецЕсли;
			
			ИзменяемаяЗапись = ДокументОбъект.РеквизитыТабличныхЧастей.Добавить();
			ИзменяемаяЗапись.НомерСтрокиТЧ = ДобавленнаяСтрока.НомерСтроки;
			ИзменяемаяЗапись.ИмяРеквизита = ИмяРеквизита;
			ИзменяемаяЗапись.Значение = ДобавленнаяСтрока[ИмяРеквизита];
			ИзменяемаяЗапись.ПорядокСтроки = ДобавленнаяСтрока.ПорядокСтроки;
			
			ИзменяемаяЗапись.ЗаполненоВручную = Истина;
			
			ИмяРеквизита = ИзменяемаяЗапись.ИмяРеквизита + "ЭлементСоздан";
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТаблицаДокумента.Колонки, ИмяРеквизита) Тогда
				ИзменяемаяЗапись.ЭлементСоздан = ДобавленнаяСтрока[ИмяРеквизита];
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ЗагрузкаРаспознанныхДокументов() Экспорт
	
	Если ОбщегоНазначения.РазделениеВключено() И ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() Тогда
		// {УАТ}
		// КлючЗадания = "ЗагрузкаРаспознанныхДокументов" + XMLСтрока(РаботаВМоделиСервиса.ЗначениеРазделителяСеанса()); 
		КлючЗадания = "ЗагрузкаРаспознанныхДокументов" + XMLСтрока(ИнтернетПоддержкаПользователей.ЗначениеРазделителяСеанса());

		// {/УАТ}
	Иначе
		КлючЗадания = "ЗагрузкаРаспознанныхДокументов";
	КонецЕсли;
	
	ПараметрыЗадания = Новый Массив();
	ПараметрыЗадания.Добавить(Неопределено); // АдресРезультата - для обратной совместимости
	ПараметрыЗадания.Добавить(Неопределено); // СостоянияПоБалансу - для обратной совместимости
	ПараметрыЗадания.Добавить(Неопределено); // ВыполнятьЗагрузкуДокументов - для обратной совместимости
	
	Попытка
		ФоновыеЗадания.Выполнить("РаспознаваниеДокументов.ЗагрузитьРаспознанныеДокументы", ПараметрыЗадания, КлючЗадания,
			НСтр("ru = 'Загрузка распознанных документов'; en = 'Import recognized documents'"));
	Исключение
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Невозможно выполнить фоновое задание загрузки распознанных документов"
"по причине:"
"%1'; en = 'Cannot execute the background job of recognized document import"
"due to:"
"%1'"),
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(
			РаспознаваниеДокументов.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Предупреждение, , ,
			ТекстОшибки);
		
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

Функция УстановитьИПроверитьВыполняетсяЗагрузкаРаспознанныхДокументов() Экспорт 
	
	СеансИБ = ПолучитьТекущийСеансИнформационнойБазы();
	ПараметрыСеансаЗагрузки = Новый ФиксированнаяСтруктура("НомерСеанса, НачалоСеанса", СеансИБ.НомерСеанса, СеансИБ.НачалоСеанса);
	ХранилищеСеансаЗагрузки = Новый ХранилищеЗначения(ПараметрыСеансаЗагрузки);
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("Константа.ПараметрыСеансаЗагрузкиРаспознанныхДокументов");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	НачатьТранзакцию();
	Попытка
		
		Блокировка.Заблокировать();
		
		СтарыеПараметрыСеанса = Константы.ПараметрыСеансаЗагрузкиРаспознанныхДокументов.Получить().Получить();
		Если РаспознаваниеДокументовСлужебный.ВыполняетсяЗагрузкаРаспознанныхДокументов(СтарыеПараметрыСеанса) Тогда
			ВызватьИсключение НСтр("ru = 'Загрузка распознанных документов уже началась в другом сеансе.'; en = 'Import of recognized documents has already started in another session.'");
		КонецЕсли;
		
		Константы.ПараметрыСеансаЗагрузкиРаспознанныхДокументов.Установить(ХранилищеСеансаЗагрузки);
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ТекстОшибки = НСтр("ru = 'Не удалось проверить и обновить Параметры сеанса загрузки распознанных документов.'; en = 'Cannot check and update Parameters of recognized document import session.'")
			+ Символы.ПС + ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		ЗаписьЖурналаРегистрации(РаспознаваниеДокументов.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Предупреждение, , , ТекстОшибки);
		
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

Функция ВыполняетсяЗагрузкаРаспознанныхДокументов(ПараметрыСеансаЗагрузки = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЗагрузкаВыполняется = Ложь;
	
	Если ПараметрыСеансаЗагрузки = Неопределено Тогда
		ПараметрыСеансаЗагрузки = Константы.ПараметрыСеансаЗагрузкиРаспознанныхДокументов.Получить().Получить();
	КонецЕсли;
	
	Если ПараметрыСеансаЗагрузки <> Неопределено Тогда
		ВсеСеансыИБ = ПолучитьСеансыИнформационнойБазы();
		Для Каждого СеансИБ Из ВсеСеансыИБ Цикл
			Если ПараметрыСеансаЗагрузки.НомерСеанса = СеансИБ.НомерСеанса
				И ПараметрыСеансаЗагрузки.НачалоСеанса = СеансИБ.НачалоСеанса Тогда
				
				ЗагрузкаВыполняется = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ЗагрузкаВыполняется;
	
КонецФункции

Процедура ФоновоеСозданиеНоменклатуры(Параметры, АдресРезультата) Экспорт
	
	ПараметрыСозданияНоменклатуры = Параметры[0];
	
	Результат = Новый Массив;
	
	Процент = 0;
	Количество = 0;
	КоличествоВсего = ПараметрыСозданияНоменклатуры.Количество();
	
	Для Каждого ПараметрыСоздания Из ПараметрыСозданияНоменклатуры Цикл
		
		Количество = Мин(Количество + 1, КоличествоВсего);
		
		Процент = Окр(100 * Количество / КоличествоВсего);
		Текст = "" + Количество + "/" + КоличествоВсего;
		ДлительныеОперации.СообщитьПрогресс(Процент, Текст);
		
		//@skip-check query-in-loop
		ИмеющийсяДубль = НайтиДубльНоменклатуры(ПараметрыСоздания, ПараметрыСозданияНоменклатуры);
		Если ИмеющийсяДубль = Неопределено Тогда
			ЭтоДубль = Ложь;
			СозданнаяНоменклатура = НоваяНоменклатураПоПараметрам(ПараметрыСоздания);
			
			Если СозданнаяНоменклатура = Неопределено Тогда
				Продолжить;
			КонецЕсли;
		Иначе
			ЭтоДубль = Истина;
			СозданнаяНоменклатура = ИмеющийсяДубль;
		КонецЕсли;
		
		ПараметрыСоздания.Ссылка = СозданнаяНоменклатура;
		
		ВозвращаемыеСвойства = Новый Структура();
		ВозвращаемыеСвойства.Вставить("ИдентификаторИсходнойСтроки", ПараметрыСоздания.ИдентификаторИсходнойСтроки);
		ВозвращаемыеСвойства.Вставить("Номенклатура", СозданнаяНоменклатура);
		ВозвращаемыеСвойства.Вставить("ЭтоДубль", ЭтоДубль);
		
		Результат.Добавить(ВозвращаемыеСвойства);
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
	
КонецПроцедуры

#Область ОбновлениеВерсииИБ

Процедура ВключениеРаспознаванияДокументов() Экспорт
	
	//@skip-check bsl-legacy-check-string-literal
	Если ОбщегоНазначения.ПодсистемаСуществует("БРД_РаспознаваниеДокументовПодсистемы") Тогда
		Возврат; //Пользователи расширения включают функциональность сами, при переходе
	КонецЕсли;
	
	Если РаспознаваниеДокументов.АккаунтАвторизован() Тогда
		Возврат; // Если была авторизация ранее, то не выполнять действий включения.
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	Константы.ИспользоватьРаспознаваниеДокументов.Установить(Истина);
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ОбновлениеРаспознанныхДокументов() Экспорт
	
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ПустаяДата", Дата('00010101'));
		Запрос.Текст =
			"ВЫБРАТЬ
			|	РаспознанныйДокумент.Ссылка КАК Ссылка,
			|	РаспознанныйДокумент.ДатаПоследнегоИзменения КАК ДатаПоследнегоИзменения,
			|	РаспознанныйДокумент.КоличествоРаспознанныхСущностей КАК КоличествоРаспознанныхСущностей
			|ИЗ
			|	Документ.РаспознанныйДокумент КАК РаспознанныйДокумент
			|ГДЕ
			|	(РаспознанныйДокумент.КоличествоРаспознанныхСущностей = 0
			|			ИЛИ РаспознанныйДокумент.ДатаПоследнегоИзменения = &ПустаяДата)";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
			
			// Заполнение наиболее актуальной известной датой
			Если Не ЗначениеЗаполнено(Выборка.ДатаПоследнегоИзменения) Тогда
				ДокументОбъект.ДатаПоследнегоИзменения = ДокументОбъект.Дата;
			КонецЕсли;
			
			// Заполнение подсчетом сущностей
			Если Не ЗначениеЗаполнено(Выборка.КоличествоРаспознанныхСущностей) Тогда
				ДокументОбъект.КоличествоРаспознанныхСущностей = ДокументОбъект.РеквизитыДокумента.Количество()
					+ ДокументОбъект.РеквизитыТабличныхЧастей.Количество();
			КонецЕсли;
			
			// Запись
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект);
		КонецЦикла;
		
	Исключение
		ЗаписьЖурналаРегистрации(
			РаспознаваниеДокументов.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Документы.РаспознанныйДокумент,
			ДокументОбъект.Ссылка,
			СтрШаблон(
				НСтр("ru = 'Не удалось выполнить обновление данных'; en = 'Cannot update the data'"),
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())
			)
		);
	КонецПопытки;
	
КонецПроцедуры

Процедура ОбновлениеНастроекРаспознаванияДокументов() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = РегистрыСведений.ОбщиеНастройкиРаспознаваниеДокументов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.Выбран() Тогда
		
		МенеджерЗаписи.АвтоматическиРегистрироватьЧеки = Истина;
		МенеджерЗаписи.Записать();
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область РегламентныеЗадания

Процедура УстановитьПараметрРегламентногоЗадания(Знач МетаданныеРегламентногоЗадания, Знач ИмяПараметра, Знач ЗначениеПараметра) Экспорт
	
	ПараметрыЗадания = Новый Структура;
	ПараметрыЗадания.Вставить("Метаданные", МетаданныеРегламентногоЗадания);
	
	УстановитьПривилегированныйРежим(Истина);
	
	СписокЗаданий = РегламентныеЗаданияСервер.НайтиЗадания(ПараметрыЗадания);
	Если СписокЗаданий.Количество() = 0 Тогда
		ПараметрыЗадания.Вставить(ИмяПараметра, ЗначениеПараметра);
		РегламентныеЗаданияСервер.ДобавитьЗадание(ПараметрыЗадания);
	Иначе
		ПараметрыЗадания = Новый Структура(ИмяПараметра, ЗначениеПараметра);
		Для Каждого Задание Из СписокЗаданий Цикл
			РегламентныеЗаданияСервер.ИзменитьЗадание(Задание, ПараметрыЗадания);
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

Функция ОсновныеРеквизиты(ДокументОбъект) Экспорт
	
	ОсновныеРеквизиты = Новый Соответствие;
	ОсновныеРеквизиты.Вставить("Контрагент", "");
	ОсновныеРеквизиты.Вставить("Организация", "");
	
	Если ДокументОбъект.ТипДокумента = Перечисления.ТипыДокументовРаспознаваниеДокументов.СчетНаОплату Тогда
		
		Если ДокументОбъект.Направление = Перечисления.НаправленияРаспознанногоДокумента.Исходящий Тогда
			ОсновныеРеквизиты.Вставить("Контрагент", "Покупатель");
			ОсновныеРеквизиты.Вставить("Организация", "Исполнитель");
		Иначе
			ОсновныеРеквизиты.Вставить("Контрагент", "Продавец");
			ОсновныеРеквизиты.Вставить("Организация", "ПокупательОрганизация");
		КонецЕсли;
		
	Иначе
		
		Если ДокументОбъект.Направление = Перечисления.НаправленияРаспознанногоДокумента.Исходящий Тогда
			ОсновныеРеквизиты.Вставить("Контрагент", "Покупатель");
			ОсновныеРеквизиты.Вставить("Организация", "ПродавецОрганизация");
		Иначе
			ОсновныеРеквизиты.Вставить("Контрагент", "Продавец");
			ОсновныеРеквизиты.Вставить("Организация", "ПокупательОрганизация");
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ОсновныеРеквизиты;
	
КонецФункции

Функция РеквизитОбработкиИзОсновногоРеквизита(ДокументОбъект, ИмяРеквизита) Экспорт
	
	Реквизиты = ОсновныеРеквизиты(ДокументОбъект);
	Для каждого КлючЗначение Из Реквизиты Цикл
		Если КлючЗначение.Значение = ИмяРеквизита Тогда
			Возврат КлючЗначение.Ключ;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ИмяРеквизита;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьСозданныйДокументИзРаспознанногоДокументаБРДОбработчик(Источник, ДанныеЗаполнения) Экспорт
	
	// {УАТ}
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура")
		И ДанныеЗаполнения.Свойство("Основание")
		И ТипЗнч(ДанныеЗаполнения.Основание) = Тип("ДокументСсылка.РаспознанныйДокумент") Тогда
		
		МетаданныеОбъекта 	= Источник.Метаданные();
		ЕстьТаблицаУслуг = (МетаданныеОбъекта.ТабличныеЧасти.Найти("Услуги") <> Неопределено); 
		ЕстьТаблицаТовары = (МетаданныеОбъекта.ТабличныеЧасти.Найти("Товары") <> Неопределено);
		
		Если ЕстьТаблицаУслуг 
			И ЕстьТаблицаТовары Тогда
			ЗаполнитьЗначенияСвойств(Источник, ДанныеЗаполнения,,"Товары, Услуги");
			Для Каждого ДанныеСтроки Из ДанныеЗаполнения.Услуги Цикл
				ЗаполнитьЗначенияСвойств(Источник.Услуги.Добавить(), ДанныеСтроки);
			КонецЦикла;
			Для Каждого ДанныеСтроки Из ДанныеЗаполнения.Товары Цикл
				ЗаполнитьЗначенияСвойств(Источник.Товары.Добавить(), ДанныеСтроки);
			КонецЦикла; 
		ИначеЕсли ЕстьТаблицаУслуг Тогда
			ЗаполнитьЗначенияСвойств(Источник, ДанныеЗаполнения,,"Услуги");
			Для Каждого ДанныеСтроки Из ДанныеЗаполнения.Услуги Цикл
				ЗаполнитьЗначенияСвойств(Источник.Услуги.Добавить(), ДанныеСтроки);
			КонецЦикла;
		ИначеЕсли ЕстьТаблицаТовары Тогда
			ЗаполнитьЗначенияСвойств(Источник, ДанныеЗаполнения,,"Товары");
			Для Каждого ДанныеСтроки Из ДанныеЗаполнения.Товары Цикл
				ЗаполнитьЗначенияСвойств(Источник.Товары.Добавить(), ДанныеСтроки);
			КонецЦикла;
		КонецЕсли;
		// {/УАТ}
		
		Если Метаданные.ОпределяемыеТипы.ПоступлениеТоваровУслугБРД.Тип.СодержитТип(ТипЗнч(Источник.Ссылка))
			Или Метаданные.ОпределяемыеТипы.РеализацияТоваровУслугБРД.Тип.СодержитТип(ТипЗнч(Источник.Ссылка)) Тогда
			
			Источник.СуммаВключаетНДС = ДанныеЗаполнения.СуммаВключаетНДС;
			
			Если ОбщегоНазначения.ПодсистемаСуществует("БухгалтерияПредприятияПодсистемы") Тогда
				МодульСчетаУчетаВДокументах = ОбщегоНазначения.ОбщийМодуль("СчетаУчетаВДокументах");
				МодульСчетаУчетаВДокументах.ЗаполнитьПередОтображениемПользователю(Источник);
			КонецЕсли;
			
		КонецЕсли;
		
		Если ДанныеЗаполнения.Свойство("СрокОплаты") Тогда 
			Источник.ДополнительныеСвойства.Вставить("СрокОплаты", ДанныеЗаполнения.СрокОплаты);
		КонецЕсли;
		
		Если РаспознаваниеДокументовТипы.ЭтоПлатежноеПоручение(ТипЗнч(Источник.Ссылка)) Тогда
			РаспознаваниеДокументовПереопределяемый.ПриЗаполненииПлатежногоПоручения(Источник, ДанныеЗаполнения);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписиДокументаСоздаваемогоИзРаспознанногоДокумента(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если РаспознаваниеДокументовТипы.ЭтоПлатежноеПоручение(ТипЗнч(Источник.Ссылка)) Тогда
		
		РаспознанныйДокументОснование = Неопределено;
		Если Источник.ДополнительныеСвойства.Свойство("РаспознанныйДокументОснование", РаспознанныйДокументОснование) Тогда
			
			РаспознанныйДокументОбъект = РаспознанныйДокументОснование.ПолучитьОбъект();
			
			Если РаспознанныйДокументОбъект.Статус <> Перечисления.СтатусыСозданныхДокументовРаспознаваниеДокументов.Обработан Тогда
				РаспознанныйДокументОбъект.Статус = Перечисления.СтатусыСозданныхДокументовРаспознаваниеДокументов.Обработан;
				РаспознанныйДокументОбъект.Записать();
			КонецЕсли;
			
			РегистрыСведений.СвязанныеОбъектыРаспознаниеДокументов.ЗаписатьЗначения(
				Источник.Ссылка,
				РаспознанныйДокументОснование,
				Ложь
			);
			
			АдресКартинки = ПоместитьВоВременноеХранилище(РаспознанныйДокументОбъект.ИсходноеИзображение.Получить());
			РаспознаваниеДокументовСлужебный.ДобавитьПрисоединенныйФайл(РаспознанныйДокументОснование, Источник.Ссылка, АдресКартинки);
			УдалитьИзВременногоХранилища(АдресКартинки);
			
			ДанныеСозданногоДокумента = ПолучитьОбратнуюСвязьДляСозданногоДокумента(Источник.Ссылка, РаспознанныйДокументОбъект);
			
			Пакет = Новый Структура;
			Пакет.Вставить("created", ДанныеСозданногоДокумента);
			
			РаспознаваниеДокументовКоннекторСлужебный.ПередатьОбратнуюСвязь(РаспознанныйДокументОбъект.ИдентификаторРезультата, Пакет);
			
		КонецЕсли;
		
	ИначеЕсли РаспознаваниеДокументовТипы.ЭтоАвансовыйОтчет(ТипЗнч(Источник.Ссылка)) Тогда
		
		РаспознаваниеДокументовПереопределяемый.ПриЗаписиАвансовогоОтчета(Источник);
		
	ИначеЕсли РаспознаваниеДокументовТипы.ЭтоРасходыПредпринимателя(ТипЗнч(Источник.Ссылка)) Тогда
		
		РаспознаваниеДокументовПереопределяемый.ПриЗаписиРасходовПредпринимателя(Источник);
		
	ИначеЕсли РаспознаваниеДокументовТипы.ЭтоПутевойЛист(ТипЗнч(Источник.Ссылка)) Тогда
		
		РаспознаваниеДокументовПереопределяемый.ПриЗаписиПутевогоЛиста(Источник);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьОбратнуюСвязьДляСозданногоДокумента(СоздаваемыйДокумент, РаспознанныйДокумент)
	
	ПараметрыВыбораДоговора = РаспознаваниеДокументовСлужебный.ПараметрыВыбораДоговора(РаспознанныйДокумент);
	
	ИсточникПоляДоговорКонтрагент = ПараметрыВыбораДоговора.Контрагент;
	ИсточникПоляДоговорОрганизация = ПараметрыВыбораДоговора.Организация;
	
	ИтогоВсего    = РаспознаваниеДокументовСлужебныйКлиентСервер.ЗначениеРеквизитаДокумента(РаспознанныйДокумент, "ИтогоВсего", 0);
	
	Результат = РаспознаваниеДокументов.ОписаниеОбратнойСвязи("Проведен");
	Результат.IdСозданногоДокумента = Строка(СоздаваемыйДокумент.УникальныйИдентификатор());
	Результат.НомерРаспознанногоДокумента = РаспознанныйДокумент.Номер;
	Результат.ЭтоВходящийДокумент = (РаспознанныйДокумент.Направление = Перечисления.НаправленияРаспознанногоДокумента.Входящий);
	Результат.НомерДокумента = РаспознанныйДокумент.РеквизитыДокумента[0].Значение;
	Результат.ДатаДокумента = РаспознанныйДокумент.РеквизитыДокумента[1].Значение;
	Результат.СуммаДокумента = ИтогоВсего;
	Результат.Контрагент = РаспознаваниеДокументов.УбратьОрганизационнуюФорму(ИсточникПоляДоговорКонтрагент);
	Результат.Организация = РаспознаваниеДокументов.УбратьОрганизационнуюФорму(ИсточникПоляДоговорОрганизация);
	Результат.ТипРаспознанногоДокумента = Строка(РаспознанныйДокумент.ТипДокумента);
	
	Возврат Результат;
	
КонецФункции

#Область РаботаСРаспознаннымДокументом

Функция ДоступныеОрганизации() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Организации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Организации КАК Организации";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Функция ПолучитьДанныеДляСпискаВыбора(Документ, ДанныеТаблицы = Ложь) Экспорт
	
	Если ДанныеТаблицы Тогда
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	СписокВыбораТабличныхЧастейРаспознаваниеДокументов.НомерСтрокиТЧ КАК НомерСтрокиТЧ,
		|	СписокВыбораТабличныхЧастейРаспознаваниеДокументов.ИмяРеквизита КАК ИмяРеквизита,
		|	СписокВыбораТабличныхЧастейРаспознаваниеДокументов.ПорядковыйНомер КАК ПорядковыйНомер,
		|	СписокВыбораТабличныхЧастейРаспознаваниеДокументов.Значение КАК Значение,
		|	СписокВыбораТабличныхЧастейРаспознаваниеДокументов.ДополнительноеЗначение КАК ДополнительноеЗначение,
		|	СписокВыбораТабличныхЧастейРаспознаваниеДокументов.Уверенность КАК Уверенность,
		|	СписокВыбораТабличныхЧастейРаспознаваниеДокументов.НайденВТаблицеСоответствий КАК НайденВТаблицеСоответствий
		|ИЗ
		|	РегистрСведений.СписокВыбораТабличныхЧастейРаспознаваниеДокументов КАК СписокВыбораТабличныхЧастейРаспознаваниеДокументов
		|ГДЕ
		|	СписокВыбораТабличныхЧастейРаспознаваниеДокументов.РаспознанныйДокумент = &РаспознанныйДокумент
		|
		|УПОРЯДОЧИТЬ ПО
		|	НайденВТаблицеСоответствий УБЫВ,
		|	Уверенность УБЫВ"
	Иначе
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	СписокВыбораРеквизитовРаспознаваниеДокументов.ИмяРеквизита КАК ИмяРеквизита,
		|	СписокВыбораРеквизитовРаспознаваниеДокументов.ПорядковыйНомер КАК ПорядковыйНомер,
		|	СписокВыбораРеквизитовРаспознаваниеДокументов.Значение КАК Значение,
		|	СписокВыбораРеквизитовРаспознаваниеДокументов.ДополнительноеЗначение КАК ДополнительноеЗначение,
		|	СписокВыбораРеквизитовРаспознаваниеДокументов.Уверенность КАК Уверенность,
		|	СписокВыбораРеквизитовРаспознаваниеДокументов.НайденВТаблицеСоответствий КАК НайденВТаблицеСоответствий
		|ИЗ
		|	РегистрСведений.СписокВыбораРеквизитовРаспознаваниеДокументов КАК СписокВыбораРеквизитовРаспознаваниеДокументов
		|ГДЕ
		|	СписокВыбораРеквизитовРаспознаваниеДокументов.РаспознанныйДокумент = &РаспознанныйДокумент
		|	И (НЕ СписокВыбораРеквизитовРаспознаваниеДокументов.Значение ССЫЛКА Справочник.Организации
		|			ИЛИ СписокВыбораРеквизитовРаспознаваниеДокументов.Значение В (&ДоступныеОрганизации))
		|
		|УПОРЯДОЧИТЬ ПО
		|	НайденВТаблицеСоответствий УБЫВ,
		|	Уверенность УБЫВ";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("РаспознанныйДокумент", Документ);
	Запрос.УстановитьПараметр("ДоступныеОрганизации", ДоступныеОрганизации());
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

Процедура ПриФормированииДанныхТабличныхЧастей(Документ, ИмяТаблицы, АдресJSON, ДанныеСтрок) Экспорт
	
	Если Документ.ТипДокумента = Перечисления.ТипыДокументовРаспознаваниеДокументов.ТОРГ12 И ИмяТаблицы = "ТаблицаТоварнаяНакладная" Тогда
		АдресJSON = ИмяТаблицы + ".";
		ИмяТаблицы = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

Функция ЗначенияВыбораЗначенийТаблицыДокумента(Документ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СписокВыбораТабличныхЧастейРаспознаваниеДокументов.НомерСтрокиТЧ КАК НомерСтроки,
		|	СписокВыбораТабличныхЧастейРаспознаваниеДокументов.ИмяРеквизита КАК ИмяРеквизита,
		|	СписокВыбораТабличныхЧастейРаспознаваниеДокументов.Значение КАК Значение,
		|	СписокВыбораТабличныхЧастейРаспознаваниеДокументов.ДополнительноеЗначение КАК ДополнительноеЗначение,
		|	СписокВыбораТабличныхЧастейРаспознаваниеДокументов.Уверенность КАК Уверенность,
		|	СписокВыбораТабличныхЧастейРаспознаваниеДокументов.НайденВТаблицеСоответствий КАК НайденВТаблицеСоответствий
		|ИЗ
		|	РегистрСведений.СписокВыбораТабличныхЧастейРаспознаваниеДокументов КАК СписокВыбораТабличныхЧастейРаспознаваниеДокументов
		|ГДЕ
		|	СписокВыбораТабличныхЧастейРаспознаваниеДокументов.РаспознанныйДокумент = &Документ
		|
		|УПОРЯДОЧИТЬ ПО
		|	НайденВТаблицеСоответствий УБЫВ,
		|	Уверенность УБЫВ";
	
	Запрос.УстановитьПараметр("Документ", Документ);
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

Процедура ДобавитьВариантыНайденныеПоискомПоНесколькимРеквизитам(ДокументОбъект, ДокументСсылка) Экспорт
	
	ИдентификаторРезультата = ДокументОбъект.ИдентификаторРезультата;
	
	ОбъединяемыеРеквизиты = Новый Массив;
	ОбъединяемыеРеквизиты.Добавить("Наименование");
	ОбъединяемыеРеквизиты.Добавить("НаименованиеПолное");
	ПараметрыОбъединенияРеквизитов = Новый Структура("Наименование", ОбъединяемыеРеквизиты);
	
	// Продавец
	РеквизитыПоискаКонтрагентОрганизация = Новый Структура();
	
	НайденнаяСтрока = ДокументОбъект.РеквизитыДокумента.Найти("Продавец", "ИмяРеквизита");
	Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
		Наименование = РаспознаваниеДокументов.УбратьОрганизационнуюФорму(НайденнаяСтрока.РаспознанныйТекст);
		РеквизитыПоискаКонтрагентОрганизация.Вставить("Наименование", Наименование);
	КонецЕсли;
	
	НайденнаяСтрока = ДокументОбъект.РеквизитыДокумента.Найти("ИННКПППродавца", "ИмяРеквизита");
	Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
		ДобавитьИННКПП(РеквизитыПоискаКонтрагентОрганизация, НайденнаяСтрока.РаспознанныйТекст);
	КонецЕсли;
	НайденнаяСтрока = ДокументОбъект.РеквизитыДокумента.Найти("ИННПродавца", "ИмяРеквизита");
	Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
		РеквизитыПоискаКонтрагентОрганизация.Вставить("ИНН", ИзвлечьЦифрыИзСтроки(НайденнаяСтрока.РаспознанныйТекст));
	КонецЕсли;
	НайденнаяСтрока = ДокументОбъект.РеквизитыДокумента.Найти("КПППродавца", "ИмяРеквизита");
	Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
		РеквизитыПоискаКонтрагентОрганизация.Вставить("КПП", ИзвлечьЦифрыИзСтроки(НайденнаяСтрока.РаспознанныйТекст));
	КонецЕсли;
	
	Если РеквизитыПоискаКонтрагентОрганизация.Количество() Тогда
		Тип = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
		Кандидаты = РаспознаваниеДокументов.ПолучитьКандидатов(
			РеквизитыПоискаКонтрагентОрганизация,
			Тип,
			ПараметрыОбъединенияРеквизитов,
			,
			ИдентификаторРезультата
		);
		
		Для Каждого Кандидат Из Кандидаты Цикл
			
			СвойстваКонтрагента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Кандидат.Ссылка, "Наименование, ИНН");
			
			Наименование = Неопределено;
			ИНН = Неопределено;
			Если Не РеквизитыПоискаКонтрагентОрганизация.Свойство("ИНН", ИНН) Тогда
				
				Схожесть = 0;
				Если РеквизитыПоискаКонтрагентОрганизация.Свойство("Наименование", Наименование) Тогда
					Схожесть = РаспознаваниеДокументовНечеткийПоискСлужебный.СходствоДжароВинклера(
						РаспознаваниеДокументов.УбратьОрганизационнуюФорму(Наименование),
						РаспознаваниеДокументов.УбратьОрганизационнуюФорму(СвойстваКонтрагента.Наименование));
				КонецЕсли;
					
				Если Схожесть > 0.9 Тогда
					Кандидат.Коэффициент = Кандидат.Коэффициент * 0.79;
				Иначе
					Кандидат.Коэффициент = Кандидат.Коэффициент * 0.49;
				КонецЕсли;
				
			Иначе
				
				Если ИНН <> СвойстваКонтрагента.ИНН Тогда
					Кандидат.Коэффициент = Кандидат.Коэффициент * 0.49;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		ДобавитьКандидатовВСписокВыбора(ДокументОбъект, ДокументСсылка, "Продавец", Кандидаты);
	КонецЕсли;
	
	Если РеквизитыПоискаКонтрагентОрганизация.Количество() Тогда
		Тип = ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка");
		Кандидаты = РаспознаваниеДокументов.ПолучитьКандидатов(
			РеквизитыПоискаКонтрагентОрганизация,
			Тип,
			ПараметрыОбъединенияРеквизитов,
			,
			ИдентификаторРезультата
		);
		ДобавитьКандидатовВСписокВыбора(ДокументОбъект, ДокументСсылка, "ПродавецОрганизация", Кандидаты);
	КонецЕсли;
	
	// Покупатель
	РеквизитыПоискаКонтрагентОрганизация = Новый Структура();
	
	НайденнаяСтрока = ДокументОбъект.РеквизитыДокумента.Найти("Покупатель", "ИмяРеквизита");
	Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
		Наименование = РаспознаваниеДокументов.УбратьОрганизационнуюФорму(НайденнаяСтрока.РаспознанныйТекст);
		РеквизитыПоискаКонтрагентОрганизация.Вставить("Наименование", Наименование);
	КонецЕсли;
	
	НайденнаяСтрока = ДокументОбъект.РеквизитыДокумента.Найти("ИННКПППокупателя", "ИмяРеквизита");
	Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
		ДобавитьИННКПП(РеквизитыПоискаКонтрагентОрганизация, НайденнаяСтрока.РаспознанныйТекст);
	КонецЕсли;
	НайденнаяСтрока = ДокументОбъект.РеквизитыДокумента.Найти("ИННПокупателя", "ИмяРеквизита");
	Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
		РеквизитыПоискаКонтрагентОрганизация.Вставить("ИНН", ИзвлечьЦифрыИзСтроки(НайденнаяСтрока.РаспознанныйТекст));
	КонецЕсли;
	НайденнаяСтрока = ДокументОбъект.РеквизитыДокумента.Найти("КПППокупателя", "ИмяРеквизита");
	Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
		РеквизитыПоискаКонтрагентОрганизация.Вставить("КПП", ИзвлечьЦифрыИзСтроки(НайденнаяСтрока.РаспознанныйТекст));
	КонецЕсли;
	
	Если РеквизитыПоискаКонтрагентОрганизация.Количество() Тогда
		Тип = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
		Кандидаты = РаспознаваниеДокументов.ПолучитьКандидатов(
			РеквизитыПоискаКонтрагентОрганизация,
			Тип,
			ПараметрыОбъединенияРеквизитов,
			,
			ИдентификаторРезультата
		);
		
		Для Каждого Кандидат Из Кандидаты Цикл
			
			СвойстваКонтрагента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Кандидат.Ссылка, "Наименование, ИНН");
			
			Наименование = Неопределено;
			ИНН = Неопределено;
			Если Не РеквизитыПоискаКонтрагентОрганизация.Свойство("ИНН", ИНН) Тогда
				
				Схожесть = 0;
				Если РеквизитыПоискаКонтрагентОрганизация.Свойство("Наименование", Наименование) Тогда
					Схожесть = РаспознаваниеДокументовНечеткийПоискСлужебный.СходствоДжароВинклера(
						РаспознаваниеДокументов.УбратьОрганизационнуюФорму(Наименование),
						РаспознаваниеДокументов.УбратьОрганизационнуюФорму(СвойстваКонтрагента.Наименование));
				КонецЕсли;
					
				Если Схожесть > 0.9 Тогда
					Кандидат.Коэффициент = Кандидат.Коэффициент * 0.79;
				Иначе
					Кандидат.Коэффициент = Кандидат.Коэффициент * 0.49;
				КонецЕсли;
				
			Иначе
				
				Если ИНН <> СвойстваКонтрагента.ИНН Тогда
					Кандидат.Коэффициент = Кандидат.Коэффициент * 0.49;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		ДобавитьКандидатовВСписокВыбора(ДокументОбъект, ДокументСсылка, "Покупатель", Кандидаты);
	КонецЕсли;
	
	Если РеквизитыПоискаКонтрагентОрганизация.Количество() Тогда
		Тип = ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка");
		Кандидаты = РаспознаваниеДокументов.ПолучитьКандидатов(
			РеквизитыПоискаКонтрагентОрганизация,
			Тип,
			ПараметрыОбъединенияРеквизитов,
			,
			ИдентификаторРезультата
		);
		ДобавитьКандидатовВСписокВыбора(ДокументОбъект, ДокументСсылка, "ПокупательОрганизация", Кандидаты);
	КонецЕсли;
	
	// Грузополучатель
	РеквизитыПоискаКонтрагентОрганизация = Новый Структура();
	
	НайденнаяСтрока = ДокументОбъект.РеквизитыДокумента.Найти("Грузополучатель", "ИмяРеквизита");
	Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
		Наименование = РаспознаваниеДокументов.УбратьОрганизационнуюФорму(НайденнаяСтрока.РаспознанныйТекст);
		РеквизитыПоискаКонтрагентОрганизация.Вставить("Наименование", Наименование);
	КонецЕсли;
	
	НайденнаяСтрока = ДокументОбъект.РеквизитыДокумента.Найти("ИННКППГрузополучателя", "ИмяРеквизита");
	Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
		ДобавитьИННКПП(РеквизитыПоискаКонтрагентОрганизация, НайденнаяСтрока.РаспознанныйТекст);
	КонецЕсли;
	НайденнаяСтрока = ДокументОбъект.РеквизитыДокумента.Найти("ИННГрузополучателя", "ИмяРеквизита");
	Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
		РеквизитыПоискаКонтрагентОрганизация.Вставить("ИНН", ИзвлечьЦифрыИзСтроки(НайденнаяСтрока.РаспознанныйТекст));
	КонецЕсли;
	НайденнаяСтрока = ДокументОбъект.РеквизитыДокумента.Найти("КППГрузополучателя", "ИмяРеквизита");
	Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
		РеквизитыПоискаКонтрагентОрганизация.Вставить("КПП", ИзвлечьЦифрыИзСтроки(НайденнаяСтрока.РаспознанныйТекст));
	КонецЕсли;
	
	Если РеквизитыПоискаКонтрагентОрганизация.Количество() Тогда
		Тип = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
		Кандидаты = РаспознаваниеДокументов.ПолучитьКандидатов(
			РеквизитыПоискаКонтрагентОрганизация,
			Тип,
			ПараметрыОбъединенияРеквизитов,
			,
			ИдентификаторРезультата
		);
		ДобавитьКандидатовВСписокВыбора(ДокументОбъект, ДокументСсылка, "Грузополучатель", Кандидаты);
	КонецЕсли;
	
	// Грузоотправитель
	РеквизитыПоискаКонтрагентОрганизация = Новый Структура();
	
	НайденнаяСтрока = ДокументОбъект.РеквизитыДокумента.Найти("Грузоотправитель", "ИмяРеквизита");
	Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
		Наименование = РаспознаваниеДокументов.УбратьОрганизационнуюФорму(НайденнаяСтрока.РаспознанныйТекст);
		РеквизитыПоискаКонтрагентОрганизация.Вставить("Наименование", Наименование);
	КонецЕсли;
	
	НайденнаяСтрока = ДокументОбъект.РеквизитыДокумента.Найти("ИННКППГрузоотправителя", "ИмяРеквизита");
	Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
		ДобавитьИННКПП(РеквизитыПоискаКонтрагентОрганизация, НайденнаяСтрока.РаспознанныйТекст);
	КонецЕсли;
	НайденнаяСтрока = ДокументОбъект.РеквизитыДокумента.Найти("ИННГрузоотправителя", "ИмяРеквизита");
	Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
		РеквизитыПоискаКонтрагентОрганизация.Вставить("ИНН", ИзвлечьЦифрыИзСтроки(НайденнаяСтрока.РаспознанныйТекст));
	КонецЕсли;
	НайденнаяСтрока = ДокументОбъект.РеквизитыДокумента.Найти("КППГрузоотправителя", "ИмяРеквизита");
	Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
		РеквизитыПоискаКонтрагентОрганизация.Вставить("КПП", ИзвлечьЦифрыИзСтроки(НайденнаяСтрока.РаспознанныйТекст));
	КонецЕсли;
	
	Если РеквизитыПоискаКонтрагентОрганизация.Количество() Тогда
		Тип = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
		Кандидаты = РаспознаваниеДокументов.ПолучитьКандидатов(
			РеквизитыПоискаКонтрагентОрганизация,
			Тип,
			ПараметрыОбъединенияРеквизитов,
			,
			ИдентификаторРезультата
		);
		ДобавитьКандидатовВСписокВыбора(ДокументОбъект, ДокументСсылка, "Грузоотправитель", Кандидаты);
	КонецЕсли;
	
	// Исполнитель
	РеквизитыПоискаКонтрагентОрганизация = Новый Структура();
	НайденнаяСтрока = ДокументОбъект.РеквизитыДокумента.Найти("Исполнитель", "ИмяРеквизита");
	Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
		Наименование = РаспознаваниеДокументов.УбратьОрганизационнуюФорму(НайденнаяСтрока.РаспознанныйТекст);
		РеквизитыПоискаКонтрагентОрганизация.Вставить("Наименование", Наименование);
	КонецЕсли;
	НайденнаяСтрока = ДокументОбъект.РеквизитыДокумента.Найти("ИННИсполнителя", "ИмяРеквизита");
	Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
		РеквизитыПоискаКонтрагентОрганизация.Вставить("ИНН", ИзвлечьЦифрыИзСтроки(НайденнаяСтрока.РаспознанныйТекст));
	КонецЕсли;
	НайденнаяСтрока = ДокументОбъект.РеквизитыДокумента.Найти("КППИсполнителя", "ИмяРеквизита");
	Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
		РеквизитыПоискаКонтрагентОрганизация.Вставить("КПП", ИзвлечьЦифрыИзСтроки(НайденнаяСтрока.РаспознанныйТекст));
	КонецЕсли;
	Если РеквизитыПоискаКонтрагентОрганизация.Количество() Тогда
		Тип = ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка");
		Кандидаты = РаспознаваниеДокументов.ПолучитьКандидатов(
			РеквизитыПоискаКонтрагентОрганизация,
			Тип,
			ПараметрыОбъединенияРеквизитов,
			,
			ИдентификаторРезультата
		);
		ДобавитьКандидатовВСписокВыбора(ДокументОбъект, ДокументСсылка, "Исполнитель", Кандидаты);
	КонецЕсли;
	
	// Банк
	РеквизитыПоискаКонтрагентОрганизация = Новый Структура();
	НайденнаяСтрока = ДокументОбъект.РеквизитыДокумента.Найти("Банк", "ИмяРеквизита");
	Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
		РеквизитыПоискаКонтрагентОрганизация.Вставить("Код", ИзвлечьЦифрыИзСтроки(НайденнаяСтрока.РаспознанныйТекст));
	КонецЕсли;
	Если РеквизитыПоискаКонтрагентОрганизация.Количество() Тогда
		Тип = ПредопределенноеЗначение("Справочник.Банки.ПустаяСсылка");
		Кандидаты = РаспознаваниеДокументов.ПолучитьКандидатов(
			РеквизитыПоискаКонтрагентОрганизация,
			Тип,
			,
			,
			ИдентификаторРезультата
		);
		ДобавитьКандидатовВСписокВыбора(ДокументОбъект, ДокументСсылка, "Банк", Кандидаты);
	КонецЕсли;
	
	// Банковский счет
	РеквизитыПоискаКонтрагентОрганизация = Новый Структура();
	НайденнаяСтрока = ДокументОбъект.РеквизитыДокумента.Найти("БанковскийСчетКонтрагента", "ИмяРеквизита");
	Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
		РеквизитыПоискаКонтрагентОрганизация.Вставить("НомерСчета", ИзвлечьЦифрыИзСтроки(НайденнаяСтрока.РаспознанныйТекст));
	КонецЕсли;
	Если РеквизитыПоискаКонтрагентОрганизация.Количество() Тогда
		Тип = ПредопределенноеЗначение("Справочник.БанковскиеСчета.ПустаяСсылка");
		Кандидаты = РаспознаваниеДокументов.ПолучитьКандидатов(
			РеквизитыПоискаКонтрагентОрганизация,
			Тип,
			,
			,
			ИдентификаторРезультата
		);
		
		Для Каждого Кандидат Из Кандидаты Цикл
			Если РеквизитыПоискаКонтрагентОрганизация.НомерСчета
				<> ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Кандидат.Ссылка, "НомерСчета") Тогда
					Кандидат.Коэффициент = Кандидат.Коэффициент * 0.49;
			КонецЕсли;
		КонецЦикла;
		
		ДобавитьКандидатовВСписокВыбора(ДокументОбъект, ДокументСсылка, "БанковскийСчетКонтрагента", Кандидаты);
		ДобавитьКандидатовВСписокВыбора(ДокументОбъект, ДокументСсылка, "БанковскийСчетОрганизации", Кандидаты);
	КонецЕсли;
	
	//////////////////////////////
	// Табличная часть
	/////////////////////////////
	
	// Номенклатура
	НайденныеСтроки = ДокументОбъект.РеквизитыТабличныхЧастей.НайтиСтроки(Новый Структура("ИмяРеквизита", "Номенклатура"));
	
	Для Каждого СтрокаТаблицы Из НайденныеСтроки Цикл
		
		// Номенклатура
		
		РеквизитыПоискаКонтрагентОрганизация = Новый Структура();
		РеквизитыПоискаКонтрагентОрганизация.Вставить("Наименование", СтрокаТаблицы.РаспознанныйТекст);
		
		Отбор = Новый Структура("ИмяРеквизита, НомерСтрокиТЧ", "Артикул", СтрокаТаблицы.НомерСтрокиТЧ);
		НайденнаяСтрока = ДокументОбъект.РеквизитыТабличныхЧастей.НайтиСтроки(Отбор);
		Если НайденнаяСтрока.Количество() <> 0 Тогда
			Артикул = ИзвлечьАртикулИзСтроки(НайденнаяСтрока[0].РаспознанныйТекст);
			Если Не ПустаяСтрока(Артикул) Тогда
				РеквизитыПоискаКонтрагентОрганизация.Вставить("Артикул", Артикул);
			КонецЕсли;
		КонецЕсли;
		
		Тип = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
		Кандидаты = РаспознаваниеДокументов.ПолучитьКандидатов(
			РеквизитыПоискаКонтрагентОрганизация,
			Тип,
			ПараметрыОбъединенияРеквизитов
			,
			,
			ИдентификаторРезультата
		);
		ДобавитьКандидатовВСписокВыбора(ДокументОбъект, ДокументСсылка, "Номенклатура", Кандидаты, СтрокаТаблицы.НомерСтрокиТЧ);
		
		// СтранаПроисхождения
		
		РеквизитыПоискаКонтрагентОрганизация = Новый Структура();
		Отбор = Новый Структура("ИмяРеквизита, НомерСтрокиТЧ", "СтранаПроисхождения", СтрокаТаблицы.НомерСтрокиТЧ);
		НайденнаяСтрока = ДокументОбъект.РеквизитыТабличныхЧастей.НайтиСтроки(Отбор);
		Если НайденнаяСтрока.Количество() <> 0 И НЕ ПустаяСтрока(НайденнаяСтрока[0].РаспознанныйТекст) Тогда
			РеквизитыПоискаКонтрагентОрганизация.Вставить("Наименование", НайденнаяСтрока[0].РаспознанныйТекст);
		КонецЕсли;
		Отбор.ИмяРеквизита = "КодСтраныПроисхождения";
		НайденнаяСтрока = ДокументОбъект.РеквизитыТабличныхЧастей.НайтиСтроки(Отбор);
		Если НайденнаяСтрока.Количество() <> 0 Тогда
			Код = ИзвлечьЦифрыИзСтроки(НайденнаяСтрока[0].РаспознанныйТекст);
			Если Не ПустаяСтрока(Код) Тогда
				РеквизитыПоискаКонтрагентОрганизация.Вставить("Код", Код);
			КонецЕсли;
		КонецЕсли;
		Если РеквизитыПоискаКонтрагентОрганизация.Количество() Тогда
			Тип = ПредопределенноеЗначение("Справочник.СтраныМира.ПустаяСсылка");
			Кандидаты = РаспознаваниеДокументов.ПолучитьКандидатов(
				РеквизитыПоискаКонтрагентОрганизация,
				Тип,
				ПараметрыОбъединенияРеквизитов,
				,
				ИдентификаторРезультата
			);
			
			СтранаНайдена = Ложь;
			Для Каждого Кандидат Из Кандидаты Цикл
				Если Кандидат.Коэффициент * 100 >= РаспознаваниеДокументовСлужебныйКлиентСервер.ГраницаУверенныхЗначений() Тогда
					СтранаНайдена = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
				
			Если Не СтранаНайдена Тогда
				ДобавитьСтрануПоКлассификатору(РеквизитыПоискаКонтрагентОрганизация, Кандидаты);
			КонецЕсли;
			
			ДобавитьКандидатовВСписокВыбора(ДокументОбъект, ДокументСсылка, "СтранаПроисхождения", Кандидаты, СтрокаТаблицы.НомерСтрокиТЧ);
		КонецЕсли;
		
		РеквизитыПоискаКонтрагентОрганизация = Новый Структура();
		Отбор = Новый Структура("ИмяРеквизита, НомерСтрокиТЧ", "СтранаПроисхожденияДоКорректировки", СтрокаТаблицы.НомерСтрокиТЧ);
		НайденнаяСтрока = ДокументОбъект.РеквизитыТабличныхЧастей.НайтиСтроки(Отбор);
		Если НайденнаяСтрока.Количество() <> 0 И НЕ ПустаяСтрока(НайденнаяСтрока[0].РаспознанныйТекст) Тогда
			РеквизитыПоискаКонтрагентОрганизация.Вставить("Наименование", НайденнаяСтрока[0].РаспознанныйТекст);
		КонецЕсли;
		Отбор.ИмяРеквизита = "КодСтраныПроисхождения";
		НайденнаяСтрока = ДокументОбъект.РеквизитыТабличныхЧастей.НайтиСтроки(Отбор);
		Если НайденнаяСтрока.Количество() <> 0 Тогда
			Код = ИзвлечьЦифрыИзСтроки(НайденнаяСтрока[0].РаспознанныйТекст);
			Если Не ПустаяСтрока(Код) Тогда
				РеквизитыПоискаКонтрагентОрганизация.Вставить("Код", Код);
			КонецЕсли;
		КонецЕсли;
		Если РеквизитыПоискаКонтрагентОрганизация.Количество() Тогда
			Тип = ПредопределенноеЗначение("Справочник.СтраныМира.ПустаяСсылка");
			Кандидаты = РаспознаваниеДокументов.ПолучитьКандидатов(
				РеквизитыПоискаКонтрагентОрганизация,
				Тип,
				ПараметрыОбъединенияРеквизитов,
				,
				ИдентификаторРезультата
			);
			ДобавитьКандидатовВСписокВыбора(ДокументОбъект, ДокументСсылка, "СтранаПроисхожденияДоКорректировки", Кандидаты, СтрокаТаблицы.НомерСтрокиТЧ);
		КонецЕсли;
		
		// ЕдиницаИзмерения
		
		РеквизитыПоискаКонтрагентОрганизация = Новый Структура();
		Отбор = Новый Структура("ИмяРеквизита, НомерСтрокиТЧ", "ЕдиницаИзмерения", СтрокаТаблицы.НомерСтрокиТЧ);
		НайденнаяСтрока = ДокументОбъект.РеквизитыТабличныхЧастей.НайтиСтроки(Отбор);
		Если НайденнаяСтрока.Количество() <> 0 И НЕ ПустаяСтрока(НайденнаяСтрока[0].РаспознанныйТекст) Тогда
			РеквизитыПоискаКонтрагентОрганизация.Вставить("Наименование", НайденнаяСтрока[0].РаспознанныйТекст);
		КонецЕсли;
		Отбор.ИмяРеквизита = "КодЕдиницыИзмерения";
		НайденнаяСтрока = ДокументОбъект.РеквизитыТабличныхЧастей.НайтиСтроки(Отбор);
		Если НайденнаяСтрока.Количество() <> 0 Тогда
			Код = ИзвлечьЦифрыИзСтроки(НайденнаяСтрока[0].РаспознанныйТекст);
			Если Не ПустаяСтрока(Код) Тогда
				РеквизитыПоискаКонтрагентОрганизация.Вставить("Код", Код);
			КонецЕсли;
		КонецЕсли;
		Если РеквизитыПоискаКонтрагентОрганизация.Количество() Тогда
			Тип = ПредопределенноеЗначение("Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка");
			Кандидаты = РаспознаваниеДокументов.ПолучитьКандидатов(
				РеквизитыПоискаКонтрагентОрганизация,
				Тип,
				ПараметрыОбъединенияРеквизитов,
				,
				ИдентификаторРезультата
			);
			ДобавитьКандидатовВСписокВыбора(ДокументОбъект, ДокументСсылка, "ЕдиницаИзмерения", Кандидаты, СтрокаТаблицы.НомерСтрокиТЧ);
		КонецЕсли;
		
		// СтавкаНДС
		
		РеквизитыПоискаКонтрагентОрганизация = Новый Структура();
		Отбор = Новый Структура("ИмяРеквизита, НомерСтрокиТЧ", "СтавкаНДС", СтрокаТаблицы.НомерСтрокиТЧ);
		НайденнаяСтрока = ДокументОбъект.РеквизитыТабличныхЧастей.НайтиСтроки(Отбор);
		Если НайденнаяСтрока.Количество() <> 0 И НЕ ПустаяСтрока(НайденнаяСтрока[0].РаспознанныйТекст) Тогда
			РеквизитыПоискаКонтрагентОрганизация.Вставить("Представление", НайденнаяСтрока[0].РаспознанныйТекст);
		КонецЕсли;
		Если РеквизитыПоискаКонтрагентОрганизация.Количество() Тогда
			
			Тип = Новый(Метаданные.ОпределяемыеТипы.СтавкаНДСБРД.Тип.Типы()[0]);
			
			Кандидаты = РаспознаваниеДокументов.ПолучитьКандидатов(
				РеквизитыПоискаКонтрагентОрганизация,
				Тип,
				ПараметрыОбъединенияРеквизитов,
				,
				ИдентификаторРезультата
			);
			ДобавитьКандидатовВСписокВыбора(ДокументОбъект, ДокументСсылка, "СтавкаНДС", Кандидаты, СтрокаТаблицы.НомерСтрокиТЧ);
		КонецЕсли;
		
		// СтавкаНДСДоКорректировки
		РеквизитыПоискаКонтрагентОрганизация = Новый Структура();
		Отбор = Новый Структура("ИмяРеквизита, НомерСтрокиТЧ", "СтавкаНДСДоКорректировки", СтрокаТаблицы.НомерСтрокиТЧ);
		НайденнаяСтрока = ДокументОбъект.РеквизитыТабличныхЧастей.НайтиСтроки(Отбор);
		Если НайденнаяСтрока.Количество() <> 0 И НЕ ПустаяСтрока(НайденнаяСтрока[0].РаспознанныйТекст) Тогда
			РеквизитыПоискаКонтрагентОрганизация.Вставить("Представление", НайденнаяСтрока[0].РаспознанныйТекст);
		КонецЕсли;
		Если РеквизитыПоискаКонтрагентОрганизация.Количество() Тогда
			
			Тип = Новый(Метаданные.ОпределяемыеТипы.СтавкаНДСБРД.Тип.Типы()[0]);
			
			Кандидаты = РаспознаваниеДокументов.ПолучитьКандидатов(
				РеквизитыПоискаКонтрагентОрганизация,
				Тип,
				ПараметрыОбъединенияРеквизитов,
				,
				ИдентификаторРезультата
			);
			ДобавитьКандидатовВСписокВыбора(ДокументОбъект, ДокументСсылка, "СтавкаНДСДоКорректировки", Кандидаты, СтрокаТаблицы.НомерСтрокиТЧ);
		КонецЕсли;
		
		// НомерГТД
		
		РеквизитыПоискаКонтрагентОрганизация = Новый Структура();
		Отбор = Новый Структура("ИмяРеквизита, НомерСтрокиТЧ", "НомерГТД", СтрокаТаблицы.НомерСтрокиТЧ);
		НайденнаяСтрока = ДокументОбъект.РеквизитыТабличныхЧастей.НайтиСтроки(Отбор);
		Если НайденнаяСтрока.Количество() <> 0 И НЕ ПустаяСтрока(НайденнаяСтрока[0].РаспознанныйТекст) Тогда
			РеквизитыПоискаКонтрагентОрганизация.Вставить("Код", НайденнаяСтрока[0].РаспознанныйТекст);
			
			НомерГТД = ИзвлечьГТДИзСтроки(НайденнаяСтрока[0].РаспознанныйТекст);
			ОтборМетаданных = Новый Массив;
			ОтборМетаданных.Добавить(Новый Структура("Свойство, ВидСравнения, Значение",
				"Код", "=", НомерГТД));
		КонецЕсли;
		
		Если РеквизитыПоискаКонтрагентОрганизация.Количество() Тогда
			Тип = ПредопределенноеЗначение("Справочник.НомераГТД.ПустаяСсылка");
			Кандидаты = РаспознаваниеДокументов.ПолучитьКандидатов(
				РеквизитыПоискаКонтрагентОрганизация,
				Тип,
				ПараметрыОбъединенияРеквизитов,
				ОтборМетаданных,
				ИдентификаторРезультата
			);
			ДобавитьКандидатовВСписокВыбора(ДокументОбъект, ДокументСсылка, "НомерГТД", Кандидаты, СтрокаТаблицы.НомерСтрокиТЧ);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьСтрануПоКлассификатору(РеквизитыПоиска, Кандидаты)
	
	Если Не РеквизитыПоиска.Свойство("Наименование") Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаКлассификатора = РаботаСАдресами.ТаблицаКлассификатора();
	
	МаксимальнаяСхожесть = 0;
	НайденнаяСтрока = Неопределено;
	Для Каждого Строка Из ТаблицаКлассификатора Цикл
		
		Схожесть = РаспознаваниеДокументовНечеткийПоискСлужебный.СравнитьСтрокиПоДжароВинклеру(
			РеквизитыПоиска.Наименование, Строка.Наименование);
			
		Если Схожесть > МаксимальнаяСхожесть Тогда
			МаксимальнаяСхожесть = Схожесть;
			НайденнаяСтрока = Строка;
		КонецЕсли;
	КонецЦикла;
	
	Если МаксимальнаяСхожесть > 0.9 Тогда
		
		Попытка
			СтранаМира = УправлениеКонтактнойИнформацией.СтранаМираПоКодуИлиНаименованию(НайденнаяСтрока.Код);
		Исключение
			Возврат;
		КонецПопытки;
		
		НовыйКандидат = Кандидаты.Добавить();
		НовыйКандидат.Ссылка = СтранаМира;
		НовыйКандидат.Коэффициент = МаксимальнаяСхожесть;
		
		Кандидаты.Сортировать("Коэффициент Убыв");
	КонецЕсли;
	
КонецПроцедуры


Процедура ЗаполнитьСпискиВыбораРеквизитаШапкиДокументов(ПараметрыОперации, АдресРезультата) Экспорт
	
	Для Каждого ДокументСсылка Из ПараметрыОперации.РаспознанныеДокументы Цикл
		ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
		Для Каждого ИмяРеквизита Из ПараметрыОперации.ИменаРеквизитов Цикл
			ЗаполнитьСпискиВыбораРеквизитаШапкиДокумента(ДокументОбъект, ДокументСсылка, ИмяРеквизита);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСпискиВыбораРеквизитаШапкиДокумента(ДокументОбъект, ДокументСсылка, ИмяРеквизита)
	
	ИдентификаторРезультата = ДокументОбъект.ИдентификаторРезультата;
	
	ОбъединяемыеРеквизиты = Новый Массив;
	ОбъединяемыеРеквизиты.Добавить("Наименование");
	ОбъединяемыеРеквизиты.Добавить("НаименованиеПолное");
	ПараметрыОбъединенияРеквизитов = Новый Структура("Наименование", ОбъединяемыеРеквизиты);
	
	Если ИмяРеквизита = "Контрагент" Тогда
		
		// Продавец
		РеквизитыПоискаКонтрагентОрганизация = Новый Структура();
		
		НайденнаяСтрока = ДокументОбъект.РеквизитыДокумента.Найти("Продавец", "ИмяРеквизита");
		Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
			Наименование = РаспознаваниеДокументов.УбратьОрганизационнуюФорму(НайденнаяСтрока.РаспознанныйТекст);
			РеквизитыПоискаКонтрагентОрганизация.Вставить("Наименование", Наименование);
		КонецЕсли;
		
		НайденнаяСтрока = ДокументОбъект.РеквизитыДокумента.Найти("ИННКПППродавца", "ИмяРеквизита");
		Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
			ДобавитьИННКПП(РеквизитыПоискаКонтрагентОрганизация, НайденнаяСтрока.РаспознанныйТекст);
		КонецЕсли;
		НайденнаяСтрока = ДокументОбъект.РеквизитыДокумента.Найти("ИННПродавца", "ИмяРеквизита");
		Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
			РеквизитыПоискаКонтрагентОрганизация.Вставить("ИНН", ИзвлечьЦифрыИзСтроки(НайденнаяСтрока.РаспознанныйТекст));
		КонецЕсли;
		НайденнаяСтрока = ДокументОбъект.РеквизитыДокумента.Найти("КПППродавца", "ИмяРеквизита");
		Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
			РеквизитыПоискаКонтрагентОрганизация.Вставить("КПП", ИзвлечьЦифрыИзСтроки(НайденнаяСтрока.РаспознанныйТекст));
		КонецЕсли;
		
		Если РеквизитыПоискаКонтрагентОрганизация.Количество() Тогда
			Тип = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
			Кандидаты = РаспознаваниеДокументов.ПолучитьКандидатов(
				РеквизитыПоискаКонтрагентОрганизация,
				Тип,
				ПараметрыОбъединенияРеквизитов,
				,
				ИдентификаторРезультата
			);
			ДобавитьКандидатовВСписокВыбора(ДокументОбъект, ДокументСсылка, "Продавец", Кандидаты);
		КонецЕсли;
		
		// Покупатель
		РеквизитыПоискаКонтрагентОрганизация = Новый Структура();
		
		НайденнаяСтрока = ДокументОбъект.РеквизитыДокумента.Найти("Покупатель", "ИмяРеквизита");
		Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
			Наименование = РаспознаваниеДокументов.УбратьОрганизационнуюФорму(НайденнаяСтрока.РаспознанныйТекст);
			РеквизитыПоискаКонтрагентОрганизация.Вставить("Наименование", Наименование);
		КонецЕсли;
		
		НайденнаяСтрока = ДокументОбъект.РеквизитыДокумента.Найти("ИННКПППокупателя", "ИмяРеквизита");
		Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
			ДобавитьИННКПП(РеквизитыПоискаКонтрагентОрганизация, НайденнаяСтрока.РаспознанныйТекст);
		КонецЕсли;
		НайденнаяСтрока = ДокументОбъект.РеквизитыДокумента.Найти("ИННПокупателя", "ИмяРеквизита");
		Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
			РеквизитыПоискаКонтрагентОрганизация.Вставить("ИНН", ИзвлечьЦифрыИзСтроки(НайденнаяСтрока.РаспознанныйТекст));
		КонецЕсли;
		НайденнаяСтрока = ДокументОбъект.РеквизитыДокумента.Найти("КПППокупателя", "ИмяРеквизита");
		Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
			РеквизитыПоискаКонтрагентОрганизация.Вставить("КПП", ИзвлечьЦифрыИзСтроки(НайденнаяСтрока.РаспознанныйТекст));
		КонецЕсли;
		
		Если РеквизитыПоискаКонтрагентОрганизация.Количество() Тогда
			Тип = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
			Кандидаты = РаспознаваниеДокументов.ПолучитьКандидатов(
				РеквизитыПоискаКонтрагентОрганизация,
				Тип,
				ПараметрыОбъединенияРеквизитов,
				,
				ИдентификаторРезультата
			);
			ДобавитьКандидатовВСписокВыбора(ДокументОбъект, ДокументСсылка, "Покупатель", Кандидаты);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция СоздатьДокументНаОснованииРаспознанного(РаспознанныйДокумент, ТипСоздаваемогоДокумента, ПараметрыЗаполнения, РежимЗаписи = Неопределено) Экспорт

	// {УАТ}
	ЕстьПустаяНоменклатура = Ложь; 
	
	ЕстьУслуги = Ложь;
	ЕстьТовары = Ложь;
	Если ТипСоздаваемогоДокумента = "уатСчетНаОплатуПоставщика" Тогда
		ЕстьУслуги = Истина;
		ЕстьТовары = Истина; 
	ИначеЕсли ТипСоздаваемогоДокумента = "уатСчетНаОплатуПокупателю" Тогда
		ЕстьУслуги = Истина;
	ИначеЕсли ТипСоздаваемогоДокумента = "уатРеализацияУслуг" Тогда
		ЕстьУслуги = Истина;
	ИначеЕсли ТипСоздаваемогоДокумента = "уатПоступлениеТоваровУслуг" Тогда
		ЕстьУслуги = Истина;
		ЕстьТовары = Истина;
	КонецЕсли;
	
	мсвУслуг   = Новый Массив(); 
	мсвТоваров = Новый Массив(); 
	
	Если ПараметрыЗаполнения.Свойство("Товары") Тогда
		Для Каждого СтрокаТаблицы Из ПараметрыЗаполнения.Товары Цикл
			Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) Тогда
				ЕстьПустаяНоменклатура = Истина;
				
				ЭтоСообщение = Новый СообщениеПользователю;
				ЭтоСообщение.Текст = НСтр("ru = 'Не заполнена колонка ""Номенклатура"" в строке '; en = 'The ""Items"" column is not filled in line '") + СтрокаТаблицы.ПорядокСтроки;
				ЭтоСообщение.Поле = СтрШаблон("ТаблицаДокумента[%1].Номенклатура", Формат(СтрокаТаблицы.ПорядокСтроки - 1, "ЧГ="));
				ЭтоСообщение.Сообщить();
			КонецЕсли;
			Если СтрокаТаблицы.Свойство("ЕдиницаИзмерения") Тогда
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ЕдиницаИзмерения)
					ИЛИ ТипЗнч(СтрокаТаблицы.ЕдиницаИзмерения) <> Тип("СправочникСсылка.ЕдиницыИзмерения") Тогда
					СтрокаТаблицы.ЕдиницаИзмерения = СтрокаТаблицы.Номенклатура.ЕдиницаХраненияОстатков; 
				Конецесли;
			Иначе
				СтрокаТаблицы.Вставить("ЕдиницаИзмерения", СтрокаТаблицы.Номенклатура.ЕдиницаХраненияОстатков);
			КонецЕсли;    
			
			СтрокаТаблицы.Вставить("СтатьяРасходов",
				уатОбщегоНазначенияСервер.СтатьяРасходовНоменклатуры(СтрокаТаблицы.Номенклатура)); 
			СтрокаТаблицы.Вставить("СтатьяДоходов",
				уатОбщегоНазначенияСервер.СтатьяДоходовНоменклатуры(СтрокаТаблицы.Номенклатура));
			СтрокаТаблицы.Вставить("Содержание",
				уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(СтрокаТаблицы.Номенклатура, "НаименованиеПолное"));

			Если СтрокаТаблицы.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Услуга Тогда
				мсвУслуг.Добавить(СтрокаТаблицы); 
			Иначе
				мсвТоваров.Добавить(СтрокаТаблицы);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ПараметрыЗаполнения.Свойство("Услуги") Тогда   
		Для Каждого СтрокаТаблицы Из ПараметрыЗаполнения.Услуги Цикл
			Если Не ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) Тогда
				ЕстьПустаяНоменклатура = Истина;
				
				ЭтоСообщение = Новый СообщениеПользователю;
				ЭтоСообщение.Текст = НСтр("ru = 'Не заполнена колонка ""Номенклатура"" в строке '; en = 'The ""Items"" column is not filled in line '") + СтрокаТаблицы.ПорядокСтроки;
				ЭтоСообщение.Поле = СтрШаблон("ТаблицаДокумента[%1].Номенклатура", Формат(СтрокаТаблицы.ПорядокСтроки - 1, "ЧГ="));
				ЭтоСообщение.Сообщить();
			КонецЕсли;  
			Если СтрокаТаблицы.Свойство("ЕдиницаИзмерения") Тогда
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ЕдиницаИзмерения) Тогда
					СтрокаТаблицы.ЕдиницаИзмерения = СтрокаТаблицы.Номенклатура.ЕдиницаХраненияОстатков; 
				Конецесли;
			Иначе
				СтрокаТаблицы.Вставить("ЕдиницаИзмерения", СтрокаТаблицы.Номенклатура.ЕдиницаХраненияОстатков);
			КонецЕсли; 
			
			СтрокаТаблицы.Вставить("СтатьяРасходов",
				уатОбщегоНазначенияСервер.СтатьяРасходовНоменклатуры(СтрокаТаблицы.Номенклатура)); 
			СтрокаТаблицы.Вставить("СтатьяДоходов",
				уатОбщегоНазначенияСервер.СтатьяДоходовНоменклатуры(СтрокаТаблицы.Номенклатура));
			СтрокаТаблицы.Вставить("Содержание",
				уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(СтрокаТаблицы.Номенклатура, "НаименованиеПолное"));

			Если СтрокаТаблицы.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Услуга Тогда
				мсвУслуг.Добавить(СтрокаТаблицы); 
			Иначе
				мсвТоваров.Добавить(СтрокаТаблицы);
			КонецЕсли; 
		
		КонецЦикла;
	КонецЕсли;
	
	Если ПараметрыЗаполнения.Свойство("Организация") Тогда 
		Организация = Неопределено;
		Если РаспознанныйДокумент.Направление = Перечисления.НаправленияРаспознанногоДокумента.Входящий Тогда
			Если ПараметрыЗаполнения.Свойство("Исполнитель") 
				И ЗначениеЗаполнено(ПараметрыЗаполнения.Исполнитель) Тогда 
				Организация = ПараметрыЗаполнения.Исполнитель;
			ИначеЕсли ПараметрыЗаполнения.Свойство("ПокупательОрганизация") 
				И ЗначениеЗаполнено(ПараметрыЗаполнения.ПокупательОрганизация) Тогда 
				Организация = ПараметрыЗаполнения.ПокупательОрганизация;
			КонецЕсли;
		Иначе 
			Если ЗначениеЗаполнено(ПараметрыЗаполнения.Организация) Тогда
				Организация = ПараметрыЗаполнения.Организация;
			ИначеЕсли ПараметрыЗаполнения.Свойство("ПокупательОрганизация") 
				И ЗначениеЗаполнено(ПараметрыЗаполнения.ПокупательОрганизация) Тогда 
				Организация = ПараметрыЗаполнения.ПокупательОрганизация;
			ИначеЕсли ПараметрыЗаполнения.Свойство("Исполнитель") 
				И ЗначениеЗаполнено(ПараметрыЗаполнения.Исполнитель) Тогда 
				Организация = ПараметрыЗаполнения.Исполнитель;
			КонецЕсли; 
		Конецесли;
		Если ЗначениеЗаполнено(Организация) Тогда
			ПараметрыЗаполнения.Организация = Организация;
		КонецЕсли;	
	КонецЕсли;
	Если ПараметрыЗаполнения.Свойство("Контрагент") Тогда
		Контрагент = Неопределено;
		Если РаспознанныйДокумент.Направление = Перечисления.НаправленияРаспознанногоДокумента.Входящий Тогда
			Если ПараметрыЗаполнения.Свойство("Продавец") 
				И ЗначениеЗаполнено(ПараметрыЗаполнения.Продавец) Тогда 
				Контрагент = ПараметрыЗаполнения.Продавец;
			ИначеЕсли ПараметрыЗаполнения.Свойство("Покупатель") 
				И ЗначениеЗаполнено(ПараметрыЗаполнения.Покупатель) Тогда 
				Контрагент = ПараметрыЗаполнения.Покупатель;
			КонецЕсли;
			
		Иначе
			Если ПараметрыЗаполнения.Свойство("Покупатель") 
				И ЗначениеЗаполнено(ПараметрыЗаполнения.Покупатель) Тогда 
				Контрагент = ПараметрыЗаполнения.Покупатель;
			ИначеЕсли ПараметрыЗаполнения.Свойство("Продавец") 
				И ЗначениеЗаполнено(ПараметрыЗаполнения.Продавец) Тогда 
				Контрагент = ПараметрыЗаполнения.Продавец;
			КонецЕсли;
		КонецЕсли; 
		Если ЗначениеЗаполнено(Контрагент) Тогда
			ПараметрыЗаполнения.Контрагент = Контрагент;
		КонецЕсли;
	КонецЕсли;	
		
	ПараметрыЗаполнения.Вставить("Услуги", мсвУслуг);
	ПараметрыЗаполнения.Вставить("Товары", мсвТоваров);
		
	Если ЕстьПустаяНоменклатура Тогда
		ВызватьИсключение НСтр("ru = 'Необходимо заполнить номенклатуру во всех строках'; en = 'Fill items in all lines'");
	КонецЕсли;
	
	СоздаваемыйДокумент = Документы[ТипСоздаваемогоДокумента].СоздатьДокумент();
	//Если ОбщегоНазначения.ЕстьРеквизитОбъекта("НомерВходящегоДокумента", СоздаваемыйДокумент.Метаданные()) Тогда
		ПараметрыЗаполнения.Удалить("Номер");
	//КонецЕсли; 
	СоздаваемыйДокумент.Заполнить(ПараметрыЗаполнения); 
	
	РаспознаваниеДокументовПереопределяемый.ПриСозданииДокументаНаОснованииРаспознанного(СоздаваемыйДокумент, РаспознанныйДокумент, ПараметрыЗаполнения);
	
	СоздаваемыйДокумент.УчитыватьНДС      = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(СоздаваемыйДокумент.Организация,
		ПланыВидовХарактеристик.уатПраваИНастройки.УчитыватьНДС);
	СоздаваемыйДокумент.СуммаВключаетНДС  = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(СоздаваемыйДокумент.Организация,
		ПланыВидовХарактеристик.уатПраваИНастройки.СуммаВключаетНДС);
	СоздаваемыйДокумент.ВалютаДокумента   = уатОбщегоНазначенияТиповые.ВалютаРегламентированногоУчета(СоздаваемыйДокумент.Организация);  
	ВалютаДокументаКурсКратность = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(СоздаваемыйДокумент.ВалютаДокумента, ТекущаяДата());
	СоздаваемыйДокумент.КурсВзаиморасчетов      = ВалютаДокументаКурсКратность.Курс;
	СоздаваемыйДокумент.КратностьВзаиморасчетов = ВалютаДокументаКурсКратность.Кратность; 
	Попытка
		СоздаваемыйДокумент.ВалютаВзаиморасчетов = СоздаваемыйДокумент.ДоговорКонтрагента.ВалютаВзаиморасчетов; 
	Исключение
	КонецПопытки;
	Попытка
		СоздаваемыйДокумент.КроссКурс = уатОбщегоНазначенияСервер.ПолучитьКроссКурс(СоздаваемыйДокумент.ВалютаДокумента,
			СоздаваемыйДокумент.ВалютаВзаиморасчетов, ТекущаяДата(),, СоздаваемыйДокумент); 
	Исключение
	КонецПопытки;
	Попытка
		СоздаваемыйДокумент.СуммаВзаиморасчетов = уатОбщегоНазначения_проф.СуммаВзаиморасчетовДокумента(СоздаваемыйДокумент);
	Исключение
	КонецПопытки; 
	
	СоздаваемыйДокумент.Ответственный = уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(
			ПользователиКлиентСервер.АвторизованныйПользователь(), "ОсновнойОтветственный");  
			
	Попытка
		флМноговалютныйУчет = ПолучитьФункциональнуюОпцию("уатМноговалютныйУчет");
	Исключение 
		флМноговалютныйУчет = Ложь;
	КонецПопытки;   
	
	Попытка
		КэшКурсов = Неопределено;
		Для Каждого ТекУслуга Из СоздаваемыйДокумент.Услуги Цикл
			ВалютаДокумента         = СоздаваемыйДокумент.ВалютаДокумента;
			КурсВзаиморасчетов      = СоздаваемыйДокумент.КурсВзаиморасчетов;
			КратностьВзаиморасчетов = СоздаваемыйДокумент.КратностьВзаиморасчетов;
			Если флМноговалютныйУчет Тогда
				ВалютаСтроки = ?(ЗначениеЗаполнено(ТекУслуга.Валюта), ТекУслуга.Валюта, ВалютаДокумента);
				
				ТекУслуга.Валюта           = ВалютаСтроки;
				ТекУслуга.ЦенаВалютная     = ТекУслуга.Цена;
				ТекУслуга.СуммаВалютная    = ТекУслуга.Сумма;
				ТекУслуга.СуммаНДСвалютная = ТекУслуга.СуммаНДС;
				ТекУслуга.КроссКурс        = 1;
			КонецЕсли;
			Если ВалютаСтроки <> ВалютаДокумента Тогда
				СтруктураКурсКратность     = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(ВалютаСтроки, ТекущаяДата());
				
				ТекУслуга.Цена             = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекУслуга.Цена,
					ВалютаСтроки,                     ВалютаДокумента,
					СтруктураКурсКратность.Курс,      КурсВзаиморасчетов,
					СтруктураКурсКратность.Кратность, КратностьВзаиморасчетов,,
					СоздаваемыйДокумент);
				ТекУслуга.Сумма            = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекУслуга.Сумма,
					ВалютаСтроки,                     ВалютаДокумента,
					СтруктураКурсКратность.Курс,      КурсВзаиморасчетов,
					СтруктураКурсКратность.Кратность, КратностьВзаиморасчетов,,
					СоздаваемыйДокумент);
				ТекУслуга.СуммаНДС         = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекУслуга.СуммаНДС,
					ВалютаСтроки,                     ВалютаДокумента,
					СтруктураКурсКратность.Курс,      КурсВзаиморасчетов,
					СтруктураКурсКратность.Кратность, КратностьВзаиморасчетов,,
					СоздаваемыйДокумент);
				
				Если флМноговалютныйУчет Тогда
					ТекУслуга.КроссКурс = уатОбщегоНазначенияСервер.ПолучитьКроссКурс(ТекУслуга.Валюта, ВалютаДокумента,
						ТекущаяДата(), КэшКурсов, СоздаваемыйДокумент);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	Исключение
	КонецПопытки;
		
	Если РежимЗаписи = Неопределено Тогда
		СоздаваемыйДокумент.Записать(РежимЗаписиДокумента.Запись);
	Иначе
		Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			Если Не СоздаваемыйДокумент.ПроверитьЗаполнение() Тогда
				ВызватьИсключение НСтр("ru = 'При проверке заполнения обнаружены ошибки'; en = 'Errors were found while checking the filling'");
			КонецЕсли;
			РаспознаваниеДокументовПереопределяемый.ПриПроведенииДокументаНаОснованииРаспознанного(СоздаваемыйДокумент);
		КонецЕсли; 
		СоздаваемыйДокумент.Записать(РежимЗаписи);
	КонецЕсли;
	
	РаспознаваниеДокументовПереопределяемый.ПослеСозданияДокументаНаОснованииРаспознанного(СоздаваемыйДокумент);
	
	РегистрыСведений.СвязанныеОбъектыРаспознаниеДокументов.ЗаписатьЗначения(СоздаваемыйДокумент.Ссылка, РаспознанныйДокумент, Ложь);
	
	Возврат СоздаваемыйДокумент.Ссылка;
	// {/УАТ}
КонецФункции

Процедура ИзменитьПорядокРеквизитовРаспознаваемогоДокумента(Объект) Экспорт
	
	// Сохранение текущих значений
	ТабличнаяЧасть = Объект.РеквизитыДокумента.Выгрузить();
	
	// Добавление порядка сортировки
	ТабличнаяЧасть.Колонки.Добавить("НомерСопоставленияРеквизитов");
	ТабличнаяЧасть.ЗаполнитьЗначения(1000000, "НомерСопоставленияРеквизитов");
	
	СопоставлениеРеквизитов = ПолучитьСопоставлениеРеквизитовИСвойствJSON(Объект.ТипДокумента);
	
	Для НомерСтроки = 0 По СопоставлениеРеквизитов.Количество() - 1 Цикл
		
		ДанныеСопоставления = СопоставлениеРеквизитов[НомерСтроки];
		
		Если ДанныеСопоставления.ЭтоРеквизитТабличнойЧасти Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТабличнойЧасти = ТабличнаяЧасть.Найти(ДанныеСопоставления.ИмяРеквизита, "ИмяРеквизита");
		Если СтрокаТабличнойЧасти = Неопределено Тогда 
			НоваяСтрока = ТабличнаяЧасть.Добавить();
			НоваяСтрока.ИмяРеквизита = ДанныеСопоставления.ИмяРеквизита;
			НоваяСтрока.Значение = ДанныеСопоставления.ОписаниеТипа.ПривестиЗначение();
			НоваяСтрока.НомерСопоставленияРеквизитов = НомерСтроки;
		Иначе 
			СтрокаТабличнойЧасти.Значение = ДанныеСопоставления.ОписаниеТипа.ПривестиЗначение(СтрокаТабличнойЧасти.Значение);
			СтрокаТабличнойЧасти.НомерСопоставленияРеквизитов = НомерСтроки;
		КонецЕсли;
		
	КонецЦикла;
	
	ТабличнаяЧасть.Сортировать("НомерСопоставленияРеквизитов");
	
	Объект.РеквизитыДокумента.Загрузить(ТабличнаяЧасть);
	
КонецПроцедуры

Процедура ЗаполнитьСписокВыбораПоля(Форма, РаспознанныйТекст, Тип, ДанныеВыбора) Экспорт
	
	Объект = Форма.Объект;
	ЭтоПримитивныйТип = Ложь;
	ПараметрыВыбораДоговора = ПараметрыВыбораДоговора(Объект);
	
	ОтборМетаданных = Новый Массив;
	ОтборМетаданных.Добавить(Новый Структура("Свойство, ВидСравнения, Значение",
		"Владелец", "=", ПараметрыВыбораДоговора.Контрагент));
	ОтборМетаданных.Добавить(Новый Структура("Свойство, ВидСравнения, Значение",
		"Организация", "=", ПараметрыВыбораДоговора.Организация));
	ОтборМетаданных.Добавить(Новый Структура("Свойство, ВидСравнения, Значение",
		"ВидДоговора", "В", ПараметрыВыбораДоговора.ВидыДоговоров));
	
	ДанныеПоиска = Новый Структура;
	РеквизитыПоиска = Новый Структура; // Ключ - имя реквизита из РаспознанныйДокумент.РеквизитыДокумента, Значение - имя реквизита объекта метаданных
	РеквизитыПоиска.Вставить("НомерДоговора", "Номер");
	РеквизитыПоиска.Вставить("ДатаДоговора", "Дата");
	РеквизитыПоиска.Вставить("Договор", "Наименование");
	
	Для Каждого ИмяРеквизита Из РеквизитыПоиска Цикл
		Отбор = Новый Структура("ИмяРеквизита", ИмяРеквизита.Ключ);
		СтрокиПоиска = Объект.РеквизитыДокумента.НайтиСтроки(Отбор);
		Если СтрокиПоиска.Количество() <> 0 Тогда
			ЗначениеПоиска = СтрокиПоиска[0].РаспознанныйТекст;
		Иначе
			ЗначениеПоиска = Неопределено;
		КонецЕсли;
		
		ДанныеПоиска.Вставить(ИмяРеквизита.Значение, ЗначениеПоиска);
	КонецЦикла;
	
	Кандидаты = РаспознаваниеДокументов.ПолучитьКандидатов(
		ДанныеПоиска,
		Тип,
		,
		ОтборМетаданных,
		Объект.ИдентификаторРезультата
	);
	
	Кандидаты.Колонки.Добавить("Значение");
	Кандидаты.Колонки.Добавить("Уверенность");
	
	Для Каждого Кандидат Из Кандидаты Цикл
		Кандидат.Значение = Кандидат.Ссылка;
		Кандидат.Уверенность = Окр(Кандидат.Коэффициент * 100);
	КонецЦикла;
	
	СписокДляВыбора = РаспознаваниеДокументовСлужебныйКлиентСервер.ПолучитьСписокДляВыбораПользователем(РаспознанныйТекст, Кандидаты);
	Если ТипЗнч(ДанныеВыбора) = Тип("СписокЗначений") Тогда
		ДанныеВыбора.Очистить();
	Иначе
		ДанныеВыбора = Новый СписокЗначений;
	КонецЕсли;
	
	Для Каждого ЭлементВыбораЭлемента Из СписокДляВыбора Цикл
		Если ТипЗнч(ЭлементВыбораЭлемента.Значение) = Тип("Структура") Тогда
			ДанныеВыбора.Добавить(ЭлементВыбораЭлемента.Значение.Значение, ЭлементВыбораЭлемента.Представление, , ЭлементВыбораЭлемента.Картинка);
		Иначе
			Если ЭтоПримитивныйТип Тогда
				ДанныеВыбора.Добавить(ЭлементВыбораЭлемента.Значение, ЭлементВыбораЭлемента.Представление);
			Иначе
				ДанныеВыбора.Добавить(ЭлементВыбораЭлемента.Значение, ЭлементВыбораЭлемента.Представление, , ЭлементВыбораЭлемента.Картинка);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ИсходноеИзображение(Ссылка) Экспорт
	
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "ИмяФайла, ИсходноеИзображение, Миниатюра, ИдентификаторРезультата");
	
	ДанныеИзображения = Реквизиты.ИсходноеИзображение.Получить();
	Если Не ЗначениеЗаполнено(ДанныеИзображения) Тогда
		ДанныеИзображения = Реквизиты.Миниатюра.Получить();
	КонецЕсли;
	
	Если ДанныеИзображения = Неопределено И ЭтоФайлИзображения(Реквизиты.ИмяФайла) Тогда
		ДанныеИзображения = РегистрыСведений.ИсходныеДанныеЗаданийРаспознаваниеДокументов
			.ПолучитьЕдинственныйИсходныйФайл(Реквизиты.ИдентификаторРезультата);
	КонецЕсли;
	
	Если ДанныеИзображения = Неопределено Тогда 
		ДанныеИзображения = БиблиотекаКартинок.ОтсутствуетИзображениеРаспознанногоДокумента.ПолучитьДвоичныеДанные();
	КонецЕсли;
	
	Возврат ДанныеИзображения;
	
КонецФункции

Функция ЭтоФайлИзображения(ИмяФайла)
	
	ФайлИнфо = Новый Файл(ИмяФайла);
	Возврат ЭтоРасширениеИзображения(ФайлИнфо.Расширение);
	
КонецФункции

Функция ЭтоРасширениеИзображения(Знач Расширение)
	
	Расширение = НРег(Расширение);
	Возврат Расширение = ".jpg"
		Или Расширение = ".jpeg"
		Или Расширение = ".png";
	
КонецФункции

#КонецОбласти

#Область НайтиИЗаполнитьСозданныеДокументы

Процедура АктуализироватьОбъектыСвязанныеСРаспознаннымДокументом(РаспознанныйДокумент, КомплектныеДокументы = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	КандидатыВСвязанныеДокументы = НайтиПотенциальныеСвязанныеДокументы(РаспознанныйДокумент);
	Если КомплектныеДокументы <> Неопределено Тогда
		Для Каждого КомплектныйДокумент Из КомплектныеДокументы Цикл
			Если КомплектныйДокумент = РаспознанныйДокумент Тогда
				Продолжить;
			КонецЕсли;
			
			//@skip-check query-in-loop
			СвязанныеПоКомплекту = НайтиПотенциальныеСвязанныеДокументы(КомплектныйДокумент);
			Для Каждого СтрокаСвязанных Из СвязанныеПоКомплекту Цикл
				Если Не ДокументЕстьВТаблице(СтрокаСвязанных.Ссылка, КандидатыВСвязанныеДокументы) Тогда
					НоваяСтрока = КандидатыВСвязанныеДокументы.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаСвязанных);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	СвязанныеДокументы = РегистрыСведений.СвязанныеОбъектыРаспознаниеДокументов.ВсеСвязанныеДокументы(РаспознанныйДокумент.Ссылка);
	
	Отбор = Новый Структура("ПотенциальныйКандидат", Истина);
	СтарыеКандидаты = СвязанныеДокументы.НайтиСтроки(Отбор);
	
	Для Каждого Документ Из СтарыеКандидаты Цикл
		РегистрыСведений.СвязанныеОбъектыРаспознаниеДокументов.УдалитьЗначения(Документ.Ссылка, РаспознанныйДокумент.Ссылка);
	КонецЦикла;
	
	Отбор = Новый Структура("ПотенциальныйКандидат", Ложь);
	СтарыеСвязанные = СвязанныеДокументы.НайтиСтроки(Отбор);
	
	Для Каждого Кандидат Из КандидатыВСвязанныеДокументы Цикл
		
		Если Не ДокументЕстьВТаблице(Кандидат.Ссылка, СтарыеСвязанные) Тогда
			
			РегистрыСведений.СвязанныеОбъектыРаспознаниеДокументов.ЗаписатьЗначения(Кандидат.Ссылка, РаспознанныйДокумент.Ссылка, Истина);
			
		КонецЕсли;
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Функция ДокументЕстьВТаблице(СсылкаНаДокумент, ТаблицаПоиска)
	
	Для Каждого СтрокаТаблицы Из ТаблицаПоиска Цикл
		Если СтрокаТаблицы.Ссылка = СсылкаНаДокумент Тогда 
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция НайтиПотенциальныеСвязанныеДокументы(Объект) Экспорт
	
	СвязанныеДокументы = Новый ТаблицаЗначений;
	СвязанныеДокументы.Колонки.Добавить("Ссылка");
	СвязанныеДокументы.Колонки.Добавить("ПотенциальныйКандидат");
	
	Если Объект.ТипДокумента = Перечисления.ТипыДокументовРаспознаваниеДокументов.УПД
		ИЛИ Объект.ТипДокумента = Перечисления.ТипыДокументовРаспознаваниеДокументов.СчетФактура
		ИЛИ Объект.ТипДокумента = Перечисления.ТипыДокументовРаспознаваниеДокументов.УКД Тогда
		
		// {УАТ}
		Если Объект.Направление = Перечисления.НаправленияРаспознанногоДокумента.Входящий Тогда
			ИмяТипа = "ПоступлениеТоваровУслугБРД";
			ТипНовогоДокумента = "Поступление";
		Иначе
			ИмяТипа = "РеализацияТоваровУслугБРД";
			ТипНовогоДокумента = "Реализация";
		КонецЕсли;
		// {/УАТ}
		Запрос = Новый Запрос;
		РаспознаваниеДокументовПереопределяемый.ТекстЗапросаПоПервичнымДокументам(ИмяТипа, Запрос.Текст);
		ЗаполнитьПараметрыПоУмолчанию(Объект, Запрос, ТипНовогоДокумента);
		
		УстановитьПривилегированныйРежим(Истина);
		Выборка = Запрос.Выполнить().Выбрать();
		УстановитьПривилегированныйРежим(Ложь);
		
		Если Выборка.Следующий() Тогда
			
			Документ = СвязанныеДокументы.Добавить();
			Документ.Ссылка = Выборка.Документ;
			Документ.ПотенциальныйКандидат = Истина;
			
			Если Выборка.ДокументОснование <> Null Тогда
				Документ = СвязанныеДокументы.Добавить();
				Документ.Ссылка = Выборка.ДокументОснование;
				Документ.ПотенциальныйКандидат = Истина;
			КонецЕсли;
			
		Иначе
			// Не нашли счет-фактуру, тогда ищем поступление или реализацию
			
			Если Объект.Направление = Перечисления.НаправленияРаспознанногоДокумента.Входящий Тогда
				ИмяТипа = "ПоступлениеТоваровУслугБРД";
			Иначе
				ИмяТипа = "РеализацияТоваровУслугБРД";
			КонецЕсли;
			
			РаспознаваниеДокументовПереопределяемый.ТекстЗапросаПоПервичнымДокументам(ИмяТипа, Запрос.Текст, Ложь);
			
			// Счет-фактуру могут выписать на 5 дней позже
			Запрос.УстановитьПараметр("ДатаНачала", Объект.РеквизитыДокумента[1].Значение - 5 * 86400);
			
			УстановитьПривилегированныйРежим(Истина);
			Выборка = Запрос.Выполнить().Выбрать();
			УстановитьПривилегированныйРежим(Ложь);
			
			Если Выборка.Следующий() Тогда
				
				Документ = СвязанныеДокументы.Добавить();
				Документ.Ссылка = Выборка.Документ;
				Документ.ПотенциальныйКандидат = Истина;
				
				СчетФактура = Неопределено;
				Если Объект.Направление = Перечисления.НаправленияРаспознанногоДокумента.Входящий Тогда
					РаспознаваниеДокументовПереопределяемый.НайтиПодчиненныйСчетФактуруПолученный(Выборка.Документ.Ссылка, СчетФактура);
				Иначе
					РаспознаваниеДокументовПереопределяемый.НайтиПодчиненныйСчетФактуруВыданныйНаРеализацию(Выборка.Документ.Ссылка, СчетФактура);
				КонецЕсли;
				
				Если ЗначениеЗаполнено(СчетФактура) Тогда
					Документ = СвязанныеДокументы.Добавить();
					Документ.Ссылка = СчетФактура;
					Документ.ПотенциальныйКандидат = Истина;
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли Объект.ТипДокумента = Перечисления.ТипыДокументовРаспознаваниеДокументов.ТОРГ12
		ИЛИ Объект.ТипДокумента = Перечисления.ТипыДокументовРаспознаваниеДокументов.АктОбОказанииУслуг Тогда
		
		Если Объект.Направление = Перечисления.НаправленияРаспознанногоДокумента.Входящий Тогда  
			ИмяТипа = "ПоступлениеТоваровУслугБРД";
			ТипНовогоДокумента = "Поступление";
		Иначе
			ИмяТипа = "РеализацияТоваровУслугБРД";
			ТипНовогоДокумента = "Реализация";
		КонецЕсли;
		
		Запрос = Новый Запрос;
		РаспознаваниеДокументовПереопределяемый.ТекстЗапросаПоПервичнымДокументам(ИмяТипа, Запрос.Текст, Ложь);
		ЗаполнитьПараметрыПоУмолчанию(Объект, Запрос, ТипНовогоДокумента);
		
		УстановитьПривилегированныйРежим(Истина);
		Выборка = Запрос.Выполнить().Выбрать();
		УстановитьПривилегированныйРежим(Ложь);
		
		Если Выборка.Следующий() Тогда
			
			Документ = СвязанныеДокументы.Добавить();
			Документ.Ссылка = Выборка.Документ;
			Документ.ПотенциальныйКандидат = Истина;
			
			Если Выборка.ДокументОснование = Null Тогда  
				
				СчетФактура = Неопределено;
				Если Объект.Направление = Перечисления.НаправленияРаспознанногоДокумента.Входящий Тогда
					РаспознаваниеДокументовПереопределяемый.НайтиПодчиненныйСчетФактуруПолученный(Выборка.Документ.Ссылка, СчетФактура);
				Иначе
					РаспознаваниеДокументовПереопределяемый.НайтиПодчиненныйСчетФактуруВыданныйНаРеализацию(Выборка.Документ.Ссылка, СчетФактура);
				КонецЕсли;
				
				Если ЗначениеЗаполнено(СчетФактура) Тогда
					Документ = СвязанныеДокументы.Добавить();
					Документ.Ссылка = СчетФактура;
					Документ.ПотенциальныйКандидат = Истина;
				КонецЕсли;
			Иначе
				Документ = СвязанныеДокументы.Добавить();
				Документ.Ссылка = Выборка.ДокументОснование;
				Документ.ПотенциальныйКандидат = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли Объект.ТипДокумента = Перечисления.ТипыДокументовРаспознаваниеДокументов.СчетНаОплату Тогда
		
		Если Объект.Направление = Перечисления.НаправленияРаспознанногоДокумента.Входящий Тогда
			ИмяТипа = "СчетНаОплатуПоставщикаБРД";
			ТипНовогоДокумента = "ДокументВходящий"; 
		Иначе
			ИмяТипа = "СчетНаОплатуПокупателюБРД";
			ТипНовогоДокумента = "ДокументИсходящий";
		КонецЕсли;
		
		Запрос = Новый Запрос;
		РаспознаваниеДокументовПереопределяемый.ТекстЗапросаПоПервичнымДокументам(ИмяТипа, Запрос.Текст, Ложь);
		ЗаполнитьПараметрыПоУмолчанию(Объект, Запрос, ТипНовогоДокумента);
		
		УстановитьПривилегированныйРежим(Истина);
		Выборка = Запрос.Выполнить().Выбрать();
		УстановитьПривилегированныйРежим(Ложь);
		
		Если Выборка.Следующий() Тогда
			
			Документ = СвязанныеДокументы.Добавить();
			Документ.Ссылка = Выборка.Документ;
			Документ.ПотенциальныйКандидат = Истина;
			
		КонецЕсли;
		
		// {УАТ}
		//Если Объект.Направление = Перечисления.НаправленияРаспознанногоДокумента.Входящий Тогда
		//	Запрос = Новый Запрос;
		//	РаспознаваниеДокументовПереопределяемый.ТекстЗапросаПоПлатежнымПоручениям(Запрос.Текст);
		//	ЗаполнитьПараметрыПоУмолчанию(Объект, Запрос, ТипНовогоДокумента);
		//	Запрос.УстановитьПараметр("СуммаДокумента", Объект.РеквизитыДокумента[12].Значение);
		//КонецЕсли;
		//
		//УстановитьПривилегированныйРежим(Истина);
		//Выборка = Запрос.Выполнить().Выбрать();
		//УстановитьПривилегированныйРежим(Ложь);
		//
		//Если Выборка.Следующий() Тогда
		//	
		//	Документ = СвязанныеДокументы.Добавить();
		//	Документ.Ссылка = Выборка.Документ;
		//	Документ.ПотенциальныйКандидат = Истина;
		//	
		//КонецЕсли;
		// {/УАТ}
	КонецЕсли;
	
	Возврат СвязанныеДокументы;
	
КонецФункции

Процедура ЗаполнитьПараметрыПоУмолчанию(Объект, Запрос, ТипНовогоДокумента)
	
	Если ТипНовогоДокумента = "Поступление" Тогда
		Запрос.УстановитьПараметр("Организация", Объект.РеквизитыДокумента[9].Значение);
		Запрос.УстановитьПараметр("Контрагент", Объект.РеквизитыДокумента[2].Значение);
	ИначеЕсли ТипНовогоДокумента = "Реализация" Тогда
		Запрос.УстановитьПараметр("Организация", Объект.РеквизитыДокумента[8].Значение);
		Запрос.УстановитьПараметр("Контрагент", Объект.РеквизитыДокумента[3].Значение);
	ИначеЕсли ТипНовогоДокумента = "ДокументВходящий" Тогда
		Запрос.УстановитьПараметр("Организация", Объект.РеквизитыДокумента[9].Значение);
		Запрос.УстановитьПараметр("Контрагент", Объект.РеквизитыДокумента[2].Значение);
	ИначеЕсли ТипНовогоДокумента = "ДокументИсходящий" Тогда
		Запрос.УстановитьПараметр("Организация", Объект.РеквизитыДокумента[17].Значение);
		Запрос.УстановитьПараметр("Контрагент", Объект.РеквизитыДокумента[3].Значение);
	КонецЕсли;
	Запрос.УстановитьПараметр("Номер", Объект.РеквизитыДокумента[0].Значение);
	Запрос.УстановитьПараметр("ДатаНачала", Объект.РеквизитыДокумента[1].Значение);
	Запрос.УстановитьПараметр("ДатаКонца", КонецДня(Объект.РеквизитыДокумента[1].Значение));
	
КонецПроцедуры

#КонецОбласти

Функция ОпределяемыеТипыРаспознаваемыеРеквизитыДокументаБРД()
	
	Возврат Метаданные.ОпределяемыеТипы.РаспознаваемыеРеквизитыДокументаБРД.Тип;
	
КонецФункции

Функция ЕстьОшибкаВЗначенииИтогаПоТаблице(ТаблицаДокумента, ИмяКолонки, ДанныеШапки)
	
	Если ТаблицаДокумента.Колонки.Найти(ИмяКолонки) = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЗначениеИтого = ДанныеШапки["Итого" + ИмяКолонки];
	
	// Предназначена для проверки полей (ИмяКолонки =) ИтогоСумма, ИтогоСуммаНДС, ИтогоВсего, ИтогоСуммаСкидки
	
	Если ИмяКолонки = "СуммаСкидки" Тогда
		
		Если ДанныеШапки.ВидСкидки = РаспознаваниеДокументовСлужебныйКлиентСервер.ВидыСкидок().НаОтдельныеПозиции Тогда
			Возврат (ТаблицаДокумента.Итог(ИмяКолонки) <> ЗначениеИтого);
		КонецЕсли;
		
		Возврат Ложь;
	КонецЕсли;
	
	Если ДанныеШапки.ВидСкидки = РаспознаваниеДокументовСлужебныйКлиентСервер.ВидыСкидок().ПоДокументуВЦелом Тогда
		ЗначениеИтого = ЗначениеИтого + ДанныеШапки.ИтогоСуммаСкидки;
		
		Если ИмяКолонки = "СуммаНДС" Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеИтого = 0 Тогда
		Если ИмяКолонки = "СуммаНДС" Тогда
			Если ТаблицаДокумента.Колонки.Найти("Сумма") <> Неопределено И ТаблицаДокумента.Итог("Сумма") = 0
				Или ТаблицаДокумента.Колонки.Найти("Всего") <> Неопределено И  ТаблицаДокумента.Итог("Всего") = 0 Тогда
				
				Возврат Истина;
			КонецЕсли;
		Иначе
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат (ТаблицаДокумента.Итог(ИмяКолонки) <> ЗначениеИтого);
	
КонецФункции

Функция ЕстьОшибкаВЗначенииУменьшенияУвеличенияИтогаПоТаблице(ТаблицаДокумента, ИмяКолонки, ДанныеШапки)
	
	ЗначениеИтого = ДанныеШапки[ИмяКолонки];
	
	ИмяКолонкиПослеИзменения = СтрЗаменить(ИмяКолонки, "Итого", "");
	ИмяКолонкиПослеИзменения = СтрЗаменить(ИмяКолонкиПослеИзменения, "Увеличение", "");
	ИмяКолонкиПослеИзменения = СтрЗаменить(ИмяКолонкиПослеИзменения, "Уменьшение", "");
	ИмяКолонкиПоДокументу = ИмяКолонкиПослеИзменения + "ПоДокументу";
	
	Если ТаблицаДокумента.Колонки.Найти(ИмяКолонкиПослеИзменения) = Неопределено
		Или ТаблицаДокумента.Колонки.Найти(ИмяКолонкиПоДокументу) = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	РазницаИтог = 0;
	Для Каждого Строка Из ТаблицаДокумента Цикл
		
		Если СтрЗаканчиваетсяНа(ИмяКолонки, "Уменьшение") Тогда
			Разница = Строка[ИмяКолонкиПоДокументу] - Строка[ИмяКолонкиПослеИзменения];
		Иначе
			Разница = Строка[ИмяКолонкиПослеИзменения] - Строка[ИмяКолонкиПоДокументу];
		КонецЕсли;
		
		Если Разница < 0 Тогда
			Разница = 0;
		КонецЕсли;
		
		РазницаИтог = РазницаИтог + Разница;
		
	КонецЦикла;
	
	Возврат РазницаИтог <> ЗначениеИтого;
	
КонецФункции


Процедура ОбновитьКоличествоОшибок(Форма)
	
	ТаблицаПроблемных = Форма.ПроблемныеЭлементы.Выгрузить(, "ИмяРеквизита, НомерСтроки");
	ТаблицаПроблемных.Свернуть("ИмяРеквизита, НомерСтроки");
	Форма.ОсталосьОшибок = ТаблицаПроблемных.Количество();
	
КонецПроцедуры

Функция ЮрФизЛицоПоОрганизационнойФорме() Экспорт
	
	Результат = Новый Соответствие;
	РаспознаваниеДокументовПереопределяемый.ПриОпределенииЮрФизЛицаПоОрганизационнойФорме(Результат);
	
	Возврат Новый ФиксированноеСоответствие(Результат);
	
КонецФункции

#Область ВосстановлениеДанныхТабличныхЧастей

Функция ВосстановлениеПо2Формулам(СуммаВключаетНДС, ТаблицаДокумента, ИтогоВсего, ИтогоСуммаНДС, ПоляПроверки) Экспорт
	
	БылоИзменение = Ложь;
	Для Каждого СтрокаТаблицы Из ТаблицаДокумента Цикл
		Если НЕ КоличествоЦенаСуммаСходятся(СтрокаТаблицы) ИЛИ НЕ СуммаСуммаНДСВсегоСходятся(СтрокаТаблицы, СуммаВключаетНДС) Тогда
			Для Каждого НашеПоле Из ПоляПроверки Цикл
				ТекущееЗначение = СтрокаТаблицы[НашеПоле];
				Если НашеПоле = "Сумма" Тогда
					// Сумму можно проверить по 3 формулам. Здесь используется только 2
					СтрокаТаблицы.Сумма = СтрокаТаблицы.Всего - ?(СуммаВключаетНДС, 0, СтрокаТаблицы.СуммаНДС);
					
					Если НЕ КоличествоЦенаСуммаСходятся(СтрокаТаблицы) Тогда
						СтрокаТаблицы.Сумма = ТекущееЗначение;
					ИначеЕсли ТекущееЗначение <> СтрокаТаблицы[НашеПоле] И НЕ БылоИзменение Тогда
						БылоИзменение = Истина;
					КонецЕсли;
				ИначеЕсли НашеПоле = "СуммаНДС" И ИтогоСуммаНДС <> 0 Тогда
					Если СуммаВключаетНДС Тогда
						СтавкаНДСЧислом = РаспознаваниеДокументовСлужебныйВызовСервераПовтИсп.ПолучитьСтавкуНДС(СтрокаТаблицы.СтавкаНДС);
						СтрокаТаблицы.СуммаНДС = Окр(РаспознаваниеДокументовСлужебныйКлиентСервер.РассчитатьСуммуНДС(
							СтрокаТаблицы.Сумма, СуммаВключаетНДС, СтавкаНДСЧислом), 2);
					Иначе
						СтрокаТаблицы.СуммаНДС = СтрокаТаблицы.Всего - СтрокаТаблицы.Сумма;
					КонецЕсли;

					Если ТаблицаДокумента.Итог("СуммаНДС") <> ИтогоСуммаНДС Тогда
						СтрокаТаблицы.СуммаНДС = ТекущееЗначение;
					ИначеЕсли ТекущееЗначение <> СтрокаТаблицы[НашеПоле] И НЕ БылоИзменение Тогда
						БылоИзменение = Истина;
					КонецЕсли;
				ИначеЕсли НашеПоле = "Всего" И ИтогоВсего <> 0 Тогда
					СтрокаТаблицы.Всего = СтрокаТаблицы.Сумма + ?(СуммаВключаетНДС, 0, СтрокаТаблицы.СуммаНДС);
					
					Если ТаблицаДокумента.Итог("Всего") <> ИтогоВсего Тогда
						СтрокаТаблицы.Всего = ТекущееЗначение;
					ИначеЕсли ТекущееЗначение <> СтрокаТаблицы[НашеПоле] И НЕ БылоИзменение Тогда
						БылоИзменение = Истина;
					КонецЕсли;
				КонецЕсли;
					
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Возврат БылоИзменение;
	
КонецФункции

Функция ВосстановлениеПо1ФормулеСУверенностью(ДокументОбъект, СуммаВключаетНДС, ТаблицаДокумента, ИтогоВсего, ИтогоСуммаНДС, ИтогоСумма) Экспорт
	
	БылоИзменение = Ложь;
	ИтогоСуммаСходится = (ИтогоСумма <> 0 И ТаблицаДокумента.Итог("Сумма") = ИтогоСумма);
	ИтогоСуммаНДССходится = (ТаблицаДокумента.Итог("СуммаНДС") = ИтогоСуммаНДС);
	ИтогоВсегоСходится = (ИтогоВсего <> 0 И ТаблицаДокумента.Итог("Всего") = ИтогоВсего);
	
	ПолеВосстановления = "";
	Если ИтогоСуммаСходится И ИтогоСуммаНДССходится Тогда
		ПолеВосстановления = "Всего";
	ИначеЕсли ИтогоСуммаНДССходится И ИтогоВсегоСходится Тогда 
		ПолеВосстановления = "Сумма";
	ИначеЕсли ИтогоСуммаСходится И ИтогоВсегоСходится Тогда
		ПолеВосстановления = "СуммаНДС";
	КонецЕсли;
	
	Если ПолеВосстановления <> "" Тогда
		Для Каждого СтрокаТаблицы Из ТаблицаДокумента Цикл
			ВосстановитьПоле(СтрокаТаблицы, ПолеВосстановления, ДокументОбъект, СуммаВключаетНДС);
			Если СтрокаТаблицы.Всего <> СтрокаТаблицы.Сумма + ?(СуммаВключаетНДС, 0, СтрокаТаблицы.СуммаНДС) Тогда
				Если НЕ БылоИзменение Тогда
					БылоИзменение = Истина;
				КонецЕсли;
				ВосстановитьПоле(СтрокаТаблицы, ПолеВосстановления, ДокументОбъект, СуммаВключаетНДС);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат БылоИзменение;
	
КонецФункции

Процедура НайтиИВосстановитьЕдинственныйНоль(СтрокаТаблицы, ПоляПроверки, ДокументОбъект, СуммаВключаетНДС) Экспорт
	
	НулевоеПоле = НайтиЕдинственныйНоль(СтрокаТаблицы, ПоляПроверки);
	Если НЕ ПустаяСтрока(НулевоеПоле) Тогда
		ВосстановитьПоле(СтрокаТаблицы, НулевоеПоле, ДокументОбъект, СуммаВключаетНДС);
		Если НЕ (СтрокаТаблицы.Количество <> 0 И КоличествоЦенаСуммаСходятся(СтрокаТаблицы)) Тогда
			СтрокаТаблицы[НулевоеПоле] = 0;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура НайтиИВосстановитьПотеряннуюЗапятую(СтрокаТаблицы, ПоляПроверки, ДокументОбъект) Экспорт
	
	// Для "Количество" и "Цена" проверим, не потерялась ли запятая (умножим на 100 и на 1000)
	Если СтрокаТаблицы.Количество <> 0 И НЕ КоличествоЦенаСуммаСходятся(СтрокаТаблицы) Тогда
		Для Каждого НашеПоле Из ПоляПроверки Цикл
			Если СтрокаТаблицы[НашеПоле] = Окр(СтрокаТаблицы[НашеПоле]) Тогда
				Отбор = Новый Структура("ИмяРеквизита, НомерСтрокиТЧ", НашеПоле, СтрокаТаблицы.НомерСтроки);
				НайденныеДанныеТаблицыДокумента = ДокументОбъект.РеквизитыТабличныхЧастей.НайтиСтроки(Отбор);
				Если НЕ НайденныеДанныеТаблицыДокумента.Количество() Тогда
					Продолжить;
				КонецЕсли;
				
				РаспознанныйТекст = НайденныеДанныеТаблицыДокумента[0].РаспознанныйТекст;
				Если СтрНайти(РаспознанныйТекст, ",") = 0 И СтрНайти(РаспознанныйТекст, ".") = 0 Тогда
					ТекущееЗначение = СтрокаТаблицы[НашеПоле];
					Множитель = 100;
					Для Вариант = 1 По 2 Цикл
						СтрокаТаблицы[НашеПоле] = СтрокаТаблицы[НашеПоле] / Множитель;
						Если КоличествоЦенаСуммаСходятся(СтрокаТаблицы) Тогда
							Прервать;
						Иначе
							СтрокаТаблицы[НашеПоле] = ТекущееЗначение;
						КонецЕсли;
						Множитель = Множитель * 10;
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ВосстановитьПоле(СтрокаТаблицы, ПолеВосстановления, ДокументОбъект, СуммаВключаетНДС)
	
	Если ПолеВосстановления = "Всего" Тогда
		СтрокаТаблицы.Всего = СтрокаТаблицы.Сумма + ?(СуммаВключаетНДС, 0, СтрокаТаблицы.СуммаНДС);
	ИначеЕсли ПолеВосстановления = "СуммаНДС" Тогда
		Если СуммаВключаетНДС Тогда
			СтавкаНДСЧислом = РаспознаваниеДокументовСлужебныйВызовСервераПовтИсп.ПолучитьСтавкуНДС(СтрокаТаблицы.СтавкаНДС);
			СтрокаТаблицы.СуммаНДС = Окр(РаспознаваниеДокументовСлужебныйКлиентСервер.РассчитатьСуммуНДС(
				СтрокаТаблицы.Сумма, СуммаВключаетНДС, СтавкаНДСЧислом), 2);
		Иначе
			СтрокаТаблицы.СуммаНДС = СтрокаТаблицы.Всего - СтрокаТаблицы.Сумма;
		КонецЕсли;
	ИначеЕсли ПолеВосстановления = "Сумма" Тогда
		Если ДокументОбъект.ТипДокумента = Перечисления.ТипыДокументовРаспознаваниеДокументов.АктОбОказанииУслуг
			ИЛИ ДокументОбъект.ТипДокумента = Перечисления.ТипыДокументовРаспознаваниеДокументов.СчетНаОплату Тогда
			
			СтрокаТаблицы.Сумма = СтрокаТаблицы.Количество * СтрокаТаблицы.Цена;
		Иначе
			СтрокаТаблицы.Сумма = СтрокаТаблицы.Всего - ?(СуммаВключаетНДС, 0, СтрокаТаблицы.СуммаНДС);
		КонецЕсли;
	ИначеЕсли ПолеВосстановления = "Цена" Тогда
		СтрокаТаблицы.Цена = Окр(СтрокаТаблицы.Сумма / СтрокаТаблицы.Количество, 2);
	ИначеЕсли ПолеВосстановления = "Количество" Тогда
		БезОкругления = СтрокаТаблицы.Сумма / СтрокаТаблицы.Цена;
		РазностьОкругления = БезОкругления - Окр(БезОкругления);
		Если РазностьОкругления > -0.01 И РазностьОкругления < 0.01 Тогда
			СтрокаТаблицы.Количество = Окр(БезОкругления);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция НайтиЕдинственныйНоль(СтрокаТаблицы, ПоляПроверки)
	
	СтавкаНДСЧислом = РаспознаваниеДокументовСлужебныйВызовСервераПовтИсп.ПолучитьСтавкуНДС(СтрокаТаблицы.СтавкаНДС);
	
	Результат = "";
	Для Каждого НашеПоле Из ПоляПроверки Цикл
		Если СтавкаНДСЧислом = 0 И НашеПоле = "СуммаНДС" Тогда
			Продолжить;
		КонецЕсли;
		Если СтрокаТаблицы[НашеПоле] = 0 Тогда
			Если Результат = "" Тогда
				Результат = НашеПоле;
			Иначе
				// Было найдено второе поле
				Результат = "";
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция КоличествоЦенаСуммаСходятся(СтрокаТаблицы)
	Если СтрокаТаблицы.Количество = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Окр(СтрокаТаблицы.Количество * СтрокаТаблицы.Цена, 2) = СтрокаТаблицы.Сумма
		Или Окр(СтрокаТаблицы.Сумма / СтрокаТаблицы.Количество, 2) = СтрокаТаблицы.Цена;
КонецФункции

Функция СуммаСуммаНДСВсегоСходятся(СтрокаТаблицы, СуммаВключаетНДС)
	
	Если СуммаВключаетНДС Тогда
		СтавкаНДСЧислом = РаспознаваниеДокументовСлужебныйВызовСервераПовтИсп.ПолучитьСтавкуНДС(СтрокаТаблицы.СтавкаНДС);
		СуммаНДСРасчет = Окр(РаспознаваниеДокументовСлужебныйКлиентСервер.РассчитатьСуммуНДС(
			СтрокаТаблицы.Сумма, СуммаВключаетНДС, СтавкаНДСЧислом), 2);
		
		Возврат СтрокаТаблицы.Сумма = СтрокаТаблицы.Всего И СтрокаТаблицы.СуммаНДС = СуммаНДСРасчет;
	Иначе
		Возврат СтрокаТаблицы.Сумма + СтрокаТаблицы.СуммаНДС = СтрокаТаблицы.Всего;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область ПроблемныеРеквизиты

Функция ПроверяемыеРеквизиты(ДокументОбъект)
	
	ПроверяемыеРеквизиты = Новый Массив;
	Если ДокументОбъект.ТипДокумента = Перечисления.ТипыДокументовРаспознаваниеДокументов.УПД
		Или ДокументОбъект.ТипДокумента = Перечисления.ТипыДокументовРаспознаваниеДокументов.ТОРГ12
		Или ДокументОбъект.ТипДокумента = Перечисления.ТипыДокументовРаспознаваниеДокументов.СчетФактура
		Или ДокументОбъект.ТипДокумента = Перечисления.ТипыДокументовРаспознаваниеДокументов.АктОбОказанииУслуг
		Или ДокументОбъект.ТипДокумента = Перечисления.ТипыДокументовРаспознаваниеДокументов.НеопределенныйДокумент
		    И (ДокументОбъект.ВариантОбработки = Перечисления.ВариантыОбработкиЗаданияРаспознавания.ПоступлениеТоваров
		       Или ДокументОбъект.ВариантОбработки = Перечисления.ВариантыОбработкиЗаданияРаспознавания.РеализацияТоваров) Тогда
		
		// Шапка
		ПроверяемыеРеквизиты.Добавить("НомерДокумента");
		ПроверяемыеРеквизиты.Добавить("ДатаДокумента");
		ПроверяемыеРеквизиты.Добавить("Договор");
		ПроверяемыеРеквизиты.Добавить("ИтогоСумма");
		ПроверяемыеРеквизиты.Добавить("ИтогоСуммаНДС");
		ПроверяемыеРеквизиты.Добавить("ИтогоВсего");
		Если ДокументОбъект.ТипДокумента <> Перечисления.ТипыДокументовРаспознаваниеДокументов.АктОбОказанииУслуг Тогда
			ПроверяемыеРеквизиты.Добавить("Грузоотправитель");
			ПроверяемыеРеквизиты.Добавить("Грузополучатель");
			ПроверяемыеРеквизиты.Добавить("Склад");
		КонецЕсли;
		
		Если ДокументОбъект.Направление = Перечисления.НаправленияРаспознанногоДокумента.Исходящий Тогда
			ПроверяемыеРеквизиты.Добавить("Покупатель");
			ПроверяемыеРеквизиты.Добавить("ПродавецОрганизация");
		Иначе
			ПроверяемыеРеквизиты.Добавить("Продавец");
			ПроверяемыеРеквизиты.Добавить("ПокупательОрганизация");
		КонецЕсли;
		
		// Таблица
		ПроверяемыеРеквизиты.Добавить(".Номенклатура");
		ПроверяемыеРеквизиты.Добавить(".Количество");
		ПроверяемыеРеквизиты.Добавить(".Цена");
		ПроверяемыеРеквизиты.Добавить(".Сумма");
		ПроверяемыеРеквизиты.Добавить(".СтавкаНДС");
		ПроверяемыеРеквизиты.Добавить(".СуммаНДС");
		ПроверяемыеРеквизиты.Добавить(".Всего");
		ПроверяемыеРеквизиты.Добавить(".НомерГТД");
		
	ИначеЕсли ДокументОбъект.ТипДокумента = Перечисления.ТипыДокументовРаспознаваниеДокументов.СчетНаОплату
		Или ДокументОбъект.ТипДокумента = Перечисления.ТипыДокументовРаспознаваниеДокументов.НеопределенныйДокумент
		     И (ДокументОбъект.ВариантОбработки = Перечисления.ВариантыОбработкиЗаданияРаспознавания.СчетНаОплатуКлиента
		       Или ДокументОбъект.ВариантОбработки = Перечисления.ВариантыОбработкиЗаданияРаспознавания.СчетНаОплатуПоставщика) Тогда
		
		ПроверяемыеРеквизиты.Добавить("НомерДокумента");
		ПроверяемыеРеквизиты.Добавить("ДатаДокумента");
		ПроверяемыеРеквизиты.Добавить("Договор");
		ПроверяемыеРеквизиты.Добавить("ИтогоСумма");
		ПроверяемыеРеквизиты.Добавить("ИтогоСуммаНДС");
		ПроверяемыеРеквизиты.Добавить("ИтогоВсего");
		
		Если ДокументОбъект.Направление = Перечисления.НаправленияРаспознанногоДокумента.Исходящий Тогда
			ПроверяемыеРеквизиты.Добавить("Покупатель");
			ПроверяемыеРеквизиты.Добавить("ПродавецОрганизация");
			ПроверяемыеРеквизиты.Добавить("Исполнитель");
			ПроверяемыеРеквизиты.Добавить("БанковскийСчетОрганизации");
		Иначе
			ПроверяемыеРеквизиты.Добавить("Продавец");
			ПроверяемыеРеквизиты.Добавить("ПокупательОрганизация");
			ПроверяемыеРеквизиты.Добавить("БанковскийСчетКонтрагента");
		КонецЕсли;
		
		// Таблица
		ПроверяемыеРеквизиты.Добавить(".Номенклатура");
		ПроверяемыеРеквизиты.Добавить(".Количество");
		ПроверяемыеРеквизиты.Добавить(".Цена");
		ПроверяемыеРеквизиты.Добавить(".Сумма");
		ПроверяемыеРеквизиты.Добавить(".СтавкаНДС");
		ПроверяемыеРеквизиты.Добавить(".СуммаНДС");
		ПроверяемыеРеквизиты.Добавить(".Всего");
		
	ИначеЕсли ДокументОбъект.ТипДокумента = Перечисления.ТипыДокументовРаспознаваниеДокументов.УКД Тогда
		
		// Шапка
		ПроверяемыеРеквизиты.Добавить("НомерДокумента");
		ПроверяемыеРеквизиты.Добавить("ДатаДокумента");
		ПроверяемыеРеквизиты.Добавить("Организация");
		ПроверяемыеРеквизиты.Добавить("Контрагент");
		
		
		//Если ДокументОбъект.Направление = Перечисления.НаправленияРаспознанногоДокумента.Исходящий Тогда
		//	ПроверяемыеРеквизиты.Добавить("Покупатель");
		//	ПроверяемыеРеквизиты.Добавить("ПродавецОрганизация");
		//Иначе
		//	ПроверяемыеРеквизиты.Добавить("Продавец");
		//	ПроверяемыеРеквизиты.Добавить("ПокупательОрганизация");
		//КонецЕсли;
		
		// Таблица
		ПроверяемыеРеквизиты.Добавить(".Количество");
		ПроверяемыеРеквизиты.Добавить(".Цена");
		ПроверяемыеРеквизиты.Добавить(".Сумма");
		ПроверяемыеРеквизиты.Добавить(".СтавкаНДС");
		ПроверяемыеРеквизиты.Добавить(".СуммаНДС");
		ПроверяемыеРеквизиты.Добавить(".Всего");
		ПроверяемыеРеквизиты.Добавить(".НомерГТД");
		
	КонецЕсли;
	
	РаспознаваниеДокументовПереопределяемый.ПриОпределенииПроверяемыхРеквизитов(ДокументОбъект, ПроверяемыеРеквизиты);
	
	Возврат ПроверяемыеРеквизиты;
	
КонецФункции

Функция ПроблемныеРеквизиты(ДокументОбъект, Вариант = "Общий", ТаблицаВходящая = Неопределено) Экспорт
	
	ТаблицаПроблем = Новый ТаблицаЗначений;
	ТаблицаПроблем.Колонки.Добавить("ИмяРеквизита", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(40)));
	ТаблицаПроблем.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(5)));
	ТаблицаПроблем.Колонки.Добавить("ГруппаОшибки", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(40)));
	ТаблицаПроблем.Колонки.Добавить("ТекстПодсказки", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(100)));
	
	ДанныеШапки = Новый Структура; // Необходимые для проверки таблицы
	ДанныеШапки.Вставить("ИтогоСуммаСкидки", РаспознаваниеДокументовСлужебныйКлиентСервер.ЗначениеРеквизитаДокумента(ДокументОбъект, "ИтогоСуммаСкидки", 0));
	ДанныеШапки.Вставить("ИтогоСумма", РаспознаваниеДокументовСлужебныйКлиентСервер.ЗначениеРеквизитаДокумента(ДокументОбъект, "ИтогоСумма", 0));
	ДанныеШапки.Вставить("ИтогоСуммаНДС", РаспознаваниеДокументовСлужебныйКлиентСервер.ЗначениеРеквизитаДокумента(ДокументОбъект, "ИтогоСуммаНДС", 0));
	ДанныеШапки.Вставить("ИтогоВсего", РаспознаваниеДокументовСлужебныйКлиентСервер.ЗначениеРеквизитаДокумента(ДокументОбъект, "ИтогоВсего", 0));
	
	ДанныеШапки.Вставить("СуммаВключаетНДС", РаспознаваниеДокументовСлужебныйКлиентСервер.ЗначениеРеквизитаДокумента(ДокументОбъект, "СуммаВключаетНДС", Ложь));
	ДанныеШапки.Вставить("ВидСкидки", РаспознаваниеДокументовСлужебныйКлиентСервер.ЗначениеРеквизитаДокумента(ДокументОбъект, "ВидСкидки",
		РаспознаваниеДокументовСлужебныйКлиентСервер.ВидыСкидок().НеПредоставлена));
	
	ДанныеШапки.Вставить("ИтогоВсегоУвеличение", РаспознаваниеДокументовСлужебныйКлиентСервер.ЗначениеРеквизитаДокумента(ДокументОбъект, "ИтогоВсегоУвеличение", 0));
	ДанныеШапки.Вставить("ИтогоСуммаНДСУвеличение", РаспознаваниеДокументовСлужебныйКлиентСервер.ЗначениеРеквизитаДокумента(ДокументОбъект, "ИтогоСуммаНДСУвеличение", 0));
	ДанныеШапки.Вставить("ИтогоСуммаУвеличение", РаспознаваниеДокументовСлужебныйКлиентСервер.ЗначениеРеквизитаДокумента(ДокументОбъект, "ИтогоСуммаУвеличение", 0));
	ДанныеШапки.Вставить("ИтогоВсегоУменьшение", РаспознаваниеДокументовСлужебныйКлиентСервер.ЗначениеРеквизитаДокумента(ДокументОбъект, "ИтогоВсегоУменьшение", 0));
	ДанныеШапки.Вставить("ИтогоСуммаНДСУменьшение", РаспознаваниеДокументовСлужебныйКлиентСервер.ЗначениеРеквизитаДокумента(ДокументОбъект, "ИтогоСуммаНДСУменьшение", 0));
	ДанныеШапки.Вставить("ИтогоСуммаУменьшение", РаспознаваниеДокументовСлужебныйКлиентСервер.ЗначениеРеквизитаДокумента(ДокументОбъект, "ИтогоСуммаУменьшение", 0));
	
	ВыделяемыеРеквизиты = ПроверяемыеРеквизиты(ДокументОбъект);
	
	Если ТипЗнч(ТаблицаВходящая) = Тип("ДанныеФормыКоллекция") Тогда
		ТаблицаДокумента = ТаблицаВходящая.Выгрузить();
	Иначе
		ТаблицаДокумента = ЗаполненнаяТаблицаДокумента(ДокументОбъект);
	КонецЕсли;
	
	// Заполнение для шапки
	Для Каждого Реквизит Из ДокументОбъект.РеквизитыДокумента Цикл
		Если Реквизит.ИмяРеквизита = "ИтогоСумма"
			Или Реквизит.ИмяРеквизита = "ИтогоСуммаНДС"
			Или Реквизит.ИмяРеквизита = "ИтогоВсего"
			Или Реквизит.ИмяРеквизита = "ИтогоСуммаСкидки" Тогда
			
			ИмяКолонки = СтрЗаменить(Реквизит.ИмяРеквизита, "Итого", "");
			Если ЕстьОшибкаВЗначенииИтогаПоТаблице(ТаблицаДокумента, ИмяКолонки, ДанныеШапки) Тогда
				ТекстПодсказки = РаспознаваниеДокументовСлужебныйКлиентСервер.ПодсказкаЗначениеИтогаВПодвалеНеСовпадает();
				ДобавитьПроблемныйЭлемент(ТаблицаПроблем, Реквизит.ИмяРеквизита, 0, "", ТекстПодсказки);
			КонецЕсли;
			
			Продолжить;
		КонецЕсли;
		
		Если Реквизит.ИмяРеквизита = "ИтогоВсегоУвеличение"
			Или Реквизит.ИмяРеквизита = "ИтогоСуммаНДСУвеличение"
			Или Реквизит.ИмяРеквизита = "ИтогоСуммаУвеличение"
			Или Реквизит.ИмяРеквизита = "ИтогоВсегоУменьшение"
			Или Реквизит.ИмяРеквизита = "ИтогоСуммаНДСУменьшение"
			Или Реквизит.ИмяРеквизита = "ИтогоСуммаУменьшение" Тогда
			
			Если ЕстьОшибкаВЗначенииУменьшенияУвеличенияИтогаПоТаблице(ТаблицаДокумента, Реквизит.ИмяРеквизита, ДанныеШапки) Тогда
				ТекстПодсказки = РаспознаваниеДокументовСлужебныйКлиентСервер.ПодсказкаЗначениеИтогаВПодвалеНеСовпадает();
				ДобавитьПроблемныйЭлемент(ТаблицаПроблем, Реквизит.ИмяРеквизита, 0, "", ТекстПодсказки);
			КонецЕсли;
				
			Продолжить;
		КонецЕсли;
		
		ИмяРеквизита = Реквизит.ИмяРеквизита;
		Если (Реквизит.ЗаполненоВручную И ЗначениеЗаполнено(Реквизит.Значение))
			Или ВыделяемыеРеквизиты.Найти(ИмяРеквизита) = Неопределено Тогда
			
			Продолжить;
		КонецЕсли;
		
		ЭтоПримитивныйТип = РаспознаваниеДокументовКлиентСервер.ЭтоПримитивныйТип(ТипЗнч(Реквизит.Значение));
		Если ЗначениеЗаполнено(Реквизит.Значение) Тогда
			Если Не ЭтоПримитивныйТип И Реквизит.Значение = Реквизит.НайденноеЗначение
				И Реквизит.УверенностьНайденногоЗначения < РаспознаваниеДокументовСлужебныйКлиентСервер.ГраницаУверенныхЗначений()
				И Вариант <> "ТолькоМешающиеПроведению" Тогда
				
				ТекстПодсказки = РаспознаваниеДокументовСлужебныйКлиентСервер.ПодсказкаВозможнаОшибкаСопоставленияРаспознаннойСтроки();
				ДобавитьПроблемныйЭлемент(ТаблицаПроблем, ИмяРеквизита, 0, "", ТекстПодсказки);
			КонецЕсли;
		Иначе
			Если ИмяРеквизита = "Грузоотправитель"
				Или ИмяРеквизита = "Грузополучатель" Тогда
				
				// Если не заполнено, то по умолчанию выставлено "он же"
				Продолжить;
			ИначеЕсли ИмяРеквизита = "Договор" Тогда
				ТекстПодсказки = РаспознаваниеДокументовСлужебныйКлиентСервер.ПодсказкаНеНайденДоговорСКонтрагентом();
			ИначеЕсли ИмяРеквизита = "Склад" Тогда
				СкладПоУмолчанию = ПолучитьСкладПоУмолчанию();
				Если ЗначениеЗаполнено(СкладПоУмолчанию) Тогда
					Продолжить;
				Иначе
					ТекстПодсказки = РаспознаваниеДокументовСлужебныйКлиентСервер.ПодсказкаТребуетсяВыбрать();
				КонецЕсли;
			ИначеЕсли ЭтоПримитивныйТип Тогда
				ТекстПодсказки = РаспознаваниеДокументовСлужебныйКлиентСервер.ПодсказкаВозможнаОшибкаРаспознавания();
			Иначе
				ТекстПодсказки = РаспознаваниеДокументовСлужебныйКлиентСервер.ПодсказкаНеНайденЭлементПоРаспознаннойСтроке();
			КонецЕсли;
			ДобавитьПроблемныйЭлемент(ТаблицаПроблем, ИмяРеквизита, 0, "", ТекстПодсказки);
		КонецЕсли;
	КонецЦикла;
	
	// Заполнение для чисел в таблице
	Для Каждого СтрокаТаблицы Из ТаблицаДокумента Цикл
		ДобавитьОшибкиКоличествоЦенаСумма(ТаблицаПроблем, ДанныеШапки, ТаблицаДокумента, СтрокаТаблицы);
		ДобавитьОшибкиСуммаСуммаНДСВсего(ТаблицаПроблем, ДанныеШапки, ТаблицаДокумента, СтрокаТаблицы);
		
		Если ДокументОбъект.ТипДокумента = Перечисления.ТипыДокументовРаспознаваниеДокументов.УКД Тогда
			ДобавитьОшибкиРаспознаноПоДокументу(ТаблицаПроблем, ДанныеШапки, ТаблицаДокумента, СтрокаТаблицы);
		КонецЕсли;
	КонецЦикла;
	
	СтрокВТаблице = ТаблицаДокумента.Количество();
	// Заполнение для оставшихся реквизитов таблицы
	Для Каждого Реквизит Из ДокументОбъект.РеквизитыТабличныхЧастей Цикл
		Если Ложь И ТаблицаВходящая = Неопределено Тогда
			// ТаблицаДокумента все равно формировалась из ДокументОбъект, и нет смысла делать доп проверки.
			ЗначениеРеквизита = Реквизит.Значение;
			РеквизитЗаполненВручную = Реквизит.ЗаполненоВручную;
		Иначе
			// Будем брать Значение и ЗаполненоВручную из таблицы, т.к. она может быть еще не перенесена в ДокументОбъект.
			// Найдем строку в ТаблицаДокумента, у которой Реквизит.НомерСтрокиТЧ = СтрокаТаблицы.НомерСтроки
			Если СтрокВТаблице >= Реквизит.НомерСтрокиТЧ
				И Реквизит.НомерСтрокиТЧ = ТаблицаДокумента[Реквизит.НомерСтрокиТЧ - 1].НомерСтроки Тогда
				
				// Если в таблице не меняли и не добавляли строки, то индекс совпадет и поиск делать не нужно
				СтрокаТаблицы = ТаблицаДокумента[Реквизит.НомерСтрокиТЧ - 1];
			Иначе
				СтрокаТаблицы = ТаблицаДокумента.Найти(Реквизит.НомерСтрокиТЧ, "НомерСтроки");
			КонецЕсли;
			
			Если СтрокаТаблицы = Неопределено Тогда
				// Строка удалена
				Продолжить;
			Иначе
				Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТаблицы, Реквизит.ИмяРеквизита) Тогда
					ЗначениеРеквизита = СтрокаТаблицы[Реквизит.ИмяРеквизита];
				Иначе
					ЗначениеРеквизита = Реквизит.Значение;
				КонецЕсли;
				Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТаблицы, Реквизит.ИмяРеквизита + "ЗаполненоВручную") Тогда
					РеквизитЗаполненВручную = СтрокаТаблицы[Реквизит.ИмяРеквизита + "ЗаполненоВручную"];
				Иначе
					РеквизитЗаполненВручную = Реквизит.ЗаполненоВручную;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		Если (РеквизитЗаполненВручную И ЗначениеЗаполнено(ЗначениеРеквизита)) Или Реквизит.СтрокаУдалена
			Или ВыделяемыеРеквизиты.Найти(Реквизит.ТабличнаяЧасть + "." + Реквизит.ИмяРеквизита) = Неопределено Тогда
			
			Продолжить;
		КонецЕсли;
		
		Если Реквизит.ИмяРеквизита = "Количество"
			Или Реквизит.ИмяРеквизита = "Цена"
			Или Реквизит.ИмяРеквизита = "СуммаСкидки"
			Или Реквизит.ИмяРеквизита = "Сумма"
			Или Реквизит.ИмяРеквизита = "СуммаНДС"
			Или Реквизит.ИмяРеквизита = "Всего" Тогда
			
			// Нужен сложный расчет, который проведен выше
			Продолжить;
		КонецЕсли;
		
		Если Реквизит.ИмяРеквизита = "НомерГТД" Тогда
			
			Если ПустаяСтрока(Реквизит.РаспознанныйТекст) Тогда
				Продолжить;
			КонецЕсли;
			
		КонецЕсли;
		
		ЭтоПримитивныйТип = РаспознаваниеДокументовКлиентСервер.ЭтоПримитивныйТип(ТипЗнч(ЗначениеРеквизита));
		Если ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
			Если Не ЭтоПримитивныйТип И ЗначениеРеквизита = Реквизит.НайденноеЗначение
				И Реквизит.УверенностьНайденногоЗначения < РаспознаваниеДокументовСлужебныйКлиентСервер.ГраницаУверенныхЗначений()
				И Вариант <> "ТолькоМешающиеПроведению" Тогда
				
				ТекстПодсказки = РаспознаваниеДокументовСлужебныйКлиентСервер.ПодсказкаВозможнаОшибкаСопоставленияРаспознаннойСтроки();
				ДобавитьПроблемныйЭлемент(ТаблицаПроблем, Реквизит.ИмяРеквизита, Реквизит.НомерСтрокиТЧ, "", ТекстПодсказки);
			КонецЕсли;
		Иначе
			Если ЭтоПримитивныйТип Тогда
				ТекстПодсказки = РаспознаваниеДокументовСлужебныйКлиентСервер.ПодсказкаВозможнаОшибкаРаспознавания();
			Иначе
				ТекстПодсказки = РаспознаваниеДокументовСлужебныйКлиентСервер.ПодсказкаНеНайденЭлементПоРаспознаннойСтроке();
			КонецЕсли;
			ДобавитьПроблемныйЭлемент(ТаблицаПроблем, Реквизит.ИмяРеквизита, Реквизит.НомерСтрокиТЧ, "", ТекстПодсказки);
		КонецЕсли;
	КонецЦикла;
	
	Если Вариант = "ТолькоМешающиеПроведению" Тогда
		ИдСтроки = ТаблицаПроблем.Количество();
		Пока ИдСтроки > 0 Цикл
			ИдСтроки = ИдСтроки - 1;
			Если ТаблицаПроблем[ИдСтроки].ИмяРеквизита = "ИтогоСуммаСкидки"
				Или ТаблицаПроблем[ИдСтроки].ИмяРеквизита = "ИтогоСумма"
				Или ТаблицаПроблем[ИдСтроки].ИмяРеквизита = "ИтогоСуммаНДС"
				Или ТаблицаПроблем[ИдСтроки].ИмяРеквизита = "ИтогоВсего" 
				Или ТаблицаПроблем[ИдСтроки].ИмяРеквизита = "НомерГТД" Тогда
				
				ТаблицаПроблем.Удалить(ИдСтроки);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	РаспознаваниеДокументовПереопределяемый.ПриОбработкеПроверкиЗаполненияРеквизитов(ДокументОбъект, ТаблицаПроблем);
	
	Возврат ТаблицаПроблем;
	
КонецФункции

Процедура ДобавитьОшибкиКоличествоЦенаСумма(ПроблемныеРеквизиты, ДанныеШапки, ТаблицаДокумента, СтрокаТаблицы)
	
	Если ДанныеШапки.ВидСкидки = РаспознаваниеДокументовСлужебныйКлиентСервер.ВидыСкидок().НаОтдельныеПозиции Тогда
		
		Если Окр(СтрокаТаблицы.Количество * СтрокаТаблицы.Цена, 2) <> СтрокаТаблицы.Сумма + СтрокаТаблицы.СуммаСкидки
			И (СтрокаТаблицы.Количество = 0
			Или Окр((СтрокаТаблицы.Сумма + СтрокаТаблицы.СуммаСкидки) / СтрокаТаблицы.Количество, 2) <> СтрокаТаблицы.Цена) Тогда
			
			ТекстПодсказки = НСтр("ru = 'Количество * Цена - Скидка не совпадает с Сумма'; en = 'Quantity * Price - Discount does not match Amount'");
			ДобавитьПроблемныйЭлемент(ПроблемныеРеквизиты, "Количество", СтрокаТаблицы.НомерСтроки, "Количество", ТекстПодсказки);
			ДобавитьПроблемныйЭлемент(ПроблемныеРеквизиты, "Цена", СтрокаТаблицы.НомерСтроки, "Количество", ТекстПодсказки);
			
		КонецЕсли;
		
	Иначе
	
		Если Окр(СтрокаТаблицы.Количество * СтрокаТаблицы.Цена, 2) <> СтрокаТаблицы.Сумма
			И (СтрокаТаблицы.Количество = 0 Или Окр(СтрокаТаблицы.Сумма / СтрокаТаблицы.Количество, 2) <> СтрокаТаблицы.Цена) Тогда
			
			ТекстПодсказки = НСтр("ru = 'Количество * Цена не совпадает с Сумма'; en = 'Quantity * Price does not match Amount'");
			ДобавитьПроблемныйЭлемент(ПроблемныеРеквизиты, "Количество", СтрокаТаблицы.НомерСтроки, "Количество", ТекстПодсказки);
			ДобавитьПроблемныйЭлемент(ПроблемныеРеквизиты, "Цена", СтрокаТаблицы.НомерСтроки, "Количество", ТекстПодсказки);
			
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьОшибкиСуммаСуммаНДСВсего(ПроблемныеРеквизиты, ДанныеШапки, ТаблицаДокумента, СтрокаТаблицы)
	
	Если НЕ ЗначенияСуммаСуммаНДСВсегоСовпадают(СтрокаТаблицы, ДанныеШапки.СуммаВключаетНДС) Тогда
		ТекстПодсказки = НСтр("ru = 'Сумма + Сумма НДС не совпадает с Всего'; en = 'Amount + VAT amount does not match Total'");
		
		Если НЕ СуммаИтогоПоКолонкеСовпадает(ТаблицаДокумента, "Сумма", ДанныеШапки.ИтогоСумма) Тогда
			ДобавитьПроблемныйЭлемент(ПроблемныеРеквизиты, "Сумма", СтрокаТаблицы.НомерСтроки, "Всего", ТекстПодсказки);
		КонецЕсли;
		
		Если НЕ СуммаИтогоПоКолонкеСовпадает(ТаблицаДокумента, "СуммаНДС", ДанныеШапки.ИтогоСуммаНДС) Тогда
			ДобавитьПроблемныйЭлемент(ПроблемныеРеквизиты, "СуммаНДС", СтрокаТаблицы.НомерСтроки, "Всего", ТекстПодсказки);
		КонецЕсли;
		
		Если НЕ СуммаИтогоПоКолонкеСовпадает(ТаблицаДокумента, "Всего", ДанныеШапки.ИтогоВсего) Тогда
			ДобавитьПроблемныйЭлемент(ПроблемныеРеквизиты, "Всего", СтрокаТаблицы.НомерСтроки, "Всего", ТекстПодсказки);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьОшибкиРаспознаноПоДокументу(ПроблемныеРеквизиты, ДанныеШапки, ТаблицаДокумента, СтрокаТаблицы)
	
	ПроверяемыеРеквизиты = Новый Массив;
	ПроверяемыеРеквизиты.Добавить("Цена");
	ПроверяемыеРеквизиты.Добавить("Количество");
	ПроверяемыеРеквизиты.Добавить("СуммаНДС");
	ПроверяемыеРеквизиты.Добавить("Сумма");
	ПроверяемыеРеквизиты.Добавить("СтавкаНДС");
	ПроверяемыеРеквизиты.Добавить("СтранаПроисхождения");
	ПроверяемыеРеквизиты.Добавить("Всего");
	
	ТекстПодсказки = НСтр("ru = 'Различаются значения ""до (в основании)"" и ""до (распознано)""'; en = 'The meanings of ""before (at the base)"" and ""before (recognized)"" differ.'");
	
	Для Каждого ПроверяемыйРеквизит Из ПроверяемыеРеквизиты Цикл
		
		ИмяРеквизитаПоДокументу = ПроверяемыйРеквизит + "ПоДокументу";
		ИмяРеквизитаДоКорректировки = ПроверяемыйРеквизит + "ДоКорректировки";
		
		Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТаблицы, ИмяРеквизитаПоДокументу)
			Или Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТаблицы, ИмяРеквизитаДоКорректировки) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТаблицы[ИмяРеквизитаПоДокументу])
			И СтрокаТаблицы[ИмяРеквизитаДоКорректировки] <> СтрокаТаблицы[ИмяРеквизитаПоДокументу] Тогда
			
			ДобавитьПроблемныйЭлемент(ПроблемныеРеквизиты, ИмяРеквизитаПоДокументу, СтрокаТаблицы.НомерСтроки,, ТекстПодсказки);
			ДобавитьПроблемныйЭлемент(ПроблемныеРеквизиты, ИмяРеквизитаДоКорректировки, СтрокаТаблицы.НомерСтроки,, ТекстПодсказки);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьПроблемныйЭлемент(ПроблемныеРеквизиты, ИмяРеквизита, НомерСтроки = 0, ГруппаОшибки = "", ТекстПодсказки = "")
	
	Строка = ПроблемныеРеквизиты.Добавить();
	Строка.ИмяРеквизита = ИмяРеквизита;
	Строка.НомерСтроки = НомерСтроки;
	Строка.ГруппаОшибки = ГруппаОшибки;
	Строка.ТекстПодсказки = ТекстПодсказки;
	
КонецПроцедуры

Функция СуммаИтогоПоКолонкеСовпадает(КоллекцияЗаписей, ИмяКолонкиСравнения, ЗначениеДляСравнения)
	
	Возврат КоллекцияЗаписей.Итог(ИмяКолонкиСравнения) = ЗначениеДляСравнения;
	
КонецФункции

Функция ЗначенияСуммаСуммаНДСВсегоСовпадают(ПроверяемаяЗапись, СуммаВключаетНДС)
	
	Если СуммаВключаетНДС Тогда
		СтавкаНДС = РаспознаваниеДокументовСлужебныйВызовСервераПовтИсп.ПолучитьСтавкуНДС(ПроверяемаяЗапись.СтавкаНДС);
		СуммаНДС = РаспознаваниеДокументовСлужебныйКлиентСервер.РассчитатьСуммуНДС(ПроверяемаяЗапись.Сумма, Истина, СтавкаНДС);
		НДСОкругленный = Окр(СуммаНДС, 2);
		
		Возврат ПроверяемаяЗапись.Сумма = ПроверяемаяЗапись.Всего И ПроверяемаяЗапись.СуммаНДС = НДСОкругленный;
	Иначе
		Возврат ПроверяемаяЗапись.Сумма + ПроверяемаяЗапись.СуммаНДС = ПроверяемаяЗапись.Всего;
	КонецЕсли;
	
КонецФункции

#Область ПроблемныеРеквизитыНаФорме

Процедура ПересчитатьПроблемныеЭлементы(Форма, РаспознанныйДокумент = Неопределено, ИмяТаблицы = "ТаблицаДокумента") Экспорт
	
	ТаблицаДокумента = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(Форма, ИмяТаблицы);
	Если РаспознанныйДокумент = Неопределено Тогда
		РаспознанныйДокумент = Форма.Объект;
	КонецЕсли;
	
	ТаблицаПроблем = ПроблемныеРеквизиты(РаспознанныйДокумент, , ТаблицаДокумента);
	
	// Удалим решенные проблемные элементы
	ИндексПроблемы = Форма.ПроблемныеЭлементы.Количество();
	Пока ИндексПроблемы > 0 Цикл
		ИндексПроблемы = ИндексПроблемы - 1;
		СтрокаПроблемы = Форма.ПроблемныеЭлементы[ИндексПроблемы];
		Отбор = Новый Структура("ИмяРеквизита, НомерСтроки, ГруппаОшибки");
		ЗаполнитьЗначенияСвойств(Отбор, СтрокаПроблемы);
		
		Если ТаблицаПроблем.НайтиСтроки(Отбор).Количество() = 0 Тогда
			// В новой таблице нет старой проблемы
			Если СтрокаПроблемы.НомерСтроки = 0 Тогда
				РаспознаваниеДокументовСлужебныйКлиентСервер.УстановитьЦветПоляПоУмолчанию(Форма, СтрокаПроблемы.ИмяРеквизита);
			Иначе
				РаспознаваниеДокументовСлужебныйКлиентСервер.ОтключитьУсловноеОформление(Форма, ИмяТаблицы, СтрокаПроблемы);
			КонецЕсли;
			Форма.ПроблемныеЭлементы.Удалить(СтрокаПроблемы);
		КонецЕсли;
	КонецЦикла;
	
	// Добавим новые проблемные элементы
	Для Каждого СтрокаПроблемы Из ТаблицаПроблем Цикл
		Отбор = Новый Структура("ИмяРеквизита, НомерСтроки, ГруппаОшибки");
		ЗаполнитьЗначенияСвойств(Отбор, СтрокаПроблемы);
		
		Если Форма.ПроблемныеЭлементы.НайтиСтроки(Отбор).Количество() = 0 Тогда
			// В старой таблице нет новой проблемы
			Если СтрокаПроблемы.НомерСтроки = 0 Тогда
				РаспознаваниеДокументовСлужебныйКлиентСервер.УстановитьЦветИДобавитьВПроблемные(Форма, СтрокаПроблемы);
			Иначе
				РаспознаваниеДокументовСлужебныйКлиентСервер.ДобавитьВУсловноеОформлениеИВПроблемные(Форма, ИмяТаблицы, СтрокаПроблемы);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ОбновитьКоличествоОшибок(Форма);
	
КонецПроцедуры

Процедура ВосстановитьТекстыОшибок(Форма, ИмяТаблицы = "ТаблицаДокумента") Экспорт
	
	Для Каждого СтрокаПроблемы Из Форма.ПроблемныеЭлементы Цикл
		
		СтрокиТаблицы = Форма[ИмяТаблицы].НайтиСтроки(Новый Структура("НомерСтроки", СтрокаПроблемы.НомерСтроки));
		Если СтрокиТаблицы.Количество() = 1 Тогда
			СтрокиТаблицы[0][СтрокаПроблемы.ИмяРеквизита + "ТекстОшибки"] = СтрокаПроблемы.ТекстПодсказки;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

Функция ПараметрыВыбораДоговора(ДокументОбъект) Экспорт
	
	// Ключи - Контрагент, Организация
	// Значения - сначала имена реквизитов для поиска, затем фактические значения
	Результат = РаспознаваниеДокументовСлужебныйКлиентСервер.ИменаРеквизитовКонтрагентИОрганизация(ДокументОбъект);
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Отбор = Новый Структура("ИмяРеквизита", Результат.Контрагент);
		НайденныеСтроки = ДокументОбъект.РеквизитыДокумента.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() <> 0 Тогда
			Результат.Вставить("Контрагент", НайденныеСтроки[0].Значение);
		КонецЕсли;
		
		Отбор = Новый Структура("ИмяРеквизита", Результат.Организация);
		НайденныеСтроки = ДокументОбъект.РеквизитыДокумента.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() <> 0 Тогда
			Результат.Вставить("Организация", НайденныеСтроки[0].Значение);
		КонецЕсли;
	Иначе
		Результат.Вставить("Контрагент", Неопределено);
		Результат.Вставить("Организация", Неопределено);
	КонецЕсли;
	
	РаспознаваниеДокументовКлиентСерверПереопределяемый.ПриЗаполненииПараметровВыбораДоговора(ДокументОбъект, Результат);
	
	Возврат Результат;
	
КонецФункции

Функция НайтиДоговорКонтрагента(ДокументОбъект) Экспорт
	
	ПараметрыДоговора = ПараметрыВыбораДоговора(ДокументОбъект);
	
	РеквизитыПоиска = Новый Массив;
	РеквизитыПоиска.Добавить("НомерДоговора");
	РеквизитыПоиска.Добавить("ДатаДоговора");
	
	Для Каждого ИмяРеквизита Из РеквизитыПоиска Цикл
		Реквизит = РаспознаваниеДокументовСлужебныйКлиентСервер.РеквизитДокумента(ДокументОбъект, ИмяРеквизита, Ложь);
		Если Реквизит = Неопределено Тогда
			ПараметрыДоговора.Вставить(ИмяРеквизита, Неопределено);
		Иначе
			ПараметрыДоговора.Вставить(ИмяРеквизита, Реквизит.Значение);
		КонецЕсли;
	КонецЦикла;
	
	ЗначениеДоговора = Неопределено;
	РаспознаваниеДокументовПереопределяемый.ПриЗаполненииДоговораКонтрагента(
		ЗначениеДоговора, ДокументОбъект, ПараметрыДоговора);
	
	Возврат ЗначениеДоговора;
	
КонецФункции

Функция НайтиДоговорыРаспознанныхДокументов(РаспознанныеДокументы) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РаспознанныеДокументы", РаспознанныеДокументы);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РаспознанныйДокумент.Ссылка КАК Ссылка,
	|	РаспознанныйДокумент.Направление КАК Направление,
	|	РаспознанныйДокумент.Контрагент КАК Контрагент,
	|	РаспознанныйДокумент.Организация КАК Организация
	|ПОМЕСТИТЬ ОсновнаяТаблица
	|ИЗ
	|	Документ.РаспознанныйДокумент КАК РаспознанныйДокумент
	|ГДЕ
	|	РаспознанныйДокумент.Ссылка В(&РаспознанныеДокументы)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОсновнаяТаблица.Ссылка КАК Ссылка,
	|	ОсновнаяТаблица.Направление КАК Направление,
	|	ОсновнаяТаблица.Контрагент КАК Контрагент,
	|	ОсновнаяТаблица.Организация КАК Организация,
	|	ЕСТЬNULL(СтрокаНомерДоговора.Значение, НЕОПРЕДЕЛЕНО) КАК НомерДоговора,
	|	ЕСТЬNULL(СтрокаДатаДоговора.Значение, НЕОПРЕДЕЛЕНО) КАК ДатаДоговора
	|ИЗ
	|	ОсновнаяТаблица КАК ОсновнаяТаблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РаспознанныйДокумент.РеквизитыДокумента КАК СтрокаНомерДоговора
	|		ПО ОсновнаяТаблица.Ссылка = СтрокаНомерДоговора.Ссылка
	|			И (СтрокаНомерДоговора.ИмяРеквизита = ""НомерДоговора"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РаспознанныйДокумент.РеквизитыДокумента КАК СтрокаДатаДоговора
	|		ПО ОсновнаяТаблица.Ссылка = СтрокаДатаДоговора.Ссылка
	|			И (СтрокаДатаДоговора.ИмяРеквизита = ""ДатаДоговора"")";
	
	ДанныеДокументов = Запрос.Выполнить().Выгрузить();
	
	Результат = Новый Соответствие;
	Для Каждого СтрокаДанных Из ДанныеДокументов Цикл
		ДанныеДокумента = Новый Структура("Ссылка, Направление, Контрагент, Организация, НомерДоговора, ДатаДоговора");
		ЗаполнитьЗначенияСвойств(ДанныеДокумента, СтрокаДанных);
		ПараметрыДоговора = Новый Структура("Контрагент, Организация, НомерДоговора, ДатаДоговора");
		ЗаполнитьЗначенияСвойств(ПараметрыДоговора, СтрокаДанных);
		
		РаспознаваниеДокументовКлиентСерверПереопределяемый.ПриЗаполненииПараметровВыбораДоговора(ДанныеДокумента, ПараметрыДоговора);
		
		ЗначениеДоговора = Неопределено;
		РаспознаваниеДокументовПереопределяемый.ПриЗаполненииДоговораКонтрагента(
			ЗначениеДоговора, ДанныеДокумента, ПараметрыДоговора);
		Если ЗначениеЗаполнено(ЗначениеДоговора) Тогда
			Результат.Вставить(СтрокаДанных.Ссылка, ЗначениеДоговора);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьДоговорКонтрагента(ДокументОбъект) Экспорт
	
	ЗначениеДоговора = НайтиДоговорКонтрагента(ДокументОбъект);
	
	Отбор = Новый Структура("ИмяРеквизита", "Договор");
	НайденныеСтроки = ДокументОбъект.РеквизитыДокумента.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() <> 0 Тогда
		НайденныеСтроки[0].Значение = ЗначениеДоговора;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьБанковскийСчет(ДокументОбъект) Экспорт
	
	ВсеДанныеСчета = Новый Структура;
	ВсеДанныеСчета.Вставить("Банк");
	ВсеДанныеСчета.Вставить("БанкНаименование");
	ВсеДанныеСчета.Вставить("БанкСчет");
	ВсеДанныеСчета.Вставить("Договор");
	ВсеДанныеСчета.Вставить("Продавец");
	ВсеДанныеСчета.Вставить("ПродавецОрганизация");
	
	Для Каждого ДанныеРеквизита Из ВсеДанныеСчета Цикл
		Отбор = Новый Структура("ИмяРеквизита", ДанныеРеквизита.Ключ);
		СтрокиПоиска = ДокументОбъект.РеквизитыДокумента.НайтиСтроки(Отбор);
		Если СтрокиПоиска.Количество() <> 0 Тогда
			ВсеДанныеСчета.Вставить(ДанныеРеквизита.Ключ, СтрокиПоиска[0].Значение);
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыСчета = Новый Структура("Банк, БанкНаименование, БанкСчет, Договор");
	ЗаполнитьЗначенияСвойств(ПараметрыСчета, ВсеДанныеСчета);
	
	// Банковский счет Контрагента (для Направление = Входящий)
	Отбор = Новый Структура("ИмяРеквизита", "БанковскийСчетКонтрагента");
	НайденныеСтроки = ДокументОбъект.РеквизитыДокумента.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() <> 0 Тогда
		Счет = НайденныеСтроки[0].Значение;
		
		ПараметрыСчета.Вставить("Владелец", ВсеДанныеСчета.Продавец);
		РаспознаваниеДокументовПереопределяемый.ПриЗаполненииБанковскогоСчета(Счет, ДокументОбъект, ПараметрыСчета);
		
		НайденныеСтроки[0].Значение = Счет;
		
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Счет, "НомерСчета") <> НайденныеСтроки[0].РаспознанныйТекст Тогда
			НайденныеСтроки[0].Значение = Справочники.БанковскиеСчета.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	
	// Банковский счет Организации (для Направление = Исходящий)
	Отбор = Новый Структура("ИмяРеквизита", "БанковскийСчетОрганизации");
	НайденныеСтроки = ДокументОбъект.РеквизитыДокумента.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() <> 0 Тогда
		Счет = НайденныеСтроки[0].Значение;
		
		ПараметрыСчета.Вставить("Владелец", ВсеДанныеСчета.ПродавецОрганизация);
		РаспознаваниеДокументовПереопределяемый.ПриЗаполненииБанковскогоСчета(Счет, ДокументОбъект, ПараметрыСчета);
		
		НайденныеСтроки[0].Значение = Счет;
	КонецЕсли;
	
КонецПроцедуры

Функция ВалютаОплаты(ДоговорКонтрагента) Экспорт
	
	Валюта = Неопределено;
	РаспознаваниеДокументовПереопределяемый.ПриЗаполненииВалютыОплаты(ДоговорКонтрагента, Валюта);
	
	Возврат Валюта;
	
КонецФункции

Процедура ЗаполнитьСчетФактуруИзРаспознанногоДокумента(Источник, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("РаспознаваниеДокументов") Тогда
		ЗаполнитьЗначенияСвойств(Источник, ДанныеЗаполнения);
		Если Метаданные.ОпределяемыеТипы.СчетФактураВыданныйБРД.Тип.СодержитТип(ТипЗнч(Источник)) Тогда
			Источник.ДатаВыставления = Источник.Дата;
		Иначе
			Источник.ДатаВходящегоДокумента = Источник.Дата;
			Источник.НомерВходящегоДокумента = Источник.Номер;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ПараметрыСозданияНоменклатуры() Экспорт
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("ОписаниеРеквизита");
	Таблица.Колонки.Добавить("ОписаниеЭлемента");
	
	Возврат Таблица;
	
КонецФункции

Процедура ДобавитьРеквизитыДляСозданияНоменклатуры(Форма, СвойстваОбработки) Экспорт
	
	ИмяТаблицы = СвойстваОбработки.ИмяЭлементаТаблицы;
	ИмяГруппыРеквизитов = СвойстваОбработки.ИмяЭлементаРеквизитовОбъекта;
	ИмяПроцедурыПриИзменении = СвойстваОбработки.ИмяПроцедурыПриИзменении;
	ИмяПроцедурыИзменениеФлажка = СвойстваОбработки.ИмяПроцедурыИзменениеФлажка;
	
	ЭлементДобавления = ЭлементФормыПоИмениРеквизита(Форма.Элементы, ИмяТаблицы);
	Если ЭлементДобавления = Неопределено Тогда
		Возврат; // Не найдена таблица для добавления реквизитов - дальнейшая обработка не имеет смысла
	КонецЕсли;
	
	ГруппаБыстрогоРедактирования = Форма.Элементы.Найти(ИмяГруппыРеквизитов);
	
	Параметры = ПараметрыСозданияНоменклатуры();
	РаспознаваниеДокументовПереопределяемый.ПриОпределенииПараметровСозданияНоменклатуры(Параметры);
	
	Если Не Параметры.Количество() Тогда // Отсутствуют реквизиты - дальнейшая обработка не имеет смысла
		Возврат;
	КонецЕсли;
	
	НовыеРеквизиты = РеквизитыДляСозданияНоменклатуры(Параметры, ИмяТаблицы);
	Форма.ИзменитьРеквизиты(НовыеРеквизиты);
	
	// Вывод реквизитов на форму
	Для Каждого ДобавляемыйРеквизит Из Параметры Цикл
		
		ОписаниеРеквизита = ДобавляемыйРеквизит.ОписаниеРеквизита;
		ОписаниеЭлемента = ДобавляемыйРеквизит.ОписаниеЭлемента;
		
		// Колонки таблицы
		ИмяЭлемента = ЭлементДобавления.Имя + ОписаниеРеквизита.Имя; // Для исключения возможности повторения
		
		ЭлементФормы = Форма.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ЭлементДобавления);
		ЭлементФормы.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементФормы.ПутьКДанным = ЭлементДобавления.ПутьКДанным + "." + ОписаниеРеквизита.Имя;
		Если ОписаниеРеквизита.ПроверкаЗаполнения = ПроверкаЗаполнения.ВыдаватьОшибку Тогда
			ЭлементФормы.АвтоотметкаНезаполненного = Истина;
		КонецЕсли;
		Если Не ОписаниеЭлемента = Неопределено Тогда
			Для Каждого СвойствоЭлемента Из ОписаниеЭлемента Цикл
				ЭлементФормы[СвойствоЭлемента.Ключ] = СвойствоЭлемента.Значение;
			КонецЦикла;
		КонецЕсли;
		
		// Поля для быстрого редактирования
		Если ГруппаБыстрогоРедактирования = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяГруппы = "Группа" + ИмяЭлемента;
		
		ГруппаЭлемента = Форма.Элементы.Добавить(ИмяГруппы, Тип("ГруппаФормы"), ГруппаБыстрогоРедактирования);
		ГруппаЭлемента.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаЭлемента.ОтображатьЗаголовок = Ложь;
		ГруппаЭлемента.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		ГруппаЭлемента.Объединенная = Ложь;
		
		ПолеНераспознаннойНоменклатуры = Форма.ПоляНераспознаннойНоменклатуры.Добавить();
		ПолеНераспознаннойНоменклатуры.ИмяРеквизита = ОписаниеРеквизита.Имя;
		ПолеНераспознаннойНоменклатуры.Значение = ОписаниеРеквизита.Тип.ПривестиЗначение();
		ИндексПоля = Форма.ПоляНераспознаннойНоменклатуры.Индекс(ПолеНераспознаннойНоменклатуры);
		
		ФлажокБыстрогоРедактирования = Форма.Элементы.Добавить("Флажок" + ИмяЭлемента, Тип("ПолеФормы"), ГруппаЭлемента);
		ФлажокБыстрогоРедактирования.Вид = ВидПоляФормы.ПолеФлажка;
		ФлажокБыстрогоРедактирования.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		ФлажокБыстрогоРедактирования.ПутьКДанным = "ПоляНераспознаннойНоменклатуры[" + ИндексПоля + "].Выбран";
		ФлажокБыстрогоРедактирования.УстановитьДействие("ПриИзменении", ИмяПроцедурыИзменениеФлажка);
		
		ЭлементБыстрогоРедактирования = Форма.Элементы.Добавить("Поле" + ИмяЭлемента, Тип("ПолеФормы"), ГруппаЭлемента);
		ЭлементБыстрогоРедактирования.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементБыстрогоРедактирования.Заголовок = ОписаниеРеквизита.Синоним;
		ЭлементБыстрогоРедактирования.ВыбиратьТип = Ложь;
		ЭлементБыстрогоРедактирования.ПутьКДанным = "ПоляНераспознаннойНоменклатуры[" + ИндексПоля + "].Значение";
		Если ОписаниеРеквизита.ПроверкаЗаполнения = ПроверкаЗаполнения.ВыдаватьОшибку Тогда
			ЭлементБыстрогоРедактирования.АвтоотметкаНезаполненного = Истина;
		КонецЕсли;
		Если Не ОписаниеЭлемента = Неопределено Тогда
			Для Каждого СвойствоЭлемента Из ОписаниеЭлемента Цикл
				ЭлементБыстрогоРедактирования[СвойствоЭлемента.Ключ] = СвойствоЭлемента.Значение;
			КонецЦикла;
		КонецЕсли;
		
		Если ОписаниеРеквизита.Имя = "СтавкаНДС" Тогда
			ЗаполнитьСпискиВыбораСтавокНДС(Форма);
		КонецЕсли;
		
		ЭлементБыстрогоРедактирования.УстановитьДействие("ПриИзменении", ИмяПроцедурыПриИзменении);
		
	КонецЦикла;
	
КонецПроцедуры

Функция НоваяНоменклатураПоПараметрам(Параметры) Экспорт
	
	НоваяНоменклатура = Неопределено;
	РаспознаваниеДокументовПереопределяемый.ОбработкаСозданияНоменклатуры(НоваяНоменклатура, Параметры);
	
	Возврат НоваяНоменклатура;
	
КонецФункции

Процедура ДобавитьКандидатовВСписокВыбора(ДокументОбъект, ДокументСсылка, ИмяРеквизита, Кандидаты, НомерСтроки = Неопределено) Экспорт
	
	Если Кандидаты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если НомерСтроки = Неопределено Тогда
		НаборЗаписей = РегистрыСведений.СписокВыбораРеквизитовРаспознаваниеДокументов.СоздатьНаборЗаписей();
	Иначе
		НаборЗаписей = РегистрыСведений.СписокВыбораТабличныхЧастейРаспознаваниеДокументов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.НомерСтрокиТЧ.Установить(НомерСтроки);
	КонецЕсли;
	
	НаборЗаписей.Отбор.РаспознанныйДокумент.Установить(ДокументСсылка);
	НаборЗаписей.Отбор.ИмяРеквизита.Установить(ИмяРеквизита);
	
	// Для поиска по нескольким реквизитам затираем результаты старого нечеткого поиска,
	// кроме найденных в регистре СоответствиеРаспознанныхСтрокРаспознаваниеДокументов
	НаборЗаписей.Прочитать();
	
	НаиболееУверенноеЗначениеПройдено = Ложь;
	ИмеющиесяДанные = НаборЗаписей.Выгрузить();
	Если ИмеющиесяДанные.Количество() Тогда
		ТекущийПорядковыйНомер = 0;
		Ид = ИмеющиесяДанные.Количество();
		Пока Ид > 0 Цикл
			Ид = Ид - 1;
			Если ИмеющиесяДанные[Ид].НайденВТаблицеСоответствий Тогда
				ЗаполнитьНайденноеЗначениеВОбъекте(ДокументОбъект, ИмяРеквизита, НомерСтроки, ИмеющиесяДанные[Ид].Значение, ИмеющиесяДанные[Ид].Уверенность, НаиболееУверенноеЗначениеПройдено);
				ТекущийПорядковыйНомер = ТекущийПорядковыйНомер + 1;
				ИмеющиесяДанные[Ид].ПорядковыйНомер = ТекущийПорядковыйНомер;
			Иначе
				ИмеющиесяДанные.Удалить(Ид);
			КонецЕсли;
		КонецЦикла;
	Иначе
		ТекущийПорядковыйНомер = 0;
	КонецЕсли;
	
	НаборЗаписей.Загрузить(ИмеющиесяДанные);
	
	Для Каждого Кандидат Из Кандидаты Цикл
		
		ЗаполнитьНайденноеЗначениеВОбъекте(ДокументОбъект, ИмяРеквизита, НомерСтроки, Кандидат.Ссылка, Кандидат.Коэффициент * 100, НаиболееУверенноеЗначениеПройдено);
		ЕстьСовпадение = Ложь;
		Для Каждого ИмеющаясяЗапись Из НаборЗаписей Цикл
			Если ИмеющаясяЗапись.Значение = Кандидат.Ссылка
				И ИмеющаясяЗапись.ДополнительноеЗначение = Кандидат.ДополнительнаяСсылка Тогда
				
				Если НЕ ИмеющаясяЗапись.НайденВТаблицеСоответствий Тогда
					ИмеющаясяЗапись.Уверенность = Кандидат.Коэффициент * 100;
				КонецЕсли;
				ЕстьСовпадение = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ ЕстьСовпадение Тогда
			ТекущийПорядковыйНомер = ТекущийПорядковыйНомер + 1;
			ДанныеНабора = НаборЗаписей.Добавить();
			ДанныеНабора.РаспознанныйДокумент = ДокументСсылка;
			ДанныеНабора.ПорядковыйНомер = ТекущийПорядковыйНомер;
			ДанныеНабора.ИмяРеквизита = ИмяРеквизита;
			ДанныеНабора.Значение = Кандидат.Ссылка;
			ДанныеНабора.ДополнительноеЗначение = Кандидат.ДополнительнаяСсылка;
			ДанныеНабора.Уверенность = Кандидат.Коэффициент * 100;
			Если НЕ НомерСтроки = Неопределено Тогда
				ДанныеНабора.НомерСтрокиТЧ = НомерСтроки;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ЗаполнитьНайденноеЗначениеВОбъекте(ДокументОбъект, ИмяРеквизита, НомерСтроки, Значение, Уверенность, НаиболееУверенноеЗначениеПройдено)
	
	Если НаиболееУверенноеЗначениеПройдено Тогда
		Возврат;
	КонецЕсли;
	
	НаиболееУверенноеЗначениеПройдено = Истина;
	Если НомерСтроки = Неопределено Тогда
		НайденнаяСтрока = ДокументОбъект.РеквизитыДокумента.Найти(ИмяРеквизита, "ИмяРеквизита");
		Если НайденнаяСтрока = Неопределено Тогда
			Возврат;
		КонецЕсли;
	Иначе
		Отбор = Новый Структура("ИмяРеквизита, НомерСтрокиТЧ", ИмяРеквизита, НомерСтроки);
		НайденныеСтроки = ДокументОбъект.РеквизитыТабличныхЧастей.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() = 0 Тогда
			Возврат;
		Иначе
			НайденнаяСтрока = НайденныеСтроки[0];
		КонецЕсли;
	КонецЕсли;
	
	НайденнаяСтрока.НайденноеЗначение = Значение;
	НайденнаяСтрока.УверенностьНайденногоЗначения = Уверенность;
	
КонецПроцедуры

Функция ЭлементФормыПоИмениРеквизита(ЭлементыФормы, ИмяРеквизита)
	
	Для Каждого ЭлементФормы Из ЭлементыФормы Цикл
		Если Не (ТипЗнч(ЭлементФормы) = Тип("ТаблицаФормы") Или ТипЗнч(ЭлементФормы) = Тип("ПолеФормы")) Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрЗаканчиваетсяНа(ЭлементФормы.ПутьКДанным, ИмяРеквизита) Тогда
			Возврат ЭлементФормы;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Функция РеквизитыДляСозданияНоменклатуры(Реквизиты, ИмяТаблицыНераспознаннойНоменклатуры) Экспорт
	
	ДобавляемыеРеквизиты = Новый Массив();
	
	Для Каждого ДобавляемыйРеквизит Из Реквизиты Цикл
		НовыйРеквизит = Новый РеквизитФормы(ДобавляемыйРеквизит.ОписаниеРеквизита.Имя,
											ДобавляемыйРеквизит.ОписаниеРеквизита.Тип,
											ИмяТаблицыНераспознаннойНоменклатуры,
											ДобавляемыйРеквизит.ОписаниеРеквизита.Синоним);
		
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	КонецЦикла;
	
	Возврат ДобавляемыеРеквизиты;
	
КонецФункции

Функция ПолучитьПараметрыПрисоединяемогоФайла(Объект, ВладелецФайлов, ДвоичныеДанные)
	
	СтруктураИмениФайла = РазложитьИмяФайла(Объект.ИмяФайла);
	ПараметрыФайла = Новый Структура;
	ПараметрыФайла.Вставить("ВладелецФайлов",     ВладелецФайлов);
	ПараметрыФайла.Вставить("Автор",              Неопределено);
	ПараметрыФайла.Вставить("ИмяБезРасширения",   СтруктураИмениФайла.Имя);
	ПараметрыФайла.Вставить("РасширениеБезТочки", "jpeg");
	ПараметрыФайла.Вставить("ГруппаФайлов",       Неопределено);
	ПараметрыФайла.Вставить("Размер",             ДвоичныеДанные.Размер());
	ПараметрыФайла.Вставить("ВремяИзменения");
	ПараметрыФайла.Вставить("ВремяИзмененияУниверсальное");
	
	Возврат ПараметрыФайла;
	
КонецФункции

Функция ФайлУжеЕстьУВладельца(ВладелецФайлов, ПараметрыФайла)
	
	Файлы = Новый Массив;
	РаботаСФайлами.ЗаполнитьПрисоединенныеФайлыКОбъекту(ВладелецФайлов, Файлы);
	Для Каждого Файл Из Файлы Цикл
		
		Попытка
			ДанныеФайла = РаботаСФайлами.ДанныеФайла(Файл);
			Если ДанныеФайла.Наименование = ПараметрыФайла.ИмяБезРасширения
				И ДанныеФайла.Размер = ПараметрыФайла.Размер Тогда
				
				Возврат Истина;
			КонецЕсли;
		Исключение
			Продолжить;
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция СканУжеЕстьУВладельца(Объект, ВладелецФайлов, АдресСкана) Экспорт
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресСкана);
	Если ТипЗнч(ДвоичныеДанные) = Тип("ДвоичныеДанные") Тогда 
		ПараметрыФайла = ПолучитьПараметрыПрисоединяемогоФайла(Объект, ВладелецФайлов, ДвоичныеДанные);
		Возврат ФайлУжеЕстьУВладельца(ВладелецФайлов, ПараметрыФайла);
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция НайтиДубльНоменклатуры(ИскомаяЗапись, НаборЗаписей)
	
	// Исходный НаборЗаписей содержит только создаваемую Номенклатуру. Проверим сначала по справочнику
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Наименование", ИскомаяЗапись["Наименование"]);
	Запрос.УстановитьПараметр("Артикул", ИскомаяЗапись["Артикул"]);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Наименование = &Наименование
	|	И (Номенклатура.Артикул = &Артикул
	|			ИЛИ &Артикул = """"
	|			ИЛИ Номенклатура.Артикул = """")";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Если Запись = ИскомаяЗапись Тогда
			Продолжить;
		КонецЕсли;
		
		Идентичны = (ИскомаяЗапись["Наименование"] = Запись["Наименование"]
		И (ИскомаяЗапись["Артикул"] = Запись["Артикул"]
			Или ПустаяСтрока(ИскомаяЗапись["Артикул"])
			Или ПустаяСтрока(Запись["Артикул"]))
		);
		
		Если Идентичны И ЗначениеЗаполнено(Запись.Ссылка) Тогда
			Возврат Запись.Ссылка;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Процедура ЗаполнитьСпискиВыбораСтавокНДС(Форма) Экспорт
	
	ЭлементФормы = Форма.Элементы.СписокНераспознаннойНоменклатурыСтавкаНДС;
	ЭлементБыстрогоРедактирования = Форма.Элементы.ПолеСписокНераспознаннойНоменклатурыСтавкаНДС;

	ЭлементФормы.РежимВыбораИзСписка = Истина;
	ЭлементФормы.СписокВыбора.Очистить();
	РаспознаваниеДокументовПереопределяемый.СтавкиНДСПоДатеРаспознанногоДокумента(
		Форма.Объект.РеквизитыДокумента[1].Значение,
		ЭлементФормы.СписокВыбора);
	
	ЭлементБыстрогоРедактирования.РежимВыбораИзСписка = Истина;
	ЭлементБыстрогоРедактирования.СписокВыбора.Очистить();
	РаспознаваниеДокументовПереопределяемый.СтавкиНДСПоДатеРаспознанногоДокумента(
		Форма.Объект.РеквизитыДокумента[1].Значение,
		ЭлементБыстрогоРедактирования.СписокВыбора);
	
КонецПроцедуры

#Область РаботаСоСтроками

// Возвращает структуру
// Результат (Структура)
// - Имя (Строка)
// - Расширение (Строка)
//
// Параметры:
// - ИмяФайла (Строка)
//
Функция РазложитьИмяФайла(ИмяФайла) Экспорт
	
	Расширение = ИмяФайла;
	Поз = Найти(Расширение, ".");
	Если Поз = 0 Тогда
		Возврат Новый Структура("Имя, Расширение", СокрЛП(ИмяФайла), "");
	КонецЕсли;
	Пока Поз > 0 Цикл
		Расширение = Сред(Расширение, Поз + 1);
		Поз = Найти(Расширение, ".");
	КонецЦикла;
	Имя = Лев(ИмяФайла, СтрДлина(ИмяФайла) - СтрДлина(Расширение) - 1);
	Возврат Новый Структура("Имя, Расширение", СокрЛП(Имя), СокрЛП(Расширение));
	
КонецФункции

#КонецОбласти

#Область ФормаРаспознанногоДокумента

Процедура ПередЗаписьюНаСервере(ЭтотОбъект, Отказ, ТекущийОбъект, ПараметрыЗаписи) Экспорт
	
	ЗаписьРаспознанногоДокументаРазрешена = ПараметрыЗаписи.Свойство("ЗаписьРаспознанногоДокументаРазрешена")
		И ПараметрыЗаписи.ЗаписьРаспознанногоДокументаРазрешена = Истина;
	
	Если Не ЗаписьРаспознанногоДокументаРазрешена Тогда
		Отказ = Истина;
		
		ПараметрыЗаписи.Вставить("ЗаписьРаспознанногоДокументаРазрешена", Истина);
		Если РольДоступна("КорректировкаНераспознанныхДокументов") Тогда
			УстановитьПривилегированныйРежим(Истина);
			ЭтотОбъект.Записать(ПараметрыЗаписи);
			УстановитьПривилегированныйРежим(Ложь);
		Иначе
			ЭтотОбъект.Записать(ПараметрыЗаписи);
		КонецЕсли;
		
		Возврат;
	КонецЕсли;
	
	РаспознаваниеДокументовПереопределяемый.ПередЗаписьюФормыРаспознаванияНаСервере(ЭтотОбъект, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

#КонецОбласти

Функция ПараметрыСозданияНовогоЭлемента(ИмяЭлемента, ТипДокумента, Направление) Экспорт
	
	СвязанныеКолонки = Новый Массив;
	РаспознаваниеДокументовПереопределяемый.ПриЗаполненииПараметровСозданияНовогоЭлемента(
		СвязанныеКолонки,
		ИмяЭлемента,
		ТипДокумента,
		Направление);
	
	Возврат СвязанныеКолонки;
	
КонецФункции

Процедура ДобавитьИННКПП(ПараметрыПоиска, ИННКПП)
	
	ПараметрыПоиска.Вставить("ИНН", ИзвлечьИННКППИзСтроки(ИННКПП, "ИНН"));
	ПараметрыПоиска.Вставить("КПП", ИзвлечьИННКППИзСтроки(ИННКПП, "КПП"));
	
КонецПроцедуры

Функция ИзвлечьЦифрыИзСтроки(Строка) Экспорт
	
	ДоступныеСимволы = "0123456789";
	Возврат ИзвлечьСимволыИзСтроки(Строка, ДоступныеСимволы);
	
КонецФункции

Функция ИзвлечьАртикулИзСтроки(Строка) Экспорт
	
	ДоступныеСимволы = "-_./:"
		+ "0123456789"
		+ "абвгдежзиклмнопрстуфхцчшщъыьэюя"
		+ "АБВГДЕЖЗИКЛМНОПРЕСТУФХЦЧШЩЪЫЬЭЮЯ"
		+ "abcdefghijklmnopqrstuvwxwz"
		+ "ABCDEFGHIGKLMNOPQRSTUVWXYZ";
	Возврат ИзвлечьСимволыИзСтроки(Строка, ДоступныеСимволы);
	
КонецФункции

Функция ИзвлечьГТДИзСтроки(Строка) Экспорт
	
	ДоступныеСимволы = "0123456789/";
	Возврат ИзвлечьСимволыИзСтроки(Строка, ДоступныеСимволы);
	
КонецФункции

Функция ИзвлечьИННКППИзСтроки(ИННКПП, ИмяРеквизита) Экспорт
	
	НаборЗначений = СтрРазделить(ИННКПП, "/", Ложь);
	
	Если НаборЗначений.Количество() И ИмяРеквизита = "ИНН" Тогда
		Возврат ИзвлечьЦифрыИзСтроки(НаборЗначений[0]);
	ИначеЕсли НаборЗначений.Количество() > 1 И ИмяРеквизита = "КПП" Тогда
		Возврат ИзвлечьЦифрыИзСтроки(НаборЗначений[1]);
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция ИзвлечьСимволыИзСтроки(Строка, ДоступныеСимволы)
	
	Результат = Строка;
	Индекс = 1;
	Пока Индекс <= СтрДлина(Результат) Цикл
		ПроверяемыйСимвол = Сред(Результат, Индекс, 1);
		Если СтрНайти(ДоступныеСимволы, ПроверяемыйСимвол) = 0 Тогда
			Результат = СтрЗаменить(Результат, ПроверяемыйСимвол, "");
			Продолжить;
		КонецЕсли;
		Индекс = Индекс + 1;
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

#Область СвойстваЯчеекТаблицы

Функция СвойстваЯчеекТаблицы(Объект) Экспорт
	
	Результат = Новый Структура;
	
	Для Каждого СтрокаТЧ Из Объект.РеквизитыТабличныхЧастей Цикл
		
		Свойства = Новый Структура;
		Свойства.Вставить("ИмяРеквизита", СтрокаТЧ.ИмяРеквизита);
		Свойства.Вставить("Значение", СтрокаТЧ.Значение);
		Свойства.Вставить("ТипЗначения", ТипЗнч(СтрокаТЧ.Значение));
		
		Свойства.Вставить("НайденноеЗначение", СтрокаТЧ.НайденноеЗначение);
		Свойства.Вставить("УверенностьНайденногоЗначения", СтрокаТЧ.УверенностьНайденногоЗначения);
		
		Свойства.Вставить("РаспознанныйТекст", СтрокаТЧ.РаспознанныйТекст);
		Свойства.Вставить("ЗаполненоВручную", СтрокаТЧ.ЗаполненоВручную);
		Свойства.Вставить("ЭлементСоздан", СтрокаТЧ.ЭлементСоздан);
		Свойства.Вставить("НомерСтроки", СтрокаТЧ.НомерСтроки);
		
		Свойства.Вставить("СтрокВИзображении", СтрокаТЧ.СтрокВИзображении);
		Свойства.Вставить("Координаты", РаспознаваниеДокументовСлужебныйКлиентСервер.ПолучитьНаборКоординат(СтрокаТЧ));
		
		Свойства.Вставить("ЗначенияВыбора", Новый Массив);
		
		Ключ = РаспознаваниеДокументовСлужебныйКлиентСервер.КлючСвойстваЯчеекТаблицы(
			СтрокаТЧ.ИмяРеквизита, СтрокаТЧ.НомерСтрокиТЧ);
		Результат.Вставить(Ключ, Свойства);
		
	КонецЦикла;
	
	ЗначенияВыбораЗначений = ЗначенияВыбораЗначенийТаблицыДокумента(Объект.Ссылка);
	
	Для Каждого ДанныеВыбора Из ЗначенияВыбораЗначений Цикл
		
		Ключ = РаспознаваниеДокументовСлужебныйКлиентСервер.КлючСвойстваЯчеекТаблицы(
			ДанныеВыбора.ИмяРеквизита, ДанныеВыбора.НомерСтроки);
		
		ВариантВыбора = Новый Структура;
		ВариантВыбора.Вставить("Значение", ДанныеВыбора.Значение);
		ВариантВыбора.Вставить("ДополнительноеЗначение", ДанныеВыбора.ДополнительноеЗначение);
		ВариантВыбора.Вставить("Уверенность", ДанныеВыбора.Уверенность);
		ВариантВыбора.Вставить("НайденВТаблицеСоответствий", ДанныеВыбора.НайденВТаблицеСоответствий);
		
		Свойства = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Результат, Ключ);
		Свойства.ЗначенияВыбора.Добавить(ВариантВыбора);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область РеквизитыРаспознанногоДокумента

Функция РеквизитыРаспознанногоДокумента(Объект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РаспознанныйДокументРеквизитыДокумента.Ссылка КАК Ссылка,
		|	РаспознанныйДокументРеквизитыДокумента.НомерСтроки КАК НомерСтроки,
		|	РаспознанныйДокументРеквизитыДокумента.ИмяРеквизита КАК ИмяРеквизита,
		|	РаспознанныйДокументРеквизитыДокумента.Значение КАК Значение,
		|	РаспознанныйДокументРеквизитыДокумента.ЗаполненоВручную КАК ЗаполненоВручную,
		|	РаспознанныйДокументРеквизитыДокумента.НайденноеЗначение КАК НайденноеЗначение,
		|	РаспознанныйДокументРеквизитыДокумента.УверенностьНайденногоЗначения КАК УверенностьНайденногоЗначения,
		|	РаспознанныйДокументРеквизитыДокумента.РаспознанныйТекст КАК РаспознанныйТекст,
		|	РаспознанныйДокументРеквизитыДокумента.ОбластьИзображения КАК ОбластьИзображения,
		|	РаспознанныйДокументРеквизитыДокумента.СтрокВИзображении КАК СтрокВИзображении,
		|	РаспознанныйДокументРеквизитыДокумента.КоординатаX0 КАК КоординатаX0,
		|	РаспознанныйДокументРеквизитыДокумента.КоординатаY0 КАК КоординатаY0,
		|	РаспознанныйДокументРеквизитыДокумента.КоординатаX1 КАК КоординатаX1,
		|	РаспознанныйДокументРеквизитыДокумента.КоординатаY1 КАК КоординатаY1,
		|	РаспознанныйДокументРеквизитыДокумента.ЭлементСоздан КАК ЭлементСоздан
		|ИЗ
		|	Документ.РаспознанныйДокумент.РеквизитыДокумента КАК РаспознанныйДокументРеквизитыДокумента
		|ГДЕ
		|	РаспознанныйДокументРеквизитыДокумента.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка); 
	Таблица = Запрос.Выполнить().Выгрузить();
	МассивСтрок = Новый Массив;
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		ДанныеСтроки =  ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СтрокаТаблицы);
		МассивСтрок.Добавить(ДанныеСтроки);
	КонецЦикла;
	
	ВозвращаемыеДанные = Новый Структура;
	ВозвращаемыеДанные.Вставить("РеквизитыДокумента", МассивСтрок);
	Возврат ВозвращаемыеДанные;
	
КонецФункции

#КонецОбласти

#Область ПроверкаБлокировки

// Выполняет анализ выполненного перехода.
//
// Возвращаемое значение:
//  Строка - 
//    "ПереходаНеБыло"
//    "КоробкаВКоробку"
//    "КоробкаВОблако"
//    "ОблакоВКоробку"
//    "ОблакоВОблако"
//
Функция ВариантВыполненногоПерехода() Экспорт
	
	ДоПерехода = РегистрыСведений.ПараметрыАвторизацииИскусственногоИнтеллекта.СохраненныеНастройки(
		Перечисления.СервисыИскусственногоИнтеллекта.РаспознаваниеДокументов
	);
	
	// {УАТ}
	РазделениеВключено = ОбщегоНазначения.РазделениеВключено();
	ЗначениеРазделителяСеанса = ИнтернетПоддержкаПользователей.ЗначениеРазделителяСеанса();
	// {/УАТ}
	
	СменаРежимаРаботы = (ДоПерехода.РазделениеВключено <> РазделениеВключено);
	Если СменаРежимаРаботы Тогда
		
		Если ДоПерехода.РазделениеВключено Тогда
			Результат = "ОблакоВКоробку";
		Иначе
			Результат = "КоробкаВОблако";
		КонецЕсли;
		
	Иначе // Были облако осталось облаком, были коробка осталась коробкой
		
		СменаОбласти = РазделениеВключено И (ДоПерехода.ЗначениеРазделителяСеанса <> ЗначениеРазделителяСеанса);
		Если СменаОбласти Тогда
			Результат = "ОблакоВОблако";
		Иначе
			// "КоробкаВКоробку" - состояние недостижимое, не вычисляем
			
			Результат = "ПереходаНеБыло";
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ТребуетсяЗаблокироватьСервисРаспознавания() Экспорт
	
	Результат = Ложь;
	ВариантПерехода = ВариантВыполненногоПерехода();
	Если ВариантПерехода = "КоробкаВОблако"
		Или ВариантПерехода = "ОблакоВКоробку"
		Или ВариантПерехода = "ОблакоВОблако" Тогда
		
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаблокироватьСервисРаспознавания() Экспорт
	
	Если ТребуетсяЗаблокироватьСервисРаспознавания() Тогда
		РаспознаваниеДокументов.УдалитьДанныеАвторизации(Истина);
		Справочники.МобильныеПриложенияРаспознаванияДокументов.УстановитьПризнакОтключенВсемМобильнымПриложениям();
	КонецЕсли;
	
КонецПроцедуры

Функция ТекущиеПараметрыАвторизацииИИ() Экспорт
	
	Результат = РегистрыСведений.ПараметрыАвторизацииИскусственногоИнтеллекта.НачальныеНастройки(); 
	// {УАТ}
	Результат.РазделениеВключено = ОбщегоНазначения.РазделениеВключено();
	Результат.ЗначениеРазделителяСеанса = ИнтернетПоддержкаПользователей.ЗначениеРазделителяСеанса();
	// {/УАТ}

	Если Результат.РазделениеВключено Тогда
		Попытка
			// {УАТ} 
			АдресПриложения = "";
			//АдресПриложения = ПрограммныйИнтерфейсСервиса.СвойстваПриложения(ИнтернетПоддержкаПользователей.ЗначениеРазделителяСеанса()).АдресПриложения;
			// {/УАТ}
		Исключение
			Результат.АдресПриложения = "";
		КонецПопытки;
	Иначе
		Результат.АдресПриложения = "";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

Функция ВидыОперацийПоступлениеТоваровУслуг() Экспорт
	
	Результат = Новый Структура;
	
	РаспознаваниеДокументовПереопределяемый.ВидыОперацийПоступлениеТоваровУслуг(Результат);
	
	Возврат Результат;
	
КонецФункции

Функция ВидыОперацийРеализацияТоваров() Экспорт
	
	Результат = Новый Структура;
	
	РаспознаваниеДокументовПереопределяемый.ВидыОперацийРеализацияТоваров(Результат);
	
	Возврат Результат;
	
КонецФункции

#Область ПрисоединениеФайлов

Процедура ДобавитьПрисоединенныйФайл(ДокументОбъект, ВладелецФайловСсылка, АдресКартинки) Экспорт
	
	Если Не ЗначениеЗаполнено(ВладелецФайловСсылка) Тогда
		Возврат
	КонецЕсли;
	
	ТекущиеНастройки = РегистрыСведений.ОбщиеНастройкиРаспознаваниеДокументов.ТекущиеНастройки();
	Если ТекущиеНастройки.НеПрикреплятьИзображения Тогда
		Возврат;
	КонецЕсли;
	
	Если Не РаботаСФайлами.КОбъектуМожноПрисоединятьФайлы(ВладелецФайловСсылка) Тогда
		РегистрыСведений.СвязанныеОбъектыРаспознаниеДокументов.ЗаписатьЗначения(ВладелецФайловСсылка, ДокументОбъект.Ссылка, Ложь);
		Возврат;
	КонецЕсли;
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресКартинки);
	Если ТипЗнч(ДвоичныеДанные) = Тип("ДвоичныеДанные") Тогда 
		ПараметрыФайла = ПолучитьПараметрыПрисоединяемогоФайла(ДокументОбъект, ВладелецФайловСсылка, ДвоичныеДанные);
		
		Если Не ФайлУжеЕстьУВладельца(ВладелецФайловСсылка, ПараметрыФайла) Тогда
			РаботаСФайлами.ДобавитьФайл(ПараметрыФайла, АдресКартинки);
		КонецЕсли;
	КонецЕсли;
	
	ПослеПрикрепленияСкриншота(ВладелецФайловСсылка, ДокументОбъект.Ссылка, ДокументОбъект.ИдентификаторРезультата);
	
КонецПроцедуры

Процедура ПрикрепитьИсходныеФайлы(ДокументСсылка, КудаДобавляемСсылка) Экспорт
	
	ТекущиеНастройки = РегистрыСведений.ОбщиеНастройкиРаспознаваниеДокументов.ТекущиеНастройки();
	Если ТекущиеНастройки.НеПрикреплятьИзображения Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, "ИдентификаторРезультата");
	
	ИнформацияОФайлах = РегистрыСведений.ИсходныеДанныеЗаданийРаспознаваниеДокументов.
		ПолучитьИдентификаторыФайлов(РеквизитыДокумента.ИдентификаторРезультата);
	
	Для Каждого ИнформацияОФайле Из ИнформацияОФайлах Цикл
		
		СтруктураИмениФайла = РазложитьИмяФайла(ИнформацияОФайле.ИмяФайла);
		
		ПараметрыФайла = Новый Структура;
		ПараметрыФайла.Вставить("ВладелецФайлов",     КудаДобавляемСсылка);
		ПараметрыФайла.Вставить("Автор",              Неопределено);
		ПараметрыФайла.Вставить("ИмяБезРасширения",   СтруктураИмениФайла.Имя);
		ПараметрыФайла.Вставить("РасширениеБезТочки", НРег(СтруктураИмениФайла.Расширение));
		ПараметрыФайла.Вставить("ГруппаФайлов",       Неопределено);
		ПараметрыФайла.Вставить("ВремяИзменения");
		ПараметрыФайла.Вставить("ВремяИзмененияУниверсальное");
		
		АдресИзображения = ПоместитьВоВременноеХранилище(ИнформацияОФайле.ИсходныйФайл, Новый УникальныйИдентификатор);
		РаботаСФайлами.ДобавитьФайл(ПараметрыФайла, АдресИзображения);
		УдалитьИзВременногоХранилища(АдресИзображения);
	
	КонецЦикла;
	
	ПослеПрикрепленияСкриншота(КудаДобавляемСсылка, ДокументСсылка, РеквизитыДокумента.ИдентификаторРезультата);
	
КонецПроцедуры

Процедура ПослеПрикрепленияСкриншота(ВладелецФайловСсылка, ДокументОбъектСсылка, ИдентификаторРезультата)
	
	РегистрыСведений.СвязанныеОбъектыРаспознаниеДокументов.ЗаписатьЗначения(ВладелецФайловСсылка, ДокументОбъектСсылка, Ложь);
	
	РезультатОбратнойСвязи = РаспознаваниеДокументов.ОписаниеОбратнойСвязи("ПрикрепилСкан");
	Пакет = Новый Структура("created", РезультатОбратнойСвязи);
	РаспознаваниеДокументовКоннекторСлужебный.ПередатьОбратнуюСвязь(ИдентификаторРезультата, Пакет);
	
КонецПроцедуры

#КонецОбласти

Функция ПолучитьСкладПоУмолчанию() Экспорт
	
	Склад = Неопределено;
	РаспознаваниеДокументовПереопределяемый.ОпределитьСкладПоУмолчанию(Склад);
	
	Если Не ЗначениеЗаполнено(Склад) Тогда
		НастройкиРаспознования = РегистрыСведений.ОбщиеНастройкиРаспознаваниеДокументов.ТекущиеНастройки();
		Если ЗначениеЗаполнено(НастройкиРаспознования.СкладПоУмолчанию) Тогда
			Склад = НастройкиРаспознования.СкладПоУмолчанию;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Склад;
	
КонецФункции

#Область ПредпросмотрКартинки

Функция МакетОтображенияКартинкиДокументаHTML(АдресВременногоХранилища = Неопределено) Экспорт
	
	ДвоичныеДанные = ПолучитьОбщийМакет("МакетОтображенияКартинкиДокумента");
	
	ЧтениеТекста = Новый ЧтениеТекста(ДвоичныеДанные.ОткрытьПотокДляЧтения(), КодировкаТекста.UTF8);
	Возврат ЧтениеТекста.Прочитать();
	
КонецФункции


#КонецОбласти

#КонецОбласти
