
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//Для каждого Строка Из ПутевыеЛисти Цикл
	//	Если ЗначениеЗаполнено(Строка.ПутевойЛист) Тогда
	//		Для каждого СтрокаЗадание Из Строка.ПутевойЛист.Задание Цикл
	//			Если СтрокаЗадание.Контрагент <> Контрагент Тогда
	//				Сообщить("По строке " + Строка.НомерСтроки + " в путевом листе " + Строка.ПутевойЛист + " не корректно указан ""Контрагент""");
	//				Отказ = Истина;
	//			КонецЕсли;
	//			Если СтрокаЗадание.Маршрут <> Маршрут Тогда
	//				Сообщить("По строке " + Строка.НомерСтроки + " в путевом листе " + Строка.ПутевойЛист + " не корректно указан ""Маршрут""");
	//				Отказ = Истина;
	//			КонецЕсли;
	//		КонецЦикла;	
	//	КонецЕсли;
	//КонецЦикла;  
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	

КонецПроцедуры

Процедура ПриЗаписи(Отказ)

	//Если Дата >= Дата(2022,2,1) Тогда
	//	
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//		"ВЫБРАТЬ
	//		|	_АктПоЗавозуВывозуТехводыДляГРПТабЧасть.ПутевойЛист КАК ПутевойЛист
	//		|ПОМЕСТИТЬ ВыборкаПЛ
	//		|ИЗ
	//		|	Документ._АктПоЗавозуВывозуТехводыДляГРП.ТабЧасть КАК _АктПоЗавозуВывозуТехводыДляГРПТабЧасть
	//		|ГДЕ
	//		|	_АктПоЗавозуВывозуТехводыДляГРПТабЧасть.Ссылка = &Ссылка
	//		|;
	//		|
	//		|////////////////////////////////////////////////////////////////////////////////
	//		|ВЫБРАТЬ
	//		|	ВыборкаПЛ.ПутевойЛист КАК ПутевойЛист,
	//		|	СУММА(_АктПоЗавозуВывозуТехводыДляГРПТабЧасть.КолТехВоды) КАК КолТехВоды
	//		|ПОМЕСТИТЬ ВыборкаОбъемаИзАкта
	//		|ИЗ
	//		|	ВыборкаПЛ КАК ВыборкаПЛ
	//		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ._АктПоЗавозуВывозуТехводыДляГРП.ТабЧасть КАК _АктПоЗавозуВывозуТехводыДляГРПТабЧасть
	//		|		ПО ВыборкаПЛ.ПутевойЛист = _АктПоЗавозуВывозуТехводыДляГРПТабЧасть.ПутевойЛист
	//		|ГДЕ
	//		|	_АктПоЗавозуВывозуТехводыДляГРПТабЧасть.Ссылка.Проведен
	//		|
	//		|СГРУППИРОВАТЬ ПО
	//		|	ВыборкаПЛ.ПутевойЛист
	//		|;
	//		|
	//		|////////////////////////////////////////////////////////////////////////////////
	//		|ВЫБРАТЬ
	//		|	ВыборкаПЛ.ПутевойЛист КАК ПутевойЛист,
	//		|	СУММА(уатПутевойЛистЗадание.Объем) КАК Объем
	//		|ПОМЕСТИТЬ ВыборкаОбъемаИзПЛ
	//		|ИЗ
	//		|	ВыборкаПЛ КАК ВыборкаПЛ
	//		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уатПутевойЛист.Задание КАК уатПутевойЛистЗадание
	//		|		ПО ВыборкаПЛ.ПутевойЛист = уатПутевойЛистЗадание.Ссылка
	//		|
	//		|СГРУППИРОВАТЬ ПО
	//		|	ВыборкаПЛ.ПутевойЛист
	//		|;
	//		|
	//		|////////////////////////////////////////////////////////////////////////////////
	//		|ВЫБРАТЬ
	//		|	ЕСТЬNULL(ВыборкаОбъемаИзАкта.ПутевойЛист, ВыборкаОбъемаИзПЛ.ПутевойЛист) КАК ПЛ,
	//		|	СУММА(ЕСТЬNULL(ВыборкаОбъемаИзАкта.КолТехВоды, 0)) КАК КолТехВодыИзАкта,
	//		|	СУММА(ЕСТЬNULL(ВыборкаОбъемаИзПЛ.Объем, 0)) КАК ОбъемПЛ
	//		|ИЗ
	//		|	ВыборкаОбъемаИзАкта КАК ВыборкаОбъемаИзАкта
	//		|		ПОЛНОЕ СОЕДИНЕНИЕ ВыборкаОбъемаИзПЛ КАК ВыборкаОбъемаИзПЛ
	//		|		ПО ВыборкаОбъемаИзАкта.ПутевойЛист = ВыборкаОбъемаИзПЛ.ПутевойЛист
	//		|
	//		|СГРУППИРОВАТЬ ПО
	//		|	ЕСТЬNULL(ВыборкаОбъемаИзАкта.ПутевойЛист, ВыборкаОбъемаИзПЛ.ПутевойЛист)";
	//	
	//	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	//	
	//	РезультатЗапроса = Запрос.Выполнить();
	//	
	//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//	
	//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//		
	//		Если ВыборкаДетальныеЗаписи.ПЛ.Пустая() Тогда
	//			Продолжить;
	//		КонецЕсли;
	//		
	//		//Если не равны то поменяем значение в ПЛ
	//		
	//		Если ВыборкаДетальныеЗаписи.КолТехВодыИзАкта <> ВыборкаДетальныеЗаписи.ОбъемПЛ Тогда
	//			
	//			ДокОб = ВыборкаДетальныеЗаписи.ПЛ.ПолучитьОбъект();
	//			ДокОб.ОбменДанными.Загрузка = Истина;
	//			
	//			Для каждого Строка из ДокОб.Задание Цикл
	//				Строка.Объем =  0;
	//			КонецЦикла;

	//			Попытка
	//				ДокОб.Задание[0].Объем = ВыборкаДетальныеЗаписи.КолТехВодыИзАкта;
	//				ДокОб.Записать();
	//			Исключение
	//				Отказ = Истина;
	//				Сообщить("Ошибка! Нет возможности изменить объем в документе " + ВыборкаДетальныеЗаписи.ПЛ);  
	//				Если ДокОб.Задание.Количество() = 0 Тогда
	//					Сообщить("По причине: Не заполнена табличная часть задание!");
	//				КонецЕсли;
	//			КонецПопытки;	
	//			
	//		КонецЕсли;
	//		
	//	КонецЦикла;
	//	
	//КонецЕсли;


КонецПроцедуры
