
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений();
	ДанныеВыбора.Добавить(Перечисления.уатТипыОбъектовДляУведомлений_уэ.ЗаказНаТС);
	ДанныеВыбора.Добавить(Перечисления.уатТипыОбъектовДляУведомлений_уэ.МаршрутныйЛист);
	ДанныеВыбора.Добавить(Перечисления.уатТипыОбъектовДляУведомлений_уэ.ТС);
	ДанныеВыбора.Добавить(Перечисления.уатТипыОбъектовДляУведомлений_уэ.СопроводительныйДокумент);  
	ДанныеВыбора.Добавить(Перечисления.уатТипыОбъектовДляУведомлений_уэ.ПакетСопроводительныхДокументов);
	Если уатОбщегоНазначенияПовтИсп.ВариантПоставкиТакси() Тогда
		ДанныеВыбора.Добавить(Перечисления.уатТипыОбъектовДляУведомлений_уэ.ЗаказТакси);
		ДанныеВыбора.Добавить(Перечисления.уатТипыОбъектовДляУведомлений_уэ.АрендаТС);
	Иначе 
		ДанныеВыбора.Добавить(Перечисления.уатТипыОбъектовДляУведомлений_уэ.ПотребностьВПеревозке);
		ДанныеВыбора.Добавить(Перечисления.уатТипыОбъектовДляУведомлений_уэ.ЗаказПеревозчику);
		ДанныеВыбора.Добавить(Перечисления.уатТипыОбъектовДляУведомлений_уэ.Тендер); 
		ДанныеВыбора.Добавить(Перечисления.уатТипыОбъектовДляУведомлений_уэ.СтраховойСертификат);
		ДанныеВыбора.Добавить(Перечисления.уатТипыОбъектовДляУведомлений_уэ.АктПриемки);
		ДанныеВыбора.Добавить(Перечисления.уатТипыОбъектовДляУведомлений_уэ.АктОтгрузки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти