////////////////////////////////////////////////////////////////////////////////
// Подсистема "Даты запрета изменения".
// Настройка переопределяемого модуля в конфигурации "УАТ: ПРОФ".
// 
// Реализация процедур и функций модуля ДатыЗапретаИзмененияПереопределяемый
// для поддержки библиотечного подхода разработки.
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Вызывается из переопределяемого модуля
Процедура НастройкаИнтерфейса(Знач НастройкиРаботыИнтерфейса) Экспорт
	
	НастройкиРаботыИнтерфейса.ИспользоватьВнешнихПользователей = Ложь;
	
КонецПроцедуры

// Вызывается из переопределяемого модуля
Процедура ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(Знач ИсточникиДанных) Экспорт
	
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.такАгентскийДоговор",                                     "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.такАрендаТС",                                             "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.такЗаказТакси",                                           "Дата", "УправлениеАвтотранспортом", "Организация");
	
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатНатурныйЛист",                                         "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатЗаявкаГУ12",                                           "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатНакладнаяГУ27",                                        "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатАктОсмотраВагонов",                                    "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатПровеска",                                             "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатОпломбированиеВагонов",                                "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатОперацияСВагонами",                                    "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатДислокацияВагонов",                                    "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатСправкаНаВагон",                                       "Дата", "УправлениеАвтотранспортом", "Организация");
	
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатАвансовыйОтчет",                                       "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатАктКС3_стм",                                           "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатАктОтгрузки_уэ",                                       "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатАктПриемаПередачиТС",                                  "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатАктПриемки_уэ",                                        "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатАктСверкиВзаиморасчетов_уэ",                           "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатБилетныйЛист",                                         "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатВводВЭксплуатациюТСиОборудования",                     "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатВводНачальныхДанныхПоАгрегатам",                       "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатВводНачальныхПоказаний",                               "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатВводОстатков",                                         "Дата", "УправлениеАвтотранспортом", "Организация");        
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатВводОстатковГСМ",                                      "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатВзаимозачет"    ,                                      "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатВнутреннееПеремещение",                                "Дата", "УправлениеАвтотранспортом", "Организация");  
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатВозвратТоваров",                                       "Дата", "УправлениеАвтотранспортом", "Организация");          
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатВыбытиеТСиОборудования",                               "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатВыдачаРасходныхМатериалов",                            "Дата", "УправлениеАвтотранспортом", "Организация");          
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатВыручкаВодителей",                                     "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатДиспозицияТС",                                         "Дата", "УправлениеАвтотранспортом", "Организация");  
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатДоверенность",                                         "Дата", "УправлениеАвтотранспортом", "Организация");  
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатДТП",                                                  "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатЖурналМедицинскогоОсмотраВодителей",                   "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатЖурналПредрейсовогоИПослерейсовогоКонтроляТС",         "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатЖурналУчетаПоказанийОдометра",                         "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатЗаказГрузоотправителя",                                "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатЗаказПоставщику",                                      "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатЗакрытиеЗаявокНаРасходованиеСредств",                  "Дата", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатЗакрытиеЗаявокНаРемонты",                              "Дата", "УправлениеАвтотранспортом", "Организация");  
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатЗаправкаГСМ",                                          "Дата", "УправлениеАвтотранспортом", "Организация");  
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатЗаявкаНаРасходованиеДС",                               "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатЗаявкаНаРемонт",                                       "Дата", "УправлениеАвтотранспортом", "Организация"); 
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатИнвентаризацияАгрегатов",                              "Дата", "УправлениеАвтотранспортом", "Организация");  
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатИнвентаризацияГСМвТС",                                 "Дата", "УправлениеАвтотранспортом", "Организация");  
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатИнвентаризацияТоваров",                                "Дата", "УправлениеАвтотранспортом", "Организация");  
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатКомандировкиОрганизаций",                              "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатКорректировкаДолга",                                   "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатКорректировкаЗаписейРегистров",                        "Дата", "УправлениеАвтотранспортом", "");  
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатКорректировкаИспользованияРаботникамиРабочегоВремени", "Дата", "УправлениеАвтотранспортом", "Организация"); 
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатМаршрутныйЛист",                                       "Дата", "УправлениеАвтотранспортом", "Организация"); 
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатНачислениеЗарплаты",                                   "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатНачислениеПремий",                                     "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатНачислениеУдержаний",                                  "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатОперацииСАгрегатами",                                  "Дата", "УправлениеАвтотранспортом", "Организация"); 
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатОперацииСТехническимиЖидкостями",                      "Дата", "УправлениеАвтотранспортом", "Организация"); 
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатОперацияСГрузом_уэ",                                   "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатОприходованиеТоваров",                                 "Дата", "УправлениеАвтотранспортом", "Организация");  
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатОтклонениеГруза",                                      "Дата", "УправлениеАвтотранспортом", "Организация");  
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатОтчетПоставщикаПЦ",                                    "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатПакетСопроводительныхДокументов",                      "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатПарковка",                                             "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатПеремещениеАгрегатов",                                 "Дата", "УправлениеАвтотранспортом", "Организация");  
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатПеремещениеТоваров",                                   "Дата", "УправлениеАвтотранспортом", "Организация");  
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатПеремещениеТСиОборудования",                           "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатПланированиеРаботыТС",                                 "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатПлатежноеПоручениеВходящее",                           "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатПлатежноеПоручениеИсходящее",                          "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатПосадочнаяВедомость",                                  "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатПоступлениеАгрегатов",                                 "Дата", "УправлениеАвтотранспортом", "Организация");  
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатПоступлениеБилетов",                                   "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатПоступлениеТоваровУслуг",                              "Дата", "УправлениеАвтотранспортом", "Организация");  
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатПриходныйКассовыйОрдер",                               "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатПрочиеДоходыРасходы",                                  "Дата", "УправлениеАвтотранспортом", "Организация");  
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатПутевойЛист",                                          "Дата", "УправлениеАвтотранспортом", "Организация");  
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатРазнарядка",                                           "Дата", "УправлениеАвтотранспортом", "Организация");  
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатРаспределениеДоходовРасходов",                         "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатРаспределениеРасходовБудущихПериодов",                 "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатРассылкаЭлектронныхПисем_уэ",                          "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатРасходныйКассовыйОрдер",                               "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатРеализацияУслуг",                                      "Дата", "УправлениеАвтотранспортом", "Организация");  
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатРемонтныйЛист",                                        "Дата", "УправлениеАвтотранспортом", "Организация");  
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатСливГСМ",                                              "Дата", "УправлениеАвтотранспортом", "Организация");  
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатСписаниеАгрегатов",                                    "Дата", "УправлениеАвтотранспортом", "Организация");  
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатСписаниеТоваров",                                      "Дата", "УправлениеАвтотранспортом", "Организация");  
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатСчетНаОплатуПокупателю",                               "Дата", "УправлениеАвтотранспортом", "Организация"); 
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатСчетНаОплатуПоставщика",                               "Дата", "УправлениеАвтотранспортом", "Организация"); 
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатСчетФактураВыданный",                                  "Дата", "УправлениеАвтотранспортом", "Организация"); 
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатТабельУчетаРабочегоВремени",                           "Дата", "УправлениеАвтотранспортом", "Организация"); 
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатТТД",                                                  "Дата", "УправлениеАвтотранспортом", "Организация"); 
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатУстановкаСтатусовСопроводительныхДокументов",          "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатУстановкаПрейскурантовТС",                             "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатУстановкаТарифовЗП",                                   "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатУстановкаТарифовСебестоимости_уэ",                     "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатЗаказПеревозчику_уэ",                                  "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатТендер_уэ",                                            "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатПотребностьВПеревозке_уэ",                             "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатРекламация_уэ",                                        "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатУстановкаСтатусаГруза_уэ",                             "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатУстановкаСтатусаПЛ",                                   "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатШтраф",                                                "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатРеестрОплатыШтрафов",                                  "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатОтчетСистемыПлатон",                                   "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатОтчетСистемыАвтодор",                                  "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатАктСверкиСтраховыхСертификатов_уэ",                    "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатСтраховойСертификат_уэ",                               "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатРасчетФактическихДанныхПоДолгосрочномуПланированию",   "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатРасчетСводныхПараметровВыработки",                     "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатИзменениеCчетчиковТС",                                 "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатТехнологическийПутевойЛист",                           "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатРеестрПеревозок",                                      "Дата", "УправлениеАвтотранспортом", "Организация");
	
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрСведений.уатАгрегатыТС",                         "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрСведений.уатСведенияОТС",                        "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрСведений.уатМестонахождениеТС",                  "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрСведений.уатНормыБесплатногоХранения_уэ",        "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрСведений.уатНормыРасходаГСМ",                    "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрСведений.уатНормыРасходаТехническихЖидкостей",   "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрСведений.уатПрейскурантыТС",                     "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрСведений.уатПрохождениеТО",                      "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрСведений.уатКадроваяИсторияСотрудников",         "Период", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрСведений.уатСтатусыСопроводительныхДокументов",  "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрСведений.уатСчетчикиТС",                         "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрСведений.уатТарифыСебестоимости_уэ",             "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрСведений.уатТарифыСотрудников",                  "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрСведений.уатЦеныНоменклатурыКонтрагентов",       "Период", "УправлениеАвтотранспортом", "");
	
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.такВознаграждениеВодителей",              "Период", "УправлениеАвтотранспортом", "Организация"); 
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.такОборотыПоЗаказамТакси",                "Период", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.такНахождениеВАренде",                    "Период", "УправлениеАвтотранспортом", "Организация");
	
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатБилетыНаСкладах",                      "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатВзаиморасчетыСКонтрагентами",          "Период", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатВыработкаАгрегатов",                   "Период", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатВыработкаПоМаршрутнымЛистам_уэ",       "Период", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатВыработкаСотрудников",                 "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатВыработкаТС",                          "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатВыручка",                              "Период", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатВыставленныеУслуги",                   "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатГрузыКПеревозке_уэ",                   "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатДвижениеДС",                           "Период", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатДоходы",                               "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатЗаказыГрузоотправителей",              "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатЗаявкиНаРасходованиеДС",               "Период", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатЗаявкиНаРемонт",                       "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатИзносАгрегатов",                       "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатНевыставленныеРекламации_уэ",          "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатНоменклатураТС",                       "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатОборотыПоЗаправкамГСМ",                "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатОборотыПоМаршрутномуЛисту",            "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатОборотыПоОтчетамПоставщиковПЦ",        "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатОборотыТЖнаТС",                        "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатОстаткиАгрегатов",                     "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатОстаткиГрузовВКонтейнерах_уэ",         "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатОстаткиГрузовНаСкладеКомплектации_уэ", "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатОстаткиГСМнаТС",                       "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатОстаткиДС",                            "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатОстаткиДСУПодотчетныхЛиц",             "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатОстаткиТЖнаТС",                        "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатПартииТоваровНаСкладах",               "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатПлановыеУслуги_уэ",                    "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатПланРаботыТС",                         "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатПредоставленныеУслуги",                "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатРабочееВремяСотрудников",              "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатРасходГСМнаТС",                        "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатРасшифровкаРасходаГСМнаТС",            "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатРасходы",                              "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатРекламации_уэ",                        "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатСводныеПараметрыВыработки",            "Период", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатСписаниеАгрегатов",                    "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатФактРаботыТС",                         "Период", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатФинансовыеРезультаты",                 "Период", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатЭлементыКомплектации_уэ",              "Период", "УправлениеАвтотранспортом", "");
	
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатОборотыВагоновПоСтанции",              "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатФактПоЗаказамНаТС",                    "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатЭлементыКомплектации_уэ",              "Период", "УправлениеАвтотранспортом", "");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Добавление строки с учетом наличия в метаданных
//
Процедура ДатыЗапретаДобавитьСтроку(ИсточникиДанных, Таблица="", ПолеДаты="", Раздел="", ПолеОбъекта="") 
	
	МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(Таблица);
	
	Если МетаданныеОбъекта = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Таблица, ПолеДаты, Раздел, ПолеОбъекта); 

КонецПроцедуры // ДатыЗапретаДобавитьСтроку()

#КонецОбласти
