
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Запись.СтрокаСоединенияИБ) Тогда
		Запись.СтрокаСоединенияИБ = GDS_ОбменДаннымиНастройки.СтрокаСоединенияТекущейБазы();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Запись.ИдентификаторБазы) Тогда
		Запись.ИдентификаторБазы = GDS_ОбменДаннымиНастройки.ИдентификаторТекущейБазы();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Запись.Порт) Тогда
		Запись.Порт = 80;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтрокаСоединенияИБПриИзменении(Элемент)
	СтрокаСоединенияИБПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СтрокаСоединенияИБПриИзмененииНаСервере()
	Запись.ИдентификаторБазы = GDS_ОбменДаннымиНастройки.ХэшСтроки(Запись.СтрокаСоединенияИБ);
КонецПроцедуры

#КонецОбласти

