#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

	
#Область ПрограммныйИнтерфейс

// Задает настройки размещения вариантов отчетов в панели отчетов.
// См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//
// Параметры:
//   Настройки - Коллекция - Используется для описания настроек отчетов и вариантов
//       см. описание к ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//   НастройкиОтчета - СтрокаДереваЗначений - Настройки размещения всех вариантов отчета.
//       См. ""Реквизиты для изменения"" функции ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "Остатки грузов на складах комплектации");
	НастройкиВарианта.Описание = НСтр("en='Report is intended to analyze the remains of cargo packages and сargo info in temporary storage area.';ru='Отчет предназначен для анализа остатков грузовых мест и номенклатуры грузов на складах комплектации.'");
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	уатЗащищенныеФункцииСервер.уатОтчетОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

// Возвращает вес номенклатуры
//
// Параметры:
//  Номенклатура	 - 	 - Неопределено, Грузовое место, спр. Номенклатура
//  	Единица измерения
//  ЕдиницаИзмерения - 	 - 
//  Количество		 - 	 - 
//  Заказ			 - 	 - 
// 
// Возвращаемое значение:
//  Вес, кг - 
//
Функция ВесНоменклатуры(Номенклатура, ЕдиницаИзмерения, Количество, Заказ) Экспорт
	
	Если ТипЗнч(Номенклатура) = Тип("СправочникСсылка.уатГрузовыеМеста_уэ") Тогда
		Рез = Номенклатура.ВесБрутто;
		
	ИначеЕсли ТипЗнч(Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
		ВесОбъем = уатОбщегоНазначения.ПолучитьВесОбъемНоменклатуры(Номенклатура, ЕдиницаИзмерения, Количество);
		Рез = ВесОбъем.Вес;
		
	ИначеЕсли Заказ.ДетализацияЗакрытия = Перечисления.уатДетализацияЗаказаГрузоотправителя_уэ.ПоЗаказам Тогда 
		Рез = Заказ.ВесБрутто;
		
	Иначе
		Рез = 0;
	КонецЕсли;
	
	Возврат Рез;
	
КонецФункции

// Возвращает объем номенклатуры
//
// Параметры:
//  Номенклатура	 - 	 - Неопределено, Грузовое место, спр. Номенклатура
//  	Единица измерения
//  ЕдиницаИзмерения - 	 - 
//  Количество		 - 	 - 
//  Заказ			 - 	 - 
// 
// Возвращаемое значение:
//  Объем, м3 - 
//
Функция ОбъемНоменклатуры(Номенклатура, ЕдиницаИзмерения, Количество, Заказ) Экспорт
	
	Если ТипЗнч(Номенклатура) = Тип("СправочникСсылка.уатГрузовыеМеста_уэ") Тогда
		Рез = Номенклатура.Объем;
		
	ИначеЕсли ТипЗнч(Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
		ВесОбъем = уатОбщегоНазначения.ПолучитьВесОбъемНоменклатуры(Номенклатура, ЕдиницаИзмерения, Количество);
		Рез = ВесОбъем.Объем;
		
	ИначеЕсли Заказ.ДетализацияЗакрытия = Перечисления.уатДетализацияЗаказаГрузоотправителя_уэ.ПоЗаказам Тогда 
		Рез = Заказ.Объем;
		
	Иначе
		Рез = 0;
	КонецЕсли;
	
	Возврат Рез;
	
КонецФункции

// Возвращает количество мест номенклатуры
//
// Параметры:
//  Номенклатура	 - 	 - Неопределено, Грузовое место, спр. Номенклатура
//  	Единица измерения
//  ЕдиницаИзмерения - 	 - 
//  Количество		 - 	 - 
//  Заказ			 - 	 - 
// 
// Возвращаемое значение:
//  Количество - мест
//
Функция КоличествоМестНоменклатуры(Номенклатура, ЕдиницаИзмерения, Количество, Заказ) Экспорт
	
	Если ТипЗнч(Номенклатура) = Тип("СправочникСсылка.уатГрузовыеМеста_уэ") Тогда
		Рез = Номенклатура.КоличествоМест;
		
	ИначеЕсли ТипЗнч(Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
		ВесОбъем = уатОбщегоНазначения.ПолучитьВесОбъемНоменклатуры(Номенклатура, ЕдиницаИзмерения, Количество);
		Рез = ВесОбъем.КоличествоМест;
		
	ИначеЕсли Заказ.ДетализацияЗакрытия = Перечисления.уатДетализацияЗаказаГрузоотправителя_уэ.ПоЗаказам Тогда 
		Рез = Заказ.КоличествоМест;
		
	Иначе
		Рез = 0;
	КонецЕсли;
	
	Возврат Рез;
	
КонецФункции

#КонецОбласти


#КонецЕсли