
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("мсвРейсов") Тогда
		Возврат;
	КонецЕсли;
	
	мсвРейсов = Параметры.мсвРейсов;
	
	Для каждого ТекРейс Из мсвРейсов Цикл
		НоваяСтрока = СписокМЛ.Добавить();
		НоваяСтрока.МаршрутныйЛист = ТекРейс;
		НоваяСтрока.Перевозчик = ТекРейс.Контрагент;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Печать(Команда)
	
	ВыбранныеМЛ = СписокМЛ.НайтиСтроки(Новый Структура("Использовать", Истина));
	Если ВыбранныеМЛ.Количество() = 0 Тогда
		ТекстНСтр = НСтр("ru = 'Для печати необходимо выбрать хотя бы один Маршрутный лист'; en = 'To print, you must select at least one Route Sheet'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСтр);
		Возврат;
	КонецЕсли;
	РазныеПеревозчики = Ложь;
	ТекПеревозчик = ВыбранныеМЛ[0].Перевозчик;
	мсвРейсов = Новый Массив;
	Для каждого ТекВыбранныйМЛ Из ВыбранныеМЛ Цикл
		Если ТекВыбранныйМЛ.Перевозчик <> ТекПеревозчик Тогда
			РазныеПеревозчики = Истина;
			Прервать;
		КонецЕсли;
		мсвРейсов.Добавить(ТекВыбранныйМЛ.МаршрутныйЛист);
	КонецЦикла;
	
	Если РазныеПеревозчики Тогда
		ТекстНСтр = НСтр("ru = 'Выбранные Маршрутные листы относятся к различным перевозчикам'; en = 'The selected Route Sheets belong to different carriers'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСтр);
	Иначе
		Закрыть(мсвРейсов);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	Для каждого ТекСтрока Из СписокМл Цикл
		ТекСтрока.Использовать = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	Для каждого ТекСтрока Из СписокМл Цикл
		ТекСтрока.Использовать = Ложь;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
