#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
	Настройки.ПриПолученииСлужебныхРеквизитов = Ложь;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	// необходима для подключения внешних ПФ
	Заглушка = Истина;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

// СтандартныеПодсистемы.УправлениеДоступом

// Позволяет переопределить ограничение, указанное в модуле менеджера объекта метаданных.
//
// Параметры:
//  Ограничение - Структура:
//    * Текст                             - Строка - ограничение доступа для пользователей.
//                                          Если пустая строка, значит, доступ разрешен.
//    * ТекстДляВнешнихПользователей      - Строка - ограничение доступа для внешних пользователей.
//                                          Если пустая строка, значит, доступ запрещен.
//    * ПоВладельцуБезЗаписиКлючейДоступа - Неопределено - определить автоматически.
//                                        - Булево - если Ложь, то всегда записывать ключи доступа,
//                                          если Истина, тогда не записывать ключи доступа,
//                                          а использовать ключи доступа владельца (требуется,
//                                          чтобы ограничение было строго по объекту-владельцу).
//   * ПоВладельцуБезЗаписиКлючейДоступаДляВнешнихПользователей - Неопределено, Булево - также
//                                          как у параметра ПоВладельцуБезЗаписиКлючейДоступа.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";
	
	Ограничение.ТекстДляВнешнихПользователей = Ограничение.Текст;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	мХарактеристикиСценария     = уатОбщегоНазначения_проф.ЗаполнитьХарактеристикиСценария(ДокументСсылка.Сценарий);
	Периодичность               = мХарактеристикиСценария.Периодичность;
	Раздел = мХарактеристикиСценария.Раздел;
	
	ФлагиРазделыПланирования  = уатОбщегоНазначения_проф.ФлагиРазделыПланирования();
	ФлагиВключенияРазрезов    = уатОбщегоНазначения_проф.ФлагиВключенияРазрезов();
	ФлагиПланированияПоГруппе = уатОбщегоНазначения_проф.ФлагиПланированияПоГруппе();
	ВариантыАналитик          = уатОбщегоНазначения_проф.ВариантыАналитик();

	ТаблицаСводныеПараметрыВыработки = РегистрыНакопления.уатСводныеПараметрыВыработки.СоздатьНаборЗаписей().Выгрузить();
	ТаблицаСводныеПараметрыВыработки.Очистить();
	
	ТаблицаВыработкаТС = РегистрыНакопления.уатВыработкаТС.СоздатьНаборЗаписей().Выгрузить();
	ТаблицаВыработкаТС.Очистить();
	
	ТаблицаВыработкаТСМЛ = РегистрыНакопления.уатВыработкаПоМаршрутнымЛистам_уэ.СоздатьНаборЗаписей().Выгрузить();
	ТаблицаВыработкаТСМЛ.Очистить();
	
	РазрезыПоказателейПланирования = ДокументСсылка.Сценарий.РазрезыПоказателейПланирования;
	МассивПараметровВыработки      = мХарактеристикиСценария.МассивПараметровВыработки;
	Для Каждого ТекСтрока Из МассивПараметровВыработки Цикл
		ХарактеристикиСценария = Новый Структура(ФлагиРазделыПланирования + ", " + ФлагиВключенияРазрезов + ", " +
			ФлагиПланированияПоГруппе + ", " + ВариантыАналитик);
		ЗаполнитьЗначенияСвойств(ХарактеристикиСценария, мХарактеристикиСценария, ФлагиРазделыПланирования);
		
		уатОбщегоНазначения_проф.ЗаполнитьФлагиВключенияРазрезов(ХарактеристикиСценария, РазрезыПоказателейПланирования, ТекСтрока);
		Если ТекСтрока = Справочники.уатПараметрыВыработки.КоличествоСобственныхТС Тогда
			РасчетКоличестваСобственныхТС(ДокументСсылка, ХарактеристикиСценария, ТаблицаСводныеПараметрыВыработки,
				ДокументСсылка.Дата, Периодичность, ТаблицаВыработкаТС, ТаблицаВыработкаТСМЛ);
		ИначеЕсли ТекСтрока = Справочники.уатПараметрыВыработки.КоличествоПривлеченныхТС Тогда
			РасчетКоличестваПривлеченныхТС(ДокументСсылка, ХарактеристикиСценария, ТаблицаСводныеПараметрыВыработки,
				ДокументСсылка.Дата, Периодичность, ТаблицаВыработкаТС, ТаблицаВыработкаТСМЛ);
		ИначеЕсли ТекСтрока = Справочники.уатПараметрыВыработки.КоличествоВодителей Тогда
			РасчетКоличестваВодителей(ДокументСсылка, ХарактеристикиСценария, ТаблицаСводныеПараметрыВыработки,
				ДокументСсылка.Дата, Периодичность, ТаблицаВыработкаТС, ТаблицаВыработкаТСМЛ);
		ИначеЕсли ТекСтрока = Справочники.уатПараметрыВыработки.ФактическийРасходГСМ Тогда
			РасчетФактическийРасходГСМ(ДокументСсылка, ХарактеристикиСценария, ТаблицаСводныеПараметрыВыработки,
				ДокументСсылка.Дата, Периодичность, ТаблицаВыработкаТС, ТаблицаВыработкаТСМЛ);
		ИначеЕсли ТекСтрока = Справочники.уатПараметрыВыработки.СтоимостьКмПробега
				И мХарактеристикиСценария.флДоходыРасходы Тогда
			РасчетСтоимостьПробега(ДокументСсылка, ХарактеристикиСценария, ТаблицаСводныеПараметрыВыработки,
				ДокументСсылка.Дата, Периодичность, ТаблицаВыработкаТС, ТаблицаВыработкаТСМЛ, мХарактеристикиСценария.ВариантАналитикиСтатья);
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаСводныеПараметрыВыработки.ЗаполнитьЗначения(Истина, "Активность");
	ТаблицаВыработкаТС.ЗаполнитьЗначения(Истина, "Активность");

	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСводныеПараметрыВыработки", ТаблицаСводныеПараметрыВыработки);
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаВыработкиТС", ТаблицаВыработкаТС);
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ДатаНачала",     ДокументСсылка.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",  ДокументСсылка.ДатаОкончания);
	Запрос.УстановитьПараметр("Сценарий",       ДокументСсылка.Сценарий);
	Запрос.УстановитьПараметр("Организация",    ДокументСсылка.Организация);
	Запрос.УстановитьПараметр("Ссылка",         ДокументСсылка);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	уатСводныеПараметрыВыработкиОбороты.Регистратор КАК Регистратор
	               |ИЗ
	               |	РегистрНакопления.уатСводныеПараметрыВыработки.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, ) КАК уатСводныеПараметрыВыработкиОбороты
	               |ГДЕ
	               |	уатСводныеПараметрыВыработкиОбороты.Регистратор <> &Ссылка
	               |	И уатСводныеПараметрыВыработкиОбороты.Регистратор.Сценарий = &Сценарий
	               |	И уатСводныеПараметрыВыработкиОбороты.Регистратор.Организация = &Организация";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокОбъект = Выборка.Регистратор.ПолучитьОбъект();
		Попытка
			ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		Исключение
			мОтказ = Истина;
			Возврат;
		КонецПопытки;
	КонецЦикла; 

КонецПроцедуры // ИнициализироватьДанныеДокумента()

Процедура ВыполнитьКонтроль(ДокументСсылка, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
	
	Заглушка = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура РасчетКоличестваПривлеченныхТС(ДокументСсылка, ХарактеристикиСценария, ТаблицаСводныеПараметрыВыработки,
	ДатаПланирования, Периодичность, ТаблицаВыработкаТС, ТаблицаВыработкаТСМЛ)  
	
	НачДата = ДатаПланирования;
	КонДата = ДатаПланирования;
	уатОбщегоНазначенияТиповые.уатВыровнятьПериод(НачДата, КонДата, Периодичность);

	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ДатаНачала",                   НачДата);
	Запрос.УстановитьПараметр("ДатаОкончания",                КонецДня(КонДата));
	Запрос.УстановитьПараметр("флКолоннаГруппы",              ХарактеристикиСценария.флКолоннаГруппы);
	Запрос.УстановитьПараметр("ВариантАналитикиТС",           ХарактеристикиСценария.ВариантАналитикиТС);
	Запрос.УстановитьПараметр("флТСГруппы",                   ХарактеристикиСценария.флТСГруппы);
	Запрос.УстановитьПараметр("флМаршрутГруппы",              ХарактеристикиСценария.флМаршрутГруппы);
	Запрос.УстановитьПараметр("флОбъектСтроительстваГруппы",  ХарактеристикиСценария.флОбъектСтроительстваГруппы);
	Запрос.УстановитьПараметр("флНаправлениеПеревозкиГруппы", ХарактеристикиСценария.флНаправлениеПеревозкиГруппы);
	Запрос.УстановитьПараметр("Организация",                  ДокументСсылка.Организация);

	Запрос.Текст = "ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ уатМаршрутныйЛист.ТС) КАК КоличествоПривлеченныхТС,
	               |	уатМаршрутныйЛист.Организация КАК Организация,
	               |	уатМаршрутныйЛист.Подразделение КАК Подразделение,
				   |	ВЫБОР
				   |		КОГДА &флКолоннаГруппы
				   |			ТОГДА уатМаршрутныйЛист.ТС.Колонна.Родитель
				   |		ИНАЧЕ уатМаршрутныйЛист.ТС.Колонна
				   |	КОНЕЦ КАК Колонна";
	
	Если ХарактеристикиСценария.флТС Тогда
		Запрос.Текст = Запрос.Текст + ",
		|	ВЫБОР
		|		КОГДА &ВариантАналитикиТС = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.ТС)
		|			ТОГДА ВЫБОР
		|					КОГДА &флТСГруппы
		|						ТОГДА уатМаршрутныйЛист.ТС.Родитель
		|					ИНАЧЕ уатМаршрутныйЛист.ТС
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА &ВариантАналитикиТС = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.МодельТС)
		|					ТОГДА ВЫБОР
		|							КОГДА &флТСГруппы
		|								ТОГДА уатМаршрутныйЛист.ТС.Модель.Родитель
		|							ИНАЧЕ уатМаршрутныйЛист.ТС.Модель
		|						КОНЕЦ
		|				ИНАЧЕ ВЫБОР
		|						КОГДА &ВариантАналитикиТС = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.ТипТС)
		|							ТОГДА ВЫБОР
		|									КОГДА &флТСГруппы
		|										ТОГДА уатМаршрутныйЛист.ТС.ТипТС.Родитель
		|									ИНАЧЕ уатМаршрутныйЛист.ТС.ТипТС
		|								КОНЕЦ
		|						ИНАЧЕ уатМаршрутныйЛист.ТС.ПринадлежностьТС
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК ДетализацияПланирования";
	КонецЕсли;
	Если ХарактеристикиСценария.флКонтрагент Тогда
		Запрос.Текст = Запрос.Текст + ",
		|уатМаршрутныйЛист.Контрагент КАК Контрагент";
	КонецЕсли;
	Если ХарактеристикиСценария.флВидПеревозки Тогда
		Запрос.Текст = Запрос.Текст + ",
		|уатМаршрутныйЛист.ВидПеревозки КАК ВидПеревозки";
	КонецЕсли;
	Если ХарактеристикиСценария.флДоговор Тогда
		Запрос.Текст = Запрос.Текст + ",
		|уатМаршрутныйЛист.ДоговорКонтрагента КАК ДоговорКонтрагента";
	КонецЕсли;
	Если ХарактеристикиСценария.флМаршрут Тогда
		Запрос.Текст = Запрос.Текст + ",
		|ВЫБОР
		|		КОГДА &флМаршрутГруппы
		|				ТОГДА уатМаршрутныйЛист.Маршрут.Родитель
		|					ИНАЧЕ уатМаршрутныйЛист.Маршрут
		|	КОНЕЦ КАК Маршрут";
	КонецЕсли;
	Если ХарактеристикиСценария.флОбъектСтроительства Тогда
		Запрос.Текст = Запрос.Текст + ",
		|	ВЫБОР
		|		КОГДА &флОбъектСтроительстваГруппы
		|			ТОГДА уатМаршрутныйЛист.ОбъектСтроительства.Родитель
		|		ИНАЧЕ уатМаршрутныйЛист.ОбъектСтроительства
		|	КОНЕЦ КАК ОбъектСтроительства";
	КонецЕсли;
	Если ХарактеристикиСценария.флНаправлениеПеревозки Тогда
		Запрос.Текст = Запрос.Текст + ",
		|	ВЫБОР
		|		КОГДА &флНаправлениеПеревозкиГруппы
		|			ТОГДА уатМаршрутныйЛист.НаправлениеПеревозки.Родитель
		|		ИНАЧЕ уатМаршрутныйЛист.НаправлениеПеревозки
		|	КОНЕЦ КАК НаправлениеПеревозки";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	               |ИЗ
	               |	Документ.уатМаршрутныйЛист КАК уатМаршрутныйЛист
	               |ГДЕ
	               |	уатМаршрутныйЛист.Проведен
	               |	И уатМаршрутныйЛист.ТС.ПринадлежностьТС = ЗНАЧЕНИЕ(Перечисление.уатПринадлежностьТС.Привлеченное)
	               |	И уатМаршрутныйЛист.ДатаИВремяОтправления МЕЖДУ &ДатаНачала И &ДатаОкончания
				   |	И уатМаршрутныйЛист.Организация = &Организация
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	уатМаршрутныйЛист.Организация,
	               |	уатМаршрутныйЛист.Подразделение,
				   |	ВЫБОР
				   |		КОГДА &флКолоннаГруппы
				   |			ТОГДА уатМаршрутныйЛист.ТС.Колонна.Родитель
				   |		ИНАЧЕ уатМаршрутныйЛист.ТС.Колонна
				   |	КОНЕЦ";
	Если ХарактеристикиСценария.флТС Тогда
		Запрос.Текст = Запрос.Текст + ",
		|	ВЫБОР
		|		КОГДА &ВариантАналитикиТС = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.ТС)
		|			ТОГДА ВЫБОР
		|					КОГДА &флТСГруппы
		|						ТОГДА уатМаршрутныйЛист.ТС.Родитель
		|					ИНАЧЕ уатМаршрутныйЛист.ТС
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА &ВариантАналитикиТС = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.МодельТС)
		|					ТОГДА ВЫБОР
		|							КОГДА &флТСГруппы
		|								ТОГДА уатМаршрутныйЛист.ТС.Модель.Родитель
		|							ИНАЧЕ уатМаршрутныйЛист.ТС.Модель
		|						КОНЕЦ
		|				ИНАЧЕ ВЫБОР
		|						КОГДА &ВариантАналитикиТС = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.ТипТС)
		|							ТОГДА ВЫБОР
		|									КОГДА &флТСГруппы
		|										ТОГДА уатМаршрутныйЛист.ТС.ТипТС.Родитель
		|									ИНАЧЕ уатМаршрутныйЛист.ТС.ТипТС
		|								КОНЕЦ
		|						ИНАЧЕ уатМаршрутныйЛист.ТС.ПринадлежностьТС
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ";
	КонецЕсли;
	Если ХарактеристикиСценария.флКонтрагент Тогда
		Запрос.Текст = Запрос.Текст + ",
		|уатМаршрутныйЛист.Контрагент";
	КонецЕсли;
	Если ХарактеристикиСценария.флВидПеревозки Тогда
		Запрос.Текст = Запрос.Текст + ",
		|уатМаршрутныйЛист.ВидПеревозки";
	КонецЕсли;
	Если ХарактеристикиСценария.флДоговор Тогда
		Запрос.Текст = Запрос.Текст + ",
		|уатМаршрутныйЛист.ДоговорКонтрагент";
	КонецЕсли;
	Если ХарактеристикиСценария.флМаршрут Тогда
		Запрос.Текст = Запрос.Текст + ",
		|ВЫБОР
		|		КОГДА &флМаршрутГруппы
		|				ТОГДА уатМаршрутныйЛист.Маршрут.Родитель
		|					ИНАЧЕ уатМаршрутныйЛист.Маршрут
		|	КОНЕЦ";
	КонецЕсли;
	Если ХарактеристикиСценария.флОбъектСтроительства Тогда
		Запрос.Текст = Запрос.Текст + ",
		|	ВЫБОР
		|		КОГДА &флОбъектСтроительстваГруппы
		|			ТОГДА уатМаршрутныйЛист.ОбъектСтроительства.Родитель
		|		ИНАЧЕ уатМаршрутныйЛист.ОбъектСтроительства
		|	КОНЕЦ";
	КонецЕсли;
	Если ХарактеристикиСценария.флНаправлениеПеревозки Тогда
		Запрос.Текст = Запрос.Текст + ",
		|	ВЫБОР
		|		КОГДА &флНаправлениеПеревозкиГруппы
		|			ТОГДА уатМаршрутныйЛист.НаправлениеПеревозки.Родитель
		|		ИНАЧЕ уатМаршрутныйЛист.НаправлениеПеревозки
		|	КОНЕЦ";
	КонецЕсли;

	
	РезультатЗапроса = Запрос.Выполнить(); 
	Выборка          = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаСводныеПараметрыВыработки.Добавить();
		НоваяСтрока.Период            = НачДата;
		НоваяСтрока.Периодичность     = Периодичность;
		НоваяСтрока.ПараметрВыработки = Справочники.уатПараметрыВыработки.КоличествоПривлеченныхТС;
		НоваяСтрока.Регистратор       = ДокументСсылка;
		НоваяСтрока.Значение          = Выборка.КоличествоПривлеченныхТС;
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		Если РезультатЗапроса.Колонки.Найти("ДетализацияПланирования") = Неопределено
			ИЛИ ТипЗнч(Выборка.ДетализацияПланирования) <> Тип("СправочникСсылка.уатТС")
			ИЛИ НЕ ЗначениеЗаполнено(Выборка.ДетализацияПланирования)
			ИЛИ Выборка.ДетализацияПланирования.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ТаблицаВыработкаТСМЛ.Добавить();
		НоваяСтрока.Период            = НачДата;
		НоваяСтрока.ПараметрВыработки = Справочники.уатПараметрыВыработки.КоличествоПривлеченныхТС;
		НоваяСтрока.Регистратор       = ДокументСсылка;
		НоваяСтрока.Количество        = Выборка.КоличествоПривлеченныхТС;
		НоваяСтрока.ТС                = Выборка.ДетализацияПланирования;
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура РасчетКоличестваСобственныхТС(ДокументСсылка, ХарактеристикиСценария, ТаблицаСводныеПараметрыВыработки,
	ДатаПланирования, Периодичность, ТаблицаВыработкаТС, ТаблицаВыработкаТСМЛ)  
	
	КоличествоСобственныхТС = Справочники.уатПараметрыВыработки.КоличествоСобственныхТС;
	ИсточникПолученияФактЗначенийДляСобственногоТС = КоличествоСобственныхТС.ИсточникПолученияФактЗначенийДляСобственногоТС;
	
	НачДата = ДатаПланирования;
	КонДата = ДатаПланирования;
	уатОбщегоНазначенияТиповые.уатВыровнятьПериод(НачДата, КонДата, Периодичность);

	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ДатаНачала",                   НачДата);
	Запрос.УстановитьПараметр("ДатаОкончания",                КонецДня(КонДата));
	Запрос.УстановитьПараметр("флКолоннаГруппы",              ХарактеристикиСценария.флКолоннаГруппы);
	Запрос.УстановитьПараметр("ВариантАналитикиТС",           ХарактеристикиСценария.ВариантАналитикиТС);
	Запрос.УстановитьПараметр("флТСГруппы",                   ХарактеристикиСценария.флТСГруппы); 
	Запрос.УстановитьПараметр("флКонтрагентГруппы",           ХарактеристикиСценария.флКонтрагентГруппы);
	Запрос.УстановитьПараметр("флМаршрутГруппы",              ХарактеристикиСценария.флМаршрутГруппы);
	Запрос.УстановитьПараметр("флОбъектСтроительстваГруппы",  ХарактеристикиСценария.флОбъектСтроительстваГруппы);
	Запрос.УстановитьПараметр("флНаправлениеПеревозкиГруппы", ХарактеристикиСценария.флНаправлениеПеревозкиГруппы);
	Запрос.УстановитьПараметр("Организация",                  ДокументСсылка.Организация);

	Если ИсточникПолученияФактЗначенийДляСобственногоТС = Перечисления.уатИсточникиФактДанныхПоказателейПланирования.МаршрутныйЛист Тогда
		
		Запрос.Текст = "ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ уатМаршрутныйЛист.ТС) КАК КоличествоСобственныхТС,
		|	уатМаршрутныйЛист.Организация КАК Организация,
		|	уатМаршрутныйЛист.Подразделение КАК Подразделение,
		|	ВЫБОР
		|		КОГДА &флКолоннаГруппы
		|			ТОГДА уатМаршрутныйЛист.ТС.Колонна.Родитель
		|		ИНАЧЕ уатМаршрутныйЛист.ТС.Колонна
		|	КОНЕЦ КАК Колонна";
		
		Если ХарактеристикиСценария.флТС Тогда
			Запрос.Текст = Запрос.Текст + ",
			|	ВЫБОР
			|		КОГДА &ВариантАналитикиТС = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.ТС)
			|			ТОГДА ВЫБОР
			|					КОГДА &флТСГруппы
			|						ТОГДА уатМаршрутныйЛист.ТС.Родитель
			|					ИНАЧЕ уатМаршрутныйЛист.ТС
			|				КОНЕЦ
			|		ИНАЧЕ ВЫБОР
			|				КОГДА &ВариантАналитикиТС = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.МодельТС)
			|					ТОГДА ВЫБОР
			|							КОГДА &флТСГруппы
			|								ТОГДА уатМаршрутныйЛист.ТС.Модель.Родитель
			|							ИНАЧЕ уатМаршрутныйЛист.ТС.Модель
			|						КОНЕЦ
			|				ИНАЧЕ ВЫБОР
			|						КОГДА &ВариантАналитикиТС = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.ТипТС)
			|							ТОГДА ВЫБОР
			|									КОГДА &флТСГруппы
			|										ТОГДА уатМаршрутныйЛист.ТС.ТипТС.Родитель
			|									ИНАЧЕ уатМаршрутныйЛист.ТС.ТипТС
			|								КОНЕЦ
			|						ИНАЧЕ уатМаршрутныйЛист.ТС.ПринадлежностьТС
			|					КОНЕЦ
			|			КОНЕЦ
			|	КОНЕЦ КАК ДетализацияПланирования";
		КонецЕсли;
		Если ХарактеристикиСценария.флКонтрагент Тогда
			Запрос.Текст = Запрос.Текст + ",
			|уатМаршрутныйЛист.Контрагент КАК Контрагент";
		КонецЕсли;
		Если ХарактеристикиСценария.флВидПеревозки Тогда
			Запрос.Текст = Запрос.Текст + ",
			|уатМаршрутныйЛист.ВидПеревозки КАК ВидПеревозки";
		КонецЕсли;
		Если ХарактеристикиСценария.флДоговор Тогда
			Запрос.Текст = Запрос.Текст + ",
			|уатМаршрутныйЛист.ДоговорКонтрагента КАК ДоговорКонтрагента";
		КонецЕсли;
		Если ХарактеристикиСценария.флМаршрут Тогда
			Запрос.Текст = Запрос.Текст + ",
			|ВЫБОР
			|		КОГДА &флМаршрутГруппы
			|				ТОГДА уатМаршрутныйЛист.Маршрут.Родитель
			|					ИНАЧЕ уатМаршрутныйЛист.Маршрут
			|	КОНЕЦ КАК Маршрут";
		КонецЕсли;
		Если ХарактеристикиСценария.флОбъектСтроительства Тогда
			Запрос.Текст = Запрос.Текст + ",
			|	ВЫБОР
			|		КОГДА &флОбъектСтроительстваГруппы
			|			ТОГДА уатМаршрутныйЛист.ОбъектСтроительства.Родитель
			|		ИНАЧЕ уатМаршрутныйЛист.ОбъектСтроительства
			|	КОНЕЦ КАК ОбъектСтроительства";
		КонецЕсли;
		Если ХарактеристикиСценария.флНаправлениеПеревозки Тогда
			Запрос.Текст = Запрос.Текст + ",
			|	ВЫБОР
			|		КОГДА &флНаправлениеПеревозкиГруппы
			|			ТОГДА уатМаршрутныйЛист.НаправлениеПеревозки.Родитель
			|		ИНАЧЕ уатМаршрутныйЛист.НаправлениеПеревозки
			|	КОНЕЦ КАК НаправлениеПеревозки";
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		|ИЗ
		|	Документ.уатМаршрутныйЛист КАК уатМаршрутныйЛист
		|ГДЕ
		|	уатМаршрутныйЛист.Проведен
		|	И уатМаршрутныйЛист.ТС.ПринадлежностьТС = ЗНАЧЕНИЕ(Перечисление.уатПринадлежностьТС.Собственное)
		|	И уатМаршрутныйЛист.ДатаИВремяОтправления МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И уатМаршрутныйЛист.Организация = &Организация
		|
		|СГРУППИРОВАТЬ ПО
		|	уатМаршрутныйЛист.Организация,
		|	уатМаршрутныйЛист.Подразделение,
		|	ВЫБОР
		|		КОГДА &флКолоннаГруппы
		|			ТОГДА уатМаршрутныйЛист.ТС.Колонна.Родитель
		|		ИНАЧЕ уатМаршрутныйЛист.ТС.Колонна
		|	КОНЕЦ";
		Если ХарактеристикиСценария.флТС Тогда
			Запрос.Текст = Запрос.Текст + ",
			|	ВЫБОР
			|		КОГДА &ВариантАналитикиТС = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.ТС)
			|			ТОГДА ВЫБОР
			|					КОГДА &флТСГруппы
			|						ТОГДА уатМаршрутныйЛист.ТС.Родитель
			|					ИНАЧЕ уатМаршрутныйЛист.ТС
			|				КОНЕЦ
			|		ИНАЧЕ ВЫБОР
			|				КОГДА &ВариантАналитикиТС = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.МодельТС)
			|					ТОГДА ВЫБОР
			|							КОГДА &флТСГруппы
			|								ТОГДА уатМаршрутныйЛист.ТС.Модель.Родитель
			|							ИНАЧЕ уатМаршрутныйЛист.ТС.Модель
			|						КОНЕЦ
			|				ИНАЧЕ ВЫБОР
			|						КОГДА &ВариантАналитикиТС = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.ТипТС)
			|							ТОГДА ВЫБОР
			|									КОГДА &флТСГруппы
			|										ТОГДА уатМаршрутныйЛист.ТС.ТипТС.Родитель
			|									ИНАЧЕ уатМаршрутныйЛист.ТС.ТипТС
			|								КОНЕЦ
			|						ИНАЧЕ уатМаршрутныйЛист.ТС.ПринадлежностьТС
			|					КОНЕЦ
			|			КОНЕЦ
			|	КОНЕЦ";
		КонецЕсли;
		Если ХарактеристикиСценария.флКонтрагент Тогда
			Запрос.Текст = Запрос.Текст + ",
			|уатМаршрутныйЛист.Контрагент";
		КонецЕсли;
		Если ХарактеристикиСценария.флВидПеревозки Тогда
			Запрос.Текст = Запрос.Текст + ",
			|уатМаршрутныйЛист.ВидПеревозки";
		КонецЕсли;
		Если ХарактеристикиСценария.флДоговор Тогда
			Запрос.Текст = Запрос.Текст + ",
			|уатМаршрутныйЛист.ДоговорКонтрагент";
		КонецЕсли;
		Если ХарактеристикиСценария.флМаршрут Тогда
			Запрос.Текст = Запрос.Текст + ",
			|ВЫБОР
			|		КОГДА &флМаршрутГруппы
			|				ТОГДА уатМаршрутныйЛист.Маршрут.Родитель
			|					ИНАЧЕ уатМаршрутныйЛист.Маршрут
			|	КОНЕЦ";
		КонецЕсли;
		Если ХарактеристикиСценария.флОбъектСтроительства Тогда
			Запрос.Текст = Запрос.Текст + ",
			|	ВЫБОР
			|		КОГДА &флОбъектСтроительстваГруппы
			|			ТОГДА уатМаршрутныйЛист.ОбъектСтроительства.Родитель
			|		ИНАЧЕ уатМаршрутныйЛист.ОбъектСтроительства
			|	КОНЕЦ";
		КонецЕсли;
		Если ХарактеристикиСценария.флНаправлениеПеревозки Тогда
			Запрос.Текст = Запрос.Текст + ",
			|	ВЫБОР
			|		КОГДА &флНаправлениеПеревозкиГруппы
			|			ТОГДА уатМаршрутныйЛист.НаправлениеПеревозки.Родитель
			|		ИНАЧЕ уатМаршрутныйЛист.НаправлениеПеревозки
			|	КОНЕЦ";
		КонецЕсли;
	Иначе 
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ";
		Если ХарактеристикиСценария.флНаправлениеПеревозки Тогда
			Запрос.Текст = Запрос.Текст + "
			|	ВЫБОР
			|		КОГДА &флНаправлениеПеревозкиГруппы
			|			ТОГДА уатПутевойЛистЗадание.НаправлениеПеревозки.Родитель
			|		ИНАЧЕ уатПутевойЛистЗадание.НаправлениеПеревозки
			|	КОНЕЦ КАК НаправлениеПеревозки,";
		КонецЕсли;
		Если ХарактеристикиСценария.флВидПеревозки Тогда 
			Запрос.Текст = Запрос.Текст + "
			|	уатПутевойЛистЗадание.ВидПеревозки КАК ВидПеревозки,"; 
		КонецЕсли;
		Если ХарактеристикиСценария.флМаршрут Тогда 
			Запрос.Текст = Запрос.Текст + "
			|	ВЫБОР
			|		КОГДА &флМаршрутГруппы
			|			ТОГДА уатПутевойЛистЗадание.Маршрут.Родитель
			|		ИНАЧЕ уатПутевойЛистЗадание.Маршрут
			|	КОНЕЦ КАК Маршрут,";
		КонецЕсли;
		Если ХарактеристикиСценария.флКонтрагент Тогда
			Запрос.Текст = Запрос.Текст + "
			|	ВЫБОР
			|		КОГДА &флКонтрагентГруппы
			|			ТОГДА уатПутевойЛистЗадание.Контрагент.Родитель
			|		ИНАЧЕ уатПутевойЛистЗадание.Контрагент
			|	КОНЕЦ КАК Контрагент,";
		КонецЕсли;
		Если ХарактеристикиСценария.флОбъектСтроительства Тогда 
			Запрос.Текст = Запрос.Текст + "
			|	ВЫБОР
			|		КОГДА &флОбъектСтроительстваГруппы
			|			ТОГДА уатПутевойЛистЗадание.ОбъектСтроительства.Родитель
			|		ИНАЧЕ уатПутевойЛистЗадание.ОбъектСтроительства
			|	КОНЕЦ КАК ОбъектСтроительства,";
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		|	уатПутевойЛистЗадание.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ втАналитикиЗадания
		|ИЗ
		|	Документ.уатПутевойЛист.Задание КАК уатПутевойЛистЗадание
		|ГДЕ
		|	уатПутевойЛистЗадание.Ссылка.Проведен
		|	И уатПутевойЛистЗадание.Ссылка.Рассчитан
		|	И уатПутевойЛистЗадание.Ссылка.ДатаВыезда МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И уатПутевойЛистЗадание.Ссылка.Организация = &Организация  
		|	И уатПутевойЛистЗадание.Ссылка.ТранспортноеСредство.ПринадлежностьТС = ЗНАЧЕНИЕ(Перечисление.уатПринадлежностьТС.Собственное)
		|
		|СГРУППИРОВАТЬ ПО";
		Если ХарактеристикиСценария.флНаправлениеПеревозки Тогда
			Запрос.Текст = Запрос.Текст + "
			|	ВЫБОР
			|		КОГДА &флНаправлениеПеревозкиГруппы
			|			ТОГДА уатПутевойЛистЗадание.НаправлениеПеревозки.Родитель
			|		ИНАЧЕ уатПутевойЛистЗадание.НаправлениеПеревозки
			|	КОНЕЦ,"; 
		КонецЕсли;
		Если ХарактеристикиСценария.флОбъектСтроительства Тогда
			Запрос.Текст = Запрос.Текст + "
			|	ВЫБОР
			|		КОГДА &флОбъектСтроительстваГруппы
			|			ТОГДА уатПутевойЛистЗадание.ОбъектСтроительства.Родитель
			|		ИНАЧЕ уатПутевойЛистЗадание.ОбъектСтроительства
			|	КОНЕЦ,"; 
		КонецЕсли;   
		Если ХарактеристикиСценария.флКонтрагент Тогда
			Запрос.Текст = Запрос.Текст + "
			|	ВЫБОР
			|		КОГДА &флКонтрагентГруппы
			|			ТОГДА уатПутевойЛистЗадание.Контрагент.Родитель
			|		ИНАЧЕ уатПутевойЛистЗадание.Контрагент
			|	КОНЕЦ,";
		КонецЕсли;
		Если ХарактеристикиСценария.флМаршрут Тогда
			Запрос.Текст = Запрос.Текст + "
			|	ВЫБОР
			|		КОГДА &флМаршрутГруппы
			|			ТОГДА уатПутевойЛистЗадание.Маршрут.Родитель
			|		ИНАЧЕ уатПутевойЛистЗадание.Маршрут
			|	КОНЕЦ,";
		КонецЕсли;
		Если ХарактеристикиСценария.флВидПеревозки Тогда
			Запрос.Текст = Запрос.Текст + "
			|	уатПутевойЛистЗадание.ВидПеревозки,";
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		|	уатПутевойЛистЗадание.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ уатПутевойЛист.ТранспортноеСредство) КАК КоличествоСобственныхТС,
		|	уатПутевойЛист.Организация КАК Организация,
		|	уатПутевойЛист.Подразделение КАК Подразделение,
		|	ВЫБОР
		|		КОГДА &флКолоннаГруппы
		|			ТОГДА уатПутевойЛист.ТранспортноеСредство.Колонна.Родитель
		|		ИНАЧЕ уатПутевойЛист.ТранспортноеСредство.Колонна
		|	КОНЕЦ КАК Колонна";
		
		Если ХарактеристикиСценария.флТС Тогда
			Запрос.Текст = Запрос.Текст + ",
			|	ВЫБОР
			|		КОГДА &ВариантАналитикиТС = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.ТС)
			|			ТОГДА ВЫБОР
			|					КОГДА &флТСГруппы
			|						ТОГДА уатПутевойЛист.ТранспортноеСредство.Родитель
			|					ИНАЧЕ уатПутевойЛист.ТранспортноеСредство
			|				КОНЕЦ
			|		ИНАЧЕ ВЫБОР
			|				КОГДА &ВариантАналитикиТС = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.МодельТС)
			|					ТОГДА ВЫБОР
			|							КОГДА &флТСГруппы
			|								ТОГДА уатПутевойЛист.ТранспортноеСредство.Модель.Родитель
			|							ИНАЧЕ уатПутевойЛист.ТранспортноеСредство.Модель
			|						КОНЕЦ
			|				ИНАЧЕ ВЫБОР
			|						КОГДА &ВариантАналитикиТС = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.ТипТС)
			|							ТОГДА ВЫБОР
			|									КОГДА &флТСГруппы
			|										ТОГДА уатПутевойЛист.ТранспортноеСредство.ТипТС.Родитель
			|									ИНАЧЕ уатПутевойЛист.ТранспортноеСредство.ТипТС
			|								КОНЕЦ
			|						ИНАЧЕ уатПутевойЛист.ТранспортноеСредство.ПринадлежностьТС
			|					КОНЕЦ
			|			КОНЕЦ
			|	КОНЕЦ КАК ДетализацияПланирования";
		КонецЕсли;
		Если ХарактеристикиСценария.флКонтрагент Тогда
			Запрос.Текст = Запрос.Текст + ",
			|втАналитикиЗадания.Контрагент КАК Контрагент";
		КонецЕсли;
		Если ХарактеристикиСценария.флОбъектСтроительства Тогда
			Запрос.Текст = Запрос.Текст + ",
			|втАналитикиЗадания.ОбъектСтроительства КАК ОбъектСтроительства";
		КонецЕсли;
		Если ХарактеристикиСценария.флМаршрут Тогда
			Запрос.Текст = Запрос.Текст + ",
			|втАналитикиЗадания.Маршрут КАК Маршрут";
		КонецЕсли;
		Если ХарактеристикиСценария.флВидПеревозки Тогда
			Запрос.Текст = Запрос.Текст + ",
			|втАналитикиЗадания.ВидПеревозки КАК ВидПеревозки";
		КонецЕсли;
		Если ХарактеристикиСценария.флНаправлениеПеревозки Тогда
			Запрос.Текст = Запрос.Текст + ",
			|втАналитикиЗадания.НаправлениеПеревозки КАК НаправлениеПеревозки";
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		|ИЗ 
		|	Документ.уатПутевойЛист КАК уатПутевойЛист
		|		ЛЕВОЕ СОЕДИНЕНИЕ втАналитикиЗадания КАК втАналитикиЗадания
		|		ПО втАналитикиЗадания.Ссылка = уатПутевойЛист.Ссылка
		|ГДЕ
		|	уатПутевойЛист.Проведен
		|	И уатПутевойЛист.ТранспортноеСредство.ПринадлежностьТС = ЗНАЧЕНИЕ(Перечисление.уатПринадлежностьТС.Собственное)
		|	И уатПутевойЛист.ДатаВыезда МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И уатПутевойЛист.Рассчитан
		|	И уатПутевойЛист.Организация = &Организация
		|
		|СГРУППИРОВАТЬ ПО
		|	уатПутевойЛист.Организация,
		|	уатПутевойЛист.Подразделение,
		|	ВЫБОР
		|		КОГДА &флКолоннаГруппы
		|			ТОГДА уатПутевойЛист.ТранспортноеСредство.Колонна.Родитель
		|		ИНАЧЕ уатПутевойЛист.ТранспортноеСредство.Колонна
		|	КОНЕЦ";
		Если ХарактеристикиСценария.флТС Тогда
			Запрос.Текст = Запрос.Текст + ",
			|	ВЫБОР
			|		КОГДА &ВариантАналитикиТС = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.ТС)
			|			ТОГДА ВЫБОР
			|					КОГДА &флТСГруппы
			|						ТОГДА уатПутевойЛист.ТранспортноеСредство.Родитель
			|					ИНАЧЕ уатПутевойЛист.ТранспортноеСредство
			|				КОНЕЦ
			|		ИНАЧЕ ВЫБОР
			|				КОГДА &ВариантАналитикиТС = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.МодельТС)
			|					ТОГДА ВЫБОР
			|							КОГДА &флТСГруппы
			|								ТОГДА уатПутевойЛист.ТранспортноеСредство.Модель.Родитель
			|							ИНАЧЕ уатПутевойЛист.ТранспортноеСредство.Модель
			|						КОНЕЦ
			|				ИНАЧЕ ВЫБОР
			|						КОГДА &ВариантАналитикиТС = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.ТипТС)
			|							ТОГДА ВЫБОР
			|									КОГДА &флТСГруппы
			|										ТОГДА уатПутевойЛист.ТранспортноеСредство.ТипТС.Родитель
			|									ИНАЧЕ уатПутевойЛист.ТранспортноеСредство.ТипТС
			|								КОНЕЦ
			|						ИНАЧЕ уатПутевойЛист.ТранспортноеСредство.ПринадлежностьТС
			|					КОНЕЦ
			|			КОНЕЦ
			|	КОНЕЦ";
		КонецЕсли;
		Если ХарактеристикиСценария.флКонтрагент Тогда
			Запрос.Текст = Запрос.Текст + ",
			|втАналитикиЗадания.Контрагент";
		КонецЕсли;
		Если ХарактеристикиСценария.флОбъектСтроительства Тогда
			Запрос.Текст = Запрос.Текст + ",
			|втАналитикиЗадания.ОбъектСтроительства";
		КонецЕсли;  
		Если ХарактеристикиСценария.флМаршрут Тогда
			Запрос.Текст = Запрос.Текст + ",
			|втАналитикиЗадания.Маршрут";
		КонецЕсли;
		Если ХарактеристикиСценария.флВидПеревозки Тогда
			Запрос.Текст = Запрос.Текст + ",
			|втАналитикиЗадания.ВидПеревозки";
		КонецЕсли;
		Если ХарактеристикиСценария.флНаправлениеПеревозки Тогда
			Запрос.Текст = Запрос.Текст + ",
			|втАналитикиЗадания.НаправлениеПеревозки";
		КонецЕсли;
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка          = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаСводныеПараметрыВыработки.Добавить();
		НоваяСтрока.Период            = НачДата;
		НоваяСтрока.Периодичность     = Периодичность;
		НоваяСтрока.ПараметрВыработки = Справочники.уатПараметрыВыработки.КоличествоСобственныхТС;
		НоваяСтрока.Регистратор       = ДокументСсылка;
		НоваяСтрока.Значение          = Выборка.КоличествоСобственныхТС;
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		Если РезультатЗапроса.Колонки.Найти("ДетализацияПланирования") = Неопределено
			ИЛИ ТипЗнч(Выборка.ДетализацияПланирования) <> Тип("СправочникСсылка.уатТС")
			ИЛИ НЕ ЗначениеЗаполнено(Выборка.ДетализацияПланирования) 
			ИЛИ Выборка.ДетализацияПланирования.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли;
		 
		Если ИсточникПолученияФактЗначенийДляСобственногоТС = Перечисления.уатИсточникиФактДанныхПоказателейПланирования.МаршрутныйЛист Тогда
			НоваяСтрока = ТаблицаВыработкаТСМЛ.Добавить();
		Иначе
			НоваяСтрока = ТаблицаВыработкаТС.Добавить();
		КонецЕсли;
		НоваяСтрока.Период            = НачДата;
		НоваяСтрока.ПараметрВыработки = Справочники.уатПараметрыВыработки.КоличествоСобственныхТС;
		НоваяСтрока.Регистратор       = ДокументСсылка;
		НоваяСтрока.Количество        = Выборка.КоличествоСобственныхТС;
		НоваяСтрока.ТС                = Выборка.ДетализацияПланирования;
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
	КонецЦикла;
		
КонецПроцедуры

Процедура РасчетКоличестваВодителей(ДокументСсылка, ХарактеристикиСценария, ТаблицаСводныеПараметрыВыработки,
	ДатаПланирования, Периодичность, ТаблицаВыработкаТС, ТаблицаВыработкаТСМЛ)  
	
	КоличествоВодителей = Справочники.уатПараметрыВыработки.КоличествоВодителей;
	ИсточникПолученияФактЗначенийДляСобственногоТС = КоличествоВодителей.ИсточникПолученияФактЗначенийДляСобственногоТС;
	
	НачДата = ДатаПланирования;
	КонДата = ДатаПланирования;
	уатОбщегоНазначенияТиповые.уатВыровнятьПериод(НачДата, КонДата, Периодичность);

	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ДатаНачала",                   НачДата);
	Запрос.УстановитьПараметр("ДатаОкончания",                КонецДня(КонДата));
	Запрос.УстановитьПараметр("флКолоннаГруппы",              ХарактеристикиСценария.флКолоннаГруппы);
	Запрос.УстановитьПараметр("ВариантАналитикиТС",           ХарактеристикиСценария.ВариантАналитикиТС);
	Запрос.УстановитьПараметр("флТСГруппы",                   ХарактеристикиСценария.флТСГруппы);   
	Запрос.УстановитьПараметр("флКонтрагентГруппы",           ХарактеристикиСценария.флКонтрагентГруппы);
	Запрос.УстановитьПараметр("флМаршрутГруппы",              ХарактеристикиСценария.флМаршрутГруппы);
	Запрос.УстановитьПараметр("флОбъектСтроительстваГруппы",  ХарактеристикиСценария.флОбъектСтроительстваГруппы);
	Запрос.УстановитьПараметр("флНаправлениеПеревозкиГруппы", ХарактеристикиСценария.флНаправлениеПеревозкиГруппы);
	Запрос.УстановитьПараметр("Организация",                  ДокументСсылка.Организация);

	Если ИсточникПолученияФактЗначенийДляСобственногоТС = Перечисления.уатИсточникиФактДанныхПоказателейПланирования.МаршрутныйЛист Тогда
		
		Запрос.Текст = "ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ уатМаршрутныйЛист.Водитель1) КАК КоличествоВодителей,
		|	уатМаршрутныйЛист.Организация КАК Организация,
		|	уатМаршрутныйЛист.Подразделение КАК Подразделение,
		|	ВЫБОР
		|		КОГДА &флКолоннаГруппы
		|			ТОГДА уатМаршрутныйЛист.ТС.Колонна.Родитель
		|		ИНАЧЕ уатМаршрутныйЛист.ТС.Колонна
		|	КОНЕЦ КАК Колонна";
		
		Если ХарактеристикиСценария.флТС Тогда
			Запрос.Текст = Запрос.Текст + ",
			|	ВЫБОР
			|		КОГДА &ВариантАналитикиТС = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.ТС)
			|			ТОГДА ВЫБОР
			|					КОГДА &флТСГруппы
			|						ТОГДА уатМаршрутныйЛист.ТС.Родитель
			|					ИНАЧЕ уатМаршрутныйЛист.ТС
			|				КОНЕЦ
			|		ИНАЧЕ ВЫБОР
			|				КОГДА &ВариантАналитикиТС = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.МодельТС)
			|					ТОГДА ВЫБОР
			|							КОГДА &флТСГруппы
			|								ТОГДА уатМаршрутныйЛист.ТС.Модель.Родитель
			|							ИНАЧЕ уатМаршрутныйЛист.ТС.Модель
			|						КОНЕЦ
			|				ИНАЧЕ ВЫБОР
			|						КОГДА &ВариантАналитикиТС = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.ТипТС)
			|							ТОГДА ВЫБОР
			|									КОГДА &флТСГруппы
			|										ТОГДА уатМаршрутныйЛист.ТС.ТипТС.Родитель
			|									ИНАЧЕ уатМаршрутныйЛист.ТС.ТипТС
			|								КОНЕЦ
			|						ИНАЧЕ уатМаршрутныйЛист.ТС.ПринадлежностьТС
			|					КОНЕЦ
			|			КОНЕЦ
			|	КОНЕЦ КАК ДетализацияПланирования";
		КонецЕсли;
		Если ХарактеристикиСценария.флКонтрагент Тогда
			Запрос.Текст = Запрос.Текст + ",
			|уатМаршрутныйЛист.Контрагент КАК Контрагент";
		КонецЕсли;
		Если ХарактеристикиСценария.флВидПеревозки Тогда
			Запрос.Текст = Запрос.Текст + ",
			|уатМаршрутныйЛист.ВидПеревозки КАК ВидПеревозки";
		КонецЕсли;
		Если ХарактеристикиСценария.флДоговор Тогда
			Запрос.Текст = Запрос.Текст + ",
			|уатМаршрутныйЛист.ДоговорКонтрагента КАК ДоговорКонтрагента";
		КонецЕсли;
		Если ХарактеристикиСценария.флМаршрут Тогда
			Запрос.Текст = Запрос.Текст + ",
			|ВЫБОР
			|		КОГДА &флМаршрутГруппы
			|				ТОГДА уатМаршрутныйЛист.Маршрут.Родитель
			|					ИНАЧЕ уатМаршрутныйЛист.Маршрут
			|	КОНЕЦ КАК Маршрут";
		КонецЕсли;
		Если ХарактеристикиСценария.флОбъектСтроительства Тогда
			Запрос.Текст = Запрос.Текст + ",
			|	ВЫБОР
			|		КОГДА &флОбъектСтроительстваГруппы
			|			ТОГДА уатМаршрутныйЛист.ОбъектСтроительства.Родитель
			|		ИНАЧЕ уатМаршрутныйЛист.ОбъектСтроительства
			|	КОНЕЦ КАК ОбъектСтроительства";
		КонецЕсли;
		Если ХарактеристикиСценария.флНаправлениеПеревозки Тогда
			Запрос.Текст = Запрос.Текст + ",
			|	ВЫБОР
			|		КОГДА &флНаправлениеПеревозкиГруппы
			|			ТОГДА уатМаршрутныйЛист.НаправлениеПеревозки.Родитель
			|		ИНАЧЕ уатМаршрутныйЛист.НаправлениеПеревозки
			|	КОНЕЦ КАК НаправлениеПеревозки";
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		|ИЗ
		|	Документ.уатМаршрутныйЛист КАК уатМаршрутныйЛист
		|ГДЕ
		|	уатМаршрутныйЛист.Проведен
		|	И уатМаршрутныйЛист.ТС.ПринадлежностьТС = ЗНАЧЕНИЕ(Перечисление.уатПринадлежностьТС.Собственное)
		|	И уатМаршрутныйЛист.ДатаИВремяОтправления МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И уатМаршрутныйЛист.Организация = &Организация
		|
		|СГРУППИРОВАТЬ ПО
		|	уатМаршрутныйЛист.Организация,
		|	уатМаршрутныйЛист.Подразделение,
		|	ВЫБОР
		|		КОГДА &флКолоннаГруппы
		|			ТОГДА уатМаршрутныйЛист.ТС.Колонна.Родитель
		|		ИНАЧЕ уатМаршрутныйЛист.ТС.Колонна
		|	КОНЕЦ";
		Если ХарактеристикиСценария.флТС Тогда
			Запрос.Текст = Запрос.Текст + ",
			|	ВЫБОР
			|		КОГДА &ВариантАналитикиТС = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.ТС)
			|			ТОГДА ВЫБОР
			|					КОГДА &флТСГруппы
			|						ТОГДА уатМаршрутныйЛист.ТС.Родитель
			|					ИНАЧЕ уатМаршрутныйЛист.ТС
			|				КОНЕЦ
			|		ИНАЧЕ ВЫБОР
			|				КОГДА &ВариантАналитикиТС = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.МодельТС)
			|					ТОГДА ВЫБОР
			|							КОГДА &флТСГруппы
			|								ТОГДА уатМаршрутныйЛист.ТС.Модель.Родитель
			|							ИНАЧЕ уатМаршрутныйЛист.ТС.Модель
			|						КОНЕЦ
			|				ИНАЧЕ ВЫБОР
			|						КОГДА &ВариантАналитикиТС = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.ТипТС)
			|							ТОГДА ВЫБОР
			|									КОГДА &флТСГруппы
			|										ТОГДА уатМаршрутныйЛист.ТС.ТипТС.Родитель
			|									ИНАЧЕ уатМаршрутныйЛист.ТС.ТипТС
			|								КОНЕЦ
			|						ИНАЧЕ уатМаршрутныйЛист.ТС.ПринадлежностьТС
			|					КОНЕЦ
			|			КОНЕЦ
			|	КОНЕЦ";
		КонецЕсли;
		Если ХарактеристикиСценария.флКонтрагент Тогда
			Запрос.Текст = Запрос.Текст + ",
			|уатМаршрутныйЛист.Контрагент";
		КонецЕсли;
		Если ХарактеристикиСценария.флВидПеревозки Тогда
			Запрос.Текст = Запрос.Текст + ",
			|уатМаршрутныйЛист.ВидПеревозки";
		КонецЕсли;
		Если ХарактеристикиСценария.флДоговор Тогда
			Запрос.Текст = Запрос.Текст + ",
			|уатМаршрутныйЛист.ДоговорКонтрагент";
		КонецЕсли;
		Если ХарактеристикиСценария.флМаршрут Тогда
			Запрос.Текст = Запрос.Текст + ",
			|ВЫБОР
			|		КОГДА &флМаршрутГруппы
			|				ТОГДА уатМаршрутныйЛист.Маршрут.Родитель
			|					ИНАЧЕ уатМаршрутныйЛист.Маршрут
			|	КОНЕЦ";
		КонецЕсли;
		Если ХарактеристикиСценария.флОбъектСтроительства Тогда
			Запрос.Текст = Запрос.Текст + ",
			|	ВЫБОР
			|		КОГДА &флОбъектСтроительстваГруппы
			|			ТОГДА уатМаршрутныйЛист.ОбъектСтроительства.Родитель
			|		ИНАЧЕ уатМаршрутныйЛист.ОбъектСтроительства
			|	КОНЕЦ";
		КонецЕсли;
		Если ХарактеристикиСценария.флНаправлениеПеревозки Тогда
			Запрос.Текст = Запрос.Текст + ",
			|	ВЫБОР
			|		КОГДА &флНаправлениеПеревозкиГруппы
			|			ТОГДА уатМаршрутныйЛист.НаправлениеПеревозки.Родитель
			|		ИНАЧЕ уатМаршрутныйЛист.НаправлениеПеревозки
			|	КОНЕЦ";
		КонецЕсли;
	Иначе    
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ";
		Если ХарактеристикиСценария.флНаправлениеПеревозки Тогда
			Запрос.Текст = Запрос.Текст + "
			|	ВЫБОР
			|		КОГДА &флНаправлениеПеревозкиГруппы
			|			ТОГДА уатПутевойЛистЗадание.НаправлениеПеревозки.Родитель
			|		ИНАЧЕ уатПутевойЛистЗадание.НаправлениеПеревозки
			|	КОНЕЦ КАК НаправлениеПеревозки,";
		КонецЕсли;
		Если ХарактеристикиСценария.флВидПеревозки Тогда 
			Запрос.Текст = Запрос.Текст + "
			|	уатПутевойЛистЗадание.ВидПеревозки КАК ВидПеревозки,"; 
		КонецЕсли;
		Если ХарактеристикиСценария.флМаршрут Тогда 
			Запрос.Текст = Запрос.Текст + "
			|	ВЫБОР
			|		КОГДА &флМаршрутГруппы
			|			ТОГДА уатПутевойЛистЗадание.Маршрут.Родитель
			|		ИНАЧЕ уатПутевойЛистЗадание.Маршрут
			|	КОНЕЦ КАК Маршрут,";
		КонецЕсли;
		Если ХарактеристикиСценария.флКонтрагент Тогда
			Запрос.Текст = Запрос.Текст + "
			|	ВЫБОР
			|		КОГДА &флКонтрагентГруппы
			|			ТОГДА уатПутевойЛистЗадание.Контрагент.Родитель
			|		ИНАЧЕ уатПутевойЛистЗадание.Контрагент
			|	КОНЕЦ КАК Контрагент,";
		КонецЕсли;
		Если ХарактеристикиСценария.флОбъектСтроительства Тогда 
			Запрос.Текст = Запрос.Текст + "
			|	ВЫБОР
			|		КОГДА &флОбъектСтроительстваГруппы
			|			ТОГДА уатПутевойЛистЗадание.ОбъектСтроительства.Родитель
			|		ИНАЧЕ уатПутевойЛистЗадание.ОбъектСтроительства
			|	КОНЕЦ КАК ОбъектСтроительства,";
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		|	уатПутевойЛистЗадание.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ втАналитикиЗадания
		|ИЗ
		|	Документ.уатПутевойЛист.Задание КАК уатПутевойЛистЗадание
		|ГДЕ
		|	уатПутевойЛистЗадание.Ссылка.Проведен
		|	И уатПутевойЛистЗадание.Ссылка.Рассчитан
		|	И уатПутевойЛистЗадание.Ссылка.ДатаВыезда МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И уатПутевойЛистЗадание.Ссылка.Организация = &Организация  
		|	И уатПутевойЛистЗадание.Ссылка.ТранспортноеСредство.ПринадлежностьТС = ЗНАЧЕНИЕ(Перечисление.уатПринадлежностьТС.Собственное)
		|
		|СГРУППИРОВАТЬ ПО";
		Если ХарактеристикиСценария.флНаправлениеПеревозки Тогда
			Запрос.Текст = Запрос.Текст + "
			|	ВЫБОР
			|		КОГДА &флНаправлениеПеревозкиГруппы
			|			ТОГДА уатПутевойЛистЗадание.НаправлениеПеревозки.Родитель
			|		ИНАЧЕ уатПутевойЛистЗадание.НаправлениеПеревозки
			|	КОНЕЦ,"; 
		КонецЕсли;
		Если ХарактеристикиСценария.флОбъектСтроительства Тогда
			Запрос.Текст = Запрос.Текст + "
			|	ВЫБОР
			|		КОГДА &флОбъектСтроительстваГруппы
			|			ТОГДА уатПутевойЛистЗадание.ОбъектСтроительства.Родитель
			|		ИНАЧЕ уатПутевойЛистЗадание.ОбъектСтроительства
			|	КОНЕЦ,"; 
		КонецЕсли;
		Если ХарактеристикиСценария.флКонтрагент Тогда
			Запрос.Текст = Запрос.Текст + "
			|	ВЫБОР
			|		КОГДА &флКонтрагентГруппы
			|			ТОГДА уатПутевойЛистЗадание.Контрагент.Родитель
			|		ИНАЧЕ уатПутевойЛистЗадание.Контрагент
			|	КОНЕЦ,";
		КонецЕсли;
		Если ХарактеристикиСценария.флМаршрут Тогда
			Запрос.Текст = Запрос.Текст + "
			|	ВЫБОР
			|		КОГДА &флМаршрутГруппы
			|			ТОГДА уатПутевойЛистЗадание.Маршрут.Родитель
			|		ИНАЧЕ уатПутевойЛистЗадание.Маршрут
			|	КОНЕЦ,";
		КонецЕсли;
		Если ХарактеристикиСценария.флВидПеревозки Тогда
			Запрос.Текст = Запрос.Текст + "
			|	уатПутевойЛистЗадание.ВидПеревозки,";
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		|	уатПутевойЛистЗадание.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ уатПутевойЛист.Водитель1) КАК КоличествоВодителей,
		|	уатПутевойЛист.Организация КАК Организация,
		|	уатПутевойЛист.Подразделение КАК Подразделение,
		|	ВЫБОР
		|		КОГДА &флКолоннаГруппы
		|			ТОГДА уатПутевойЛист.ТранспортноеСредство.Колонна.Родитель
		|		ИНАЧЕ уатПутевойЛист.ТранспортноеСредство.Колонна
		|	КОНЕЦ КАК Колонна";
		
		Если ХарактеристикиСценария.флТС Тогда
			Запрос.Текст = Запрос.Текст + ",
			|	ВЫБОР
			|		КОГДА &ВариантАналитикиТС = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.ТС)
			|			ТОГДА ВЫБОР
			|					КОГДА &флТСГруппы
			|						ТОГДА уатПутевойЛист.ТранспортноеСредство.Родитель
			|					ИНАЧЕ уатПутевойЛист.ТранспортноеСредство
			|				КОНЕЦ
			|		ИНАЧЕ ВЫБОР
			|				КОГДА &ВариантАналитикиТС = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.МодельТС)
			|					ТОГДА ВЫБОР
			|							КОГДА &флТСГруппы
			|								ТОГДА уатПутевойЛист.ТранспортноеСредство.Модель.Родитель
			|							ИНАЧЕ уатПутевойЛист.ТранспортноеСредство.Модель
			|						КОНЕЦ
			|				ИНАЧЕ ВЫБОР
			|						КОГДА &ВариантАналитикиТС = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.ТипТС)
			|							ТОГДА ВЫБОР
			|									КОГДА &флТСГруппы
			|										ТОГДА уатПутевойЛист.ТранспортноеСредство.ТипТС.Родитель
			|									ИНАЧЕ уатПутевойЛист.ТранспортноеСредство.ТипТС
			|								КОНЕЦ
			|						ИНАЧЕ уатПутевойЛист.ТранспортноеСредство.ПринадлежностьТС
			|					КОНЕЦ
			|			КОНЕЦ
			|	КОНЕЦ КАК ДетализацияПланирования";
		КонецЕсли;
		Если ХарактеристикиСценария.флКонтрагент Тогда
			Запрос.Текст = Запрос.Текст + ",
			|втАналитикиЗадания.Контрагент КАК Контрагент";
		КонецЕсли;
		Если ХарактеристикиСценария.флОбъектСтроительства Тогда
			Запрос.Текст = Запрос.Текст + ",
			|втАналитикиЗадания.ОбъектСтроительства КАК ОбъектСтроительства";
		КонецЕсли;
		Если ХарактеристикиСценария.флМаршрут Тогда
			Запрос.Текст = Запрос.Текст + ",
			|втАналитикиЗадания.Маршрут КАК Маршрут";
		КонецЕсли;
		Если ХарактеристикиСценария.флВидПеревозки Тогда
			Запрос.Текст = Запрос.Текст + ",
			|втАналитикиЗадания.ВидПеревозки КАК ВидПеревозки";
		КонецЕсли;
		Если ХарактеристикиСценария.флНаправлениеПеревозки Тогда
			Запрос.Текст = Запрос.Текст + ",
			|втАналитикиЗадания.НаправлениеПеревозки КАК НаправлениеПеревозки";
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		|ИЗ 
		|	Документ.уатПутевойЛист КАК уатПутевойЛист
		|		ЛЕВОЕ СОЕДИНЕНИЕ втАналитикиЗадания КАК втАналитикиЗадания
		|		ПО втАналитикиЗадания.Ссылка = уатПутевойЛист.Ссылка
		|ГДЕ
		|	уатПутевойЛист.Проведен
		|	И уатПутевойЛист.ТранспортноеСредство.ПринадлежностьТС = ЗНАЧЕНИЕ(Перечисление.уатПринадлежностьТС.Собственное)
		|	И уатПутевойЛист.ДатаВыезда МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И уатПутевойЛист.Рассчитан
		|	И уатПутевойЛист.Организация = &Организация
		|
		|СГРУППИРОВАТЬ ПО
		|	уатПутевойЛист.Организация,
		|	уатПутевойЛист.Подразделение,
		|	ВЫБОР
		|		КОГДА &флКолоннаГруппы
		|			ТОГДА уатПутевойЛист.ТранспортноеСредство.Колонна.Родитель
		|		ИНАЧЕ уатПутевойЛист.ТранспортноеСредство.Колонна
		|	КОНЕЦ";
		Если ХарактеристикиСценария.флТС Тогда
			Запрос.Текст = Запрос.Текст + ",
			|	ВЫБОР
			|		КОГДА &ВариантАналитикиТС = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.ТС)
			|			ТОГДА ВЫБОР
			|					КОГДА &флТСГруппы
			|						ТОГДА уатПутевойЛист.ТранспортноеСредство.Родитель
			|					ИНАЧЕ уатПутевойЛист.ТранспортноеСредство
			|				КОНЕЦ
			|		ИНАЧЕ ВЫБОР
			|				КОГДА &ВариантАналитикиТС = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.МодельТС)
			|					ТОГДА ВЫБОР
			|							КОГДА &флТСГруппы
			|								ТОГДА уатПутевойЛист.ТранспортноеСредство.Модель.Родитель
			|							ИНАЧЕ уатПутевойЛист.ТранспортноеСредство.Модель
			|						КОНЕЦ
			|				ИНАЧЕ ВЫБОР
			|						КОГДА &ВариантАналитикиТС = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.ТипТС)
			|							ТОГДА ВЫБОР
			|									КОГДА &флТСГруппы
			|										ТОГДА уатПутевойЛист.ТранспортноеСредство.ТипТС.Родитель
			|									ИНАЧЕ уатПутевойЛист.ТранспортноеСредство.ТипТС
			|								КОНЕЦ
			|						ИНАЧЕ уатПутевойЛист.ТранспортноеСредство.ПринадлежностьТС
			|					КОНЕЦ
			|			КОНЕЦ
			|	КОНЕЦ";
		КонецЕсли;
		Если ХарактеристикиСценария.флКонтрагент Тогда
			Запрос.Текст = Запрос.Текст + ",
			|втАналитикиЗадания.Контрагент";
		КонецЕсли;
		Если ХарактеристикиСценария.флОбъектСтроительства Тогда
			Запрос.Текст = Запрос.Текст + ",
			|втАналитикиЗадания.ОбъектСтроительства";
		КонецЕсли;  
		Если ХарактеристикиСценария.флМаршрут Тогда
			Запрос.Текст = Запрос.Текст + ",
			|втАналитикиЗадания.Маршрут";
		КонецЕсли;
		Если ХарактеристикиСценария.флВидПеревозки Тогда
			Запрос.Текст = Запрос.Текст + ",
			|втАналитикиЗадания.ВидПеревозки";
		КонецЕсли;
		Если ХарактеристикиСценария.флНаправлениеПеревозки Тогда
			Запрос.Текст = Запрос.Текст + ",
			|втАналитикиЗадания.НаправлениеПеревозки";
		КонецЕсли;
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка          = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаСводныеПараметрыВыработки.Добавить();
		НоваяСтрока.Период            = НачДата;
		НоваяСтрока.Периодичность     = Периодичность;
		НоваяСтрока.ПараметрВыработки = Справочники.уатПараметрыВыработки.КоличествоВодителей;
		НоваяСтрока.Регистратор       = ДокументСсылка;
		НоваяСтрока.Значение          = Выборка.КоличествоВодителей;
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		Если РезультатЗапроса.Колонки.Найти("ДетализацияПланирования") = Неопределено
			ИЛИ ТипЗнч(Выборка.ДетализацияПланирования) <> Тип("СправочникСсылка.уатТС") 
			ИЛИ НЕ ЗначениеЗаполнено(Выборка.ДетализацияПланирования)
			ИЛИ Выборка.ДетализацияПланирования.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли;
		
		Если ИсточникПолученияФактЗначенийДляСобственногоТС = Перечисления.уатИсточникиФактДанныхПоказателейПланирования.МаршрутныйЛист Тогда
			НоваяСтрока = ТаблицаВыработкаТСМЛ.Добавить();
		Иначе
			НоваяСтрока = ТаблицаВыработкаТС.Добавить();
		КонецЕсли;
		НоваяСтрока.Период            = НачДата;
		НоваяСтрока.ПараметрВыработки = Справочники.уатПараметрыВыработки.КоличествоВодителей;
		НоваяСтрока.Регистратор       = ДокументСсылка;
		НоваяСтрока.Количество        = Выборка.КоличествоВодителей;
		НоваяСтрока.ТС                = Выборка.ДетализацияПланирования;
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
		
КонецПроцедуры

Процедура РасчетФактическийРасходГСМ(ДокументСсылка, ХарактеристикиСценария, ТаблицаСводныеПараметрыВыработки,
	ДатаПланирования, Периодичность, ТаблицаВыработкаТС, ТаблицаВыработкаТСМЛ)  
	
	ФактическийРасходГСМ = Справочники.уатПараметрыВыработки.ФактическийРасходГСМ;
	
	НачДата = ДатаПланирования;
	КонДата = ДатаПланирования;
	уатОбщегоНазначенияТиповые.уатВыровнятьПериод(НачДата, КонДата, Периодичность);

	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ДатаНачала",                   НачДата);
	Запрос.УстановитьПараметр("ДатаОкончания",                КонецДня(КонДата));
	Запрос.УстановитьПараметр("флКолоннаГруппы",              ХарактеристикиСценария.флКолоннаГруппы);
	Запрос.УстановитьПараметр("ВариантАналитикиТС",           ХарактеристикиСценария.ВариантАналитикиТС);
	Запрос.УстановитьПараметр("флТСГруппы",                   ХарактеристикиСценария.флТСГруппы);
	Запрос.УстановитьПараметр("флМаршрутГруппы",              ХарактеристикиСценария.флМаршрутГруппы);
	Запрос.УстановитьПараметр("флОбъектСтроительстваГруппы",  ХарактеристикиСценария.флОбъектСтроительстваГруппы);
	Запрос.УстановитьПараметр("флНаправлениеПеревозкиГруппы", ХарактеристикиСценария.флНаправлениеПеревозкиГруппы); 
	Запрос.УстановитьПараметр("флКонтрагентГруппы",           ХарактеристикиСценария.флКонтрагентГруппы);
	Запрос.УстановитьПараметр("Организация",                  ДокументСсылка.Организация);

	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ";
	Если ХарактеристикиСценария.флНаправлениеПеревозки Тогда
		Запрос.Текст = Запрос.Текст + "
		|	ВЫБОР
		|		КОГДА &флНаправлениеПеревозкиГруппы
		|			ТОГДА уатПутевойЛистЗадание.НаправлениеПеревозки.Родитель
		|		ИНАЧЕ уатПутевойЛистЗадание.НаправлениеПеревозки
		|	КОНЕЦ КАК НаправлениеПеревозки,";
	КонецЕсли;
	Если ХарактеристикиСценария.флВидПеревозки Тогда 
		Запрос.Текст = Запрос.Текст + "
		|	уатПутевойЛистЗадание.ВидПеревозки КАК ВидПеревозки,"; 
	КонецЕсли;
	Если ХарактеристикиСценария.флМаршрут Тогда 
		Запрос.Текст = Запрос.Текст + "
		|	ВЫБОР
		|		КОГДА &флМаршрутГруппы
		|			ТОГДА уатПутевойЛистЗадание.Маршрут.Родитель
		|		ИНАЧЕ уатПутевойЛистЗадание.Маршрут
		|	КОНЕЦ КАК Маршрут,";
	КонецЕсли;
	Если ХарактеристикиСценария.флКонтрагент Тогда
		Запрос.Текст = Запрос.Текст + "
		|	ВЫБОР
		|		КОГДА &флКонтрагентГруппы
		|			ТОГДА уатПутевойЛистЗадание.Контрагент.Родитель
		|		ИНАЧЕ уатПутевойЛистЗадание.Контрагент
		|	КОНЕЦ КАК Контрагент,";
	КонецЕсли;
	Если ХарактеристикиСценария.флОбъектСтроительства Тогда 
		Запрос.Текст = Запрос.Текст + "
		|	ВЫБОР
		|		КОГДА &флОбъектСтроительстваГруппы
		|			ТОГДА уатПутевойЛистЗадание.ОбъектСтроительства.Родитель
		|		ИНАЧЕ уатПутевойЛистЗадание.ОбъектСтроительства
		|	КОНЕЦ КАК ОбъектСтроительства,";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	|	уатПутевойЛистЗадание.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ втАналитикиЗадания
	|ИЗ
	|	Документ.уатПутевойЛист.Задание КАК уатПутевойЛистЗадание
	|ГДЕ
	|	уатПутевойЛистЗадание.Ссылка.Проведен
	|	И уатПутевойЛистЗадание.Ссылка.Рассчитан
	|	И уатПутевойЛистЗадание.Ссылка.ДатаВыезда МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И уатПутевойЛистЗадание.Ссылка.Организация = &Организация
	|
	|СГРУППИРОВАТЬ ПО";
	Если ХарактеристикиСценария.флНаправлениеПеревозки Тогда
		Запрос.Текст = Запрос.Текст + "
		|	ВЫБОР
		|		КОГДА &флНаправлениеПеревозкиГруппы
		|			ТОГДА уатПутевойЛистЗадание.НаправлениеПеревозки.Родитель
		|		ИНАЧЕ уатПутевойЛистЗадание.НаправлениеПеревозки
		|	КОНЕЦ,"; 
	КонецЕсли;
	Если ХарактеристикиСценария.флОбъектСтроительства Тогда
		Запрос.Текст = Запрос.Текст + "
		|	ВЫБОР
		|		КОГДА &флОбъектСтроительстваГруппы
		|			ТОГДА уатПутевойЛистЗадание.ОбъектСтроительства.Родитель
		|		ИНАЧЕ уатПутевойЛистЗадание.ОбъектСтроительства
		|	КОНЕЦ,"; 
	КонецЕсли;
	Если ХарактеристикиСценария.флКонтрагент Тогда
		Запрос.Текст = Запрос.Текст + "
		|	ВЫБОР
		|		КОГДА &флКонтрагентГруппы
		|			ТОГДА уатПутевойЛистЗадание.Контрагент.Родитель
		|		ИНАЧЕ уатПутевойЛистЗадание.Контрагент
		|	КОНЕЦ,";
	КонецЕсли;
	Если ХарактеристикиСценария.флМаршрут Тогда 
		Запрос.Текст = Запрос.Текст + "
		|	ВЫБОР
		|		КОГДА &флМаршрутГруппы
		|			ТОГДА уатПутевойЛистЗадание.Маршрут.Родитель
		|		ИНАЧЕ уатПутевойЛистЗадание.Маршрут
		|	КОНЕЦ,";
	КонецЕсли;
	Если ХарактеристикиСценария.флВидПеревозки Тогда
		Запрос.Текст = Запрос.Текст + "
		|	уатПутевойЛистЗадание.ВидПеревозки,";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	|	уатПутевойЛистЗадание.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВЫБОР
	|			КОГДА уатПутевойЛистРасходГСМ.Ссылка.РасчетФактРасходаГСМ = ЗНАЧЕНИЕ(Перечисление.уатВидыРасчетаРасходаГСМ.НеРассчитывать)
	|				ТОГДА уатПутевойЛистРасходГСМ.РасходПоФакту
	|			ИНАЧЕ ВЫБОР
	|					КОГДА уатПутевойЛистРасходГСМ.Ссылка.РасчетФактРасходаГСМ = ЗНАЧЕНИЕ(Перечисление.уатВидыРасчетаРасходаГСМ.ПоНорме)
	|						ТОГДА уатПутевойЛистРасходГСМ.РасходПоНорме
	|					ИНАЧЕ уатПутевойЛистРасходГСМ.РасходПоGPS
	|				КОНЕЦ
	|		КОНЕЦ) КАК ФактРасходГСМ,
	|	уатПутевойЛистРасходГСМ.Ссылка.Организация КАК Организация,
	|	уатПутевойЛистРасходГСМ.Ссылка.Подразделение КАК Подразделение,
	|	ВЫБОР
	|		КОГДА &флКолоннаГруппы
	|			ТОГДА уатПутевойЛистРасходГСМ.Ссылка.ТранспортноеСредство.Колонна.Родитель
	|		ИНАЧЕ уатПутевойЛистРасходГСМ.Ссылка.ТранспортноеСредство.Колонна
	|	КОНЕЦ КАК Колонна";
	Если ХарактеристикиСценария.флТС Тогда
		Запрос.Текст = Запрос.Текст + ",
		|	ВЫБОР
		|		КОГДА &ВариантАналитикиТС = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.ТС)
		|			ТОГДА ВЫБОР
		|					КОГДА &флТСГруппы
		|						ТОГДА уатПутевойЛистРасходГСМ.Ссылка.ТранспортноеСредство.Родитель
		|					ИНАЧЕ уатПутевойЛистРасходГСМ.Ссылка.ТранспортноеСредство
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА &ВариантАналитикиТС = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.МодельТС)
		|					ТОГДА ВЫБОР
		|							КОГДА &флТСГруппы
		|								ТОГДА уатПутевойЛистРасходГСМ.Ссылка.ТранспортноеСредство.Модель.Родитель
		|							ИНАЧЕ уатПутевойЛистРасходГСМ.Ссылка.ТранспортноеСредство.Модель
		|						КОНЕЦ
		|				ИНАЧЕ ВЫБОР
		|						КОГДА &ВариантАналитикиТС = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.ТипТС)
		|							ТОГДА ВЫБОР
		|									КОГДА &флТСГруппы
		|										ТОГДА уатПутевойЛистРасходГСМ.Ссылка.ТранспортноеСредство.ТипТС.Родитель
		|									ИНАЧЕ уатПутевойЛистРасходГСМ.Ссылка.ТранспортноеСредство.ТипТС
		|								КОНЕЦ
		|						ИНАЧЕ уатПутевойЛистРасходГСМ.Ссылка.ТранспортноеСредство.ПринадлежностьТС
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК ДетализацияПланирования";
	КонецЕсли;
	Если ХарактеристикиСценария.флКонтрагент Тогда
		Запрос.Текст = Запрос.Текст + ",
		|втАналитикиЗадания.Контрагент КАК Контрагент";
	КонецЕсли;
	Если ХарактеристикиСценария.флОбъектСтроительства Тогда
		Запрос.Текст = Запрос.Текст + ",
		|	втАналитикиЗадания.ОбъектСтроительства КАК ОбъектСтроительства";
	КонецЕсли;
	Если ХарактеристикиСценария.флМаршрут Тогда
		Запрос.Текст = Запрос.Текст + ",
		|	втАналитикиЗадания.Маршрут КАК Маршрут";
	КонецЕсли;
	Если ХарактеристикиСценария.флВидПеревозки Тогда
		Запрос.Текст = Запрос.Текст + ",
		|втАналитикиЗадания.ВидПеревозки КАК ВидПеревозки";
	КонецЕсли;
	Если ХарактеристикиСценария.флНаправлениеПеревозки Тогда
		Запрос.Текст = Запрос.Текст + ",
		|втАналитикиЗадания.НаправлениеПеревозки КАК НаправлениеПеревозки";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	|ИЗ
	|	Документ.уатПутевойЛист.РасходГСМ КАК уатПутевойЛистРасходГСМ
	|		ЛЕВОЕ СОЕДИНЕНИЕ втАналитикиЗадания КАК втАналитикиЗадания
	|		ПО втАналитикиЗадания.Ссылка = уатПутевойЛистРасходГСМ.Ссылка
	|ГДЕ
	|	уатПутевойЛистРасходГСМ.Ссылка.Проведен
	|	И уатПутевойЛистРасходГСМ.Ссылка.Рассчитан
	|	И уатПутевойЛистРасходГСМ.Ссылка.ДатаВыезда МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И уатПутевойЛистРасходГСМ.ГСМ = уатПутевойЛистРасходГСМ.Ссылка.ТранспортноеСредство.Модель.ОсновноеТопливо
	|	И уатПутевойЛистРасходГСМ.Ссылка.ТранспортноеСредство  = уатПутевойЛистРасходГСМ.ТС
	|	И уатПутевойЛистРасходГСМ.Ссылка.Организация  = &Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	уатПутевойЛистРасходГСМ.Ссылка.Организация,
	|	уатПутевойЛистРасходГСМ.Ссылка.Подразделение,
	|	ВЫБОР
	|		КОГДА &флКолоннаГруппы
	|			ТОГДА уатПутевойЛистРасходГСМ.Ссылка.ТранспортноеСредство.Колонна.Родитель
	|		ИНАЧЕ уатПутевойЛистРасходГСМ.Ссылка.ТранспортноеСредство.Колонна
	|	КОНЕЦ";
	Если ХарактеристикиСценария.флТС Тогда
		Запрос.Текст = Запрос.Текст + ",
		|	ВЫБОР
		|		КОГДА &ВариантАналитикиТС = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.ТС)
		|			ТОГДА ВЫБОР
		|					КОГДА &флТСГруппы
		|						ТОГДА уатПутевойЛистРасходГСМ.Ссылка.ТранспортноеСредство.Родитель
		|					ИНАЧЕ уатПутевойЛистРасходГСМ.Ссылка.ТранспортноеСредство
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА &ВариантАналитикиТС = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.МодельТС)
		|					ТОГДА ВЫБОР
		|							КОГДА &флТСГруппы
		|								ТОГДА уатПутевойЛистРасходГСМ.Ссылка.ТранспортноеСредство.Модель.Родитель
		|							ИНАЧЕ уатПутевойЛистРасходГСМ.Ссылка.ТранспортноеСредство.Модель
		|						КОНЕЦ
		|				ИНАЧЕ ВЫБОР
		|						КОГДА &ВариантАналитикиТС = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.ТипТС)
		|							ТОГДА ВЫБОР
		|									КОГДА &флТСГруппы
		|										ТОГДА уатПутевойЛистРасходГСМ.Ссылка.ТранспортноеСредство.ТипТС.Родитель
		|									ИНАЧЕ уатПутевойЛистРасходГСМ.Ссылка.ТранспортноеСредство.ТипТС
		|								КОНЕЦ
		|						ИНАЧЕ уатПутевойЛистРасходГСМ.Ссылка.ТранспортноеСредство.ПринадлежностьТС
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ";
	КонецЕсли; 
	Если ХарактеристикиСценария.флКонтрагент Тогда
		Запрос.Текст = Запрос.Текст + ",
		|втАналитикиЗадания.Контрагент";
	КонецЕсли;
	Если ХарактеристикиСценария.флОбъектСтроительства Тогда
		Запрос.Текст = Запрос.Текст + ",
		|втАналитикиЗадания.ОбъектСтроительства";
	КонецЕсли;
	Если ХарактеристикиСценария.флМаршрут Тогда
		Запрос.Текст = Запрос.Текст + ",
		|втАналитикиЗадания.Маршрут";
	КонецЕсли;
	Если ХарактеристикиСценария.флВидПеревозки Тогда
		Запрос.Текст = Запрос.Текст + ",
		|втАналитикиЗадания.ВидПеревозки";
	КонецЕсли;
	Если ХарактеристикиСценария.флНаправлениеПеревозки Тогда
		Запрос.Текст = Запрос.Текст + ",
		|втАналитикиЗадания.НаправлениеПеревозки";
	КонецЕсли;   
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка          = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаСводныеПараметрыВыработки.Добавить();
		НоваяСтрока.Период            = НачДата;
		НоваяСтрока.Периодичность     = Периодичность;
		НоваяСтрока.ПараметрВыработки = Справочники.уатПараметрыВыработки.ФактическийРасходГСМ;
		НоваяСтрока.Регистратор       = ДокументСсылка;
		НоваяСтрока.Значение          = Выборка.ФактРасходГСМ;
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		Если РезультатЗапроса.Колонки.Найти("ДетализацияПланирования") = Неопределено
			ИЛИ ТипЗнч(Выборка.ДетализацияПланирования) <> Тип("СправочникСсылка.уатТС")
			ИЛИ НЕ ЗначениеЗаполнено(Выборка.ДетализацияПланирования)
			ИЛИ Выборка.ДетализацияПланирования.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли;
		 
		НоваяСтрока = ТаблицаВыработкаТС.Добавить();
		НоваяСтрока.Период            = НачДата;
		НоваяСтрока.ПараметрВыработки = Справочники.уатПараметрыВыработки.ФактическийРасходГСМ;
		НоваяСтрока.Регистратор       = ДокументСсылка;
		НоваяСтрока.Количество        = Выборка.ФактРасходГСМ;
		НоваяСтрока.ТС                = Выборка.ДетализацияПланирования;
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
		
КонецПроцедуры

Процедура РасчетСтоимостьПробега(ДокументСсылка, ХарактеристикиСценария, ТаблицаСводныеПараметрыВыработки,
	ДатаПланирования, Периодичность, ТаблицаВыработкаТС, ТаблицаВыработкаТСМЛ, ВариантАналитикиСтатья)  
	
	НачДата = ДатаПланирования;
	КонДата = ДатаПланирования;
	уатОбщегоНазначенияТиповые.уатВыровнятьПериод(НачДата, КонДата, Периодичность);
	
	ФактическийРасходГСМ = Справочники.уатПараметрыВыработки.СтоимостьКмПробега;
	
	ИсточникПолученияФактЗначенийДляСобственногоТС = ФактическийРасходГСМ.ИсточникПолученияФактЗначенийДляСобственногоТС;
	ИсточникПолученияФактЗначенийДляПривлТС        = ФактическийРасходГСМ.ИсточникПолученияФактЗначенийДляПривлТС;
	
	флМЛСобственноеТС = ИсточникПолученияФактЗначенийДляСобственногоТС = Перечисления.уатИсточникиФактДанныхПоказателейПланирования.МаршрутныйЛист;
	флМЛПривлТС       = ИсточникПолученияФактЗначенийДляСобственногоТС = Перечисления.уатИсточникиФактДанныхПоказателейПланирования.МаршрутныйЛист;
	
	Если ВариантАналитикиСтатья = Перечисления.уатВариантыАналитик.СтатьяДоходов Тогда
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("ДатаНачала",                   НачДата);
		Запрос.УстановитьПараметр("ДатаОкончания",                КонецДня(КонДата));
		Запрос.УстановитьПараметр("флКолоннаГруппы",              ХарактеристикиСценария.флКолоннаГруппы);
		Запрос.УстановитьПараметр("ВариантАналитикиТС",           ХарактеристикиСценария.ВариантАналитикиТС);
		Запрос.УстановитьПараметр("флТСГруппы",                   ХарактеристикиСценария.флТСГруппы);
		Запрос.УстановитьПараметр("флМаршрутГруппы",              ХарактеристикиСценария.флМаршрутГруппы);
		Запрос.УстановитьПараметр("флОбъектСтроительстваГруппы",  ХарактеристикиСценария.флОбъектСтроительстваГруппы);
		Запрос.УстановитьПараметр("флНаправлениеПеревозкиГруппы", ХарактеристикиСценария.флНаправлениеПеревозкиГруппы);
		Запрос.УстановитьПараметр("Организация",                  ДокументСсылка.Организация);
		Запрос.УстановитьПараметр("флМЛСобственноеТС",            флМЛСобственноеТС);
		Запрос.УстановитьПараметр("флМЛПривлТС",                  флМЛПривлТС);
		Запрос.УстановитьПараметр("ТипМЛ",                        Тип("ДокументСсылка.уатМаршрутныйЛист"));

		Запрос.Текст = "ВЫБРАТЬ
		|	уатВыработкаПоМаршрутнымЛистам_уэОбороты.Регистратор.СуммаДоходов КАК СуммаДоходов,
		|	СУММА(уатВыработкаПоМаршрутнымЛистам_уэОбороты.КоличествоОборот) КАК Количество,
		|	уатВыработкаПоМаршрутнымЛистам_уэОбороты.Организация КАК Организация,
		|	уатВыработкаПоМаршрутнымЛистам_уэОбороты.Подразделение КАК Подразделение,
		|	уатВыработкаПоМаршрутнымЛистам_уэОбороты.НаправлениеПеревозки КАК НаправлениеПеревозки,
		|	уатВыработкаПоМаршрутнымЛистам_уэОбороты.ОбъектСтроительства КАК ОбъектСтроительства,
		|	уатВыработкаПоМаршрутнымЛистам_уэОбороты.ОбъектСтроительства КАК ВидПеревозки,
		|	ВЫБОР
		|		КОГДА &ВариантАналитикиТС = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.ТС)
		|			ТОГДА ВЫБОР
		|					КОГДА &флТСГруппы
		|						ТОГДА уатВыработкаПоМаршрутнымЛистам_уэОбороты.ТС.Родитель
		|					ИНАЧЕ уатВыработкаПоМаршрутнымЛистам_уэОбороты.ТС
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА &ВариантАналитикиТС = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.МодельТС)
		|					ТОГДА ВЫБОР
		|							КОГДА &флТСГруппы
		|								ТОГДА уатВыработкаПоМаршрутнымЛистам_уэОбороты.ТС.Модель.Родитель
		|							ИНАЧЕ уатВыработкаПоМаршрутнымЛистам_уэОбороты.ТС.Модель
		|						КОНЕЦ
		|				ИНАЧЕ ВЫБОР
		|						КОГДА &ВариантАналитикиТС = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.ТипТС)
		|							ТОГДА ВЫБОР
		|									КОГДА &флТСГруппы
		|										ТОГДА уатВыработкаПоМаршрутнымЛистам_уэОбороты.ТС.ТипТС.Родитель
		|									ИНАЧЕ уатВыработкаПоМаршрутнымЛистам_уэОбороты.ТС.ТипТС
		|								КОНЕЦ
		|						ИНАЧЕ уатВыработкаПоМаршрутнымЛистам_уэОбороты.ТС.ПринадлежностьТС
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК ТС,
		|	ВЫБОР
		|		КОГДА &флКолоннаГруппы
		|			ТОГДА уатВыработкаПоМаршрутнымЛистам_уэОбороты.Колонна.Родитель
		|		ИНАЧЕ уатВыработкаПоМаршрутнымЛистам_уэОбороты.Колонна
		|	КОНЕЦ КАК Колонна,
		|	уатВыработкаПоМаршрутнымЛистам_уэОбороты.Контрагент КАК Контрагент,
		|	уатВыработкаПоМаршрутнымЛистам_уэОбороты.Регистратор КАК Регистратор,
		|	уатВыработкаПоМаршрутнымЛистам_уэОбороты.Маршрут КАК Маршрут
		|ПОМЕСТИТЬ втМЛ
		|ИЗ
		|	РегистрНакопления.уатВыработкаПоМаршрутнымЛистам_уэ.Обороты(
		|			&ДатаНачала,
		|			&ДатаОкончания,
		|			Регистратор,
		|			ПараметрВыработки = ЗНАЧЕНИЕ(Справочник.уатПараметрыВыработки.ПробегОбщий)
		|				И Организация = &Организация
		|				И ВЫБОР
		|					КОГДА ТС.ПринадлежностьТС = ЗНАЧЕНИЕ(Перечисление.уатПринадлежностьТС.Собственное)
		|						ТОГДА &флМЛСобственноеТС
		|					ИНАЧЕ &флМЛПривлТС
		|				КОНЕЦ) КАК уатВыработкаПоМаршрутнымЛистам_уэОбороты
		|ГДЕ
		|	уатВыработкаПоМаршрутнымЛистам_уэОбороты.Регистратор.СуммаДоходов <> 0
		|	И ТИПЗНАЧЕНИЯ(уатВыработкаПоМаршрутнымЛистам_уэОбороты.Регистратор) = &ТипМЛ
		|
		|СГРУППИРОВАТЬ ПО
		|	уатВыработкаПоМаршрутнымЛистам_уэОбороты.Организация,
		|	уатВыработкаПоМаршрутнымЛистам_уэОбороты.Подразделение,
		|	уатВыработкаПоМаршрутнымЛистам_уэОбороты.НаправлениеПеревозки,
		|	уатВыработкаПоМаршрутнымЛистам_уэОбороты.ОбъектСтроительства,
		|	уатВыработкаПоМаршрутнымЛистам_уэОбороты.ВидПеревозки,
		|	ВЫБОР
		|		КОГДА &флКолоннаГруппы
		|			ТОГДА уатВыработкаПоМаршрутнымЛистам_уэОбороты.Колонна.Родитель
		|		ИНАЧЕ уатВыработкаПоМаршрутнымЛистам_уэОбороты.Колонна
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ВариантАналитикиТС = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.ТС)
		|			ТОГДА ВЫБОР
		|					КОГДА &флТСГруппы
		|						ТОГДА уатВыработкаПоМаршрутнымЛистам_уэОбороты.ТС.Родитель
		|					ИНАЧЕ уатВыработкаПоМаршрутнымЛистам_уэОбороты.ТС
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА &ВариантАналитикиТС = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.МодельТС)
		|					ТОГДА ВЫБОР
		|							КОГДА &флТСГруппы
		|								ТОГДА уатВыработкаПоМаршрутнымЛистам_уэОбороты.ТС.Модель.Родитель
		|							ИНАЧЕ уатВыработкаПоМаршрутнымЛистам_уэОбороты.ТС.Модель
		|						КОНЕЦ
		|				ИНАЧЕ ВЫБОР
		|						КОГДА &ВариантАналитикиТС = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.ТипТС)
		|							ТОГДА ВЫБОР
		|									КОГДА &флТСГруппы
		|										ТОГДА уатВыработкаПоМаршрутнымЛистам_уэОбороты.ТС.ТипТС.Родитель
		|									ИНАЧЕ уатВыработкаПоМаршрутнымЛистам_уэОбороты.ТС.ТипТС
		|								КОНЕЦ
		|						ИНАЧЕ уатВыработкаПоМаршрутнымЛистам_уэОбороты.ТС.ПринадлежностьТС
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ,
		|	уатВыработкаПоМаршрутнымЛистам_уэОбороты.Контрагент,
		|	уатВыработкаПоМаршрутнымЛистам_уэОбороты.Регистратор.СуммаДоходов,
		|	уатВыработкаПоМаршрутнымЛистам_уэОбороты.Регистратор,
		|	уатВыработкаПоМаршрутнымЛистам_уэОбороты.Маршрут
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(втМЛ.СуммаДоходов / втМЛ.Количество) КАК Количество,
		|	втМЛ.Организация КАК Организация,
		|	втМЛ.Подразделение КАК Подразделение,
		|	втМЛ.Колонна КАК Колонна";
		Если ХарактеристикиСценария.флТС Тогда
			Запрос.Текст = Запрос.Текст + ",
			|	втМЛ.ТС КАК ТС";
		КонецЕсли;
		Если ХарактеристикиСценария.флКонтрагент Тогда
			Запрос.Текст = Запрос.Текст + ",
			|втМЛ.Контрагент КАК Контрагент";
		КонецЕсли;
		Если ХарактеристикиСценария.флВидПеревозки Тогда
			Запрос.Текст = Запрос.Текст + ",
			|втМЛ.ВидПеревозки КАК ВидПеревозки";
		КонецЕсли;
		Если ХарактеристикиСценария.флДоговор Тогда
			Запрос.Текст = Запрос.Текст + ",
			|втМЛ.Регистратор.ДоговорКонтрагента КАК ДоговорКонтрагента";
		КонецЕсли;
		Если ХарактеристикиСценария.флМаршрут Тогда
			Запрос.Текст = Запрос.Текст + ",
			|ВЫБОР
			|		КОГДА &флМаршрутГруппы
			|				ТОГДА втМЛ.Маршрут.Родитель
			|					ИНАЧЕ втМЛ.Маршрут
			|	КОНЕЦ КАК Маршрут";
		КонецЕсли;
		Если ХарактеристикиСценария.флОбъектСтроительства Тогда
			Запрос.Текст = Запрос.Текст + ",
			|	ВЫБОР
			|		КОГДА &флОбъектСтроительстваГруппы
			|			ТОГДА втМЛ.ОбъектСтроительства.Родитель
			|		ИНАЧЕ втМЛ.ОбъектСтроительства
			|	КОНЕЦ КАК ОбъектСтроительства";
		КонецЕсли;
		Если ХарактеристикиСценария.флНаправлениеПеревозки Тогда
			Запрос.Текст = Запрос.Текст + ",
			|	ВЫБОР
			|		КОГДА &флНаправлениеПеревозкиГруппы
			|			ТОГДА втМЛ.НаправлениеПеревозки.Родитель
			|		ИНАЧЕ втМЛ.НаправлениеПеревозки
			|	КОНЕЦ КАК НаправлениеПеревозки";
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		|ИЗ
		|	втМЛ КАК втМЛ
		|
		|СГРУППИРОВАТЬ ПО
		|	втМЛ.Организация,
		|	втМЛ.Подразделение,
		|	втМЛ.Колонна";
		Если ХарактеристикиСценария.флТС Тогда
			Запрос.Текст = Запрос.Текст + ",
			|	втМЛ.ТС";
		КонецЕсли;
		Если ХарактеристикиСценария.флКонтрагент Тогда
			Запрос.Текст = Запрос.Текст + ",
			|втМЛ.Контрагент";
		КонецЕсли;
		Если ХарактеристикиСценария.флВидПеревозки Тогда
			Запрос.Текст = Запрос.Текст + ",
			|втМЛ.ВидПеревозки";
		КонецЕсли;
		Если ХарактеристикиСценария.флДоговор Тогда
			Запрос.Текст = Запрос.Текст + ",
			|втМЛ.Регистратор.ДоговорКонтрагента";
		КонецЕсли;
		Если ХарактеристикиСценария.флМаршрут Тогда
			Запрос.Текст = Запрос.Текст + ",
			|ВЫБОР
			|		КОГДА &флМаршрутГруппы
			|				ТОГДА втМЛ.Маршрут.Родитель
			|					ИНАЧЕ втМЛ.Маршрут
			|	КОНЕЦ";
		КонецЕсли;
		Если ХарактеристикиСценария.флОбъектСтроительства Тогда
			Запрос.Текст = Запрос.Текст + ",
			|	ВЫБОР
			|		КОГДА &флОбъектСтроительстваГруппы
			|			ТОГДА втМЛ.ОбъектСтроительства.Родитель
			|		ИНАЧЕ втМЛ.ОбъектСтроительства
			|	КОНЕЦ";
		КонецЕсли;
		Если ХарактеристикиСценария.флНаправлениеПеревозки Тогда
			Запрос.Текст = Запрос.Текст + ",
			|	ВЫБОР
			|		КОГДА &флНаправлениеПеревозкиГруппы
			|			ТОГДА втМЛ.НаправлениеПеревозки.Родитель
			|		ИНАЧЕ втМЛ.НаправлениеПеревозки
			|	КОНЕЦ";
		КонецЕсли;
		
		
		
	Иначе
		
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("ДатаНачала",                   НачДата);
		Запрос.УстановитьПараметр("ДатаОкончания",                КонецДня(КонДата));
		Запрос.УстановитьПараметр("флКолоннаГруппы",              ХарактеристикиСценария.флКолоннаГруппы);
		Запрос.УстановитьПараметр("ВариантАналитикиТС",           ХарактеристикиСценария.ВариантАналитикиТС);
		Запрос.УстановитьПараметр("флТСГруппы",                   ХарактеристикиСценария.флТСГруппы);
		Запрос.УстановитьПараметр("флМаршрутГруппы",              ХарактеристикиСценария.флМаршрутГруппы);
		Запрос.УстановитьПараметр("флОбъектСтроительстваГруппы",  ХарактеристикиСценария.флОбъектСтроительстваГруппы);
		Запрос.УстановитьПараметр("флНаправлениеПеревозкиГруппы", ХарактеристикиСценария.флНаправлениеПеревозкиГруппы);
		Запрос.УстановитьПараметр("Организация",                  ДокументСсылка.Организация);
		Запрос.УстановитьПараметр("флМЛСобственноеТС",            флМЛСобственноеТС);
		Запрос.УстановитьПараметр("флМЛПривлТС",                  флМЛПривлТС);
		Запрос.УстановитьПараметр("ТипМЛ",                        Тип("ДокументСсылка.уатМаршрутныйЛист"));

		Запрос.Текст = "ВЫБРАТЬ
		|	уатВыработкаПоМаршрутнымЛистам_уэОбороты.Регистратор.СуммаЗатрат КАК СуммаЗатрат,
		|	СУММА(уатВыработкаПоМаршрутнымЛистам_уэОбороты.КоличествоОборот) КАК Количество,
		|	уатВыработкаПоМаршрутнымЛистам_уэОбороты.Организация КАК Организация,
		|	уатВыработкаПоМаршрутнымЛистам_уэОбороты.Подразделение КАК Подразделение,
		|	уатВыработкаПоМаршрутнымЛистам_уэОбороты.НаправлениеПеревозки КАК НаправлениеПеревозки,
		|	уатВыработкаПоМаршрутнымЛистам_уэОбороты.ОбъектСтроительства КАК ОбъектСтроительства,
		|	уатВыработкаПоМаршрутнымЛистам_уэОбороты.ОбъектСтроительства КАК ВидПеревозки,
		|	ВЫБОР
		|		КОГДА &ВариантАналитикиТС = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.ТС)
		|			ТОГДА ВЫБОР
		|					КОГДА &флТСГруппы
		|						ТОГДА уатВыработкаПоМаршрутнымЛистам_уэОбороты.ТС.Родитель
		|					ИНАЧЕ уатВыработкаПоМаршрутнымЛистам_уэОбороты.ТС
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА &ВариантАналитикиТС = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.МодельТС)
		|					ТОГДА ВЫБОР
		|							КОГДА &флТСГруппы
		|								ТОГДА уатВыработкаПоМаршрутнымЛистам_уэОбороты.ТС.Модель.Родитель
		|							ИНАЧЕ уатВыработкаПоМаршрутнымЛистам_уэОбороты.ТС.Модель
		|						КОНЕЦ
		|				ИНАЧЕ ВЫБОР
		|						КОГДА &ВариантАналитикиТС = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.ТипТС)
		|							ТОГДА ВЫБОР
		|									КОГДА &флТСГруппы
		|										ТОГДА уатВыработкаПоМаршрутнымЛистам_уэОбороты.ТС.ТипТС.Родитель
		|									ИНАЧЕ уатВыработкаПоМаршрутнымЛистам_уэОбороты.ТС.ТипТС
		|								КОНЕЦ
		|						ИНАЧЕ уатВыработкаПоМаршрутнымЛистам_уэОбороты.ТС.ПринадлежностьТС
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК ТС,
		|	ВЫБОР
		|		КОГДА &флКолоннаГруппы
		|			ТОГДА уатВыработкаПоМаршрутнымЛистам_уэОбороты.Колонна.Родитель
		|		ИНАЧЕ уатВыработкаПоМаршрутнымЛистам_уэОбороты.Колонна
		|	КОНЕЦ КАК Колонна,
		|	уатВыработкаПоМаршрутнымЛистам_уэОбороты.Контрагент КАК Контрагент,
		|	уатВыработкаПоМаршрутнымЛистам_уэОбороты.Регистратор КАК Регистратор,
		|	уатВыработкаПоМаршрутнымЛистам_уэОбороты.Маршрут КАК Маршрут
		|ПОМЕСТИТЬ втМЛ
		|ИЗ
		|	РегистрНакопления.уатВыработкаПоМаршрутнымЛистам_уэ.Обороты(
		|			&ДатаНачала,
		|			&ДатаОкончания,
		|			Регистратор,
		|			ПараметрВыработки = ЗНАЧЕНИЕ(Справочник.уатПараметрыВыработки.ПробегОбщий)
		|				И Организация = &Организация
		|				И ВЫБОР
		|					КОГДА ТС.ПринадлежностьТС = ЗНАЧЕНИЕ(Перечисление.уатПринадлежностьТС.Собственное)
		|						ТОГДА &флМЛСобственноеТС
		|					ИНАЧЕ &флМЛПривлТС
		|				КОНЕЦ) КАК уатВыработкаПоМаршрутнымЛистам_уэОбороты
		|ГДЕ
		|	уатВыработкаПоМаршрутнымЛистам_уэОбороты.Регистратор.СуммаДоходов <> 0
		|	И ТИПЗНАЧЕНИЯ(уатВыработкаПоМаршрутнымЛистам_уэОбороты.Регистратор) = &ТипМЛ
		|
		|СГРУППИРОВАТЬ ПО
		|	уатВыработкаПоМаршрутнымЛистам_уэОбороты.Организация,
		|	уатВыработкаПоМаршрутнымЛистам_уэОбороты.Подразделение,
		|	уатВыработкаПоМаршрутнымЛистам_уэОбороты.НаправлениеПеревозки,
		|	уатВыработкаПоМаршрутнымЛистам_уэОбороты.ОбъектСтроительства,
		|	уатВыработкаПоМаршрутнымЛистам_уэОбороты.ВидПеревозки,
		|	ВЫБОР
		|		КОГДА &флКолоннаГруппы
		|			ТОГДА уатВыработкаПоМаршрутнымЛистам_уэОбороты.Колонна.Родитель
		|		ИНАЧЕ уатВыработкаПоМаршрутнымЛистам_уэОбороты.Колонна
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ВариантАналитикиТС = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.ТС)
		|			ТОГДА ВЫБОР
		|					КОГДА &флТСГруппы
		|						ТОГДА уатВыработкаПоМаршрутнымЛистам_уэОбороты.ТС.Родитель
		|					ИНАЧЕ уатВыработкаПоМаршрутнымЛистам_уэОбороты.ТС
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА &ВариантАналитикиТС = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.МодельТС)
		|					ТОГДА ВЫБОР
		|							КОГДА &флТСГруппы
		|								ТОГДА уатВыработкаПоМаршрутнымЛистам_уэОбороты.ТС.Модель.Родитель
		|							ИНАЧЕ уатВыработкаПоМаршрутнымЛистам_уэОбороты.ТС.Модель
		|						КОНЕЦ
		|				ИНАЧЕ ВЫБОР
		|						КОГДА &ВариантАналитикиТС = ЗНАЧЕНИЕ(Перечисление.уатВариантыАналитик.ТипТС)
		|							ТОГДА ВЫБОР
		|									КОГДА &флТСГруппы
		|										ТОГДА уатВыработкаПоМаршрутнымЛистам_уэОбороты.ТС.ТипТС.Родитель
		|									ИНАЧЕ уатВыработкаПоМаршрутнымЛистам_уэОбороты.ТС.ТипТС
		|								КОНЕЦ
		|						ИНАЧЕ уатВыработкаПоМаршрутнымЛистам_уэОбороты.ТС.ПринадлежностьТС
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ,
		|	уатВыработкаПоМаршрутнымЛистам_уэОбороты.Контрагент,
		|	уатВыработкаПоМаршрутнымЛистам_уэОбороты.Регистратор.СуммаДоходов,
		|	уатВыработкаПоМаршрутнымЛистам_уэОбороты.Регистратор,
		|	уатВыработкаПоМаршрутнымЛистам_уэОбороты.Маршрут
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(втМЛ.СуммаЗатрат / втМЛ.Количество) КАК Количество,
		|	втМЛ.Организация КАК Организация,
		|	втМЛ.Подразделение КАК Подразделение,
		|	втМЛ.Колонна КАК Колонна";
		Если ХарактеристикиСценария.флТС Тогда
			Запрос.Текст = Запрос.Текст + ",
			|	втМЛ.ТС КАК ТС";
		КонецЕсли;
		Если ХарактеристикиСценария.флКонтрагент Тогда
			Запрос.Текст = Запрос.Текст + ",
			|втМЛ.Контрагент КАК Контрагент";
		КонецЕсли;
		Если ХарактеристикиСценария.флВидПеревозки Тогда
			Запрос.Текст = Запрос.Текст + ",
			|втМЛ.ВидПеревозки КАК ВидПеревозки";
		КонецЕсли;
		Если ХарактеристикиСценария.флДоговор Тогда
			Запрос.Текст = Запрос.Текст + ",
			|втМЛ.Регистратор.ДоговорКонтрагента КАК ДоговорКонтрагента";
		КонецЕсли;
		Если ХарактеристикиСценария.флМаршрут Тогда
			Запрос.Текст = Запрос.Текст + ",
			|ВЫБОР
			|		КОГДА &флМаршрутГруппы
			|				ТОГДА втМЛ.Маршрут.Родитель
			|					ИНАЧЕ втМЛ.Маршрут
			|	КОНЕЦ КАК Маршрут";
		КонецЕсли;
		Если ХарактеристикиСценария.флОбъектСтроительства Тогда
			Запрос.Текст = Запрос.Текст + ",
			|	ВЫБОР
			|		КОГДА &флОбъектСтроительстваГруппы
			|			ТОГДА втМЛ.ОбъектСтроительства.Родитель
			|		ИНАЧЕ втМЛ.ОбъектСтроительства
			|	КОНЕЦ КАК ОбъектСтроительства";
		КонецЕсли;
		Если ХарактеристикиСценария.флНаправлениеПеревозки Тогда
			Запрос.Текст = Запрос.Текст + ",
			|	ВЫБОР
			|		КОГДА &флНаправлениеПеревозкиГруппы
			|			ТОГДА втМЛ.НаправлениеПеревозки.Родитель
			|		ИНАЧЕ втМЛ.НаправлениеПеревозки
			|	КОНЕЦ КАК НаправлениеПеревозки";
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		|ИЗ
		|	втМЛ КАК втМЛ
		|
		|СГРУППИРОВАТЬ ПО
		|	втМЛ.Организация,
		|	втМЛ.Подразделение,
		|	втМЛ.Колонна";
		Если ХарактеристикиСценария.флТС Тогда
			Запрос.Текст = Запрос.Текст + ",
			|	втМЛ.ТС";
		КонецЕсли;
		Если ХарактеристикиСценария.флКонтрагент Тогда
			Запрос.Текст = Запрос.Текст + ",
			|втМЛ.Контрагент";
		КонецЕсли;
		Если ХарактеристикиСценария.флВидПеревозки Тогда
			Запрос.Текст = Запрос.Текст + ",
			|втМЛ.ВидПеревозки";
		КонецЕсли;
		Если ХарактеристикиСценария.флДоговор Тогда
			Запрос.Текст = Запрос.Текст + ",
			|втМЛ.Регистратор.ДоговорКонтрагента";
		КонецЕсли;
		Если ХарактеристикиСценария.флМаршрут Тогда
			Запрос.Текст = Запрос.Текст + ",
			|ВЫБОР
			|		КОГДА &флМаршрутГруппы
			|				ТОГДА втМЛ.Маршрут.Родитель
			|					ИНАЧЕ втМЛ.Маршрут
			|	КОНЕЦ";
		КонецЕсли;
		Если ХарактеристикиСценария.флОбъектСтроительства Тогда
			Запрос.Текст = Запрос.Текст + ",
			|	ВЫБОР
			|		КОГДА &флОбъектСтроительстваГруппы
			|			ТОГДА втМЛ.ОбъектСтроительства.Родитель
			|		ИНАЧЕ втМЛ.ОбъектСтроительства
			|	КОНЕЦ";
		КонецЕсли;
		Если ХарактеристикиСценария.флНаправлениеПеревозки Тогда
			Запрос.Текст = Запрос.Текст + ",
			|	ВЫБОР
			|		КОГДА &флНаправлениеПеревозкиГруппы
			|			ТОГДА втМЛ.НаправлениеПеревозки.Родитель
			|		ИНАЧЕ втМЛ.НаправлениеПеревозки
			|	КОНЕЦ";
		КонецЕсли;
		
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаСводныеПараметрыВыработки.Добавить();
		НоваяСтрока.ДетализацияПланирования = Выборка.ТС;
		НоваяСтрока.Период            = НачДата;
		НоваяСтрока.Периодичность     = Периодичность;
		НоваяСтрока.ПараметрВыработки = Справочники.уатПараметрыВыработки.СтоимостьКмПробега;
		НоваяСтрока.Регистратор       = ДокументСсылка;
		НоваяСтрока.Значение          = Выборка.Количество;
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли