////////////////////////////////////////////////////////////////////////////////
// Модуль содержит процедуры и функции обеспечения проведения
// Вариант поставки ПРОФ
////////////////////////////////////////////////////////////////////////////////


#Область СлужебныйПрограммныйИнтерфейс

// Функция выполняет формирование таблицы партий для списания билетов
//
// Параметры:
//  ТаблицаБилетов		 - 	 - таблица билетов для которой необходимо получить списываемые партии
//  	должно содержать 3 колонки: билет, списываемое количество, склад с которого выполняется
//  	списание
//  СпособСписанияПартий - 	 - способ списания партий: фило, либо, по средней - значение перечисления
//  МоментВремени		 - 	 - Момент времени на который получаются остатки партий
// 
// Возвращаемое значение:
//  Таблица - списываемых партий в формате: билет, склад, партия,  количество
//
Функция ПолучитьТаблицуПартийБилетовДляСписания(ТаблицаБилетов, СпособСписанияПартий, МоментВремени = Неопределено) Экспорт
	мЗапрос = Новый Запрос;
	мЗапрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВремТаб.Билет,
	|	ВремТаб.Количество,
	|	ВремТаб.Склад
	|ПОМЕСТИТЬ ТаблицаБилетов
	|ИЗ
	|	&ТаблицаПараметр КАК ВремТаб
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаБилетов.Билет,
	|	ТаблицаБилетов.Склад,
	|	СУММА(ТаблицаБилетов.Количество) КАК Количество
	|ПОМЕСТИТЬ ТаблицаБилетовГруппировка
	|ИЗ
	|	ТаблицаБилетов КАК ТаблицаБилетов
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаБилетов.Билет,
	|	ТаблицаБилетов.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	мЗапрос.УстановитьПараметр("ТаблицаПараметр", ТаблицаБилетов);
	Если МоментВремени = Неопределено тогда 
		мЗапрос.УстановитьПараметр("МоментВремени", Дата('00010101'));
	Иначе
		мЗапрос.УстановитьПараметр("МоментВремени", МоментВремени);
	КонецЕсли;
		
	Если СпособСписанияПартий = Перечисления.СпособыОценки.ПоСредней тогда
		мЗапрос.Текст = мЗапрос.Текст + "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Билеты.Билет,
		|	Билеты.Количество,
		|	Билеты.Склад
		|ИЗ
		|	ТаблицаБилетовГруппировка КАК Билеты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.уатБилетыНаСкладах.Остатки(
		|				&МоментВремени,
		|				Склад В (ВЫБРАТЬ РАЗЛИЧНЫЕ
		|							мТаб.Склад
		|						ИЗ
		|							ТаблицаБилетов КАК мТаб)
		|					И Билет В
		|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|							мТаб.Билет
		|						ИЗ
		|							ТаблицаБилетов КАК мТаб
		|						)) КАК уатБилетыНаСкладахОстатки
		|		ПО Билеты.Склад = уатБилетыНаСкладахОстатки.Склад
		|			И Билеты.Билет = уатБилетыНаСкладахОстатки.Билет
		|;";
		МассивРезультатов = мЗапрос.ВыполнитьПакет();
		тблПартий = МассивРезультатов[2].Выгрузить();
		тблПартий.Колонки.Добавить("Партия", Метаданные.РегистрыНакопления.уатБилетыНаСкладах.Измерения.Партия.Тип);
		
		Возврат тблПартий;
		
	Иначе
		мЗапрос.Текст = мЗапрос.Текст + 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Билеты.Билет,
		|	Билеты.Склад,
		|	Билеты.Количество,
		|	уатБилетыНаСкладахОстатки.Партия КАК Партия,
		|	ЕСТЬNULL(уатБилетыНаСкладахОстатки.КоличествоОстаток, 0) КАК КоличествоПартия,
		|	ЕСТЬNULL(уатБилетыНаСкладахОстатки.КоличествоОстаток, 0) КАК КоличествоОсталось
		|ИЗ
		|	ТаблицаБилетовГруппировка КАК Билеты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.уатБилетыНаСкладах.Остатки(
		|				&МоментВремени,
		|				Склад В
		|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|							мТаб.Склад
		|						ИЗ
		|							ТаблицаБилетов КАК мТаб)
		|					И Билет В
		|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|							мТаб.Билет
		|						ИЗ
		|							ТаблицаБилетов КАК мТаб)) КАК уатБилетыНаСкладахОстатки
		|		ПО Билеты.Билет = уатБилетыНаСкладахОстатки.Билет
		|			И Билеты.Склад = уатБилетыНаСкладахОстатки.Склад
		|
		|УПОРЯДОЧИТЬ ПО
		|	уатБилетыНаСкладахОстатки.Партия.МоментВремени";

		Если СпособСписанияПартий = Перечисления.СпособыОценки.ЛИФО Тогда
			мЗапрос.Текст = СтрЗаменить(мЗапрос.Текст, "уатБилетыНаСкладахОстатки.Партия.МоментВремени",
				"уатБилетыНаСкладахОстатки.Партия.МоментВремени Убыв");
		КонецЕсли;
		
        МассивРезультатов = мЗапрос.ВыполнитьПакет();
		
		ТаблицаОстатковПартий = МассивРезультатов[2].Выгрузить();
		ТаблицаПартий = Новый ТаблицаЗначений();
		ТаблицаПартий.Колонки.Добавить("Склад"       , Новый ОписаниеТипов("СправочникСсылка.Склады"));
		ТаблицаПартий.Колонки.Добавить("Билет", Новый ОписаниеТипов("СправочникСсылка.уатБилеты"));
		ТаблицаПартий.Колонки.Добавить("Партия"      , Метаданные.РегистрыНакопления.уатБилетыНаСкладах.Измерения.Партия.Тип);
		ТаблицаПартий.Колонки.Добавить("Количество"  , Новый ОписаниеТипов("Число"),Новый КвалификаторыЧисла(15,2));
				
		Для каждого ТекСтрокаТабБилетов ИЗ ТаблицаБилетов Цикл
			ОсталосьСписать = ТекСтрокаТабБилетов.Количество;	
			Для каждого ТекСтрокаОстатковПартий ИЗ ТаблицаОстатковПартий Цикл
				Если ОсталосьСписать = 0 ТОгда
					Прервать;
				КонецЕсли;
				Если ТекСтрокаТабБилетов.Склад = ТекСтрокаОстатковПартий.Склад 
				   И ТекСтрокаТабБилетов.Билет = ТекСтрокаОстатковПартий.Билет
				   И ТекСтрокаОстатковПартий.КоличествоОсталось > 0 тогда
					СписатьКоличество = Мин(ТекСтрокаОстатковПартий.КоличествоОсталось, ОсталосьСписать);
					Если СписатьКоличество = 0 тогда 
						Продолжить;
					КонецЕсли;
					НовСтрока = ТаблицаПартий.Добавить();
					НовСтрока.Склад        = ТекСтрокаОстатковПартий.Склад;
					НовСтрока.Билет = ТекСтрокаОстатковПартий.Билет;
					НовСтрока.Партия       = ТекСтрокаОстатковПартий.Партия;
					НовСтрока.Количество   = СписатьКоличество;
					
					ОсталосьСписать = ОсталосьСписать - СписатьКоличество;
					ТекСтрокаОстатковПартий.КоличествоОсталось  = ТекСтрокаОстатковПартий.КоличествоОсталось - СписатьКоличество;
				Иначе
					Продолжить;
				КонецЕсли;
				
			КонецЦикла;
			
			Если ОсталосьСписать > 0 тогда
				НовСтрока = ТаблицаПартий.Добавить();
				НовСтрока.Склад      = ТекСтрокаТабБилетов.Склад;
				НовСтрока.Билет      = ТекСтрокаТабБилетов.Билет;
				НовСтрока.Партия     = Неопределено;
				НовСтрока.Количество = ОсталосьСписать;
			КонецЕсли;
			
		КонецЦикла;
		
		Возврат ТаблицаПартий;
	КонецЕсли;

КонецФункции

#Область ФормированиеДвиженийРегистров

// Выполняет движения регистра сведений Местонахождение ТС
//
// Параметры:
//  ДополнительныеСвойства	 - 	 - 
//  Движения				 - 	 - 
//  Отказ					 - 	 - 
//
Процедура ОтразитьМестонахождениеТС(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаМестонахожденияТС = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаМестонахожденияТС;
	
	Если Отказ ИЛИ ТаблицаМестонахожденияТС.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияСостояние = Движения.уатМестонахождениеТС;
	ДвиженияСостояние.Записывать = Истина;
	ДвиженияСостояние.Загрузить(ТаблицаМестонахожденияТС);

КонецПроцедуры

// Выполняет движения регистра сведений Прейскуранты ТС
//
// Параметры:
//  ДополнительныеСвойства	 - 	 - 
//  Движения				 - 	 - 
//  Отказ					 - 	 - 
//
Процедура ОтразитьПрейскурантыТС(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаПрейскурантыТС = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПрейскурантыТС;
	
	Если Отказ ИЛИ ТаблицаПрейскурантыТС.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияСостояние = Движения.уатПрейскурантыТС;
	ДвиженияСостояние.Записывать = Истина;
	ДвиженияСостояние.Загрузить(ТаблицаПрейскурантыТС);

КонецПроцедуры

// Выполняет движения регистра сведений Тарифы ЗП сотрудников
//
// Параметры:
//  ДополнительныеСвойства	 - 	 - 
//  Движения				 - 	 - 
//  Отказ					 - 	 - 
//
Процедура ОтразитьТарифыЗП(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаТарифыЗП = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаТарифыЗП;
	
	Если Отказ ИЛИ ТаблицаТарифыЗП.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияСостояние = Движения.уатТарифыСотрудников;
	ДвиженияСостояние.Записывать = Истина;
	ДвиженияСостояние.Загрузить(ТаблицаТарифыЗП);

КонецПроцедуры

// Выполняет движения регистра накопления Движение денежных сресдств
//
// Параметры:
//  ДополнительныеСвойства	 - 	 - 
//  Движения				 - 	 - 
//  Отказ					 - 	 - 
//
Процедура ОтразитьДвижениеДДС(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	мТаблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДвижениеДС;
	
	Если Отказ ИЛИ мТаблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияВыработка = Движения.уатДвижениеДС;
	ДвиженияВыработка.Записывать = Истина;
	ДвиженияВыработка.Загрузить(мТаблица);

КонецПроцедуры

// Выполняет движения регистра накопления Выработка сотрудников
//
// Параметры:
//  ДополнительныеСвойства	 - 	 - 
//  Движения				 - 	 - 
//  Отказ					 - 	 - 
//
Процедура ОтразитьВзаиморасчетыСКонтрагентами(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	мТаблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаВзаиморасчетов;
	
	Если Отказ ИЛИ мТаблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияВыработка = Движения.уатВзаиморасчетыСКонтрагентами;
	ДвиженияВыработка.Записывать = Истина;
	ДвиженияВыработка.Загрузить(мТаблица);

КонецПроцедуры

// Выполняет движения регистра накопления Выработка сотрудников
//
// Параметры:
//  ДополнительныеСвойства	 - 	 - 
//  Движения				 - 	 - 
//  Отказ					 - 	 - 
//
Процедура ОтразитьПричиныСписанияАгрегатов(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	мТаблица = ДополнительныеСвойства.ТаблицыДляДвижений.ПричиныСписанияАгрегатов;
	
	Если Отказ ИЛИ мТаблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияВыработка = Движения.уатСписаниеАгрегатов;
	ДвиженияВыработка.Записывать = Истина;
	ДвиженияВыработка.Загрузить(мТаблица);

КонецПроцедуры

// Выполняет движения регистра накопления Списание номенклатуры
//
// Параметры:
//  ДополнительныеСвойства	 - 	 - 
//  Движения				 - 	 - 
//  Отказ					 - 	 - 
//
Процедура ОтразитьПричиныСписанияНоменклатуры(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	мТаблица = ДополнительныеСвойства.ТаблицыДляДвижений.ПричиныСписанияНоменклатуры;
	
	Если Отказ ИЛИ мТаблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияВыработка = Движения.уатСписаниеНоменклатуры;
	ДвиженияВыработка.Записывать = Истина;
	ДвиженияВыработка.Загрузить(мТаблица);

КонецПроцедуры

// Выполняет движения регистра накопления Заявки на расходование ДС
//
// Параметры:
//  ДополнительныеСвойства	 - 	 - 
//  Движения				 - 	 - 
//  Отказ					 - 	 - 
//
Процедура ОтразитьЗаявкиНаРасходованиеДС(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	мТаблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗаявокНаРасходованиеДС;
	
	Если Отказ ИЛИ мТаблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияВыработка = Движения.уатЗаявкиНаРасходованиеДС;
	ДвиженияВыработка.Записывать = Истина;
	ДвиженияВыработка.Загрузить(мТаблица);

КонецПроцедуры

// Выполняет движения регистра сведений План работы ТС
//
// Параметры:
//  ДополнительныеСвойства	 - 	 - 
//  Движения				 - 	 - 
//  Отказ					 - 	 - 
//
Процедура ОтразитьПланРаботыТС(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаПланаРаботыТС = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПланаРаботыТС;
	
	Если Отказ ИЛИ ТаблицаПланаРаботыТС.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияОборотыПоЗаправкамГСМ = Движения.уатПланРаботыТС;
	ДвиженияОборотыПоЗаправкамГСМ.Записывать = Истина;
	ДвиженияОборотыПоЗаправкамГСМ.Загрузить(ТаблицаПланаРаботыТС);

КонецПроцедуры

// Выполняет движения регистра накопления Факт работы ТС
//
// Параметры:
//  ДополнительныеСвойства	 - 	 - 
//  Движения				 - 	 - 
//  Отказ					 - 	 - 
//
Процедура ОтразитьФактРаботыТС(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаФактаРаботыТС = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаФактаРаботыТС;
	
	Если Отказ ИЛИ ТаблицаФактаРаботыТС.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияОборотыПоЗаправкамГСМ = Движения.уатФактРаботыТС;
	ДвиженияОборотыПоЗаправкамГСМ.Записывать = Истина;
	ДвиженияОборотыПоЗаправкамГСМ.Загрузить(ТаблицаФактаРаботыТС);

КонецПроцедуры

// Выполняет движения регистра накопления Сводные параметры выработки
//
// Параметры:
//  ДополнительныеСвойства	 - 	 - 
//  Движения				 - 	 - 
//  Отказ					 - 	 - 
//
Процедура ОтразитьСводныеПараметрыВыработки(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаСводныеПараметрыВыработки = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаСводныеПараметрыВыработки;
	
	Если Отказ ИЛИ ТаблицаСводныеПараметрыВыработки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияОборотыПоЗаправкамГСМ = Движения.уатСводныеПараметрыВыработки;
	ДвиженияОборотыПоЗаправкамГСМ.Записывать = Истина;
	ДвиженияОборотыПоЗаправкамГСМ.Загрузить(ТаблицаСводныеПараметрыВыработки);

КонецПроцедуры

// Выполняет движения регистра накопления Выручка
//
// Параметры:
//  ДополнительныеСвойства	 - 	 - 
//  Движения				 - 	 - 
//  Отказ					 - 	 - 
//
Процедура ОтразитьВыручку(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	мТаблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаВыручка;
	
	Если Отказ ИЛИ мТаблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияВыработка = Движения.уатВыручка;
	ДвиженияВыработка.Записывать = Истина;
	ДвиженияВыработка.Загрузить(мТаблица);

КонецПроцедуры

// Выполняет движения регистра накопления Билеты на складах
//
// Параметры:
//  ДополнительныеСвойства	 - 	 - 
//  Движения				 - 	 - 
//  Отказ					 - 	 - 
//
Процедура ОтразитьБилетыНаСкладах(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	мТаблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаБилетыНаСкладах;
	
	Если Отказ ИЛИ мТаблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияВыработка = Движения.уатБилетыНаСкладах;
	ДвиженияВыработка.Записывать = Истина;
	ДвиженияВыработка.Загрузить(мТаблица);

КонецПроцедуры

// Выполняет движения регистра накопления выработка агрегатов
//
// Параметры:
//  ДополнительныеСвойства	 - 	 - 
//  Движения				 - 	 - 
//  Отказ					 - 	 - 
//
Процедура ОтразитьВыработкуАгрегатов(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаВыработкиАгрегатов = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПараметровВыработкиАгрегатов;
	
	Если Отказ ИЛИ ТаблицаВыработкиАгрегатов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияВыработкиАгрегатов = Движения.уатВыработкаАгрегатов;
	ДвиженияВыработкиАгрегатов.Записывать = Истина;
	ДвиженияВыработкиАгрегатов.Загрузить(ТаблицаВыработкиАгрегатов);

КонецПроцедуры

// Выполняет движения регистра сведений уатГрафикРаботыРесурсов.
//
// Параметры:
//  ДополнительныеСвойства	 - 	 - 
//  Движения				 - 	 - 
//  Отказ					 - 	 - 
//
Процедура ОтразитьПланированиеРемонтов(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаПланированиеРемонтов = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПланированиеРемонтов;
	
	Если Отказ ИЛИ ТаблицаПланированиеРемонтов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияЗапасы = Движения.уатГрафикРаботыРесурсов;
	ДвиженияЗапасы.Записывать = Истина;
	ДвиженияЗапасы.Загрузить(ТаблицаПланированиеРемонтов);
	
КонецПроцедуры

// Выполняет движения регистра накопления уатОстаткиДС.
//
// Параметры:
//  ДополнительныеСвойства	 - 	 - 
//  Движения				 - 	 - 
//  Отказ					 - 	 - 
//
Процедура ОтразитьОстаткиДС(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаДвижения = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаОстаткиДС;
	
	Если Отказ ИЛИ ТаблицаДвижения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияРегистр = Движения.уатОстаткиДС;
	ДвиженияРегистр.Записывать = Истина;
	ДвиженияРегистр.Загрузить(ТаблицаДвижения);
	
КонецПроцедуры

// Выполняет движения регистра накопления уатОстаткиДСУПодотчетныхЛиц.
//
// Параметры:
//  ДополнительныеСвойства	 - 	 - 
//  Движения				 - 	 - 
//  Отказ					 - 	 - 
//
Процедура ОтразитьОстаткиДСУПодотчетныхЛиц(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаДвижения = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаОстаткиДСУПодотчетныхЛиц;
	
	Если Отказ ИЛИ ТаблицаДвижения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияРегистр = Движения.уатОстаткиДСУПодотчетныхЛиц;
	ДвиженияРегистр.Записывать = Истина;
	ДвиженияРегистр.Загрузить(ТаблицаДвижения);
	
КонецПроцедуры

// Выполняет движения регистра накопления уатРасчетыПоДокументам.
//
// Параметры:
//  ДополнительныеСвойства	 - 	 - 
//  Движения				 - 	 - 
//  Отказ					 - 	 - 
//
Процедура ОтразитьРасчетыПоЗаказамНаТС(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаДвижения = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПлатежныйКалендарь;
	
	Если Отказ ИЛИ ТаблицаДвижения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияРегистр = Движения.уатРасчетыПоДокументам;
	ДвиженияРегистр.Записывать = Истина;
	ДвиженияРегистр.Загрузить(ТаблицаДвижения);
	
КонецПроцедуры

// Выполняет движения регистра сведений уатСтатусыСопроводительныхДокументов.
//
// Параметры:
//  ДополнительныеСвойства	 - 	 - 
//  Движения				 - 	 - 
//  Отказ					 - 	 - 
//
Процедура ОтразитьСтатусыСопроводительныхДокументов(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаДвижения = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаСтатусыСопроводительныхДокументов;
	
	Если Отказ ИЛИ ТаблицаДвижения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияРегистр = Движения.уатСтатусыСопроводительныхДокументов;
	ДвиженияРегистр.Записывать = Истина;
	ДвиженияРегистр.Загрузить(ТаблицаДвижения);
	
КонецПроцедуры

// Выполняет движения регистра сведений уатДатыОбработкиДокументов.
//
// Параметры:
//  ДополнительныеСвойства	 - 	 - 
//  Движения				 - 	 - 
//  Отказ					 - 	 - 
//
Процедура ОтразитьДатыОбработкиСопроводительныхДокументов(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаДвижения = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДатыОбработкиДокументов;
	
	Если НЕ Отказ И ТаблицаДвижения.Количество() > 0 Тогда
		ДвиженияРегистр = Движения.уатДатыОбработкиДокументов;
		ДвиженияРегистр.Записывать = Истина;
		ДвиженияРегистр.Загрузить(ТаблицаДвижения);
	КонецЕсли;
	
	// Добавляются движения по другим регистраторам, если СД указан не в текущем документе, но связан с ним
	Если ДополнительныеСвойства.Свойство("ТаблицаДатыОбработкиДокументовДоп") 
		И НЕ Отказ И ДополнительныеСвойства.ТаблицаДатыОбработкиДокументовДоп.Количество() > 0 Тогда
		
		мсвРегистраторы = Новый Массив;
		Для Каждого ТекСтрока Из ДополнительныеСвойства.ТаблицаДатыОбработкиДокументовДоп Цикл
			Если мсвРегистраторы.Найти(ТекСтрока.Регистратор) = Неопределено Тогда
				мсвРегистраторы.Добавить(ТекСтрока.Регистратор);
			КонецЕсли;
		КонецЦикла;
		
		НЗДатыОбработки = РегистрыСведений.уатДатыОбработкиДокументов.СоздатьНаборЗаписей();
		НЗДатыОбработки.Заполнить(Неопределено);
		Для Каждого ТекРегистратор Из мсвРегистраторы Цикл
			НЗДатыОбработки.Отбор.Регистратор.Установить(ТекРегистратор);
			
			Если ТекРегистратор.Проведен Тогда
				НЗДатыОбработки.Прочитать();
				Для Каждого ТекСтрока Из ДополнительныеСвойства.ТаблицаДатыОбработкиДокументовДоп Цикл
					Если ТекСтрока.Регистратор <> ТекРегистратор Тогда
						Продолжить;
					КонецЕсли;
					
					флЕстьЗаписьСД = Ложь;
					Для Каждого ТекЗапись Из НЗДатыОбработки Цикл
						Если ТекЗапись.СопроводительныйДокумент = ТекСтрока.СопроводительныйДокумент Тогда
							флЕстьЗаписьСД = Истина;
							Прервать;
						КонецЕсли;
					КонецЦикла;
					
					Если флЕстьЗаписьСД Тогда
						ЗаписьСД = ТекЗапись;
					Иначе
						ЗаписьСД = НЗДатыОбработки.Добавить();
					КонецЕсли;
					
					ЗаписьСД.Регистратор               = ТекРегистратор;
					ЗаписьСД.СопроводительныйДокумент  = ТекСтрока.СопроводительныйДокумент;
					ЗаписьСД.ПлановаяДатаОбработки     = ТекСтрока.ПлановаяДатаОбработки;
					ЗаписьСД.КоличествоДнейНаОбработку = ТекСтрока.КоличествоДнейНаОбработку;
				КонецЦикла;
			КонецЕсли;
			
			НЗДатыОбработки.Записать();
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Выполняет движения регистра сведений уатВыработкаПоМаршрутнымЛистам_уэ
//
// Параметры:
//  ДополнительныеСвойства	 - 	 - 
//  Движения				 - 	 - 
//  Отказ					 - 	 - 
//
Процедура ОтразитьВыработкуСотрудниковПоМаршрутнымЛистам(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаДвижений = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаВыработкаСотрудниковПоМаршрутнымЛистам;
	
	Если Отказ ИЛИ ТаблицаДвижений.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияСостояние = Движения.уатВыработкаСотрудниковПоМаршрутнымЛистам;
	ДвиженияСостояние.Записывать = Истина;
	ДвиженияСостояние.Загрузить(ТаблицаДвижений);
	
КонецПроцедуры

// Выполняет движения регистра расчета Основные начисления
//
Процедура ОтразитьНачисленияФизическимЛицам(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаНачислений = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаНачисленияФизическимЛицам;
	
	Если Отказ ИЛИ ТаблицаНачислений.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияНачисления = Движения.уатНачисленияФизическимЛицам;
	ДвиженияНачисления.Записывать = Истина;
	ДвиженияНачисления.Загрузить(ТаблицаНачислений);

КонецПроцедуры

// Выполняет движения регистра накопления уатТоварыВЯчейках
//
Процедура ОтразитьТоварыВЯчейках(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаНачислений = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаТоварыВЯчейках;
	
	Если Отказ ИЛИ ТаблицаНачислений.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияНачисления = Движения.уатТоварыВЯчейках;
	ДвиженияНачисления.Записывать = Истина;
	ДвиженияНачисления.Загрузить(ТаблицаНачислений);

КонецПроцедуры

// Выполняет движения регистра сведений уатДатыДвиженияТоваровНаСкладах.
//
// Параметры:
//  ДополнительныеСвойства	 - 	 - 
//  Движения				 - 	 - 
//  Отказ					 - 	 - 
//
Процедура ОтразитьДатыДвиженияТоваровНаСкладах(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаДвижения = Неопределено;
	Если уатОбщегоНазначения.ЭтоВнешнееСоединение() Тогда
		МассивСтрокДвижения = Неопределено;
		СтруктураТаблицыДляДвижений = Новый Структура;
		Если ДополнительныеСвойства.ТаблицыДляДвижений.Свойство("ТаблицаПартии") Тогда
			ТаблицаПартии = уатОбщегоНазначенияСервер.ПреобразоватьТаблицувМассивСтрок(ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПартии);
			Если ТаблицаПартии.Количество() > 0 Тогда
				СтруктураТаблицыДляДвижений.Вставить("ТаблицаПартии", ТаблицаПартии);
			КонецЕсли;
		КонецЕсли;
		Если ДополнительныеСвойства.ТаблицыДляДвижений.Свойство("ТаблицаТоварыВЯчейках") Тогда
			ТаблицаТоварыВЯчейках = уатОбщегоНазначенияСервер.ПреобразоватьТаблицувМассивСтрок(ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаТоварыВЯчейках);
			Если ТаблицаТоварыВЯчейках.Количество() > 0 Тогда
				СтруктураТаблицыДляДвижений.Вставить("ТаблицаТоварыВЯчейках", ТаблицаТоварыВЯчейках);
			КонецЕсли;
		КонецЕсли;
		ДопСвойства = Новый Структура("ТаблицыДляДвижений", СтруктураТаблицыДляДвижений);
		уатЗащищенныеФункцииВызовСервера_проф.ПолучитьДатыДвиженияТоваровНаСкладах(МассивСтрокДвижения, ДопСвойства);
		ТаблицаДвижения = уатОбщегоНазначенияСервер.ПреобразоватьМассивСтрокВТаблицу(МассивСтрокДвижения);
	Иначе
		уатЗащищенныеФункцииСервер_проф.ПолучитьДатыДвиженияТоваровНаСкладах(ТаблицаДвижения, ДополнительныеСвойства);
	КонецЕсли;
	
	Если Отказ ИЛИ ТаблицаДвижения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаДвижения.Колонки.ВидДвижения.Имя = "ВидДвиженияНакопления";
	ТаблицаДвижения.Колонки.Добавить("ВидДвижения", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыДвиженийПриходРасход"));
	Для Каждого ТекСтрока Из ТаблицаДвижения Цикл	
		ТекСтрока.ВидДвижения = ?(ТекСтрока.ВидДвиженияНакопления = ВидДвиженияНакопления.Приход,
			Перечисления.ВидыДвиженийПриходРасход.Приход, Перечисления.ВидыДвиженийПриходРасход.Расход);
	КонецЦикла;
	ТаблицаДвижения.Колонки.Удалить("ВидДвиженияНакопления");
		
	ДвиженияРегистр = Движения.уатДатыДвиженияТоваровНаСкладах;
	ДвиженияРегистр.Записывать = Истина;
	ДвиженияРегистр.Загрузить(ТаблицаДвижения);
	
КонецПроцедуры

// Выполняет движения регистра сведений уатКузовныеЭлементыТС.
//
// Параметры:
//  ДополнительныеСвойства	 - 	 - 
//  Движения				 - 	 - 
//  Отказ					 - 	 - 
//
Процедура ОтразитьКузовныеЭлементыТС(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаДвижения = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаКузовныеЭлементыТС;
	
	Если Отказ ИЛИ ТаблицаДвижения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияРегистр = Движения.уатКузовныеЭлементыТС;
	ДвиженияРегистр.Записывать = Истина;
	ДвиженияРегистр.Загрузить(ТаблицаДвижения);
	
КонецПроцедуры

// Выполняет движения регистра сведений уатКузовныеЭлементыТС.
//
// Параметры:
//  ДополнительныеСвойства	 - 	 - 
//  Движения				 - 	 - 
//  Отказ					 - 	 - 
//
Процедура ОтразитьРезультатыОсмотраАгрегатовИЭлементов(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаДвижения = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаРезультатыОсмотраАгрегатовИЭлементов;
	
	Если Отказ ИЛИ ТаблицаДвижения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияРегистр = Движения.уатРезультатыОсмотраАгрегатовИЭлементов;
	ДвиженияРегистр.Записывать = Истина;
	ДвиженияРегистр.Загрузить(ТаблицаДвижения);
	
КонецПроцедуры

// Выполняет движения регистра накопления уатСпецодеждаИИнструментыСотрудников.
//
// Параметры:
//  ДополнительныеСвойства	 - 	 - 
//  Движения				 - 	 - 
//  Отказ					 - 	 - 
//
Процедура ОтразитьСпецодеждаСотрудников(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаДвижения = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаСпецодеждаСотрудников;
	
	Если Отказ ИЛИ ТаблицаДвижения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияРегистр = Движения.уатСпецодеждаИИнструментыСотрудников;
	ДвиженияРегистр.Записывать = Истина;
	ДвиженияРегистр.Загрузить(ТаблицаДвижения);
	
КонецПроцедуры

// Выполняет движения регистра накопления уатЗаказыПоставщикам
//
// Параметры:
//  ДополнительныеСвойства	 - 	 - 
//  Движения				 - 	 - 
//  Отказ					 - 	 - 
//
Процедура ОтразитьЗаказыПоставщику(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаДвижений = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗаказыПоставщику;
	
	Если Отказ ИЛИ ТаблицаДвижений.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияЗаявки = Движения.уатЗаказыПоставщикам;
	ДвиженияЗаявки.Записывать = Истина;
	ДвиженияЗаявки.Загрузить(ТаблицаДвижений);

КонецПроцедуры

#КонецОбласти

#Область РаспределениеДоходовИРасходов

// Получает таблицу остатков доходов и расходов для распределения по ТС и аналитикам и формирования фин. результата
//
// Параметры:
//  ДокументСсылка				 - 	 - 
//  ИсключатьДвиженияДокумента	 - 	 - если Истина, то движения текущего документа будут исключены из остатков -
//  	это необходимо в случае проведения из формы документа, поскольку в этом случае распределение производится
//  	до начала транзакции проведения и движения текущего документа еще есть в базе
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьТаблицуДоходыРасходы(ДокументСсылка, ИсключатьДвиженияДокумента = Ложь) Экспорт
	
	ЗапросОстатки = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатДоходыОстатки.СтатьяДоходов КАК Статья,
	|	уатДоходыОстатки.Организация КАК Организация,
	|	уатДоходыОстатки.Подразделение КАК Подразделение,
	|	уатДоходыОстатки.Колонна КАК Колонна,
	|	уатДоходыОстатки.ТС КАК ТС,
	|	уатДоходыОстатки.Заказ КАК Заказ,
	|	уатДоходыОстатки.Менеджер КАК Менеджер,
	|	уатДоходыОстатки.Контрагент КАК Контрагент,
	|	уатДоходыОстатки.Маршрут КАК Маршрут,
	|	уатДоходыОстатки.ОбъектСтроительства КАК ОбъектСтроительства,
	|	уатДоходыОстатки.ВидПеревозки КАК ВидПеревозки,
	|	уатДоходыОстатки.НаправлениеПеревозки КАК НаправлениеПеревозки,
	|	уатДоходыОстатки.СуммаУпрОстаток КАК СуммаУпр,
	|	уатДоходыОстатки.СуммаРеглОстаток КАК СуммаРегл,
	|	уатДоходыОстатки.СуммаНДСОстаток КАК СуммаНДС,
	|	уатДоходыОстатки.СуммаНДСУпрОстаток КАК СуммаНДСУпр,
	|	ИСТИНА КАК ЭтоДоходы
	|ИЗ
	|	РегистрНакопления.уатДоходы.Остатки(&ДатаКон, Организация = &Организация) КАК уатДоходыОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	уатРасходыОстатки.СтатьяРасходов,
	|	уатРасходыОстатки.Организация,
	|	уатРасходыОстатки.Подразделение,
	|	уатРасходыОстатки.Колонна,
	|	уатРасходыОстатки.ТС,
	|	уатРасходыОстатки.Заказ,
	|	уатРасходыОстатки.Менеджер,
	|	уатРасходыОстатки.Контрагент,
	|	уатРасходыОстатки.Маршрут,
	|	уатРасходыОстатки.ОбъектСтроительства,
	|	уатРасходыОстатки.ВидПеревозки,
	|	уатРасходыОстатки.НаправлениеПеревозки,
	|	уатРасходыОстатки.СуммаУпрОстаток,
	|	уатРасходыОстатки.СуммаРеглОстаток,
	|	уатРасходыОстатки.СуммаНДСОстаток,
	|	уатРасходыОстатки.СуммаНДСУпрОстаток,
	|	ЛОЖЬ
	|ИЗ
	|	РегистрНакопления.уатРасходы.Остатки(
	|			&ДатаКон,
	|			Организация = &Организация
	|				И (СтатьяРасходов = ЗНАЧЕНИЕ(Справочник.уатСтатьиРасходов.ПустаяСсылка)
	|					ИЛИ НЕ СтатьяРасходов.РаспределятьНаРБП)) КАК уатРасходыОстатки");
	
	Если ИсключатьДвиженияДокумента Тогда
		ЗапросОстатки.Текст = СтрЗаменить(ЗапросОстатки.Текст, "РАЗРЕШЕННЫЕ", "");
		
		ЗапросОстатки.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	тбл.Статья,
		|	тбл.Организация,
		|	тбл.Подразделение,
		|	тбл.Колонна,
		|	тбл.ТС,
		|	тбл.Заказ,
		|	тбл.Менеджер,
		|	тбл.Контрагент,
		|	тбл.Маршрут,
		|	тбл.ОбъектСтроительства,
		|	тбл.ВидПеревозки,
		|	тбл.НаправлениеПеревозки,
		|	СУММА(тбл.СуммаУпр) КАК СуммаУпр,
		|	СУММА(тбл.СуммаРегл) КАК СуммаРегл,
		|	СУММА(тбл.СуммаНДС) КАК СуммаНДС,
		|	СУММА(тбл.СуммаНДСУпр) КАК СуммаНДСУпр,
		|	тбл.ЭтоДоходы
		|ИЗ
		|("
		+ ЗапросОстатки.Текст +
		"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|" + 
		"
		|ВЫБРАТЬ
		|	уатДоходыДвижения.СтатьяДоходов,
		|	уатДоходыДвижения.Организация,
		|	уатДоходыДвижения.Подразделение,
		|	уатДоходыДвижения.Колонна,
		|	уатДоходыДвижения.ТС,
		|	уатДоходыДвижения.Заказ,
		|	уатДоходыДвижения.Менеджер,
		|	уатДоходыДвижения.Контрагент,
		|	уатДоходыДвижения.Маршрут,
		|	уатДоходыДвижения.ОбъектСтроительства,
		|	уатДоходыДвижения.ВидПеревозки,
		|	уатДоходыДвижения.НаправлениеПеревозки,
		|	уатДоходыДвижения.СуммаУпрРасход,
		|	уатДоходыДвижения.СуммаРеглРасход,
		|	уатДоходыДвижения.СуммаНДСРасход,
		|	уатДоходыДвижения.СуммаНДСУпрРасход,
		|	ИСТИНА
		|ИЗ
		|	РегистрНакопления.уатДоходы.Обороты(,, Регистратор) КАК уатДоходыДвижения
		|ГДЕ
		|	уатДоходыДвижения.Регистратор = &ДокСсылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	уатРасходыДвижения.СтатьяРасходов,
		|	уатРасходыДвижения.Организация,
		|	уатРасходыДвижения.Подразделение,
		|	уатРасходыДвижения.Колонна,
		|	уатРасходыДвижения.ТС,
		|	уатРасходыДвижения.Заказ,
		|	уатРасходыДвижения.Менеджер,
		|	уатРасходыДвижения.Контрагент,
		|	уатРасходыДвижения.Маршрут,
		|	уатРасходыДвижения.ОбъектСтроительства,
		|	уатРасходыДвижения.ВидПеревозки,
		|	уатРасходыДвижения.НаправлениеПеревозки,
		|	уатРасходыДвижения.СуммаУпрРасход,
		|	уатРасходыДвижения.СуммаРеглРасход,
		|	уатРасходыДвижения.СуммаНДСРасход,
		|	уатРасходыДвижения.СуммаНДСУпрРасход,
		|	ЛОЖЬ
		|ИЗ
		|	РегистрНакопления.уатРасходы.Обороты(,, Регистратор) КАК уатРасходыДвижения
		|ГДЕ
		|	уатРасходыДвижения.Регистратор = &ДокСсылка"
		+ ") КАК тбл
		|
		|СГРУППИРОВАТЬ ПО
		|	тбл.Статья,
		|	тбл.Организация,
		|	тбл.Подразделение,
		|	тбл.Колонна,
		|	тбл.ТС,
		|	тбл.Заказ,
		|	тбл.Менеджер,
		|	тбл.Контрагент,
		|	тбл.Маршрут,
		|	тбл.ОбъектСтроительства,
		|	тбл.ВидПеревозки,
		|	тбл.НаправлениеПеревозки,
		|	тбл.ЭтоДоходы";
		ЗапросОстатки.УстановитьПараметр("ДокСсылка", ДокументСсылка.Ссылка);
	КонецЕсли;
	
	ЗапросОстатки.УстановитьПараметр("ДатаКон", Новый Граница(КонецМесяца(ДокументСсылка.Дата), ВидГраницы.Включая));
	ЗапросОстатки.УстановитьПараметр("Организация", ДокументСсылка.Организация);
	
	ТаблицаИсходная = ЗапросОстатки.Выполнить().Выгрузить();
	
	Возврат ТаблицаИсходная;
КонецФункции

#КонецОбласти

#Область ПлатежныйКалендарь

// Процедура выполняет установку даты платежа по заказам при использовании отсрочки платежей
//
// Параметры:
//  Источник - 	 - 
//
Процедура УстановитьДатуПлатежа(Источник) Экспорт
	
	Если НЕ ПолучитьФункциональнуюОпцию("уатИспользоватьПлатежныйКалендарь") Тогда
		Возврат;
	КонецЕсли;
		
	УстановитьПривилегированныйРежим(Истина);
	
	флМноговалютныйУчет = ПолучитьФункциональнуюОпцию("уатМноговалютныйУчет");
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ВалютаУпрУчета",    Константы.ВалютаУправленческогоУчета.Получить());
	ДопПараметры.Вставить("МноговалютныйУчет", флМноговалютныйУчет);
	
	мсвЗаказы = Новый Массив;
	мсвДоговоры = Новый Массив;
	тблЗаказыДоговоры = Новый ТаблицаЗначений;
	тблЗаказыДоговоры.Колонки.Добавить("ЗаказНаТС");
	тблЗаказыДоговоры.Колонки.Добавить("Договор");
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.уатЗаказГрузоотправителя") Тогда
		мсвЗаказы.Добавить(Источник.Ссылка);
		мсвДоговоры.Добавить(Источник.ДоговорКонтрагента);
		НоваяСтрока = тблЗаказыДоговоры.Добавить();
		НоваяСтрока.ЗаказНаТС = Источник.Ссылка;
		НоваяСтрока.Договор   = Источник.ДоговорКонтрагента;
			
		Для Каждого ТекРасход Из Источник.Расходы Цикл
			мсвДоговоры.Добавить(ТекРасход.Договор);
			НоваяСтрока = тблЗаказыДоговоры.Добавить();
			НоваяСтрока.ЗаказНаТС = Источник.Ссылка;
			НоваяСтрока.Договор   = ТекРасход.Договор;
		КонецЦикла;
		
		// добавляем данные других документов, в которых есть услуги по этому заказу
		мЗапросСвязанныеУслуги = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	уатПредоставленныеУслугиОбороты.ЗаказНаТС,
		|	уатПредоставленныеУслугиОбороты.ДоговорКонтрагента КАК Договор
		|ИЗ
		|	РегистрНакопления.уатПредоставленныеУслуги.Обороты(
		|			,
		|			,
		|			Регистратор,
		|			ЗаказНаТС = &ЗаказНаТС
		|				И (ДоговорКонтрагента.ВедениеВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказамНаТС)
		|				ИЛИ ДоговорКонтрагента.ВедениеВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам))) КАК уатПредоставленныеУслугиОбороты
		|ГДЕ
		|	уатПредоставленныеУслугиОбороты.Регистратор <> &ЗаказНаТС");
		мЗапросСвязанныеУслуги.УстановитьПараметр("ЗаказНаТС", Источник.Ссылка);
		ВыборкаСвязанныеУслуги = мЗапросСвязанныеУслуги.Выполнить().Выбрать();
		Пока ВыборкаСвязанныеУслуги.Следующий() Цикл
			мсвДоговоры.Добавить(ВыборкаСвязанныеУслуги.Договор);
			НоваяСтрока = тблЗаказыДоговоры.Добавить();
			НоваяСтрока.ЗаказНаТС = Источник.Ссылка;
			НоваяСтрока.Договор   = ВыборкаСвязанныеУслуги.Договор;
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.уатПоступлениеТоваровУслуг") Тогда
		мсвДоговоры.Добавить(Источник.ДоговорКонтрагента);
		Для Каждого ТекСтрока Из Источник.Услуги Цикл
			Если мсвЗаказы.Найти(ТекСтрока.ЗаказНаТС) = Неопределено Тогда
				мсвЗаказы.Добавить(ТекСтрока.ЗаказНаТС);
				НоваяСтрока = тблЗаказыДоговоры.Добавить();
				НоваяСтрока.ЗаказНаТС = ТекСтрока.ЗаказНаТС;
				НоваяСтрока.Договор   = Источник.ДоговорКонтрагента;
			КонецЕсли;
		КонецЦикла;
		НоваяСтрока = тблЗаказыДоговоры.Добавить();
		НоваяСтрока.ЗаказНаТС = Документы.уатЗаказГрузоотправителя.ПустаяСсылка();
		НоваяСтрока.Договор   = Источник.ДоговорКонтрагента;
		
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.уатРеализацияУслуг") Тогда
		мсвДоговоры.Добавить(Источник.ДоговорКонтрагента);
		Для Каждого ТекСтрока Из Источник.Услуги Цикл
			Если мсвЗаказы.Найти(ТекСтрока.Заказ) = Неопределено Тогда
				мсвЗаказы.Добавить(ТекСтрока.Заказ);
				НоваяСтрока = тблЗаказыДоговоры.Добавить();
				НоваяСтрока.ЗаказНаТС = ТекСтрока.Заказ;
				НоваяСтрока.Договор   = Источник.ДоговорКонтрагента;
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.уатМаршрутныйЛист") Тогда
		Для Каждого ТекСтрока Из Источник.Заказы Цикл
			Если мсвЗаказы.Найти(ТекСтрока.ЗаказГрузоотправителя) = Неопределено Тогда
				мсвЗаказы.Добавить(ТекСтрока.ЗаказГрузоотправителя);
				мсвДоговоры.Добавить(ТекСтрока.ЗаказГрузоотправителя.ДоговорКонтрагента);
				НоваяСтрока = тблЗаказыДоговоры.Добавить();
				НоваяСтрока.ЗаказНаТС = ТекСтрока.ЗаказГрузоотправителя;
				НоваяСтрока.Договор   = ТекСтрока.ЗаказГрузоотправителя.ДоговорКонтрагента;
			КонецЕсли;
		КонецЦикла;
		Для Каждого ТекРасход Из Источник.Расходы Цикл
			Если мсвДоговоры.Найти(ТекРасход.Договор) = Неопределено Тогда
				мсвДоговоры.Добавить(ТекРасход.Договор);
				НоваяСтрока = тблЗаказыДоговоры.Добавить();
				НоваяСтрока.ЗаказНаТС = ТекРасход.ЗаказНаТС;
				НоваяСтрока.Договор   = ТекРасход.Договор;
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.уатРемонтныйЛист") Тогда
		//мсвЗаказы.Добавить(Документы.уатЗаказГрузоотправителя.ПустаяСсылка());
		мсвДоговоры.Добавить(Источник.ДоговорКонтрагента);
		НоваяСтрока = тблЗаказыДоговоры.Добавить();
		НоваяСтрока.ЗаказНаТС = Документы.уатЗаказГрузоотправителя.ПустаяСсылка();
		НоваяСтрока.Договор   = Источник.ДоговорКонтрагента;
		
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.уатВзаимозачет") Тогда
		Для Каждого ТекСтрока Из Источник.Состав Цикл
			// дебитор
			Если мсвДоговоры.Найти(ТекСтрока.ДоговорДебитора) = Неопределено Тогда
				мсвДоговоры.Добавить(ТекСтрока.ДоговорДебитора);
			КонецЕсли;
			НоваяСтрока = тблЗаказыДоговоры.Добавить();
			НоваяСтрока.Договор   = ТекСтрока.ДоговорДебитора;
			Если ТипЗнч(ТекСтрока.СделкаДебитора) = Тип("ДокументСсылка.уатЗаказГрузоотправителя") Тогда
				НоваяСтрока.ЗаказНаТС = ТекСтрока.СделкаДебитора;
			Иначе
				НоваяСтрока.ЗаказНаТС = Документы.уатЗаказГрузоотправителя.ПустаяСсылка();
			КонецЕсли;
			Если мсвЗаказы.Найти(НоваяСтрока.ЗаказНаТС) = Неопределено Тогда
				мсвЗаказы.Добавить(НоваяСтрока.ЗаказНаТС);
			КонецЕсли;
			// кредитор
			Если мсвДоговоры.Найти(ТекСтрока.ДоговорКредитора) = Неопределено Тогда
				мсвДоговоры.Добавить(ТекСтрока.ДоговорКредитора);
			КонецЕсли;
			НоваяСтрока = тблЗаказыДоговоры.Добавить();
			НоваяСтрока.Договор   = ТекСтрока.ДоговорКредитора;
			Если ТипЗнч(ТекСтрока.СделкаКредитора) = Тип("ДокументСсылка.уатЗаказГрузоотправителя") Тогда
				НоваяСтрока.ЗаказНаТС = ТекСтрока.СделкаКредитора;
			Иначе
				НоваяСтрока.ЗаказНаТС = Документы.уатЗаказГрузоотправителя.ПустаяСсылка();
			КонецЕсли;
			Если мсвЗаказы.Найти(НоваяСтрока.ЗаказНаТС) = Неопределено Тогда
				мсвЗаказы.Добавить(НоваяСтрока.ЗаказНаТС);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	тблЗаказыДоговоры.Свернуть("ЗаказНаТС, Договор");
	
	// проверяем необходимые условия для выполнения установки даты платежа
	флОК = Ложь;
	Для Каждого ТекДоговор Из мсвДоговоры Цикл
		Если (ТекДоговор.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказамНаТС
			ИЛИ ТекДоговор.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоНакладным
			ИЛИ ТекДоговор.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам) Тогда
			
			флОК = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если НЕ флОК Тогда
		Возврат;
	КонецЕсли;
	
	// получаем движения по Платежному календарю, по входящим Заказам на ТС
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	МИНИМУМ(уатРасчетыПоДокументам.Регистратор) КАК Регистратор,
	|	уатРасчетыПоДокументам.Контрагент КАК Контрагент,
	|	уатРасчетыПоДокументам.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	уатРасчетыПоДокументам.ЗаказНаТС КАК ЗаказНаТС,
	|	уатРасчетыПоДокументам.ПолучательУслуг КАК ПолучательУслуг,
	|	уатРасчетыПоДокументам.Валюта КАК Валюта,
	|	уатРасчетыПоДокументам.Сделка КАК Сделка,
	|	уатРасчетыПоДокументам.ЭтапОплаты КАК ЭтапОплаты,
	|	СУММА(уатРасчетыПоДокументам.СуммаПриход) КАК СуммаПриход,
	|	СУММА(уатРасчетыПоДокументам.СуммаПриходУпр) КАК СуммаПриходУпр
	|ИЗ
	|	РегистрНакопления.уатРасчетыПоДокументам КАК уатРасчетыПоДокументам
	|ГДЕ
	|	уатРасчетыПоДокументам.ЗаказНаТС В(&мсвЗаказы)
	|	И (уатРасчетыПоДокументам.Регистратор ССЫЛКА Документ.уатРеализацияУслуг
	|			ИЛИ уатРасчетыПоДокументам.Регистратор ССЫЛКА Документ.уатПоступлениеТоваровУслуг
	|			ИЛИ уатРасчетыПоДокументам.Регистратор ССЫЛКА Документ.уатЗаказГрузоотправителя
	|			ИЛИ уатРасчетыПоДокументам.Регистратор ССЫЛКА Документ.уатРемонтныйЛист
	|			ИЛИ уатРасчетыПоДокументам.Регистратор ССЫЛКА Документ.уатВзаимозачет)
	|			ИЛИ уатРасчетыПоДокументам.ЗаказНаТС = ЗНАЧЕНИЕ(Документ.уатЗаказГрузоотправителя.ПустаяСсылка)
	|				И уатРасчетыПоДокументам.Регистратор = &Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	уатРасчетыПоДокументам.ЭтапОплаты,
	|	уатРасчетыПоДокументам.Сделка,
	|	уатРасчетыПоДокументам.Валюта,
	|	уатРасчетыПоДокументам.ПолучательУслуг,
	|	уатРасчетыПоДокументам.Контрагент,
	|	уатРасчетыПоДокументам.ЗаказНаТС,
	|	уатРасчетыПоДокументам.ДоговорКонтрагента");
	Запрос.УстановитьПараметр("мсвЗаказы", мсвЗаказы);
	Запрос.УстановитьПараметр("Регистратор", Источник.Ссылка);
	тблДвиженияПоПлатежномуКалендарю = Запрос.Выполнить().Выгрузить();
	
	// получаем накладные с ручными датами платежей из Платежного календара
	тблРучныеДатыПлатежейПоЗаказуДоговору = ПолучитьРучныеДатыПлатежейПоЗаказам(мсвЗаказы);
	
	мсвСообщенияОбОшибках = Новый Массив;
	
	// удаление старых записей
	Для Каждого ТекЗаказДоговор Из тблЗаказыДоговоры Цикл
		// Движения накладной по РН "Платежный календарь" используются для получения дат платежей
		мсвДвиженияПоЗаказуДоговору = тблДвиженияПоПлатежномуКалендарю.НайтиСтроки(
			Новый Структура("ЗаказНаТС, ДоговорКонтрагента", ТекЗаказДоговор.ЗаказНаТС, ТекЗаказДоговор.Договор));
		
		Если мсвДвиженияПоЗаказуДоговору.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;

		УдалитьЗаписиДатыПлатежей(мсвДвиженияПоЗаказуДоговору, ТекЗаказДоговор.ЗаказНаТС);
	КонецЦикла;
	
	// добавление новых записей
	Для Каждого ТекЗаказДоговор Из тблЗаказыДоговоры Цикл
		// Движения накладной по РН "Платежный календарь" используются для получения дат платежей
		мсвДвиженияПоЗаказуДоговору = тблДвиженияПоПлатежномуКалендарю.НайтиСтроки(
			Новый Структура("ЗаказНаТС, ДоговорКонтрагента", ТекЗаказДоговор.ЗаказНаТС, ТекЗаказДоговор.Договор));
		
		Если мсвДвиженияПоЗаказуДоговору.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;

		Для Каждого ТекСтрока Из мсвДвиженияПоЗаказуДоговору Цикл
			// Если в одной из накладных дата платежа указана вручную, то считаем её датой платежа для всех накладных по этому заказу и договору
			// Но если указан этап и в графике оплаты несколько этапов, то ручную дату ищем также по каждому этапу
			ДатаПлатежаРучная = Неопределено;
			СтруктураПоискаДатыПлатежа = Новый Структура("ЗаказНаТС, ДоговорКонтрагента", ТекЗаказДоговор.ЗаказНаТС, ТекЗаказДоговор.Договор);
			Если ЗначениеЗаполнено(ТекСтрока.ЭтапОплаты) И ТекЗаказДоговор.Договор.ГрафикОплаты.Количество() > 1 Тогда
				СтруктураПоискаДатыПлатежа.Вставить("ЭтапОплаты", ТекСтрока.ЭтапОплаты);
			КонецЕсли;
			мсвНакладныеПоЗаказуДоговору = тблРучныеДатыПлатежейПоЗаказуДоговору.НайтиСтроки(СтруктураПоискаДатыПлатежа);
			// Для Взаимозачета, если не найдены ручные даты по договору кредитора, то ищем по договору дебитора
			// Это полезно для расчетов по заказам, когда в сделке кредитора указана сделка дебитора
			Если ТипЗнч(Источник) = Тип("ДокументОбъект.уатВзаимозачет") И мсвНакладныеПоЗаказуДоговору.Количество() = 0 Тогда
				СтрокаПоиск = Источник.Состав.Найти(ТекЗаказДоговор.Договор, "ДоговорКредитора");
				Если СтрокаПоиск <> Неопределено Тогда
					СтруктураПоискаДатыПлатежа.ДоговорКонтрагента = СтрокаПоиск.ДоговорДебитора;
					мсвНакладныеПоЗаказуДоговору = тблРучныеДатыПлатежейПоЗаказуДоговору.НайтиСтроки(СтруктураПоискаДатыПлатежа);
				КонецЕсли;
			КонецЕсли;
			Для Каждого ТекСтрокаНакладная Из мсвНакладныеПоЗаказуДоговору Цикл
				Если ЗначениеЗаполнено(ТекСтрокаНакладная.ДатаПлатежа) Тогда
					ДатаПлатежаРучная = ТекСтрокаНакладная.ДатаПлатежа;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			ПараметрыПлатежа = ПолучитьДатуСрокПлатежаПоЗаказу(ТекСтрока, ДатаПлатежаРучная, мсвСообщенияОбОшибках);
			ДобавитьЗаписиДатыПлатежей(ТекСтрока, ПараметрыПлатежа);
		КонецЦикла;
	КонецЦикла;
	
	Для Каждого ТекОшибка Из мсвСообщенияОбОшибках Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекОшибка);
	КонецЦикла;
				
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Процедура распределяет таблицу платежного календаря для записи в РН по этапам графика оплаты Договора
//  При распределении учитываются уже выставленные ранее платежи (по другим накладным)
//  Лишняя сумма платежей не будет записана в РН "Платежный календарь", но в другие регистры (Взаиморасчеты) попадает
//
// Параметры:
//  ТаблицаПлатежныйКалендарь - ТаблицаЗначений с колонками, повторяющими структуру РН "Платежный календарь"
//  ДокументСсылка            - ссылка на документ, двигающий Платежный календарь
//
Процедура РаспределитьПлатежныйКалендарьПоГрафикуОплаты(ТаблицаПлатежныйКалендарь, ДокументСсылка, ДопСвойства = Неопределено) Экспорт
	
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.уатРеализацияУслуг")
		ИЛИ ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.уатПоступлениеТоваровУслуг")
		ИЛИ ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.уатРемонтныйЛист")
		ИЛИ ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.уатЗаказГрузоотправителя")
		ИЛИ ТипЗнч(ДопСвойства) = Тип("Структура") И ДопСвойства.Свойство("Приход") Тогда
		
		Если НЕ ПолучитьФункциональнуюОпцию("уатИспользоватьПлатежныйКалендарь") Тогда
			Возврат;
		КонецЕсли;
		
		// для корректной работы алгоритма по РЛ добавляется фиктивная колонка ЗаказНаТС
		Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.уатРемонтныйЛист") Тогда
			ТаблицаПлатежныйКалендарь.Колонки.Добавить("ЗаказНаТС");
		КонецЕсли;
	
		флЕстьКолонкаЭтапОплаты = (ТаблицаПлатежныйКалендарь.Колонки.Найти("ЭтапОплаты") <> Неопределено);
		
		ТаблицаПлатежныйКалендарьРез = ТаблицаПлатежныйКалендарь.СкопироватьКолонки();
		Если НЕ флЕстьКолонкаЭтапОплаты Тогда
			ТаблицаПлатежныйКалендарьРез.Колонки.Добавить("ЭтапОплаты");
		КонецЕсли;
			
		// Строки с заполненным ЭтапомОплаты не нужно распределять, перекидываем их сразу в таблицу результата
		Если флЕстьКолонкаЭтапОплаты Тогда
			мсвСтрокиПКУдалить = Новый Массив;
			Для Каждого ТекСтрокаПК Из ТаблицаПлатежныйКалендарь Цикл
				Если ЗначениеЗаполнено(ТекСтрокаПК.ЭтапОплаты) Тогда
					НоваяСтрока = ТаблицаПлатежныйКалендарьРез.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаПК);
					мсвСтрокиПКУдалить.Добавить(ТекСтрокаПК);
				КонецЕсли;
			КонецЦикла;
			Для Каждого ТекСтрокаПКУдалить Из мсвСтрокиПКУдалить Цикл
				ТаблицаПлатежныйКалендарь.Удалить(ТекСтрокаПКУдалить);
			КонецЦикла;
		КонецЕсли;
				
		ЗапросПлатежиПоЗаказам = Новый Запрос(
		"ВЫБРАТЬ
		|	ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ВЫБОР
		|		КОГДА уатРасчетыПоДокументамОбороты.ЗаказНаТС = ЗНАЧЕНИЕ(Документ.уатЗаказГрузоотправителя.ПустаяСсылка)
		|			ТОГДА уатРасчетыПоДокументамОбороты.Сделка
		|		ИНАЧЕ уатРасчетыПоДокументамОбороты.ЗаказНаТС
		|	КОНЕЦ КАК ОбъектОплаты,
		|	СУММА(уатРасчетыПоДокументамОбороты.СуммаПриходУпрОборот) КАК СуммаПриходУпр
		|ИЗ
		|	РегистрНакопления.уатРасчетыПоДокументам.Обороты(
		|			,
		|			&МоментДокумента,
		|			,
		|				ВЫБОР
		|					КОГДА ЗаказНаТС = ЗНАЧЕНИЕ(Документ.уатЗаказГрузоотправителя.ПустаяСсылка)
		|						ТОГДА Сделка
		|					ИНАЧЕ ЗаказНаТС
		|				КОНЕЦ В (&мсвОбъектыОплаты)) КАК уатРасчетыПоДокументамОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	ДоговорКонтрагента,
		|	ВЫБОР
		|		КОГДА уатРасчетыПоДокументамОбороты.ЗаказНаТС = ЗНАЧЕНИЕ(Документ.уатЗаказГрузоотправителя.ПустаяСсылка)
		|			ТОГДА уатРасчетыПоДокументамОбороты.Сделка
		|		ИНАЧЕ уатРасчетыПоДокументамОбороты.ЗаказНаТС
		|	КОНЕЦ");
		ЗапросПлатежиПоЗаказам.УстановитьПараметр("МоментДокумента", ДокументСсылка.МоментВремени());
		ЗапросПлатежиПоЗаказам.УстановитьПараметр("мсвОбъектыОплаты", ТаблицаПлатежныйКалендарь.ВыгрузитьКолонку("ОбъектОплаты"));
		тблДолгПоОбъектамОплаты = ЗапросПлатежиПоЗаказам.Выполнить().Выгрузить();
		
		Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.уатПоступлениеТоваровУслуг") 
			ИЛИ	ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.уатРеализацияУслуг")
			ИЛИ	ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.уатВзаимозачет")
			Тогда
			ЗапросУслугиПоЗаказам = Новый Запрос(
			"ВЫБРАТЬ
			|	уатПредоставленныеУслугиОбороты.ЗаказНаТС КАК ЗаказНаТС,
			|	уатПредоставленныеУслугиОбороты.ДоговорКонтрагента КАК ДоговорКонтрагента,
			|	уатПредоставленныеУслугиОбороты.Валюта КАК Валюта,
			|	СУММА(уатПредоставленныеУслугиОбороты.СуммаОборот) КАК Сумма,
			|	СУММА(уатПредоставленныеУслугиОбороты.СуммаРеглОборот) КАК СуммаРегл
			|ИЗ
			|	РегистрНакопления.уатПредоставленныеУслуги.Обороты(
			|			,
			|			&МоментДокумента,
			|			,
			|			ЗаказНаТС В (&мсвЗаказы)) КАК уатПредоставленныеУслугиОбороты
			|
			|СГРУППИРОВАТЬ ПО
			|	уатПредоставленныеУслугиОбороты.ДоговорКонтрагента,
			|	уатПредоставленныеУслугиОбороты.ЗаказНаТС,
			|	уатПредоставленныеУслугиОбороты.Валюта");
			ЗапросУслугиПоЗаказам.УстановитьПараметр("МоментДокумента", ДокументСсылка.МоментВремени());
			ЗапросУслугиПоЗаказам.УстановитьПараметр("мсвЗаказы", ТаблицаПлатежныйКалендарь.ВыгрузитьКолонку("ЗаказНаТС"));
			тблУслугиПоЗаказам = ЗапросУслугиПоЗаказам.Выполнить().Выгрузить();
		ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.уатЗаказГрузоотправителя") Тогда
			тблУслугиПоЗаказам = ДопСвойства.ТаблицыДляДвижений.ТаблицаПредоставленныхУслуг.Скопировать();
			тблУслугиПоЗаказам.Свернуть("ЗаказНаТС, ДоговорКонтрагента, Валюта", "Сумма, СуммаРегл");
		КонецЕсли;
		
		ВалютаУпр  = Константы.ВалютаУправленческогоУчета.Получить();
		ВалютаРегл = уатОбщегоНазначенияТиповые.ВалютаРегламентированногоУчета(ДокументСсылка.Организация);
		
		тблОбъектыОплатыИДоговоры = ТаблицаПлатежныйКалендарь.Скопировать();
		тблОбъектыОплатыИДоговоры.Свернуть("ОбъектОплаты, ДоговорКонтрагента");
		Для Каждого ТекОбъектОплатыДоговор Из тблОбъектыОплатыИДоговоры Цикл
			мсвСтрокиПКПоОбъектуОплатыИДоговору = ТаблицаПлатежныйКалендарь.НайтиСтроки(
				Новый Структура("ДоговорКонтрагента, ОбъектОплаты",
				ТекОбъектОплатыДоговор.ДоговорКонтрагента, ТекОбъектОплатыДоговор.ОбъектОплаты));
				
			// Расчет общей суммы услуг по объекту оплаты.
			СуммаУслугВсегоУпр  = 0;
			Если (ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.уатРеализацияУслуг")
				ИЛИ ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.уатПоступлениеТоваровУслуг"))
				И ЗначениеЗаполнено(ТекОбъектОплатыДоговор.ОбъектОплаты)
				И ТипЗнч(ТекОбъектОплатыДоговор.ОбъектОплаты) = Тип("ДокументСсылка.уатЗаказГрузоотправителя") Тогда
				
				мсвСтрокиУслугиПоЗаказу = тблУслугиПоЗаказам.НайтиСтроки(Новый Структура("ДоговорКонтрагента, ЗаказНаТС",
					ТекОбъектОплатыДоговор.ДоговорКонтрагента, ТекОбъектОплатыДоговор.ОбъектОплаты));
				Для Каждого ТекСтрокаУслугиПоЗаказу Из мсвСтрокиУслугиПоЗаказу Цикл
					Если ТекСтрокаУслугиПоЗаказу.Валюта = ВалютаУпр Тогда
						СуммаУслугВсегоУпр = СуммаУслугВсегоУпр + ТекСтрокаУслугиПоЗаказу.Сумма;
					ИначеЕсли ВалютаРегл = ВалютаУпр Тогда
						СуммаУслугВсегоУпр = СуммаУслугВсегоУпр + ТекСтрокаУслугиПоЗаказу.СуммаРегл;
					Иначе
						СуммаУслугВсегоУпр = СуммаУслугВсегоУпр + уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(
							ТекСтрокаУслугиПоЗаказу.Сумма,
							ТекСтрокаУслугиПоЗаказу.Валюта, ВалютаУпр,
							ТекОбъектОплатыДоговор.ОбъектОплаты.Дата, ТекОбъектОплатыДоговор.ОбъектОплаты.Дата,,, Ложь, ДокументСсылка);
					КонецЕсли;
				КонецЦикла;
			Иначе
				Для Каждого ТекСтрокаПК Из мсвСтрокиПКПоОбъектуОплатыИДоговору Цикл
					Если ТекСтрокаПК.Валюта = ВалютаУпр Тогда
						СуммаУслугВсегоУпр = СуммаУслугВсегоУпр + ТекСтрокаПК.СуммаПриходУпр;
					Иначе
						СуммаУслугВсегоУпр = СуммаУслугВсегоУпр + уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(
							ТекСтрокаПК.СуммаПриход,
							ТекСтрокаПК.Валюта, ВалютаУпр,
							ТекСтрокаПК.Период, ТекСтрокаПК.Период,,, Ложь, ДокументСсылка);
					КонецЕсли;
			    КонецЦикла;
			КонецЕсли;
			
			// Таблица графика оплаты со служебной колонкой - остаток платежа по этапу.
			// Если остаток = 0, то этап закрыт и дальше не используется в распределении.
			тблГрафикОплаты = ТекОбъектОплатыДоговор.ДоговорКонтрагента.ГрафикОплаты.Выгрузить();
			тблГрафикОплаты.Колонки.Добавить("СуммаОстатокУпр");
			Для Каждого ТекСтрокаГрафик Из тблГрафикОплаты Цикл
				ТекСтрокаГрафик.СуммаОстатокУпр = Окр(СуммаУслугВсегоУпр * ТекСтрокаГрафик.ЭтапОплаты.Процент / 100, 4);
			КонецЦикла;
			
			СуммаВыставленоПоОбъектуОплатыРанееУпр = 0;
			СтрокаДолгПоОбъектуОплаты = тблДолгПоОбъектамОплаты.Найти(ТекОбъектОплатыДоговор.ОбъектОплаты, "ОбъектОплаты");
			мсвСтрокиДолгПоОбъектуОплаты = тблДолгПоОбъектамОплаты.НайтиСтроки(
				Новый Структура("ДоговорКонтрагента, ОбъектОплаты",
				ТекОбъектОплатыДоговор.ОбъектОплаты, ТекОбъектОплатыДоговор.ОбъектОплаты));
			Для Каждого СтрокаДолгПоОбъектуОплаты Из мсвСтрокиДолгПоОбъектуОплаты Цикл
				СуммаВыставленоПоОбъектуОплатыРанееУпр = СуммаВыставленоПоОбъектуОплатыРанееУпр + СтрокаДолгПоОбъектуОплаты.СуммаПриходУпр;
			КонецЦикла;
			СуммаВыставленоПоОбъектуОплатыУпр = СуммаУслугВсегоУпр;
			
			Для Каждого ТекСтрокаПК Из мсвСтрокиПКПоОбъектуОплатыИДоговору Цикл
				Если ТекОбъектОплатыДоговор.ДоговорКонтрагента.ГрафикОплаты.Количество() = 0 Тогда
					НоваяСтрокаРез = ТаблицаПлатежныйКалендарьРез.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаРез, ТекСтрокаПК);
				Иначе
					Если ЗначениеЗаполнено(ТекСтрокаПК.ЗаказНаТС) Тогда
						Если СуммаУслугВсегоУпр > 0 Тогда
							СуммаОстатокПКУпр = ТекСтрокаПК.СуммаПриходУпр;
							Для Каждого ТекСтрокаГрафик Из тблГрафикОплаты Цикл
								Если ТекСтрокаГрафик.СуммаОстатокУпр = 0 Тогда
									Продолжить;
								КонецЕсли;
								
								// пропускаем уже выставленные этапы оплаты
								Если СуммаВыставленоПоОбъектуОплатыРанееУпр >= ТекСтрокаГрафик.СуммаОстатокУпр Тогда
									СуммаВыставленоПоОбъектуОплатыРанееУпр = СуммаВыставленоПоОбъектуОплатыРанееУпр - ТекСтрокаГрафик.СуммаОстатокУпр;
									ТекСтрокаГрафик.СуммаОстатокУпр = 0;
									Продолжить;
								КонецЕсли;
								
								ТекСтрокаГрафик.СуммаОстатокУпр = ТекСтрокаГрафик.СуммаОстатокУпр - СуммаВыставленоПоОбъектуОплатыРанееУпр;
								СуммаВыставленоПоОбъектуОплатыРанееУпр = 0;
								
								ТекСуммаПриходУпр = Мин(ТекСтрокаГрафик.СуммаОстатокУпр, СуммаОстатокПКУпр);
																	
								НоваяСтрокаРез = ТаблицаПлатежныйКалендарьРез.Добавить();
								ЗаполнитьЗначенияСвойств(НоваяСтрокаРез, ТекСтрокаПК);
								
								НоваяСтрокаРез.ЭтапОплаты     = ТекСтрокаГрафик.ЭтапОплаты;
								НоваяСтрокаРез.СуммаПриходУпр = ТекСуммаПриходУпр;
								НоваяСтрокаРез.СуммаПриход    = ТекСуммаПриходУпр * ТекСтрокаПК.СуммаПриход / ТекСтрокаПК.СуммаПриходУпр;
								
								СуммаВыставленоПоОбъектуОплатыУпр = СуммаВыставленоПоОбъектуОплатыУпр - ТекСуммаПриходУпр;
								СуммаОстатокПКУпр = СуммаОстатокПКУпр - ТекСуммаПриходУпр;
								ТекСтрокаГрафик.СуммаОстатокУпр = ТекСтрокаГрафик.СуммаОстатокУпр - ТекСуммаПриходУпр;
								
								Если Окр(СуммаВыставленоПоОбъектуОплатыУпр, 2) = 0 Тогда
									Прервать;
								КонецЕсли;
							КонецЦикла;
						Иначе
							НоваяСтрокаРез = ТаблицаПлатежныйКалендарьРез.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрокаРез, ТекСтрокаПК);
						КонецЕсли;
					Иначе
						Для Каждого ТекСтрокаГрафик Из тблГрафикОплаты Цикл
							НоваяСтрокаРез = ТаблицаПлатежныйКалендарьРез.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрокаРез, ТекСтрокаПК);
							НоваяСтрокаРез.ЭтапОплаты     = ТекСтрокаГрафик.ЭтапОплаты;
							НоваяСтрокаРез.СуммаПриход    = ТекСтрокаПК.СуммаПриход * ТекСтрокаГрафик.ЭтапОплаты.Процент / 100;
							НоваяСтрокаРез.СуммаПриходУпр = ТекСтрокаПК.СуммаПриходУпр * ТекСтрокаГрафик.ЭтапОплаты.Процент / 100;
						КонецЦикла;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	Иначе
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ТаблицаПлатежныйКалендарь.Период КАК Период,
		|	ТаблицаПлатежныйКалендарь.Регистратор КАК Регистратор,
		|	ТаблицаПлатежныйКалендарь.Организация КАК Организация,
		|	ТаблицаПлатежныйКалендарь.Контрагент КАК Контрагент,
		|	ТаблицаПлатежныйКалендарь.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ТаблицаПлатежныйКалендарь.Сделка КАК Сделка,
		|	ТаблицаПлатежныйКалендарь.ЗаказНаТС КАК ЗаказНаТС,
		|	ТаблицаПлатежныйКалендарь.Валюта КАК Валюта,
		|	ТаблицаПлатежныйКалендарь.ПолучательУслуг КАК ПолучательУслуг
		|ПОМЕСТИТЬ ТаблицаПлатежныйКалендарь
		|ИЗ
		|	&ТаблицаПлатежныйКалендарь КАК ТаблицаПлатежныйКалендарь
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаПлатежныйКалендарь.Период КАК Период,
		|	ТаблицаПлатежныйКалендарь.Регистратор КАК Регистратор,
		|	ТаблицаПлатежныйКалендарь.Организация КАК Организация,
		|	ТаблицаПлатежныйКалендарь.Контрагент КАК Контрагент,
		|	ТаблицаПлатежныйКалендарь.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ТаблицаПлатежныйКалендарь.Сделка КАК Сделка,
		|	ТаблицаПлатежныйКалендарь.Валюта КАК Валюта,
		|	ТаблицаПлатежныйКалендарь.ПолучательУслуг КАК ПолучательУслуг,
		|	уатРасчетыПоДокументамОбороты.ЗаказНаТС КАК ЗаказНаТС,
		|	уатРасчетыПоДокументамОбороты.ЭтапОплаты КАК ЭтапОплаты,
		|	ЕСТЬNULL(уатРасчетыПоДокументамОбороты.СуммаПриходОборот, 0) - ЕСТЬNULL(уатРасчетыПоДокументамОбороты.СуммаРасходОборот, 0) КАК СуммаОстаток,
		|	ЕСТЬNULL(уатРасчетыПоДокументамОбороты.СуммаПриходУпрОборот, 0) - ЕСТЬNULL(уатРасчетыПоДокументамОбороты.СуммаРасходУпрОборот, 0) КАК СуммаУпрОстаток
		|ИЗ
		|	ТаблицаПлатежныйКалендарь КАК ТаблицаПлатежныйКалендарь
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.уатРасчетыПоДокументам.Обороты КАК уатРасчетыПоДокументамОбороты
		|		ПО ТаблицаПлатежныйКалендарь.ДоговорКонтрагента = уатРасчетыПоДокументамОбороты.ДоговорКонтрагента
		|			И ТаблицаПлатежныйКалендарь.Сделка = уатРасчетыПоДокументамОбороты.Сделка
		|			И ТаблицаПлатежныйКалендарь.Валюта = уатРасчетыПоДокументамОбороты.Валюта
		|			И ТаблицаПлатежныйКалендарь.ПолучательУслуг = уатРасчетыПоДокументамОбороты.ПолучательУслуг
		|			И (уатРасчетыПоДокументамОбороты.ДоговорКонтрагента.ВедениеВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказамНаТС)
		|					И ТаблицаПлатежныйКалендарь.ЗаказНаТС = уатРасчетыПоДокументамОбороты.ЗаказНаТС
		|				ИЛИ уатРасчетыПоДокументамОбороты.ДоговорКонтрагента.ВедениеВзаиморасчетов <> ЗНАЧЕНИЕ(Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказамНаТС)
		|					И (ТаблицаПлатежныйКалендарь.ЗаказНаТС = ЗНАЧЕНИЕ(Документ.уатЗаказГрузоотправителя.ПустаяСсылка)
		|						ИЛИ ТаблицаПлатежныйКалендарь.ЗаказНаТС = НЕОПРЕДЕЛЕНО
		|						ИЛИ ТаблицаПлатежныйКалендарь.ЗаказНаТС = уатРасчетыПоДокументамОбороты.ЗаказНаТС))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов.ГрафикОплаты КАК ДоговорыГрафикОплаты
		|		ПО (уатРасчетыПоДокументамОбороты.ДоговорКонтрагента = ДоговорыГрафикОплаты.Ссылка)
		|			И (уатРасчетыПоДокументамОбороты.ЭтапОплаты = ДоговорыГрафикОплаты.ЭтапОплаты)
		|
		|УПОРЯДОЧИТЬ ПО
		|	уатРасчетыПоДокументамОбороты.Сделка.Дата,
		|	ДоговорыГрафикОплаты.НомерСтроки");
		Запрос.УстановитьПараметр("ТаблицаПлатежныйКалендарь", ТаблицаПлатежныйКалендарь);
		ТаблицаОстатковПартий = Запрос.Выполнить().Выгрузить();
		
		ТаблицаПлатежныйКалендарьРез = ТаблицаПлатежныйКалендарь.СкопироватьКолонки();
		ТаблицаПлатежныйКалендарьРез.Колонки.Добавить("ЭтапОплаты");
		
		РазнесениеПоЗаказам = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(ДокументСсылка.Организация,
			ПланыВидовХарактеристик.уатПраваИНастройки.РазнесениеПлатежейПоЗаказам);
		
		Для каждого ТекСтрока Из ТаблицаПлатежныйКалендарь Цикл
			ОсталосьСписатьСумму = ТекСтрока.СуммаРасход;	
			Для каждого ТекСтрокаОстатковПартий Из ТаблицаОстатковПартий Цикл
				Если ОсталосьСписатьСумму = 0 Тогда
					Прервать;
				КонецЕсли;
				
				Если ТекСтрока.ДоговорКонтрагента = ТекСтрокаОстатковПартий.ДоговорКонтрагента 
					И ТекСтрока.Сделка = ТекСтрокаОстатковПартий.Сделка
					И ТекСтрока.Валюта = ТекСтрокаОстатковПартий.Валюта
					И (ТекСтрока.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказамНаТС
						И ТекСтрока.ЗаказНаТС = ТекСтрокаОстатковПартий.ЗаказНаТС
						ИЛИ ТекСтрока.ДоговорКонтрагента.ВедениеВзаиморасчетов <> Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказамНаТС
						И (НЕ ЗначениеЗаполнено(ТекСтрока.ЗаказНаТС) ИЛИ ТекСтрока.ЗаказНаТС = ТекСтрокаОстатковПартий.ЗаказНаТС))
					И ТекСтрокаОстатковПартий.СуммаОстаток > 0 Тогда
					
					СписатьСумму = Мин(ТекСтрокаОстатковПартий.СуммаОстаток, ОсталосьСписатьСумму);
					Если СписатьСумму = 0 Тогда 
						Продолжить;
					КонецЕсли;
					
					НоваяСтрокаРез = ТаблицаПлатежныйКалендарьРез.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаРез, ТекСтрока);
					
					НоваяСтрокаРез.ЭтапОплаты = ТекСтрокаОстатковПартий.ЭтапОплаты;
					
					// Если НЕ используется разнесение по заказам, то закрытие долга по заказам выполняется по ФИФО,
					// заказ выбирается из строки партии долга.
					// Если используется разнесение по заказам, то закрытие долга выполняется по заказу, указанному в ТЧ Заказы,
					// или по сделке-заказу, если договор "По заказам".
					Если НЕ РазнесениеПоЗаказам Тогда
						НоваяСтрокаРез.ЗаказНаТС = ТекСтрокаОстатковПартий.ЗаказНаТС;
					КонецЕсли;
					
					НоваяСтрокаРез.СуммаРасход    = СписатьСумму;
					НоваяСтрокаРез.СуммаРасходУпр = СписатьСумму * ТекСтрокаОстатковПартий.СуммаУпрОстаток / ТекСтрокаОстатковПартий.СуммаОстаток;
					
					ОсталосьСписатьСумму = ОсталосьСписатьСумму - СписатьСумму;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		// Свертка выполняется, т.к. может закрываться несколько строк партий долга одной строкой расшифровки.
		Если РазнесениеПоЗаказам Тогда
			ТаблицаПлатежныйКалендарьРез.Свернуть("Период, Регистратор, Организация, Контрагент, ДоговорКонтрагента, Сделка, Валюта, ПолучательУслуг, ЗаказНаТС, ЭтапОплаты", "СуммаРасход, СуммаРасходУпр");
		КонецЕсли;
	КонецЕсли;
	
	ТаблицаПлатежныйКалендарь = ТаблицаПлатежныйКалендарьРез;
КонецПроцедуры

// Процедура считывает общую сумму услуг заказов по РН уатПредоставленныеУслуги
//  и оплаченную сумму услуг по РН уатРасчетыПоДокументам, рассчитывает процент и состояние оплаты,
//  записывает в эти параметры в РС уатТекущееСостояниеОплаты
//
// Параметры:
//  ДокументОбъект - контекст из модуля объекта документа, выполняющего проведение по РН уатПредоставленныеУслуги
//					и РН уатРасчетыПоДокументам
//
Процедура ОбновитьТекущееСостояниеОплатыДокумента(ДокументОбъект)
	
	ИмяДокумента = ДокументОбъект.Метаданные().Имя;
	мсвЗаказы = Новый Массив;
	
	// Заказы из добавляемых движений регистров.
	Если ДокументОбъект.Движения.Найти("уатРасчетыПоДокументам") <> Неопределено Тогда
		Для Каждого ТекЗапись Из ДокументОбъект.Движения.уатРасчетыПоДокументам Цикл
			Если ЗначениеЗаполнено(ТекЗапись.ЗаказНаТС)
				И мсвЗаказы.Найти(ТекЗапись.ЗаказНаТС) = Неопределено Тогда
				мсвЗаказы.Добавить(ТекЗапись.ЗаказНаТС);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если ДокументОбъект.Движения.Найти("уатПредоставленныеУслуги") <> Неопределено Тогда
		Для Каждого ТекЗапись Из ДокументОбъект.Движения.уатПредоставленныеУслуги Цикл
			Если ЗначениеЗаполнено(ТекЗапись.ЗаказНаТС)
				И мсвЗаказы.Найти(ТекЗапись.ЗаказНаТС) = Неопределено Тогда
				мсвЗаказы.Добавить(ТекЗапись.ЗаказНаТС);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// Заказы из удаляемых движений регистров.
	Если ДокументОбъект.ДополнительныеСвойства.Свойство("СтарыеЗаказы") Тогда
		Для Каждого ТекЗаказ Из ДокументОбъект.ДополнительныеСвойства.СтарыеЗаказы Цикл
			Если мсвЗаказы.Найти(ТекЗаказ) = Неопределено Тогда
				мсвЗаказы.Добавить(ТекЗаказ);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// Заказы из документа.
	Если ИмяДокумента = "уатЗаказГрузоотправителя" ИЛИ ИмяДокумента = "такАрендаТС" Тогда
		Если мсвЗаказы.Найти(ДокументОбъект.Ссылка) = Неопределено Тогда
			мсвЗаказы.Добавить(ДокументОбъект.Ссылка);
		КонецЕсли;
	Иначе
		Если ИмяДокумента = "уатПлатежноеПоручениеВходящее" ИЛИ ИмяДокумента = "уатПлатежноеПоручениеИсходящее"
			ИЛИ ИмяДокумента = "уатПриходныйКассовыйОрдер" ИЛИ ИмяДокумента = "уатРасходныйКассовыйОрдер" Тогда
			
			Для Каждого ТекСтрока Из ДокументОбъект.РасшифровкаПлатежа Цикл
				Если НЕ ЗначениеЗаполнено(ТекСтрока.Сделка) Тогда
					Продолжить;
				КонецЕсли;
				
				ИмяДокументаСделка = ТекСтрока.Сделка.Метаданные().Имя;
				Если (ИмяДокументаСделка = "уатЗаказГрузоотправителя" ИЛИ ИмяДокументаСделка = "такАрендаТС")
					И мсвЗаказы.Найти(ТекСтрока.Сделка) = Неопределено Тогда
					мсвЗаказы.Добавить(ТекСтрока.Сделка);
				ИначеЕсли ИмяДокументаСделка = "уатРеализацияУслуг" ИЛИ ИмяДокументаСделка = "уатСчетНаОплатуПокупателю" Тогда
					Для Каждого ТекСтрокаСделки Из ТекСтрока.Сделка.Услуги Цикл
						Если ЗначениеЗаполнено(ТекСтрокаСделки.Заказ)
							И мсвЗаказы.Найти(ТекСтрокаСделки.Заказ) = Неопределено Тогда
							мсвЗаказы.Добавить(ТекСтрокаСделки.Заказ);
						КонецЕсли;
					КонецЦикла;
				ИначеЕсли ИмяДокументаСделка = "уатПоступлениеТоваровУслуг"	ИЛИ ИмяДокументаСделка = "уатСчетНаОплатуПоставщика" Тогда
					Для Каждого ТекСтрокаСделки Из ТекСтрока.Сделка.Услуги Цикл
						Если ЗначениеЗаполнено(ТекСтрокаСделки.ЗаказНаТС)
							И мсвЗаказы.Найти(ТекСтрокаСделки.ЗаказНаТС) = Неопределено Тогда
							мсвЗаказы.Добавить(ТекСтрокаСделки.ЗаказНаТС);
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
		ИначеЕсли ИмяДокумента = "уатРекламация_уэ" Тогда
			мсвЗаказы.Добавить(ДокументОбъект.ЗаказГрузоотправителя);
		ИначеЕсли ИмяДокумента = "уатВзаимозачет" Тогда
			Для Каждого ТекСтрока Из ДокументОбъект.Состав Цикл
				Если НЕ ЗначениеЗаполнено(ТекСтрока.СделкаДебитора) Тогда
					Продолжить;
				КонецЕсли;
				
				ИмяДокументаСделка = ТекСтрока.СделкаДебитора.Метаданные().Имя;
				Если (ИмяДокументаСделка = "уатЗаказГрузоотправителя" ИЛИ ИмяДокументаСделка = "такАрендаТС")
					И мсвЗаказы.Найти(ТекСтрока.СделкаДебитора) = Неопределено Тогда
					мсвЗаказы.Добавить(ТекСтрока.СделкаДебитора);
				КонецЕсли;
			КонецЦикла;	
			Для Каждого ТекСтрока Из ДокументОбъект.Состав Цикл
				Если НЕ ЗначениеЗаполнено(ТекСтрока.СделкаКредитора) Тогда
					Продолжить;
				КонецЕсли;
				
				ИмяДокументаСделка = ТекСтрока.СделкаКредитора.Метаданные().Имя;
				Если (ИмяДокументаСделка = "уатЗаказГрузоотправителя" ИЛИ ИмяДокументаСделка = "такАрендаТС")
					И мсвЗаказы.Найти(ТекСтрока.СделкаКредитора) = Неопределено Тогда
					мсвЗаказы.Добавить(ТекСтрока.СделкаКредитора);
				КонецЕсли;
			КонецЦикла;
			Если ДокументОбъект.ДополнительныеСвойства.Свойство("ЗакрытыеЗаказыНаТС") Тогда
				Для Каждого ТекЗаказ Из ДокументОбъект.ДополнительныеСвойства.ЗакрытыеЗаказыНаТС Цикл
					Если мсвЗаказы.Найти(ТекЗаказ) = Неопределено Тогда
						мсвЗаказы.Добавить(ТекЗаказ);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		Иначе
			Если ИмяДокумента = "уатЗаказПеревозчику_уэ" Тогда
				ИмяТЧ        = "Грузы";
				ИмяРеквизита = "Заказ";
			ИначеЕсли ИмяДокумента = "уатКорректировкаДолга" Тогда	
				ИмяТЧ        = "Состав";
				ИмяРеквизита = "Сделка";
			ИначеЕсли ИмяДокумента = "уатМаршрутныйЛист" Тогда
				ИмяТЧ        = "Заказы";
				ИмяРеквизита = "ЗаказГрузоотправителя";
			ИначеЕсли ИмяДокумента = "уатПоступлениеТоваровУслуг"
				ИЛИ ИмяДокумента = "уатСчетНаОплатуПоставщика" Тогда
				ИмяТЧ        = "Услуги";
				ИмяРеквизита = "ЗаказНаТС";
			ИначеЕсли ИмяДокумента = "уатРеализацияУслуг"
				ИЛИ ИмяДокумента = "уатСчетНаОплатуПокупателю" Тогда
				ИмяТЧ        = "Услуги";
				ИмяРеквизита = "Заказ";
			ИначеЕсли ИмяДокумента = "уатСтраховойСертификат_уэ" Тогда
				ИмяТЧ        = "Грузы";
				ИмяРеквизита = "ЗаказНаТС";
			КонецЕсли;
			Для Каждого ТекСтрока Из ДокументОбъект[ИмяТЧ] Цикл
				Если НЕ ЗначениеЗаполнено(ТекСтрока[ИмяРеквизита]) Тогда
					Продолжить;
				КонецЕсли;
				
				ИмяДокументаЗаказ = ТекСтрока[ИмяРеквизита].Метаданные().Имя;
				
				Если (ИмяДокументаЗаказ = "уатЗаказГрузоотправителя" ИЛИ ИмяДокументаЗаказ = "такАрендаТС")
					И мсвЗаказы.Найти(ТекСтрока[ИмяРеквизита]) = Неопределено Тогда
					мсвЗаказы.Добавить(ТекСтрока[ИмяРеквизита]);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	// Родительские мультимодальные заказы
	Для Каждого ТекЗаказ Из мсвЗаказы Цикл
		Если ТипЗнч(ТекЗаказ) = Тип("ДокументСсылка.уатЗаказГрузоотправителя")
			И ЗначениеЗаполнено(ТекЗаказ.РодительскийЗаказ)
			И мсвЗаказы.Найти(ТекЗаказ.РодительскийЗаказ) = Неопределено Тогда
			мсвЗаказы.Добавить(ТекЗаказ.РодительскийЗаказ);
		КонецЕсли;
	КонецЦикла;

	// Также нужно рассчитать состояние оплаты для самого счета / накладной
	Если ИмяДокумента = "уатПоступлениеТоваровУслуг" ИЛИ ИмяДокумента = "уатРеализацияУслуг"
		ИЛИ ИмяДокумента = "уатСчетНаОплатуПоставщика" ИЛИ ИмяДокумента = "уатСчетНаОплатуПокупателю" Тогда
		мсвЗаказы.Добавить(ДокументОбъект.Ссылка);
		Если (ИмяДокумента = "уатПоступлениеТоваровУслуг" ИЛИ ИмяДокумента = "уатРеализацияУслуг")
			И ДокументОбъект.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам Тогда
			мсвЗаказы.Добавить(ДокументОбъект.Сделка);
		ИначеЕсли (ИмяДокумента = "уатСчетНаОплатуПокупателю" ИЛИ ИмяДокумента = "уатСчетНаОплатуПоставщика")
			И ДокументОбъект.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоНакладным Тогда
			Для Каждого ТекСделка Из уатОбщегоНазначения_проф.НакладныеДляСчетаНаОплату(ДокументОбъект.Ссылка) Цикл
				Если мсвЗаказы.Найти(ТекСделка) = Неопределено Тогда
					мсвЗаказы.Добавить(ТекСделка);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	ИначеЕсли ИмяДокумента = "уатПлатежноеПоручениеВходящее"
		ИЛИ ИмяДокумента = "уатПлатежноеПоручениеИсходящее"
		ИЛИ ИмяДокумента = "уатПриходныйКассовыйОрдер"
		ИЛИ ИмяДокумента = "уатРасходныйКассовыйОрдер" Тогда // Добавляем счета и накладные из Расшифровки платежа
		Для Каждого ТекСтрока Из ДокументОбъект.РасшифровкаПлатежа Цикл
			Если ЗначениеЗаполнено(ТекСтрока.Сделка)
				И ТипЗнч(ТекСтрока.Сделка) <> Тип("ДокументСсылка.уатРемонтныйЛист")
				И мсвЗаказы.Найти(ТекСтрока.Сделка) = Неопределено Тогда
				мсвЗаказы.Добавить(ТекСтрока.Сделка);
				
				 // Добавляем накладную, введенную на основании счета, или счет указанный, в накладной
				СвязаннаяНакладнаяСчет = СвязаннаяНакладнаяИлиСчет(ТекСтрока.Сделка);
				Если ЗначениеЗаполнено(СвязаннаяНакладнаяСчет) И мсвЗаказы.Найти(СвязаннаяНакладнаяСчет) = Неопределено Тогда
					мсвЗаказы.Добавить(СвязаннаяНакладнаяСчет);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// Добавляем все счета и накладные, в которых указаны Заказы. По ним всем надо пересчитать состояние оплаты
	Для Каждого ТекНакладнаяСчет Из НакладныеИСчетаНаОплатуПоЗаказам(мсвЗаказы, ИмяДокумента) Цикл
		Если мсвЗаказы.Найти(ТекНакладнаяСчет) = Неопределено Тогда
			мсвЗаказы.Добавить(ТекНакладнаяСчет);
		КонецЕсли;
	КонецЦикла;
		
	мсвСостояниеОплатыПоЗаказам = уатОбщегоНазначения_проф.СостояниеОплатыПоДокументам(мсвЗаказы);
	Для Каждого СостояниеОплатыПоЗаказу Из мсвСостояниеОплатыПоЗаказам Цикл
		Если ((уатОбщегоНазначенияПовтИсп.ВариантПоставкиТакси()
			И ТипЗнч(СостояниеОплатыПоЗаказу.Документ) = Тип("ДокументСсылка.такЗаказТакси")
			И ТипЗнч(СостояниеОплатыПоЗаказу.Документ.Заказчик) = Тип("СправочникСсылка.Контрагенты"))
			ИЛИ ТипЗнч(СостояниеОплатыПоЗаказу.Документ.Контрагент) = Тип("СправочникСсылка.Контрагенты"))
			И (СостояниеОплатыПоЗаказу.Документ.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам
			ИЛИ СостояниеОплатыПоЗаказу.Документ.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоНакладным
			ИЛИ СостояниеОплатыПоЗаказу.Документ.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказамНаТС
			ИЛИ СостояниеОплатыПоЗаказу.Документ.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДокументуАрендаТС) Тогда
			
			НоваяЗапись = РегистрыСведений.уатТекущееСостояниеОплаты.СоздатьМенеджерЗаписи();
			НоваяЗапись.Заполнить(Неопределено);
			НоваяЗапись.Документ      = СостояниеОплатыПоЗаказу.Документ;
			НоваяЗапись.СуммаВсего    = СостояниеОплатыПоЗаказу.Сумма;
			НоваяЗапись.Оплачено      = СостояниеОплатыПоЗаказу.СуммаОплатыФакт;
			НоваяЗапись.ПроцентОплаты = СостояниеОплатыПоЗаказу.ПроцентОплатыФакт;
			Если СостояниеОплатыПоЗаказу.ПроцентОплатыФакт = 0 Тогда
				НоваяЗапись.Состояние = Перечисления.уатСостоянияВыполненияЗаказов.Новый;
			ИначеЕсли Окр(СостояниеОплатыПоЗаказу.ПроцентОплатыФакт) >= 100 Тогда
				НоваяЗапись.Состояние = Перечисления.уатСостоянияВыполненияЗаказов.Выполнен;
			Иначе
				НоваяЗапись.Состояние = Перечисления.уатСостоянияВыполненияЗаказов.ЧастичноВыполнен;
			КонецЕсли;
			НоваяЗапись.ПредоплатыНедостаточно = (СостояниеОплатыПоЗаказу.СуммаОплатыФакт < СостояниеОплатыПоЗаказу.СуммаПредоплаты);
			НоваяЗапись.ОплаченоПредставление = СтрШаблон("%1 (%2)",
				Формат(СостояниеОплатыПоЗаказу.СуммаОплатыФакт, "ЧДЦ=2; ЧН=0"),
				Формат(СостояниеОплатыПоЗаказу.ПроцентОплатыФакт, "ЧДЦ=0; ЧН=0") + "%");
			НоваяЗапись.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция НакладныеИСчетаНаОплатуПоЗаказам(мсвЗаказы, ИмяДокумента)
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	уатПоступлениеТоваровУслуг.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.уатПоступлениеТоваровУслуг КАК уатПоступлениеТоваровУслуг
	|ГДЕ
	|	уатПоступлениеТоваровУслуг.Услуги.ЗаказНаТС В(&мсвЗаказы)
	|	И уатПоступлениеТоваровУслуг.Проведен
	|	И &ПолучательУслугОрганизация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	уатРеализацияУслуг.Ссылка
	|ИЗ
	|	Документ.уатРеализацияУслуг КАК уатРеализацияУслуг
	|ГДЕ
	|	уатРеализацияУслуг.Услуги.Заказ В(&мсвЗаказы)
	|	И уатРеализацияУслуг.Проведен
	|	И НЕ &ПолучательУслугОрганизация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	уатСчетНаОплатуПоставщика.Ссылка
	|ИЗ
	|	Документ.уатСчетНаОплатуПоставщика КАК уатСчетНаОплатуПоставщика
	|ГДЕ
	|	уатСчетНаОплатуПоставщика.Услуги.ЗаказНаТС В(&мсвЗаказы)
	|	И НЕ уатСчетНаОплатуПоставщика.ПометкаУдаления
	|	И &ПолучательУслугОрганизация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	уатСчетНаОплатуПокупателю.Ссылка
	|ИЗ
	|	Документ.уатСчетНаОплатуПокупателю КАК уатСчетНаОплатуПокупателю
	|ГДЕ
	|	уатСчетНаОплатуПокупателю.Услуги.Заказ В(&мсвЗаказы)
	|	И НЕ уатСчетНаОплатуПокупателю.ПометкаУдаления
	|	И НЕ &ПолучательУслугОрганизация");
	Запрос.УстановитьПараметр("мсвЗаказы", мсвЗаказы);
	Запрос.УстановитьПараметр("ПолучательУслугОрганизация",
		ИмяДокумента = "уатПоступлениеТоваровУслуг"	ИЛИ ИмяДокумента = "уатСчетНаОплатуПоставщика");
	
	Рез = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Возврат Рез;
КонецФункции

Функция СвязаннаяНакладнаяИлиСчет(НакладнаяИлиСчет)
	Рез = Неопределено;
	
	Если ТипЗнч(НакладнаяИлиСчет) = Тип("ДокументСсылка.уатПоступлениеТоваровУслуг")
		ИЛИ ТипЗнч(НакладнаяИлиСчет) = Тип("ДокументСсылка.уатРеализацияУслуг")
		И ЗначениеЗаполнено(НакладнаяИлиСчет.Сделка) Тогда
		Рез = НакладнаяИлиСчет.Сделка;
		
	ИначеЕсли ТипЗнч(НакладнаяИлиСчет) = Тип("ДокументСсылка.уатСчетНаОплатуПокупателю")
		ИЛИ ТипЗнч(НакладнаяИлиСчет) = Тип("ДокументСсылка.уатСчетНаОплатуПоставщика") Тогда
		Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	уатПоступлениеТоваровУслуг.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.уатПоступлениеТоваровУслуг КАК уатПоступлениеТоваровУслуг
		|ГДЕ
		|	уатПоступлениеТоваровУслуг.Сделка = &Сделка
		|	И НЕ уатПоступлениеТоваровУслуг.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	уатРеализацияУслуг.Ссылка
		|ИЗ
		|	Документ.уатРеализацияУслуг КАК уатРеализацияУслуг
		|ГДЕ
		|	уатРеализацияУслуг.Сделка = &Сделка
		|	И НЕ уатРеализацияУслуг.ПометкаУдаления");
		Запрос.УстановитьПараметр("Сделка", НакладнаяИлиСчет);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Рез = Выборка.Ссылка;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Рез;
КонецФункции

Процедура ПолучитьСтарыеЗаказыПередЗаписью(ДокументОбъект) Экспорт
	
	Если НЕ ДокументОбъект.ДополнительныеСвойства.Свойство("СтарыеЗаказы") Тогда
		ДокументОбъект.ДополнительныеСвойства.Вставить("СтарыеЗаказы",   Новый Массив);
	КонецЕсли;
	
	НЗуатРасчетыПоДокументам = ДокументОбъект.Движения.Найти("уатРасчетыПоДокументам");
	Если НЗуатРасчетыПоДокументам <> Неопределено Тогда
		НЗуатРасчетыПоДокументам.Прочитать();
		Для Каждого ТекЗапись Из НЗуатРасчетыПоДокументам Цикл
			Если ЗначениеЗаполнено(ТекЗапись.ЗаказНаТС)
				И ДокументОбъект.ДополнительныеСвойства.СтарыеЗаказы.Найти(ТекЗапись.ЗаказНаТС) = Неопределено Тогда
				ДокументОбъект.ДополнительныеСвойства.СтарыеЗаказы.Добавить(ТекЗапись.ЗаказНаТС);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	НЗуатПредоставленныеУслуги = ДокументОбъект.Движения.Найти("уатПредоставленныеУслуги");
	Если НЗуатПредоставленныеУслуги <> Неопределено Тогда
		НЗуатПредоставленныеУслуги.Прочитать();
		Для Каждого ТекЗапись Из НЗуатПредоставленныеУслуги Цикл
			Если ЗначениеЗаполнено(ТекЗапись.ЗаказНаТС)
				И ДокументОбъект.ДополнительныеСвойства.СтарыеЗаказы.Найти(ТекЗапись.ЗаказНаТС) = Неопределено Тогда
				ДокументОбъект.ДополнительныеСвойства.СтарыеЗаказы.Добавить(ТекЗапись.ЗаказНаТС);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьДвиженияЗаказовПоПлатежномуКалендарю(ДокументОбъект)
	
	ИмяДокумента = ДокументОбъект.Метаданные().Имя;
	флЗаказыНаТС = Ложь;
	мсвДокументы = Новый Массив;
	Если ИмяДокумента = "уатМаршрутныйЛист" Тогда
		флЗаказыНаТС = Истина;
		Для Каждого ТекСтрока Из ДокументОбъект.Доходы Цикл
			Если ТекСтрока.ЗаказНаТС.ДоговорКонтрагента.ПредметДоговора = Перечисления.уатПредметыДоговоровКонтрагентов.Перевозка 
				И (ТекСтрока.ЗаказНаТС.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам
				ИЛИ ТекСтрока.ЗаказНаТС.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказамНаТС)
				И ЗначениеЗаполнено(ТекСтрока.ЗаказНаТС) И мсвДокументы.Найти(ТекСтрока.ЗаказНаТС) = Неопределено Тогда
				мсвДокументы.Добавить(ТекСтрока.ЗаказНаТС);
			КонецЕсли;
		КонецЦикла;
		Для Каждого ТекСтрока Из ДокументОбъект.Расходы Цикл
			Если ТекСтрока.Договор.ПредметДоговора = Перечисления.уатПредметыДоговоровКонтрагентов.Перевозка 
				И (ТекСтрока.Договор.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам
				ИЛИ ТекСтрока.Договор.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказамНаТС)
				И ЗначениеЗаполнено(ТекСтрока.ЗаказНаТС) И мсвДокументы.Найти(ТекСтрока.ЗаказНаТС) = Неопределено Тогда
				мсвДокументы.Добавить(ТекСтрока.ЗаказНаТС);
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли ДокументОбъект.ДоговорКонтрагента.ПредметДоговора = Перечисления.уатПредметыДоговоровКонтрагентов.Перевозка Тогда
		Если ДокументОбъект.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам
			ИЛИ ДокументОбъект.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказамНаТС Тогда
			
			флЗаказыНаТС = Истина;
			ИмяТЧ = "Услуги";
			ИмяПоляЗаказ = "ЗаказНаТС";
			
			Если ИмяДокумента = "уатСчетНаОплатуПокупателю"
				ИЛИ ИмяДокумента = "уатРеализацияУслуг" Тогда
				ИмяПоляЗаказ = "Заказ";
			ИначеЕсли ИмяДокумента = "уатЗаказПеревозчику_уэ" Тогда
				ИмяТЧ = "Расходы";
				ИмяПоляЗаказ = "Груз";
			ИначеЕсли ИмяДокумента = "уатСтраховойСертификат_уэ" Тогда
				ИмяТЧ = "Расходы";
			КонецЕсли;
			
			Для Каждого ТекСтрока Из ДокументОбъект[ИмяТЧ] Цикл
				Если ЗначениеЗаполнено(ТекСтрока[ИмяПоляЗаказ]) И мсвДокументы.Найти(ТекСтрока[ИмяПоляЗаказ]) = Неопределено Тогда
					мсвДокументы.Добавить(ТекСтрока[ИмяПоляЗаказ]);
				КонецЕсли;
			КонецЦикла;
		Иначе
			Возврат;
		КонецЕсли;
		
	ИначеЕсли ДокументОбъект.ДоговорКонтрагента.ПредметДоговора = Перечисления.уатПредметыДоговоровКонтрагентов.ПрочиеУслуги Тогда
		Если ДокументОбъект.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам Тогда
			РемЛист = НайтиРемонтныйЛистПоСчетуНаОплатуПоставщика(ДокументОбъект);
			Если ЗначениеЗаполнено(РемЛист) Тогда
				мсвДокументы.Добавить(РемЛист);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Для Каждого ТекДокумент Из мсвДокументы Цикл
		Если НЕ ТекДокумент.Проведен Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаказНаТСОбъект = ТекДокумент.ПолучитьОбъект();
		
		НЗуатРасчетыПоДокументам = РегистрыНакопления.уатРасчетыПоДокументам.СоздатьНаборЗаписей();
		НЗуатРасчетыПоДокументам.Отбор.Регистратор.Установить(ТекДокумент);
		НЗуатРасчетыПоДокументам.Записать();
		НЗуатДатыПлатежей = РегистрыСведений.уатДатыПлатежей.СоздатьНаборЗаписей();
		НЗуатДатыПлатежей.Заполнить(Неопределено);
		НЗуатДатыПлатежей.Отбор.Регистратор.Установить(ТекДокумент);
		НЗуатДатыПлатежей.Записать();
		
		уатПроведение.ИнициализироватьДополнительныеСвойстваДляПроведения(ТекДокумент, ЗаказНаТСОбъект.ДополнительныеСвойства);
		Если флЗаказыНаТС Тогда
			Документы.уатЗаказГрузоотправителя.СформироватьТаблицаПредоставленныеУслуги(ТекДокумент, ЗаказНаТСОбъект.ДополнительныеСвойства);
			Документы.уатЗаказГрузоотправителя.СформироватьТаблицаПлатежныйКалендарь(ТекДокумент, ЗаказНаТСОбъект.ДополнительныеСвойства);
		Иначе
			Документы.уатРемонтныйЛист.СформироватьТаблицаПлатежныйКалендарь(ТекДокумент, ЗаказНаТСОбъект.ДополнительныеСвойства);
		КонецЕсли;
		
		флОтказ = Ложь;
		ОтразитьРасчетыПоЗаказамНаТС(ЗаказНаТСОбъект.ДополнительныеСвойства, ЗаказНаТСОбъект.Движения, флОтказ);
		ЗаказНаТСОбъект.Движения.уатРасчетыПоДокументам.Записывать = Истина;
		ЗаказНаТСОбъект.Движения.уатДатыПлатежей.Записывать = Истина;
		
		уатПроведение.ЗаписатьНаборыЗаписей(ЗаказНаТСОбъект);
		
		Если флЗаказыНаТС Тогда
			ОбновитьТекущееСостояниеОплатыДокумента(ЗаказНаТСОбъект);
		КонецЕсли;
		
		Если НЕ флОтказ Тогда
			УстановитьДатуПлатежа(ЗаказНаТСОбъект);
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

// Функция получает таблицу ручных дат платежей, указанных в счетах на оплату и накладных, в которых указан этот заказ
//
// Параметры:
//  мсвЗаказы - ДокументСсылка.уатЗаказГрузоотправителя или массив ссылок - массив ссылок на документ Заказ на ТС
// 
// Возвращаемое значение:
//  ТаблицаЗначений - таблица с колонками [Договор, ДатаПлатежа]
//
Функция ПолучитьРучныеДатыПлатежейПоЗаказам(мсвЗаказы) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	уатПоступлениеТоваровУслугУслуги.ЗаказНаТС КАК ЗаказНаТС,
	|	уатПоступлениеТоваровУслугУслуги.Ссылка.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	уатПоступлениеТоваровУслугУслуги.Ссылка.ДатаПлатежа КАК ДатаПлатежа,
	|	ВЫБОР
	|		КОГДА уатПоступлениеТоваровУслугУслуги.Ссылка.ДатаПлатежа <> ДАТАВРЕМЯ(1, 1, 1)
	|				И уатПоступлениеТоваровУслугУслуги.Ссылка.ЭтапОплаты = ЗНАЧЕНИЕ(Справочник.уатЭтапыОплаты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.уатЭтапыОплаты.ПроизвольнаяОплата)
	|		ИНАЧЕ уатПоступлениеТоваровУслугУслуги.Ссылка.ЭтапОплаты
	|	КОНЕЦ КАК ЭтапОплаты
	|ПОМЕСТИТЬ втДокументы
	|ИЗ
	|	Документ.уатПоступлениеТоваровУслуг.Услуги КАК уатПоступлениеТоваровУслугУслуги
	|ГДЕ
	|	уатПоступлениеТоваровУслугУслуги.Ссылка.Проведен
	|	И уатПоступлениеТоваровУслугУслуги.Ссылка.ДатаПлатежа <> ДАТАВРЕМЯ(1, 1, 1)
	|	И уатПоступлениеТоваровУслугУслуги.ЗаказНаТС В(&мсвЗаказы)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	уатРеализацияУслугУслуги.Заказ,
	|	уатРеализацияУслугУслуги.Ссылка.ДоговорКонтрагента,
	|	уатРеализацияУслугУслуги.Ссылка.ДатаПлатежа,
	|	ВЫБОР
	|		КОГДА уатРеализацияУслугУслуги.Ссылка.ДатаПлатежа <> ДАТАВРЕМЯ(1, 1, 1)
	|				И уатРеализацияУслугУслуги.Ссылка.ЭтапОплаты = ЗНАЧЕНИЕ(Справочник.уатЭтапыОплаты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.уатЭтапыОплаты.ПроизвольнаяОплата)
	|		ИНАЧЕ уатРеализацияУслугУслуги.Ссылка.ЭтапОплаты
	|	КОНЕЦ
	|ИЗ
	|	Документ.уатРеализацияУслуг.Услуги КАК уатРеализацияУслугУслуги
	|ГДЕ
	|	уатРеализацияУслугУслуги.Ссылка.Проведен
	|	И уатРеализацияУслугУслуги.Ссылка.ДатаПлатежа <> ДАТАВРЕМЯ(1, 1, 1)
	|	И уатРеализацияУслугУслуги.Заказ В(&мсвЗаказы)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	уатСчетНаОплатуПокупателюУслуги.Заказ,
	|	уатСчетНаОплатуПокупателюУслуги.Ссылка.ДоговорКонтрагента,
	|	уатСчетНаОплатуПокупателюУслуги.Ссылка.ДатаОплаты,
	|	ВЫБОР
	|		КОГДА уатСчетНаОплатуПокупателюУслуги.Ссылка.ДатаОплаты <> ДАТАВРЕМЯ(1, 1, 1)
	|				И уатСчетНаОплатуПокупателюУслуги.Ссылка.ЭтапОплаты = ЗНАЧЕНИЕ(Справочник.уатЭтапыОплаты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.уатЭтапыОплаты.ПроизвольнаяОплата)
	|		ИНАЧЕ уатСчетНаОплатуПокупателюУслуги.Ссылка.ЭтапОплаты
	|	КОНЕЦ
	|ИЗ
	|	Документ.уатСчетНаОплатуПокупателю.Услуги КАК уатСчетНаОплатуПокупателюУслуги
	|ГДЕ
	|	НЕ уатСчетНаОплатуПокупателюУслуги.Ссылка.ПометкаУдаления
	|	И уатСчетНаОплатуПокупателюУслуги.Ссылка.ДатаОплаты <> ДАТАВРЕМЯ(1, 1, 1)
	|	И уатСчетНаОплатуПокупателюУслуги.Заказ В(&мсвЗаказы)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	уатСчетНаОплатуПоставщикаУслуги.ЗаказНаТС,
	|	уатСчетНаОплатуПоставщикаУслуги.Ссылка.ДоговорКонтрагента,
	|	уатСчетНаОплатуПоставщикаУслуги.Ссылка.ДатаОплаты,
	|	ВЫБОР
	|		КОГДА уатСчетНаОплатуПоставщикаУслуги.Ссылка.ДатаОплаты <> ДАТАВРЕМЯ(1, 1, 1)
	|				И уатСчетНаОплатуПоставщикаУслуги.Ссылка.ЭтапОплаты = ЗНАЧЕНИЕ(Справочник.уатЭтапыОплаты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.уатЭтапыОплаты.ПроизвольнаяОплата)
	|		ИНАЧЕ уатСчетНаОплатуПоставщикаУслуги.Ссылка.ЭтапОплаты
	|	КОНЕЦ
	|ИЗ
	|	Документ.уатСчетНаОплатуПоставщика.Услуги КАК уатСчетНаОплатуПоставщикаУслуги
	|ГДЕ
	|	НЕ уатСчетНаОплатуПоставщикаУслуги.Ссылка.ПометкаУдаления
	|	И уатСчетНаОплатуПоставщикаУслуги.Ссылка.ДатаОплаты <> ДАТАВРЕМЯ(1, 1, 1)
	|	И уатСчетНаОплатуПоставщикаУслуги.ЗаказНаТС В(&мсвЗаказы)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДокументы.ЗаказНаТС КАК ЗаказНаТС,
	|	втДокументы.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	втДокументы.ЭтапОплаты КАК ЭтапОплаты,
	|	МИНИМУМ(втДокументы.ДатаПлатежа) КАК ДатаПлатежа
	|ИЗ
	|	втДокументы КАК втДокументы
	|
	|СГРУППИРОВАТЬ ПО
	|	втДокументы.ЗаказНаТС,
	|	втДокументы.ДоговорКонтрагента,
	|	втДокументы.ЭтапОплаты");
	Запрос.УстановитьПараметр("мсвЗаказы", мсвЗаказы);
	тблДатыПлатежей = Запрос.Выполнить().Выгрузить();
	
	Возврат тблДатыПлатежей;
	
КонецФункции

Функция ПолучитьДатуСрокПлатежаПоЗаказу(ДанныеСтроки, ДатаПлатежаРучная, мсвСообщенияОбОшибках)
	Рез = Новый Структура;
	Рез.Вставить("ДатаСобытия", '00010101');
	Рез.Вставить("ДатаПлатежа", '00010101');
	Рез.Вставить("ДатаПлатежаПредварительная", '00010101');
	Рез.Вставить("ДнейОтсрочки", 0);
	
	флДоСобытия = Ложь;
	
	Если ЗначениеЗаполнено(ДатаПлатежаРучная) Тогда
		Рез.ДатаСобытия = ДатаПлатежаРучная;
		Рез.ДатаПлатежа = ДатаПлатежаРучная;
		Возврат Рез;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеСтроки.ДоговорКонтрагента) Тогда
		Если ДанныеСтроки.ДоговорКонтрагента.ГрафикОплаты.Найти(ДанныеСтроки.ЭтапОплаты, "ЭтапОплаты") = Неопределено Тогда
			Возврат Рез;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеСтроки.ЗаказНаТС)
		И ЗначениеЗаполнено(ДанныеСтроки.ЭтапОплаты)
		И ДанныеСтроки.ЭтапОплаты.ОтображатьНаПлатежномКалендареДоДоставкиГруза Тогда
		
		Если ДанныеСтроки.ЭтапОплаты.ВариантОтсчета = Перечисления.уатВариантыОтсчетаДатыПлатежа.ПослеДоставкиГруза
			ИЛИ ДанныеСтроки.ЭтапОплаты.ВариантОтсчета = Перечисления.уатВариантыОтсчетаДатыПлатежа.ПослеОтправкиКомплектаСопроводительныхДокументов
			ИЛИ ДанныеСтроки.ЭтапОплаты.ВариантОтсчета = Перечисления.уатВариантыОтсчетаДатыПлатежа.ПослеПолученияСопроводительныхДокументов Тогда
			Рез.ДатаПлатежаПредварительная = ДанныеСтроки.ЗаказНаТС.ДоставкаС + ДанныеСтроки.ЭтапОплаты.ОтображатьНаПлатежномКалендареДоДоставкиГрузаЧерезДней*24*3600;
		КонецЕсли;
	КонецЕсли;
		
	Если ДанныеСтроки.ЭтапОплаты.ВариантОтсчета = Перечисления.уатВариантыОтсчетаДатыПлатежа.ДоОтправленияПоЗаказу Тогда
		Рез.ДатаСобытия = НачалоДня(ДанныеСтроки.ЗаказНаТС.ОтправлениеС);
		флДоСобытия = Истина;
	ИначеЕсли ДанныеСтроки.ЭтапОплаты.ВариантОтсчета = Перечисления.уатВариантыОтсчетаДатыПлатежа.ПослеОтправленияПоЗаказу Тогда
		Рез.ДатаСобытия = НачалоДня(ДанныеСтроки.ЗаказНаТС.ОтправлениеПо);
	ИначеЕсли ДанныеСтроки.ЭтапОплаты.ВариантОтсчета = Перечисления.уатВариантыОтсчетаДатыПлатежа.ДоПрибытияПоЗаказу Тогда
		Рез.ДатаСобытия = НачалоДня(ДанныеСтроки.ЗаказНаТС.ДоставкаС);
		флДоСобытия = Истина;
	ИначеЕсли ДанныеСтроки.ЭтапОплаты.ВариантОтсчета = Перечисления.уатВариантыОтсчетаДатыПлатежа.ПослеПрибытияПоЗаказу Тогда
		Рез.ДатаСобытия = НачалоДня(ДанныеСтроки.ЗаказНаТС.ДоставкаПо);
	ИначеЕсли ДанныеСтроки.ЭтапОплаты.ВариантОтсчета = Перечисления.уатВариантыОтсчетаДатыПлатежа.ПослеДоставкиГруза Тогда
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	уатЗаказыГрузоотправителейОстатки.ЗаказГрузоотправителя КАК ЗаказГрузоотправителя,
		|	уатЗаказыГрузоотправителейОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.уатЗаказыГрузоотправителей.Остатки(, ЗаказГрузоотправителя = &ЗаказГрузоотправителя) КАК уатЗаказыГрузоотправителейОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	уатЗаказыГрузоотправителей.Период КАК ДатаДоставки
		|ИЗ
		|	РегистрНакопления.уатЗаказыГрузоотправителей КАК уатЗаказыГрузоотправителей
		|ГДЕ
		|	уатЗаказыГрузоотправителей.ЗаказГрузоотправителя = &ЗаказГрузоотправителя
		|	И уатЗаказыГрузоотправителей.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаДоставки УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	уатГрузыКПеревозке_уэОстатки.ЗаказГрузоотправителя КАК ЗаказГрузоотправителя,
		|	уатГрузыКПеревозке_уэОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.уатГрузыКПеревозке_уэ.Остатки(, ЗаказГрузоотправителя = &ЗаказГрузоотправителя) КАК уатГрузыКПеревозке_уэОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	уатГрузыКПеревозке_уэОбороты.Регистратор КАК МаршрутныйЛист
		|ИЗ
		|	РегистрНакопления.уатГрузыКПеревозке_уэ.Обороты(, , Регистратор, ЗаказГрузоотправителя = &ЗаказГрузоотправителя) КАК уатГрузыКПеревозке_уэОбороты
		|ГДЕ
		|	уатГрузыКПеревозке_уэОбороты.Регистратор ССЫЛКА Документ.уатМаршрутныйЛист");
		Запрос.УстановитьПараметр("ЗаказГрузоотправителя", ДанныеСтроки.ЗаказНаТС);
		РезЗапроса = Запрос.ВыполнитьПакет();
		
		Если РезЗапроса[0].Пустой() Тогда //остатков по заказу нет
			Если РезЗапроса[1].Пустой() Тогда //остатков то нет, но и не было вообще движений
				Если ЗначениеЗаполнено(ДанныеСтроки.ЗаказНаТС) Тогда
					ТекстСообщОшибка = СтрШаблон("Авторасчет даты платежа не выполнен: ""%1"" не проведен, отстутствуют движения по регистру ""Заказы грузоотправителей"".", ДанныеСтроки.ЗаказНаТС);
					Если мсвСообщенияОбОшибках.Найти(ТекстСообщОшибка) = Неопределено Тогда
						мсвСообщенияОбОшибках.Добавить(ТекстСообщОшибка);
					КонецЕсли;
				КонецЕсли;
			Иначе //здесь всё хорошо - и остатков нет, и движения по расходу есть - заказ выполнен
				Выборка = РезЗапроса[1].Выбрать();
				Выборка.Следующий();
				
				Рез.ДатаСобытия = НачалоДня(Выборка.ДатаДоставки);
			КонецЕсли;
		Иначе
			Если РезЗапроса[2].Пустой() Тогда // весь груз размещен в МЛ
				Выборка = РезЗапроса[3].Выбрать();
				Если Выборка.Следующий() Тогда
					ТекстСообщОшибка = СтрШаблон("Авторасчет даты платежа не выполнен: ""%1"" по ""%2"" не выполнен.", Выборка.МаршрутныйЛист, ДанныеСтроки.ЗаказНаТС);
				Иначе
					ТекстСообщОшибка = СтрШаблон("Авторасчет даты платежа не выполнен: ""%1"" не размещен в Маршрутном листе.", ДанныеСтроки.ЗаказНаТС);
				КонецЕсли;
			Иначе
				ТекстСообщОшибка = СтрШаблон("Авторасчет даты платежа не выполнен: ""%1"" не размещен в Маршрутном листе или размещен не полностью.", ДанныеСтроки.ЗаказНаТС);
			КонецЕсли;
			Если мсвСообщенияОбОшибках.Найти(ТекстСообщОшибка) = Неопределено Тогда
				мсвСообщенияОбОшибках.Добавить(ТекстСообщОшибка);
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ДанныеСтроки.ЭтапОплаты.ВариантОтсчета
		= Перечисления.уатВариантыОтсчетаДатыПлатежа.ПослеПолученияСопроводительныхДокументов
		И ЗначениеЗаполнено(ДанныеСтроки.ЭтапОплаты.ВидСопроводительногоДокумента) Тогда //получение СД
		
		// Для Взаимозачета, если в заказ кредитора выбрана заказ дебитора, то СД ищем по владельцу дебитору,
		// а не кредитору, т.к. крайне маловероятно добавление в заказ дебитора нового СД по владельцу кредитору
		ТекВладелецСД = ДанныеСтроки.ДоговорКонтрагента.Владелец;
		Если ТипЗнч(ДанныеСтроки.Регистратор) = Тип("ДокументСсылка.уатВзаимозачет") Тогда
			СтрокаПоиск = ДанныеСтроки.Регистратор.Состав.Найти(ДанныеСтроки.ДоговорКонтрагента, "ДоговорКредитора");
			Если СтрокаПоиск <> Неопределено И СтрокаПоиск.СделкаДебитора = СтрокаПоиск.СделкаКредитора Тогда
				ТекВладелецСД = ДанныеСтроки.Регистратор.Дебитор;
			КонецЕсли;
		КонецЕсли;
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	уатСтатусыСопроводительныхДокументовСрезПоследних.Период КАК Период
		|ИЗ
		|	РегистрСведений.уатСтатусыСопроводительныхДокументов.СрезПоследних(
		|			,
		|			(СопроводительныйДокумент.Основание = &ЗаказНаТС
		|				ИЛИ СопроводительныйДокумент.Основание В (&мсвМЛ))
		|				И СопроводительныйДокумент.ВладелецДокумента = &Контрагент
		|				И СопроводительныйДокумент.ВидДокумента = &ВидДокумента) КАК уатСтатусыСопроводительныхДокументовСрезПоследних
		|ГДЕ
		|	уатСтатусыСопроводительныхДокументовСрезПоследних.Статус <> ЗНАЧЕНИЕ(Справочник.уатСтатусы_уэ.ОбработкаЗавершена)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(уатСтатусыСопроводительныхДокументовСрезПоследних.Период) КАК Период
		|ИЗ
		|	РегистрСведений.уатСтатусыСопроводительныхДокументов.СрезПоследних(
		|			,
		|			(СопроводительныйДокумент.Основание = &ЗаказНаТС
		|				ИЛИ СопроводительныйДокумент.Основание В (&мсвМЛ))
		|				И СопроводительныйДокумент.ВладелецДокумента = &Контрагент
		|				И СопроводительныйДокумент.ВидДокумента = &ВидДокумента) КАК уатСтатусыСопроводительныхДокументовСрезПоследних");
		Запрос.УстановитьПараметр("ЗаказНаТС",    ДанныеСтроки.ЗаказНаТС);
		Запрос.УстановитьПараметр("мсвМЛ",        уатОбщегоНазначения_проф.ПолучитьМЛдляЗаказаНаТС(ДанныеСтроки.ЗаказНаТС));
		Запрос.УстановитьПараметр("Контрагент",   ТекВладелецСД);
		Запрос.УстановитьПараметр("ВидДокумента", ДанныеСтроки.ЭтапОплаты.ВидСопроводительногоДокумента);
		Результат = Запрос.ВыполнитьПакет();
		
		Если Результат[0].Пустой() Тогда // нет необработанных СД
			Если НЕ Результат[1].Пустой() Тогда
				Выборка = Результат[1].Выбрать();
				Выборка.Следующий();
				Если Выборка.Период <> NULL Тогда // обработка всех СД завершена
					Рез.ДатаСобытия = НачалоДня(Выборка.Период);
				Иначе
					ТекстСообщОшибка = СтрШаблон("Авторасчет даты платежа не выполнен: для ""%1"" не обнаружен сопр. документ вида ""%2"" по владельцу ""%3"".",
						ДанныеСтроки.ЗаказНаТС, ДанныеСтроки.ЭтапОплаты.ВидСопроводительногоДокумента, ТекВладелецСД);
					Если мсвСообщенияОбОшибках.Найти(ТекстСообщОшибка) = Неопределено Тогда
						мсвСообщенияОбОшибках.Добавить(ТекстСообщОшибка);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		Иначе // есть необработанные СД
			ТекстСообщОшибка = СтрШаблон("Авторасчет даты платежа не выполнен: для ""%1"" не завершена обработка сопр. документа вида ""%2"" по владельцу ""%3"".",
				ДанныеСтроки.ЗаказНаТС, ДанныеСтроки.ЭтапОплаты.ВидСопроводительногоДокумента, ТекВладелецСД);
			Если мсвСообщенияОбОшибках.Найти(ТекстСообщОшибка) = Неопределено Тогда
				мсвСообщенияОбОшибках.Добавить(ТекстСообщОшибка);
			КонецЕсли;
		КонецЕсли;
		
	// дата отправки комплекта СД в накладных и счетах
	ИначеЕсли ДанныеСтроки.ЭтапОплаты.ВариантОтсчета
		= Перечисления.уатВариантыОтсчетаДатыПлатежа.ПослеОтправкиКомплектаСопроводительныхДокументов Тогда
		
		Если ЗначениеЗаполнено(ДанныеСтроки.ЗаказНаТС) Тогда
			Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	уатПоступлениеТоваровУслуг.ДатаОтправкиСД КАК ДатаОтправкиСД
			|ПОМЕСТИТЬ втДокументы
			|ИЗ
			|	Документ.уатПоступлениеТоваровУслуг КАК уатПоступлениеТоваровУслуг
			|ГДЕ
			|	уатПоступлениеТоваровУслуг.Проведен
			|	И уатПоступлениеТоваровУслуг.ДатаОтправкиСД <> ДАТАВРЕМЯ(1, 1, 1)
			|	И уатПоступлениеТоваровУслуг.Услуги.ЗаказНаТС = &ЗаказНаТС
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	уатРеализацияУслуг.ДатаОтправкиСД
			|ИЗ
			|	Документ.уатРеализацияУслуг КАК уатРеализацияУслуг
			|ГДЕ
			|	уатРеализацияУслуг.Ссылка.Проведен
			|	И уатРеализацияУслуг.Ссылка.ДатаОтправкиСД <> ДАТАВРЕМЯ(1, 1, 1)
			|	И уатРеализацияУслуг.Услуги.Заказ = &ЗаказНаТС
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	уатСчетНаОплатуПокупателю.ДатаОтправкиСД
			|ИЗ
			|	Документ.уатСчетНаОплатуПокупателю КАК уатСчетНаОплатуПокупателю
			|ГДЕ
			|	НЕ уатСчетНаОплатуПокупателю.ПометкаУдаления
			|	И уатСчетНаОплатуПокупателю.ДатаОтправкиСД <> ДАТАВРЕМЯ(1, 1, 1)
			|	И уатСчетНаОплатуПокупателю.Услуги.Заказ = &ЗаказНаТС
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	уатСчетНаОплатуПоставщика.ДатаОтправкиСД
			|ИЗ
			|	Документ.уатСчетНаОплатуПоставщика КАК уатСчетНаОплатуПоставщика
			|ГДЕ
			|	НЕ уатСчетНаОплатуПоставщика.ПометкаУдаления
			|	И уатСчетНаОплатуПоставщика.ДатаОтправкиСД <> ДАТАВРЕМЯ(1, 1, 1)
			|	И уатСчетНаОплатуПоставщика.Услуги.ЗаказНаТС = &ЗаказНаТС
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	МИНИМУМ(втДокументы.ДатаОтправкиСД) КАК ДатаОтправкиСД
			|ИЗ
			|	втДокументы КАК втДокументы");
			Запрос.УстановитьПараметр("ЗаказНаТС", ДанныеСтроки.ЗаказНаТС);
			ВыборкаДатаОтправкиСД = Запрос.Выполнить().Выбрать();
			Если ВыборкаДатаОтправкиСД.Следующий() Тогда
				Рез.ДатаСобытия = ВыборкаДатаОтправкиСД.ДатаОтправкиСД;
			КонецЕсли;
		ИначеЕсли ДанныеСтроки.Регистратор.Метаданные().Реквизиты.Найти("ДатаОтправкиСД") <> Неопределено Тогда
			Рез.ДатаСобытия = ДанныеСтроки.Регистратор.ДатаОтправкиСД;
		КонецЕсли;
		
	ИначеЕсли ДанныеСтроки.ЭтапОплаты.ВариантОтсчета
		= Перечисления.уатВариантыОтсчетаДатыПлатежа.ПослеДатыДокумента Тогда // дата документа
		Рез.ДатаСобытия = ДанныеСтроки.Сделка.Дата;
		
	ИначеЕсли ДанныеСтроки.ЭтапОплаты.ВариантОтсчета
		= Перечисления.уатВариантыОтсчетаДатыПлатежа.ПослеДатыОказанияУслуги
		И (ТипЗнч(ДанныеСтроки.Сделка) = Тип("ДокументСсылка.уатПоступлениеТоваровУслуг")
		ИЛИ ТипЗнч(ДанныеСтроки.Сделка) = Тип("ДокументСсылка.уатСчетНаОплатуПоставщика")
		ИЛИ ТипЗнч(ДанныеСтроки.Сделка) = Тип("ДокументСсылка.уатРемонтныйЛист")) Тогда // дата входящего документа
		Рез.ДатаСобытия = ДанныеСтроки.Сделка.ДатаВходящегоДокумента;
		
	ИначеЕсли ДанныеСтроки.ЭтапОплаты.ВариантОтсчета
		= Перечисления.уатВариантыОтсчетаДатыПлатежа.ПослеВыполненияРемонта Тогда // дата окончания ремонта по рем. листу
		РемЛист = Неопределено;
		Если ТипЗнч(ДанныеСтроки.Сделка) = Тип("ДокументСсылка.уатРемонтныйЛист") Тогда
			РемЛист = ДанныеСтроки.Сделка;
		ИначеЕсли ТипЗнч(ДанныеСтроки.Сделка) = Тип("ДокументСсылка.уатСчетНаОплатуПоставщика") Тогда
			РемЛист = НайтиРемонтныйЛистПоСчетуНаОплатуПоставщика(ДанныеСтроки.Сделка);
		КонецЕсли;
		Если ЗначениеЗаполнено(РемЛист) Тогда
			Рез.ДатаСобытия = РемЛист.ДатаОкончания;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Рез.ДатаСобытия) Тогда
		Если НЕ ЗначениеЗаполнено(ДанныеСтроки.ЭтапОплаты.ПроизводственныйКалендарь) Тогда //календарные дни
			Если флДоСобытия Тогда
				Рез.ДатаПлатежа = Рез.ДатаСобытия - ДанныеСтроки.ЭтапОплаты.Срок * 24 * 3600;
			Иначе
				Рез.ДатаПлатежа = Рез.ДатаСобытия + ДанныеСтроки.ЭтапОплаты.Срок * 24 * 3600;
			КонецЕсли;
		Иначе // рабочие дни по календарю
			Если флДоСобытия Тогда
				Запрос = Новый Запрос(
				"ВЫБРАТЬ ПЕРВЫЕ 11
				|	ДанныеПроизводственногоКалендаря.Дата КАК Дата
				|ИЗ
				|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
				|ГДЕ
				|	(ДанныеПроизводственногоКалендаря.ВидДня = &ВидДня1
				|			ИЛИ ДанныеПроизводственногоКалендаря.ВидДня = &ВидДня2)
				|	И ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь = &ПроизводственныйКалендарь
				|	И ДанныеПроизводственногоКалендаря.Дата < &ДатаОтправкиЗаказа
				|
				|УПОРЯДОЧИТЬ ПО
				|	Дата УБЫВ");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "11", ДанныеСтроки.ЭтапОплаты.Срок);
				
				Запрос.УстановитьПараметр("ВидДня1", Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий);
				Запрос.УстановитьПараметр("ВидДня2", Перечисления.ВидыДнейПроизводственногоКалендаря.Предпраздничный);
				Запрос.УстановитьПараметр("ПроизводственныйКалендарь", ДанныеСтроки.ЭтапОплаты.ПроизводственныйКалендарь);
				Запрос.УстановитьПараметр("ДатаОтправкиЗаказа", НачалоДня(Рез.ДатаСобытия));
				
				тблВыборка = Запрос.Выполнить().Выгрузить();
				Если тблВыборка.Количество() = 0 Тогда
					ТекстСообщОшибка = СтрШаблон("Не заполнен производственный календарь %1 за %2 год.",
						ДанныеСтроки.ЭтапОплаты.ПроизводственныйКалендарь, Формат(Рез.ДатаСобытия, "ДФ=yyyy"));
					Если мсвСообщенияОбОшибках.Найти(ТекстСообщОшибка) = Неопределено Тогда
						мсвСообщенияОбОшибках.Добавить(ТекстСообщОшибка);
					КонецЕсли;
					
					Рез.ДатаПлатежа = Рез.ДатаСобытия;
				Иначе
					Рез.ДатаПлатежа = тблВыборка[тблВыборка.Количество()-1].Дата;
				КонецЕсли;
			Иначе 
				Рез.ДатаПлатежа = КалендарныеГрафики.ДатаПоКалендарю(ДанныеСтроки.ЭтапОплаты.ПроизводственныйКалендарь,
					Рез.ДатаСобытия, ДанныеСтроки.ЭтапОплаты.Срок);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	// Рез.ДнейОтсрочки = (Рез.ДатаПлатежа - Рез.ДатаДоставки) / (3600*24);
	Если флДоСобытия Тогда
		Рез.ДнейОтсрочки = -ДанныеСтроки.ЭтапОплаты.Срок;
	Иначе
		Рез.ДнейОтсрочки = ДанныеСтроки.ЭтапОплаты.Срок;
	КонецЕсли;
	
	Возврат Рез;
КонецФункции

// Функция - Получить таблицу платежа
//
// Параметры:
//  ТекНакладная	 - 	 - 
//  ПараметрыПлатежа - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьТаблицуПлатежа(ДанныеСтроки, ПараметрыПлатежа)
	ТаблицаДатаПлатежа = Новый ТаблицаЗначений;
	ТаблицаДатаПлатежа.Колонки.Добавить("Период");
	ТаблицаДатаПлатежа.Колонки.Добавить("Регистратор");
	ТаблицаДатаПлатежа.Колонки.Добавить("Контрагент");
	ТаблицаДатаПлатежа.Колонки.Добавить("ДоговорКонтрагента");
	ТаблицаДатаПлатежа.Колонки.Добавить("Валюта");
	ТаблицаДатаПлатежа.Колонки.Добавить("ЗаказНаТС");
	ТаблицаДатаПлатежа.Колонки.Добавить("Сделка");
	ТаблицаДатаПлатежа.Колонки.Добавить("ПолучательУслуг");
	ТаблицаДатаПлатежа.Колонки.Добавить("ДатаПлатежа");
	ТаблицаДатаПлатежа.Колонки.Добавить("ДатаПлатежаПредварительная");
	ТаблицаДатаПлатежа.Колонки.Добавить("ДнейОтсрочки");
	ТаблицаДатаПлатежа.Колонки.Добавить("СуммаПлатежа");
	ТаблицаДатаПлатежа.Колонки.Добавить("СуммаПлатежаУпр");
	ТаблицаДатаПлатежа.Колонки.Добавить("УказанаВручную");
	ТаблицаДатаПлатежа.Колонки.Добавить("ЭтапОплаты");
	
	ДатаПлатежаРегистратора = Неопределено;
	Если ДанныеСтроки.Регистратор.Метаданные().Реквизиты.Найти("ДатаПлатежа") <> Неопределено
		И ЗначениеЗаполнено(ДанныеСтроки.Регистратор.ДатаПлатежа)
		И ДанныеСтроки.ЭтапОплаты.ВариантОтсчета = Перечисления.уатВариантыОтсчетаДатыПлатежа.ПроизвольнаяДата Тогда
		ДатаПлатежаРегистратора = ДанныеСтроки.Регистратор.ДатаПлатежа;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДатаПлатежаРегистратора)
		ИЛИ ЗначениеЗаполнено(ПараметрыПлатежа.ДатаПлатежа)
		ИЛИ ЗначениеЗаполнено(ПараметрыПлатежа.ДатаПлатежаПредварительная) Тогда
		
		НоваяСтрока = ТаблицаДатаПлатежа.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеСтроки);
		
		НоваяСтрока.СуммаПлатежа    = ДанныеСтроки.СуммаПриход;
		НоваяСтрока.СуммаПлатежаУпр = ДанныеСтроки.СуммаПриходУпр;
		
		Если ЗначениеЗаполнено(ДатаПлатежаРегистратора) Тогда //в документе заполнена дата платежа, значит берем её, а не рассчитываем по параметрам договора
			НоваяСтрока.УказанаВручную = Истина;
			НоваяСтрока.ДатаПлатежа = ДанныеСтроки.Регистратор.ДатаПлатежа;
			Если ЗначениеЗаполнено(ПараметрыПлатежа.ДатаСобытия) Тогда //при этом отсрочку все равно считаем
				НоваяСтрока.ДнейОтсрочки = (НачалоДня(ДанныеСтроки.Регистратор.ДатаПлатежа) - НачалоДня(ПараметрыПлатежа.ДатаСобытия))/3600/24;
			Иначе
				НоваяСтрока.ДнейОтсрочки = 0;
			КонецЕсли;
		Иначе
			// расчетная дата платежа - по параметрам договора
			НоваяСтрока.УказанаВручную = Ложь;
			НоваяСтрока.ДатаПлатежа  = ПараметрыПлатежа.ДатаПлатежа;
			НоваяСтрока.ДнейОтсрочки = ПараметрыПлатежа.ДнейОтсрочки;
		КонецЕсли;
		
		НоваяСтрока.ДатаПлатежаПредварительная = ПараметрыПлатежа.ДатаПлатежаПредварительная;
	КонецЕсли;
		
	Возврат ТаблицаДатаПлатежа;
КонецФункции

Процедура ДобавитьЗаписиДатыПлатежей(ДанныеСтроки, ПараметрыПлатежа)
	
	
	НЗ = РегистрыСведений.уатДатыПлатежей.СоздатьНаборЗаписей();
	НЗ.Заполнить(Неопределено);
	НЗ.Отбор.Регистратор.Установить(ДанныеСтроки.Регистратор);
	НЗ.Прочитать();
	
	// Добавление новой записи по входящим Накладной и Заказу на ТС
	ТаблицаДатаПлатежа = ПолучитьТаблицуПлатежа(ДанныеСтроки, ПараметрыПлатежа);
	Если ТаблицаДатаПлатежа <> Неопределено Тогда
		Для Каждого ТекСтрока Из ТаблицаДатаПлатежа Цикл
			НоваяЗапись = НЗ.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, ТекСтрока);
		КонецЦикла;
	КонецЕсли;
	
	НЗ.Записать();
	
КонецПроцедуры

Процедура УдалитьЗаписиДатыПлатежей(мсвНакладные, ЗаказНаТС)
	
	Для Каждого ТекНакладная Из мсвНакладные Цикл
		НЗ = РегистрыСведений.уатДатыПлатежей.СоздатьНаборЗаписей();
		НЗ.Заполнить(Неопределено);
		НЗ.Отбор.Регистратор.Установить(ТекНакладная.Регистратор);
		НЗ.Прочитать();
		
		// Удаление записей регистра по входящей Сделке
		// Записи регистра по этой накладной, но по другим заказам на ТС, не изменяются
		мсвЗаписейУдалить = Новый Массив;
		Для Каждого ТекЗапись Из НЗ Цикл
			Если ТекЗапись.ЗаказНаТС = ЗаказНаТС Тогда
				мсвЗаписейУдалить.Добавить(ТекЗапись);
			КонецЕсли;
		КонецЦикла;
		Для Каждого ТекЗаписьУдалить Из мсвЗаписейУдалить Цикл
			НЗ.Удалить(ТекЗаписьУдалить);
		КонецЦикла;
	
		НЗ.Записать();
	КонецЦикла;
	
КонецПроцедуры

Функция НайтиРемонтныйЛистПоСчетуНаОплатуПоставщика(СчетНаОплату) Экспорт
	РемЛист = Неопределено;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	уатРемонтныйЛист.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.уатРемонтныйЛист КАК уатРемонтныйЛист
	|ГДЕ
	|	уатРемонтныйЛист.Проведен
	|	И уатРемонтныйЛист.Сделка = &СчетНаОплату");
	Запрос.УстановитьПараметр("СчетНаОплату", СчетНаОплату.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда // в приоритете счет на оплату, указанный в шапке РЛ
		РемЛист = Выборка.Ссылка;
	ИначеЕсли ТипЗнч(СчетНаОплату.ДокументОснование) = Тип("ДокументСсылка.уатРемонтныйЛист") Тогда
		РемЛист = СчетНаОплату.ДокументОснование;
	КонецЕсли;
	
	Возврат РемЛист;
КонецФункции

Процедура ОбновитьПлатежныйКалендарьПриЗаписиДокумента(ДокументОбъект) Экспорт
	
	ИмяДокумента = ДокументОбъект.Метаданные().Имя;
	
	Если СтрНайти("уатЗаказГрузоотправителя, уатПоступлениеТоваровУслуг, уатРеализацияУслуг, уатВзаимозачет",
		ИмяДокумента) <> 0 Тогда
		
		ОбновитьТекущееСостояниеОплатыДокумента(ДокументОбъект);
		УстановитьДатуПлатежа(ДокументОбъект);
		
	ИначеЕсли СтрНайти("уатКорректировкаДолга, уатПлатежноеПоручениеВходящее, уатПлатежноеПоручениеИсходящее, уатПриходныйКассовыйОрдер, уатРасходныйКассовыйОрдер, уатРекламация_уэ",
		ИмяДокумента) <> 0 Тогда
		
		ОбновитьТекущееСостояниеОплатыДокумента(ДокументОбъект);
	
	ИначеЕсли СтрНайти("уатСчетНаОплатуПокупателю, уатСчетНаОплатуПоставщика",
		ИмяДокумента) <> 0 Тогда
		
		ОбновитьТекущееСостояниеОплатыДокумента(ДокументОбъект);
		ОбновитьДвиженияЗаказовПоПлатежномуКалендарю(ДокументОбъект);
		
	ИначеЕсли СтрНайти("уатМаршрутныйЛист, уатЗаказПеревозчику_уэ, уатСтраховойСертификат_уэ",
		ИмяДокумента) <> 0 Тогда
		
		ОбновитьДвиженияЗаказовПоПлатежномуКалендарю(ДокументОбъект);
		
	ИначеЕсли СтрНайти("такАрендаТС", ИмяДокумента) <> 0 Тогда
		ОбновитьТекущееСостояниеОплатыДокумента(ДокументОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СопроводительныеДокументы

Процедура СформироватьТаблицуДатыОбработкиДокументов(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	ТаблицаДатыОбработкиДокументов = Новый ТаблицаЗначений;
	ТаблицаДатыОбработкиДокументов.Колонки.Добавить("Регистратор");
	ТаблицаДатыОбработкиДокументов.Колонки.Добавить("СопроводительныйДокумент");
	ТаблицаДатыОбработкиДокументов.Колонки.Добавить("ПлановаяДатаОбработки");
	ТаблицаДатыОбработкиДокументов.Колонки.Добавить("КоличествоДнейНаОбработку");
	
	// Таблица движений по другим регистраторам:
	// сюда попадают СД из Заказов при проведении МЛ и СД из МЛ при проведении Заказа
	ТаблицаДатыОбработкиДокументовДоп = ТаблицаДатыОбработкиДокументов.Скопировать();
	
	мсвЗаказыИМЛ = Новый Массив;
	мсвЗаказыИМЛ.Добавить(ДокументСсылка);
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.уатЗаказГрузоотправителя") Тогда
		мсвМЛ = уатОбщегоНазначения_проф.ПолучитьМЛдляЗаказаНаТС(ДокументСсылка, Ложь);
		Для Каждого ТекМЛ Из мсвМЛ Цикл
			мсвЗаказыИМЛ.Добавить(ТекМЛ);
		КонецЦикла;
	Иначе
		мсвЗаказы = уатОбщегоНазначения_проф.ПолучитьЗаказыМЛ(ДокументСсылка);
		Для Каждого ТекЗаказ Из мсвЗаказы Цикл
			мсвЗаказыИМЛ.Добавить(ТекЗаказ);
		КонецЦикла;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	уатСопроводительныеДокументы.Ссылка КАК Ссылка,
	|	уатСопроводительныеДокументы.Основание КАК Основание,
	|	уатСопроводительныеДокументы.ВладелецДокумента КАК ВладелецДокумента,
	|	уатСопроводительныеДокументы.ВидДокумента КАК ВидДокумента,
	|	уатСопроводительныеДокументы.ПлановаяДатаОбработкиВручную КАК ПлановаяДатаОбработкиВручную,
	|	уатСопроводительныеДокументы.ПлановаяДатаОбработки КАК ПлановаяДатаОбработки
	|ИЗ
	|	Справочник.уатСопроводительныеДокументы КАК уатСопроводительныеДокументы
	|ГДЕ
	|	НЕ уатСопроводительныеДокументы.ПометкаУдаления
	|	И уатСопроводительныеДокументы.Основание В (&мсвЗаказыИМЛ)");
	Запрос.УстановитьПараметр("мсвЗаказыИМЛ", мсвЗаказыИМЛ);
	Если СтруктураДополнительныеСвойства.Свойство("СопроводительныйДокумент") Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И уатСопроводительныеДокументы.Ссылка = &СД";
		Запрос.УстановитьПараметр("СД", СтруктураДополнительныеСвойства.СопроводительныйДокумент);
	КонецЕсли;
	
	ВыборкаСД = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаСД.Следующий() Цикл
		ПлановаяДата = Неопределено;
		
		Если ВыборкаСД.ПлановаяДатаОбработкиВручную Тогда
			ПлановаяДата = ВыборкаСД.ПлановаяДатаОбработки;
			КоличествоДнейНаОбработку = 0;
			Если НЕ ЗначениеЗаполнено(ПлановаяДата) Тогда
				ТекстСообщОшибка = СтрШаблон(
					"Не установлена дата обработки сопр. документа ""%1"": не указано значение плановой даты обработки в форме сопр. документа.",
					ВыборкаСД.Ссылка);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщОшибка);
				Продолжить;
			КонецЕсли;
		Иначе
			Если ЗначениеЗаполнено(ВыборкаСД.ВладелецДокумента) Тогда // владелец СД указан - это контрагент или перевозчик
				Если ВыборкаСД.ВладелецДокумента = ВыборкаСД.Основание.Контрагент Тогда // заказчик в Заказе ТС или перевозчик в МЛ
					Договор = ВыборкаСД.Основание.ДоговорКонтрагента;
					
					Если НЕ ЗначениеЗаполнено(Договор) Тогда
						ТекстСообщОшибка = СтрШаблон("Не удалось рассчитать дату обработки ""%1"": не указан договор контрагента.",
							ВыборкаСД.Ссылка);
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщОшибка);
						Продолжить;
					КонецЕсли;
				Иначе // контрагент из Расходов (сторонний перевозчик, страховщик и т.д.)
					Договор = Неопределено;
					СтрокаРасходы = ВыборкаСД.Основание.Расходы.Найти(ВыборкаСД.ВладелецДокумента, "Контрагент");
					Если СтрокаРасходы <> Неопределено Тогда
						Договор = СтрокаРасходы.Договор;
					КонецЕсли;
					Если НЕ ЗначениеЗаполнено(Договор) Тогда
						Договор = уатОбщегоНазначенияТиповыеСервер.уатПолучитьДоговорПоОрганизацииИКонтрагенту(
							ВыборкаСД.Основание.Организация, ВыборкаСД.ВладелецДокумента);
					КонецЕсли;
					Если НЕ ЗначениеЗаполнено(Договор) Тогда
						ТекстСообщОшибка = СтрШаблон(
							"Не удалось рассчитать дату обработки ""%1"": не найден договор контрагента ""%2"" для организации ""%3"".",
							ВыборкаСД.Ссылка, ВыборкаСД.ВладелецДокумента, ВыборкаСД.Основание.Организация);
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщОшибка);
						Продолжить;
					КонецЕсли;
				КонецЕсли;
				
				НастройкаПоВидуСД = Договор.ВидыСопроводительныхДокументов.Найти(ВыборкаСД.ВидДокумента, "ВидДокумента");
				Если НастройкаПоВидуСД = Неопределено ИЛИ НЕ ЗначениеЗаполнено(НастройкаПоВидуСД.УсловиеКонтроля) Тогда
					// Okoe: сообщение не выводится для сценария, когда не требуется учет плановых дат обработки СД
					// и настройки по ВидаСД в договоре не используются
					
					// ТекстСообщОшибка = СтрШаблон(
					//	"Не удалось рассчитать дату обработки ""%1"": не указаны настройки для сопроводительного документа вида ""%2"""
					//	" в договоре ""%3""",
					//	ВыборкаСД.Ссылка, ВыборкаСД.ВидДокумента, Договор);
					// ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщОшибка);
					Продолжить;
				КонецЕсли;
				
			Иначе // владелец СД не указан - это наша организация
				НастройкаПоВидуСД = ВыборкаСД.ВидДокумента;
				Если НЕ ЗначениеЗаполнено(НастройкаПоВидуСД.УсловиеКонтроля) Тогда
					// Okoe: сообщение не выводится для сценария, когда не требуется учет плановых дат обработки СД
					// и настройки в ВидеСД не используются
					
					// ТекстСообщОшибка = СтрШаблон(
					//	"Не удалось рассчитать дату обработки ""%1"": не указаны настройки обработки сопроводительного документа
					//  вида ""%2""", ВыборкаСД.Ссылка, ВыборкаСД.ВидДокумента);
					// ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщОшибка);
					Продолжить;
				КонецЕсли;
				
			КонецЕсли;
			
			КоличествоДнейНаОбработку = НастройкаПоВидуСД.КоличествоДнейНаОбработку;
			
			ДатаОтсчета = '00010101';
			Если ТипЗнч(ВыборкаСД.Основание) = Тип("ДокументСсылка.уатЗаказГрузоотправителя") Тогда
				Если НастройкаПоВидуСД.УсловиеКонтроля = Перечисления.уатУсловияКонтроляСопроводительныхДокументов.ПлановаяДатаПоЗаказуНаТС Тогда
					ДатаОтсчета = ВыборкаСД.Основание.ДоставкаС;
				Иначе
					ДатаОтсчета = ПолучитьДатуОтсчетаДляСДПоПервомуЗаказуИлиМЛ(ВыборкаСД.Основание);
					Если НЕ ЗначениеЗаполнено(ДатаОтсчета) Тогда
						ТекстСообщОшибка = СтрШаблон("Не удалось рассчитать дату обработки ""%1"": не выполнен Маршрутный лист по ""%2"".",
							ВыборкаСД.Ссылка, ВыборкаСД.Основание);
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщОшибка);
						Продолжить;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Если НастройкаПоВидуСД.УсловиеКонтроля = Перечисления.уатУсловияКонтроляСопроводительныхДокументов.ФактическаяДатаПоМЛ Тогда
					ДатаОтсчета = ВыборкаСД.Основание.ДатаИВремяВыполнения;
				Иначе
					ДатаОтсчета = ПолучитьДатуОтсчетаДляСДПоПервомуЗаказуИлиМЛ(ВыборкаСД.Основание);
					Если НЕ ЗначениеЗаполнено(ДатаОтсчета) Тогда
						ТекстСообщОшибка = СтрШаблон("Не удалось рассчитать дату обработки ""%1"": Заказ на ТС не указан.", ВыборкаСД.Ссылка);
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщОшибка);
						Продолжить;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Если ДатаОтсчета = '00010101' Тогда
				Если ТипЗнч(ВыборкаСД.Основание) = Тип("ДокументСсылка.уатЗаказГрузоотправителя") Тогда
					ТекстСообщОшибка = СтрШаблон(
						"Не удалось рассчитать дату обработки ""%1"": не указано значение реквизита ""Прибытие с"" в документе ""%2"".",
						ВыборкаСД.Ссылка, ВыборкаСД.Основание);
				Иначе
					ТекстСообщОшибка = СтрШаблон(
						"Не удалось рассчитать дату обработки ""%1"": ""%2"" не выполнен.",
						ВыборкаСД.Ссылка, ВыборкаСД.Основание);
				КонецЕсли;
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщОшибка);
				Продолжить;
			КонецЕсли;
			
			ПлановаяДата = Неопределено;
			Если НастройкаПоВидуСД.СпособРасчетаДней = 0
				ИЛИ НЕ ЗначениеЗаполнено(НастройкаПоВидуСД.ПроизводственныйКалендарь) Тогда //каледарные дни
				ПлановаяДата = ДатаОтсчета + КоличествоДнейНаОбработку * 24 * 3600;
			Иначе //рабочие дни
				Попытка
					ПлановаяДата = КалендарныеГрафики.ДатаПоКалендарю(НастройкаПоВидуСД.ПроизводственныйКалендарь,
						ДатаОтсчета, КоличествоДнейНаОбработку);
				Исключение
					ТекстСообщ = СтрШаблон("Не удалось рассчитать дату обработки ""%1"": %2",
						ВыборкаСД.Ссылка, ИнформацияОбОшибке().Описание);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщ);
				КонецПопытки;		
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПлановаяДата) Тогда
			Если ДокументСсылка = ВыборкаСД.Основание Тогда
				НоваяСтрока = ТаблицаДатыОбработкиДокументов.Добавить();
			Иначе
				НоваяСтрока = ТаблицаДатыОбработкиДокументовДоп.Добавить();
			КонецЕсли;
			
			НоваяСтрока.Регистратор               = ВыборкаСД.Основание;
			НоваяСтрока.СопроводительныйДокумент  = ВыборкаСД.Ссылка;
			НоваяСтрока.ПлановаяДатаОбработки     = ПлановаяДата;
			НоваяСтрока.КоличествоДнейНаОбработку = КоличествоДнейНаОбработку;
		КонецЕсли;
	КонецЦикла;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДатыОбработкиДокументов", ТаблицаДатыОбработкиДокументов);
	СтруктураДополнительныеСвойства.Вставить("ТаблицаДатыОбработкиДокументовДоп", ТаблицаДатыОбработкиДокументовДоп);
КонецПроцедуры

Функция ПолучитьДатуОтсчетаДляСДПоПервомуЗаказуИлиМЛ(ДокументСсылка) Экспорт
	ДатаОтсчета = '00010101';
	
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.уатМаршрутныйЛист") Тогда
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	МИНИМУМ(уатМаршрутныйЛистЗаказы.ЗаказГрузоотправителя.ДоставкаС) КАК ДатаОтсчета
		|ИЗ
		|	Документ.уатМаршрутныйЛист.Заказы КАК уатМаршрутныйЛистЗаказы
		|ГДЕ
		|	уатМаршрутныйЛистЗаказы.Ссылка = &Ссылка
		|	И НЕ уатМаршрутныйЛистЗаказы.ЗаказГрузоотправителя.ПометкаУдаления");
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ДатаОтсчета = Выборка.ДатаОтсчета;
		КонецЕсли;
	Иначе
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	МАКСИМУМ(уатМаршрутныйЛист.ДатаИВремяВыполнения) КАК ДатаОтсчета
		|ИЗ
		|	Документ.уатМаршрутныйЛист КАК уатМаршрутныйЛист
		|ГДЕ
		|	уатМаршрутныйЛист.Заказы.ЗаказГрузоотправителя = &Ссылка
		|	И НЕ уатМаршрутныйЛист.ПометкаУдаления");
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ДатаОтсчета = Выборка.ДатаОтсчета;
		КонецЕсли;				
	КонецЕсли;
	
	Возврат ДатаОтсчета;
КонецФункции
					
#КонецОбласти

#КонецОбласти
