
#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаписатьУдалениеОбъектаXDTO(КомпонентыОбмена, Ссылка, ТипСсылкиXDTO) Экспорт
	
	Если ТипСсылкиXDTO.Имя = "ДокументСсылка.ПередачаМатериаловВПроизводство" Тогда
		ВидОбъекта = Перечисления.уатВидыОбъектовУниверсальногоФормата.Документ_ПередачаМатериаловВПроизводство;
	ИначеЕсли ТипСсылкиXDTO.Имя = "ДокументСсылка.АвансовыйОтчет" Тогда
		ВидОбъекта = Перечисления.уатВидыОбъектовУниверсальногоФормата.Документ_АвансовыйОтчет;
	ИначеЕсли ТипСсылкиXDTO.Имя = "ДокументСсылка.ПередачаМатериаловВЭксплуатацию" Тогда
		ВидОбъекта = Перечисления.уатВидыОбъектовУниверсальногоФормата.Документ_ПередачаМатериаловВЭксплуатацию;
	ИначеЕсли ТипСсылкиXDTO.Имя = "ДокументСсылка.ПеремещениеТоваров" Тогда
		ВидОбъекта = Перечисления.уатВидыОбъектовУниверсальногоФормата.Документ_ПеремещениеТоваров;
	ИначеЕсли ТипСсылкиXDTO.Имя = "ДокументСсылка.ПоступлениеТоваровУслуг" Тогда
		ВидОбъекта = Перечисления.уатВидыОбъектовУниверсальногоФормата.Документ_ПоступлениеТоваровУслуг;
	ИначеЕсли ТипСсылкиXDTO.Имя = "ДокументСсылка.ОтражениеЗарплатыВФинансовомУчете" Тогда
		ВидОбъекта = Перечисления.уатВидыОбъектовУниверсальногоФормата.Документ_ОтражениеЗарплатыВФинансовомУчете;
	ИначеЕсли ТипСсылкиXDTO.Имя = "ДокументСсылка.ВыработкаСотрудников" Тогда
		ВидОбъекта = Перечисления.уатВидыОбъектовУниверсальногоФормата.Документ_ВыработкаСотрудников;
	ИначеЕсли ТипСсылкиXDTO.Имя = "ДокументСсылка.СписаниеЗапасов" Тогда
		ВидОбъекта = Перечисления.уатВидыОбъектовУниверсальногоФормата.Документ_СписаниеЗапасов;
	ИначеЕсли ТипСсылкиXDTO.Имя = "ДокументСсылка.ВозвратТоваровПоставщику" Тогда
		ВидОбъекта = Перечисления.уатВидыОбъектовУниверсальногоФормата.Документ_ВозвратТоваровПоставщику;
	Иначе
		ВидОбъекта = Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатВнешниеИдентификаторыВыгружаемыхОбъектов.ВнешнийИдентификатор КАК ВнешнийИдентификатор
	|ИЗ
	|	РегистрСведений.уатВнешниеИдентификаторыВыгружаемыхОбъектов КАК уатВнешниеИдентификаторыВыгружаемыхОбъектов
	|ГДЕ
	|	уатВнешниеИдентификаторыВыгружаемыхОбъектов.Объект = &Объект
	|	И уатВнешниеИдентификаторыВыгружаемыхОбъектов.ВидОбъекта = &ВидОбъекта");
	Запрос.УстановитьПараметр("Объект", Ссылка);
	Запрос.УстановитьПараметр("ВидОбъекта", ВидОбъекта);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		УИДОбъектаXDTO = РегистрыСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов.ПубличныйИдентификаторПоСсылкеОбъекта(
			КомпонентыОбмена.УзелКорреспондента, Ссылка);
		ЗаписатьУдалениеОбъектаXDTOПоИдентификатору(КомпонентыОбмена, УИДОбъектаXDTO, ТипСсылкиXDTO);
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			УИДОбъектаXDTO = СокрЛП(Выборка.ВнешнийИдентификатор);
			ЗаписатьУдалениеОбъектаXDTOПоИдентификатору(КомпонентыОбмена, УИДОбъектаXDTO, ТипСсылкиXDTO);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Копия процедуры ОбменДаннымиXDTOСервер.ЗаписатьУдалениеОбъектаXDTO,
// но вместо ссылки на объект используется его GUID
//
Процедура ЗаписатьУдалениеОбъектаXDTOПоИдентификатору(КомпонентыОбмена, УИДОбъектаXDTO, ТипСсылкиXDTO)
	
	Если Не ЗначениеЗаполнено(УИДОбъектаXDTO) Тогда
		Возврат;
	КонецЕсли;
	
	XMLСхема = КомпонентыОбмена.XMLСхема;
	ТипXDTO  = ФабрикаXDTO.Тип(XMLСхема, "УдалениеОбъекта");
	
	Для Каждого Свойство Из ТипXDTO.Свойства[0].Тип.Свойства[0].Тип.Свойства Цикл
		Если Свойство.Тип = ТипСсылкиXDTO Тогда
			
			ЗначениеXDTOЛюбаяСсылка = ФабрикаXDTO.Создать(Свойство.Тип, УИДОбъектаXDTO);
			
			СсылкаНаОбъект = ФабрикаXDTO.Создать(ТипXDTO.Свойства[0].Тип.Свойства[0].Тип); // ОбъектXDTO
			СсылкаНаОбъект.Установить(Свойство, ЗначениеXDTOЛюбаяСсылка);
			
			ЛюбаяСсылкаОбъект = ФабрикаXDTO.Создать(ТипXDTO.Свойства[0].Тип);
			ЛюбаяСсылкаОбъект.СсылкаНаОбъект = СсылкаНаОбъект;
			
			ДанныеXDTO = ФабрикаXDTO.Создать(ТипXDTO); // ОбъектXDTO
			ДанныеXDTO.СсылкаНаОбъект = ФабрикаXDTO.Создать(ТипXDTO.Свойства[0].Тип);
			ДанныеXDTO.Установить(ТипXDTO.Свойства[0], ЛюбаяСсылкаОбъект);
			ФабрикаXDTO.ЗаписатьXML(КомпонентыОбмена.ФайлОбмена, ДанныеXDTO);
			Прервать;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти