#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает найденную должность по наиенованию или создает новую
//
Функция ПолучитьСоздатьДолжность(Должность) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Параметры.Вставить("Должность", Должность);
	ТекстЗапроса = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Должности.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Должности КАК Должности
	|ГДЕ
	|	Должности.Наименование = &Должность";
	
	Запрос.Текст = ТекстЗапроса;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		ДолжностьСсылка = Выборка.Ссылка;
		
	Иначе
		ДолжностьОбъект = Справочники.Должности.СоздатьЭлемент();
		ДолжностьОбъект.Наименование = Должность;
		Попытка
			ДолжностьОбъект.Записать();
			ДолжностьСсылка = ДолжностьОбъект.Ссылка;
		Исключение
			ДолжностьСсылка = Неопределено;
		КонецПопытки;
	КонецЕсли;
	Возврат ДолжностьСсылка
КонецФункции

#КонецОбласти

#КонецЕсли