#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтруктураНастроек = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить("уатПодборНоменклатуры", );
	Если СтруктураНастроек <> Неопределено Тогда
		Если СтруктураНастроек.Свойство("ЗапрашиватьКоличество")
			И СтруктураНастроек.ЗапрашиватьКоличество Тогда
			ЗапрашиватьКоличество = Истина;
		КонецЕсли;
		Если СтруктураНастроек.Свойство("ЗапрашиватьЦену")
			И СтруктураНастроек.ЗапрашиватьЦену Тогда
			ЗапрашиватьЦену = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Элементы.ЗапрашиватьЦену.Доступность 		= ?(Параметры.Свойство("ЕстьЦена"), Параметры.ЕстьЦена, Ложь);
	Элементы.ЗапрашиватьКоличество.Доступность 	= ?(Параметры.Свойство("ЕстьКоличество"), Параметры.ЕстьКоличество, Истина);
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПрименитьНастройки(Команда)
	
	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("ЗапрашиватьКоличество", ЗапрашиватьКоличество);
	ПараметрыЗакрытия.Вставить("ЗапрашиватьЦену"      , ЗапрашиватьЦену);
	
	ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекСохранить("уатПодборНоменклатуры", , ПараметрыЗакрытия);
	
	Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры

#КонецОбласти
