
#Область СлужебныйПрограммныйИнтерфейс

Процедура ВыполнитьМаршрутизациюАлгоритмомОчередей(АдресВрХранилища, Заказы, ЗаказыПоКоординатам, мсвТС, мсвВиртТС, АдресДепо, 
		НастройкаКластеризации, РежимОптимизации, ОграничениеЧасов=0, ОграничениеПоРасстоянию=0, МаксимальноеКоличествоЗаказовТС=0,
		МаксимальноеЧислоПунктов=0, ВремяВыезда='00010101000000', СжиматьЗаказы=Ложь, АлгоритмМаршрутизации=0, ИндивидуальныйГаражТС=Ложь,
		ВозвратВГаражСобственныеТС=Ложь, ВозвратВГаражПривлеченныеТС=Ложь, ВозвратВГаражВиртуальныеТС=Ложь, УчитыватьОграниченияПоЗагрузкеТС=Ложь,
		ПараметрыСжатия=Неопределено, УчитыватьОкнаПоЗаказам=Ложь, УчитыватьРазрешенныеТипыТС=Ложь, РежимВремениВыездаИзГаража=0, ПараметрРазмераЗаказа=0,
		ПриоритетыМаршрутизации=Неопределено, ИспользоватьВПриоритетеСобственныйТранспорт=Ложь, УчитыватьНаправленияПеревозки=Ложь,
		ИспользоватьХарактеристикиЗаказовНаТС=Ложь) Экспорт
	
	Если АлгоритмМаршрутизации = 0 Тогда // Балансировки очередей
		ПолучитьРаспределениеЗаказов(АдресВрХранилища, Заказы, ЗаказыПоКоординатам, мсвТС, мсвВиртТС, АдресДепо, 
			НастройкаКластеризации, РежимОптимизации, ОграничениеЧасов, ОграничениеПоРасстоянию, МаксимальноеКоличествоЗаказовТС,
			МаксимальноеЧислоПунктов, ВремяВыезда, СжиматьЗаказы, ИндивидуальныйГаражТС, ВозвратВГаражСобственныеТС,
			ВозвратВГаражПривлеченныеТС, ВозвратВГаражВиртуальныеТС, ПараметрыСжатия, УчитыватьОкнаПоЗаказам,
			УчитыватьРазрешенныеТипыТС, РежимВремениВыездаИзГаража, ПараметрРазмераЗаказа,
			ПриоритетыМаршрутизации, ИспользоватьВПриоритетеСобственныйТранспорт, УчитыватьНаправленияПеревозки,
			ИспользоватьХарактеристикиЗаказовНаТС
		);
	Иначе 
		ВызватьИсключение НСтр("ru = 'Неверный параметр ""АлгоритмМаршрутизации"".'; en = ""Invalid 'RoutingAlgorithm' parameter.""");
	КонецЕсли;
	
КонецПроцедуры

#Область Яндекс

Функция ПолучитьСтруктуруЗапросаMVRP(ДатаПланирования, тблТСдляМаршрутизации, ТаблицаЗаказов, СтруктураНастроекАРМ,
	Склад, тблАдреса, РазрешенныеТСПоЗаказам, МассивГеозон, СоответствиеГеозонПунктов, СоответствиеГеозонТС,
	ТекстОшибки, ПересчетМетрик = Ложь, флПереносДаты = Ложь, СчДобавленныхОбъектов = 0) Экспорт
	
	флRarusVRP    = СтруктураНастроекАРМ.НастройкаАлгоритмМаршрутизации = 4;
	флагСдвигДаты = флПереносДаты; 
	
	// Получаем экпертные настройки
	НастройкиМаршрутизации = уатЗащищенныеФункцииСервер_уэ.ПрочитатьНастройкиВнешнийМаршрутизатор(СтруктураНастроекАРМ.НастройкиВнешнийМаршрутизатор);
	
	// Заполняем параметры склада  
	Структура_depot = ЗаполнитьСтруктуруПараметровСклада(ДатаПланирования, Склад, СтруктураНастроекАРМ, НастройкиМаршрутизации, флагСдвигДаты, СчДобавленныхОбъектов, тблАдреса);
	// Перенесем дату, если требуется
	МассивДат = Новый СписокЗначений;
	Для Каждого ТекЗаказ Из ТаблицаЗаказов Цикл
		МинДата        = Мин(ТекЗаказ.ОтправлениеСДата, ТекЗаказ.ДоставкаСДата);
		ДнейИзменилась = (ДатаПланирования - МинДата) / 60 / 60 / 24;
		
		Если СтруктураНастроекАРМ.НастройкаДействиеСПросроченнымиЗаказами = 0 Тогда
			Если ДнейИзменилась > 0 Тогда 
				// Сдвигаем только минимальную дату (дата планирования)
				ДнейИзмениласьСекунд		 = ДнейИзменилась * 60 *60 *24;
				ТекЗаказ.ОтправлениеСДата	 = ТекЗаказ.ОтправлениеСДата 
				+ ?(МинДата = ТекЗаказ.ОтправлениеСДата, ДнейИзмениласьСекунд, 0);
				ТекЗаказ.ОтправлениеПоДата	 = ТекЗаказ.ОтправлениеПоДата
				+ ?(МинДата = ТекЗаказ.ОтправлениеПоДата, ДнейИзмениласьСекунд, 0);
				ТекЗаказ.ДоставкаСДата		 = ТекЗаказ.ДоставкаСДата
				+ ?(МинДата = ТекЗаказ.ДоставкаСДата, ДнейИзмениласьСекунд, 0);
				ТекЗаказ.ДоставкаПоДата	     = ТекЗаказ.ДоставкаПоДата
				+ ?(МинДата = ТекЗаказ.ДоставкаПоДата, ДнейИзмениласьСекунд, 0);
			КонецЕсли;
		Иначе
			// Перенос на одинаковое число часов для всех временных окон по заказу,
			// Переносятся заказы, у которых "Отправление с" меньше начало дня рабочей даты  
			Если ДнейИзменилась > 0 Тогда
				ДнейИзмениласьСекунд		 = ДнейИзменилась * 60 *60 *24;
				ТекЗаказ.ОтправлениеСДата	 = ТекЗаказ.ОтправлениеСДата + ДнейИзмениласьСекунд;
				ТекЗаказ.ОтправлениеПоДата	 = ТекЗаказ.ОтправлениеПоДата + ДнейИзмениласьСекунд;
				ТекЗаказ.ДоставкаСДата		 = ТекЗаказ.ДоставкаСДата + ДнейИзмениласьСекунд;
				ТекЗаказ.ДоставкаПоДата	     = ТекЗаказ.ДоставкаПоДата + ДнейИзмениласьСекунд;
			КонецЕсли;
		КонецЕсли;
		
		Если МассивДат.НайтиПоЗначению(ТекЗаказ.ОтправлениеСДата) = Неопределено Тогда
			МассивДат.Добавить(ТекЗаказ.ОтправлениеСДата);
		КонецЕсли;
		Если МассивДат.НайтиПоЗначению(ТекЗаказ.ОтправлениеПоДата) = Неопределено Тогда
			МассивДат.Добавить(ТекЗаказ.ОтправлениеПоДата);
		КонецЕсли;
		Если МассивДат.НайтиПоЗначению(ТекЗаказ.ДоставкаСДата) = Неопределено Тогда
			МассивДат.Добавить(ТекЗаказ.ДоставкаСДата);
		КонецЕсли;
		Если МассивДат.НайтиПоЗначению(ТекЗаказ.ДоставкаПоДата) = Неопределено Тогда
			МассивДат.Добавить(ТекЗаказ.ДоставкаПоДата);
		КонецЕсли;
	КонецЦикла;
	
	// Таблица маршрута ТС для пересчета метрик
	Таблицаlocation = Новый ТаблицаЗначений();
	Таблицаlocation.Колонки.Добавить("ТС");
	Таблицаlocation.Колонки.Добавить("МЛ");
	Таблицаlocation.Колонки.Добавить("ДатаПосещения");
	Таблицаlocation.Колонки.Добавить("id");
	
	ТаблицаГруппПунктов = Новый ТаблицаЗначений();
	СоответвиеЗаказов = Новый Соответствие();
	ИспользуемыеГруппыСовместимости = Новый Массив();
	// Заполняем список пунктов назначения
	Массив_locations = ЗаполнитьСписокПунктовНазначение(ДатаПланирования, ТаблицаЗаказов, СтруктураНастроекАРМ, НастройкиМаршрутизации, Таблицаlocation,
	ТаблицаГруппПунктов, флагСдвигДаты, СчДобавленныхОбъектов, тблАдреса, СоответствиеГеозонПунктов, СоответвиеЗаказов, РазрешенныеТСПоЗаказам,
	ИспользуемыеГруппыСовместимости);
	
	// Заполняем параметры Сервиса планирования маршрутов
	Структура_options = ЗаполнитьСтруктуруПараметровСервисаПланированияМаршрутов(ДатаПланирования, СтруктураНастроекАРМ,
	НастройкиМаршрутизации, ТаблицаГруппПунктов, ИспользуемыеГруппыСовместимости, МассивГеозон);
	
	ИспользоватьГруппыБалансировкиМаршрутов = Константы.уатИспользоватьГруппыБалансировкиМаршрутов_уэ.Получить();
	Если ИспользоватьГруппыБалансировкиМаршрутов Тогда
		ГруппыБалансировкиМаршрутов = уатВнешнийМаршрутизаторСервер_уэ.ЗаполнитьГруппыБалансировкиМаршрутов(тблТСдляМаршрутизации);
		
		Если ГруппыБалансировкиМаршрутов.Количество() <> 0 Тогда
			Структура_options.Вставить("balanced_groups", ГруппыБалансировкиМаршрутов);
		КонецЕсли;
	КонецЕсли;
	// Заполняем список транспортных средств, доступных для планирования маршрута.
	Массив_vehicles = Новый Массив();
	
	Для Каждого ТекТС Из тблТСдляМаршрутизации Цикл
		Структура_vehicle = ЗаполнитьСтруктуруТС(ТекТС, СтруктураНастроекАРМ, НастройкиМаршрутизации,
			ТаблицаLocation, Массив_locations, ПересчетМетрик, СчДобавленныхОбъектов, флагСдвигДаты, СоответствиеГеозонТС,
			СоответвиеЗаказов, ДатаПланирования, ИспользоватьГруппыБалансировкиМаршрутов);
		Массив_vehicles.Добавить(Структура_vehicle);
	КонецЦикла;
	
	// Несколько временных окон склада, если курьер выполняет многодневный маршрут
	уатВнешнийМаршрутизаторСервер_уэ.УстановитьНесколькоВременныхОкон(ДатаПланирования, СтруктураНастроекАРМ.НастройкаКоличествоДнейПланирования, 
	флRarusVRP, МассивДат, Структура_depot, Массив_vehicles);   
	
	Если флRarusVRP Тогда
		СтруктураЗапроса = Новый Структура();
		СтруктураЗапроса.Вставить("vehicles",  Массив_vehicles);
		СтруктураЗапроса.Вставить("depot",     Структура_depot);
		СтруктураЗапроса.Вставить("options",   Структура_options);
		СтруктураЗапроса.Вставить("locations", Массив_locations);
	Иначе 
		СтруктураЗапроса = Новый Структура();
		СтруктураЗапроса = уатВнешнийМаршрутизаторСервер_уэ.УстановитьПресеты(НастройкиМаршрутизации, Структура_options, Структура_depot, Массив_vehicles, Массив_locations,, ТекстОшибки, Склад);
		Если СтруктураНастроекАРМ.ТипАвторизации = "OAuth-токен" 
			И МассивГеозон.Количество() <> 0 Тогда
			Массив_zones = уатВнешнийМаршрутизаторСервер_уэ.ЗаполнитьСписокГеозон(МассивГеозон);
			СтруктураЗапроса.Вставить("zones",  Массив_zones);
		КонецЕсли;
	КонецЕсли;
	Возврат СтруктураЗапроса;
КонецФункции

Функция ПолучитьСтруктуруЗапросаSVRP(ДатаПланирования, ТСдляМаршрутизации, ДанныеПоЗаказам, ТаблицаЗаказов, СтруктураНастроекАРМ,
	Склад, тблАдреса, ТекстОшибки, РежимОптимизацииМаршрута = Ложь, СчДобавленныхОбъектов = 0) Экспорт
	
	// Получаем экпертные настройки
	НастройкиМаршрутизации = уатЗащищенныеФункцииСервер_уэ.ПрочитатьНастройкиВнешнийМаршрутизатор(СтруктураНастроекАРМ.НастройкиОптимизацииВнешнийМаршрутизатор);
	
	флRarusVRP = СтруктураНастроекАРМ.НастройкаАлгоритмОптимизации = "RarusVRP"; 

	// Заполняем параметры склада 
	флагСдвигДаты   = Ложь;
	Структура_depot = ЗаполнитьСтруктуруПараметровСклада(ДатаПланирования, Склад, СтруктураНастроекАРМ,
		НастройкиМаршрутизации, флагСдвигДаты, СчДобавленныхОбъектов, тблАдреса, Истина, РежимОптимизацииМаршрута);
		
	ТаблицаГруппПунктов             = Новый ТаблицаЗначений(); 
	СоответвиеЗаказов               = Новый Соответствие();
	ИспользуемыеГруппыСовместимости = Новый Массив();
	СоответствиеГеозонПунктов       = Новый Соответствие;
	РазрешенныеТСПоЗаказам          = Новый Соответствие;
	
	// Таблица маршрута ТС для пересчета метрик
	Таблицаlocation = Новый ТаблицаЗначений();
	Таблицаlocation.Колонки.Добавить("ТС");
	Таблицаlocation.Колонки.Добавить("МЛ");
	Таблицаlocation.Колонки.Добавить("ДатаПосещения");
	Таблицаlocation.Колонки.Добавить("id");
	
	// Заполняем список пунктов назначения  
	СтруктураНастроекАРМ.НастройкаАдресВыезда = Склад;
	
	Массив_locations = ЗаполнитьСписокПунктовНазначение(ДатаПланирования, ТаблицаЗаказов, СтруктураНастроекАРМ, НастройкиМаршрутизации, Таблицаlocation,
		ТаблицаГруппПунктов, флагСдвигДаты, СчДобавленныхОбъектов, тблАдреса, СоответствиеГеозонПунктов, СоответвиеЗаказов, РазрешенныеТСПоЗаказам,
		ИспользуемыеГруппыСовместимости, Истина);
		
	МассивГеозон = Новый Массив();
	// Заполняем параметры Сервиса планирования маршрутов
	Структура_options = ЗаполнитьСтруктуруПараметровСервисаПланированияМаршрутов(ДатаПланирования, СтруктураНастроекАРМ,
		НастройкиМаршрутизации, ТаблицаГруппПунктов, ИспользуемыеГруппыСовместимости, МассивГеозон, Истина, РежимОптимизацииМаршрута); 
		
	СчДобавленныхОбъектов = СчДобавленныхОбъектов + 1;
	
	КоэффициентЗагрузкиКузоваПоВесу   = СтруктураНастроекАРМ.Оптимизация_НастройкаПонижающийКоэффициентЗагрузкиКузоваПоВесу; 
	КоэффициентЗагрузкиКузоваПоОбъему = СтруктураНастроекАРМ.Оптимизация_НастройкаПонижающийКоэффициентЗагрузкиКузоваПоОбъему;
    ВремяВыездаИзГаража               = СтруктураНастроекАРМ.Оптимизация_НастройкаВремяВыездаИзГаража;
	ВремяВыездаТранспортныхСредств    = СтруктураНастроекАРМ.Оптимизация_НастройкаВремяВыездаТранспортныхСредств;
	ВремяВозвратаТранспортныхСредств  = СтруктураНастроекАРМ.Оптимизация_НастройкаВремяВозвратаТранспортныхСредств;
	УчитыватьГаражПриВозвращении      = ДанныеПоЗаказам.УчитыватьГаражВозвращения;
	ГаражВозвращения                  = ДанныеПоЗаказам.ГаражВозвращения;
	
	Массив_vehicles   = Новый Массив();
	Структура_vehicle = Новый Структура();
	Если Не РежимОптимизацииМаршрута Тогда
		ЕстьХарКиВместимости   = Ложь;
		СтруктураВместимостьТС = Новый Структура();
		Если ЗначениеЗаполнено(ТСдляМаршрутизации.Грузоподъемность) Тогда
			СтруктураВместимостьТС.Вставить("weight_kg", ТСдляМаршрутизации.Грузоподъемность);
			ЕстьХарКиВместимости = Истина;
		КонецЕсли; 
		Если ЗначениеЗаполнено(КоэффициентЗагрузкиКузоваПоВесу) 
			ИЛИ ЗначениеЗаполнено(КоэффициентЗагрузкиКузоваПоОбъему) Тогда 
			СтруктураПределыЗагрузкиТС = Новый Структура();
			Если ЗначениеЗаполнено(КоэффициентЗагрузкиКузоваПоВесу) Тогда
				СтруктураПределыЗагрузкиТС.Вставить("weight_perc", КоэффициентЗагрузкиКузоваПоВесу);
			КонецЕсли;
			Если ЗначениеЗаполнено(КоэффициентЗагрузкиКузоваПоОбъему) Тогда
				СтруктураПределыЗагрузкиТС.Вставить("volume_perc", КоэффициентЗагрузкиКузоваПоОбъему);
			КонецЕсли;
			СтруктураВместимостьТС.Вставить("limits", СтруктураПределыЗагрузкиТС);
			ЕстьХарКиВместимости = Истина;
		КонецЕсли;
		ПолезныйРазмерГлубина  = ТСдляМаршрутизации.ОбъемКузова;
		Если ПолезныйРазмерГлубина > 0 Тогда
			Если флRarusVRP Тогда
				СтруктураМетрическиеРазмерыТС = Новый Структура("height_m, width_m, depth_m", 1, 1, ПолезныйРазмерГлубина);
				СтруктураВместимостьТС.Вставить("volume", СтруктураМетрическиеРазмерыТС);
			Иначе
				СтруктураВместимостьТС.Вставить("volume_cbm", ПолезныйРазмерГлубина); 
			КонецЕсли;
			ЕстьХарКиВместимости = Истина;
		КонецЕсли;
		Если ЕстьХарКиВместимости Тогда
			Структура_vehicle.Вставить("capacity", СтруктураВместимостьТС);
		КонецЕсли;

		Структура_vehicle.Вставить("tags",            Новый Массив());
		Если флRarusVRP Тогда
			Структура_vehicle.Вставить("priority", Ложь);
		Иначе
			Структура_vehicle.Вставить("priority", 100);
		КонецЕсли;
		
		Структура_shift = Новый Структура();
		Структура_shift.Вставить("service_duration_s", Структура_depot.service_duration_s);
		Структура_shift.Вставить("penalty",            Новый Структура("out_of_time", Новый Структура("fixed, minute", 1000, 17)));
		Структура_shift.Вставить("id",                 Строка(Новый УникальныйИдентификатор()));
		
		Если ВремяВыездаИзГаража = 1 Тогда 
			СменаС  = ВремяВыездаТранспортныхСредств;
			СменаПо = ?(ВремяВозвратаТранспортныхСредств = '00010101000000', '00010101235959', ВремяВозвратаТранспортныхСредств);
			
			Если СменаПо < СменаС Тогда 
				СменаПо = СменаПо + 86400;
			ИначеЕсли флагСдвигДаты Тогда
				СменаС  = СменаС  + 86400;
				СменаПо = СменаПо + 86400;
			КонецЕсли;
			
			Структура_shift.Вставить(
				"time_window", 
				"" + Строка(День(СменаС) - 1) + "." + Формат(СменаС, "ДФ=HH:mm:ss; ДП=00:00:00") + "-" +
				Строка(День(СменаПо) - 1) + "." + Формат(СменаПо, "ДФ=HH:mm:ss; ДП=00:00:00")
			);
			Структура_shift.Вставить("hard_window", СтруктураНастроекАРМ.Оптимизация_НастройкаУчитыватьОкнаПоЗаказам);
			
		Иначе 
			Структура_shift.Вставить("time_window", "0.00:00:00-1.23:59:59");
			Структура_shift.Вставить("hard_window", СтруктураНастроекАРМ.Оптимизация_НастройкаУчитыватьОкнаПоЗаказам);
		КонецЕсли;
		
		Массив_shifts = Новый Массив();
		Массив_shifts.Добавить(Структура_shift);
		Структура_vehicle.Вставить("shifts", Массив_shifts);
		
		Структура_vehicle.Вставить("cost",                   Новый Структура("fixed, km, hour, location", 3000, 8, 100, 0));
		Структура_vehicle.Вставить("travel_time_multiplier", 1);
		Структура_vehicle.Вставить("excluded_tags",          Новый Массив());
	КонецЕсли;
	Если УчитыватьГаражПриВозвращении
		И ЗначениеЗаполнено(ГаражВозвращения) 
		И ГаражВозвращения <> Склад Тогда 
		ДобавитьЗаездВГараж(Истина, ГаражВозвращения, СтруктураНастроекАРМ, Массив_locations, Структура_vehicle, СчДобавленныхОбъектов, Истина);
		Структура_vehicle.Вставить("return_to_depot", ДанныеПоЗаказам.ЗаездНаСкладПриВозврате);
	Иначе
		Структура_vehicle.Вставить("return_to_depot", УчитыватьГаражПриВозвращении);
	КонецЕсли;
	
	Структура_vehicle.Вставить("ref",             ?(ЗначениеЗаполнено(ТСдляМаршрутизации.ТС), ТСдляМаршрутизации.ТС.Наименование,
		Строка(Новый УникальныйИдентификатор()))); 
		
	Если флRarusVRP Тогда
		Структура_vehicle.Вставить("id",          Строка(СчДобавленныхОбъектов));
	Иначе
		Структура_vehicle.Вставить("id",          СчДобавленныхОбъектов);
	КонецЕсли;
	Массив_vehicles.Добавить(Структура_vehicle);
	
	СчДобавленныхОбъектов = СчДобавленныхОбъектов + 1;
	
	МассивДат = Новый Массив();
	МассивДат.Добавить(ДатаПланирования);
	
	// Несколько временных окон склада, если курьер выполняет многодневный маршрут
	уатВнешнийМаршрутизаторСервер_уэ.УстановитьНесколькоВременныхОкон(ДатаПланирования, 1, 
		флRarusVRP, МассивДат, Структура_depot, Массив_vehicles); 
		
	Если флRarusVRP Тогда
		СтруктураЗапроса = Новый Структура();
		СтруктураЗапроса.Вставить("vehicle",  Массив_vehicles[0]);
		СтруктураЗапроса.Вставить("depot",     Структура_depot);
		СтруктураЗапроса.Вставить("options",   Структура_options);
		СтруктураЗапроса.Вставить("locations", Массив_locations);
	Иначе
		СтруктураЗапроса = уатВнешнийМаршрутизаторСервер_уэ.УстановитьПресеты(НастройкиМаршрутизации, Структура_options, Структура_depot, Массив_vehicles, Массив_locations, Истина, ТекстОшибки, Склад);
	КонецЕсли;
	
	Возврат СтруктураЗапроса;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПолучитьРаспределениеЗаказов(АдресВрХранилища, ВхЗаказы, ВхЗаказыПоКоординатам, ВхМсвТС, ВхМсвВиртТС, АдресДепо,
		НастройкаКластеризации, РежимОптимизации, ОграничениеЧасов=0, ОграничениеПоРасстоянию=0,
		МаксимальноеКоличествоЗаказовТС=0, МаксимальноеЧислоПунктов=0, ВремяВыезда='00010101000000', СжиматьЗаказы=Ложь,
		ИндивидуальныйГаражТС=Ложь, ВозвратВГаражСобственныеТС=Ложь, ВозвратВГаражПривлеченныеТС=Ложь, ВозвратВГаражВиртуальныеТС=Ложь,
		ПараметрыСжатия=Неопределено, УчитыватьОкнаПоЗаказам=Ложь, УчитыватьРазрешенныеТипыТС=Ложь, РежимВремениВыездаИзГаража=0,
		ПараметрРазмераЗаказа=0, ПриоритетыМаршрутизации=Неопределено, ИспользоватьВПриоритетеСобственныйТранспорт=Ложь,
		УчитыватьНаправленияПеревозки=Ложь, ИспользоватьХарактеристикиЗаказовНаТС=Ложь)
	
	уатТипыТочекМаршрута_Погрузка = Перечисления.уатТипыТочекМаршрута.Погрузка;
	уатТипыТочекМаршрута_Разгрузка = Перечисления.уатТипыТочекМаршрута.Разгрузка;
	
	ПоместитьВоВременноеХранилище(Новый Структура("СообщениеПользователю", НСтр("ru = 'Выполняется маршрутизация заказов'; en = 'Executing of orders routing'")), АдресВрХранилища);
	
	Если ПараметрыСжатия = Неопределено Тогда 
		ПараметрыСжатия = Новый Структура();
	КонецЕсли;
	Если Не ПараметрыСжатия.Свойство("МаксВес") Тогда 
		ПараметрыСжатия.Вставить("МаксВес", 0);
	КонецЕсли;
	Если Не ПараметрыСжатия.Свойство("МаксОбъем") Тогда 
		ПараметрыСжатия.Вставить("МаксОбъем", 0);
	КонецЕсли;
	Если Не ПараметрыСжатия.Свойство("МаксУпак") Тогда 
		ПараметрыСжатия.Вставить("МаксУпак", 0);
	КонецЕсли;
	Если Не ПараметрыСжатия.Свойство("МаксВремя") Тогда 
		ПараметрыСжатия.Вставить("МаксВремя", 0);
	КонецЕсли;
	Если Не ПараметрыСжатия.Свойство("МаксРасстояние") Тогда 
		ПараметрыСжатия.Вставить("МаксРасстояние", 0);
	КонецЕсли;
	
	ЗапросСредняяСкорость = Новый Запрос();
	ЗапросСредняяСкорость.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатСредняяСкоростьДвижения.НачалоПериода,
	|	уатСредняяСкоростьДвижения.КонецПериода,
	|	уатСредняяСкоростьДвижения.Скорость
	|ИЗ
	|	РегистрСведений.уатСредняяСкоростьДвижения КАК уатСредняяСкоростьДвижения";
	
	ТабСкоростей = ЗапросСредняяСкорость.Выполнить().Выгрузить();
	
	// Группировка входящих заказов по направлениям перевозки.
	ЗаказыПоНаправлениямПеревозки = ПолучитьЗаказыПоНаправлениямПеревозки(ВхЗаказы, ВхЗаказыПоКоординатам, 
		УчитыватьНаправленияПеревозки);
	
	КоличествоНаправленийПеревозки = ЗаказыПоНаправлениямПеревозки.Количество();
	
	// Перменная "КонечныеПулы" хранит результат распределения заказов по ТС.
	КонечныеПулы = Новый Массив();
	
	Для Каждого ТекНаправление Из ЗаказыПоНаправлениямПеревозки Цикл 
		Заказы = Новый Массив();
		Для Каждого ТекСтрока Из ТекНаправление.Заказы Цикл 
			Заказы.Добавить(ТекСтрока);
		КонецЦикла;
		
		ЗаказыПоКоординатам = Новый Массив();
		Для Каждого ТекСтрока Из ТекНаправление.ЗаказыПоКоординатам Цикл 
			ЗаказыПоКоординатам.Добавить(ТекСтрока);
		КонецЦикла;
		
		мсвТС = Новый Массив();
		Для Каждого ТекСтрока Из ВхМсвТС Цикл 
			мсвТС.Добавить(ТекСтрока);
		КонецЦикла;
		
		мсвВиртТС = Новый Массив();
		Для Каждого ТекСтрока Из ВхМсвВиртТС Цикл 
			мсвВиртТС.Добавить(ТекСтрока);
		КонецЦикла;
		
		МенеджерВТ = Новый МенеджерВременныхТаблиц();
		
		Запрос = Новый Запрос();
		Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
		
		соотПараметрыВиртТС = Новый Соответствие();
		табТСВходная = ПолучитьТаблицуВходныхТС(мсвТС, мсвВиртТС, соотПараметрыВиртТС);
		
		Запрос.УстановитьПараметр("табТСВходная",                                табТСВходная);
		Запрос.УстановитьПараметр("ИспользоватьВПриоритетеСобственныйТранспорт", ИспользоватьВПриоритетеСобственныйТранспорт);
		Запрос.УстановитьПараметр("ВозвратВГаражСобственныеТС",                  ВозвратВГаражСобственныеТС);
		Запрос.УстановитьПараметр("ВозвратВГаражПривлеченныеТС",                 ВозвратВГаражПривлеченныеТС);
		Запрос.УстановитьПараметр("ВозвратВГаражВиртуальныеТС",                  ВозвратВГаражВиртуальныеТС);
		
		Если Константы.уатЕдиницаИзмеренияВеса.Получить() = Перечисления.уатЕдиницыИзмеренияВеса.Килограмм Тогда 
			Запрос.УстановитьПараметр("КоэфГрузоподъемности", 1000);
		Иначе 
			Запрос.УстановитьПараметр("КоэфГрузоподъемности", 1);
		КонецЕсли;
		
		Если Константы.уатЕдиницаИзмеренияОбъема.Получить() = Перечисления.уатЕдиницыИзмеренияОбъема.Литр Тогда 
			Запрос.УстановитьПараметр("КоэфОбъемаКузова", 1000);
		Иначе 
			Запрос.УстановитьПараметр("КоэфОбъемаКузова", 1);
		КонецЕсли;
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	табТСВходная.ТС КАК ТС,
		|	табТСВходная.Прицеп1 КАК Прицеп1,
		|	табТСВходная.Прицеп2 КАК Прицеп2
		|ПОМЕСТИТЬ ВТ_ТСВходПараметр
		|ИЗ
		|	&табТСВходная КАК табТСВходная
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫРАЗИТЬ(ВТ_ТСВходПараметр.ТС КАК Справочник.уатТС) КАК ТС,
		|	ВЫРАЗИТЬ(ВТ_ТСВходПараметр.Прицеп1 КАК Справочник.уатТС) КАК Прицеп1,
		|	ВЫРАЗИТЬ(ВТ_ТСВходПараметр.Прицеп2 КАК Справочник.уатТС) КАК Прицеп2
		|ПОМЕСТИТЬ ВТ_ТСтипизированная
		|ИЗ
		|	ВТ_ТСВходПараметр КАК ВТ_ТСВходПараметр
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_ТСтипизированная.ТС КАК Ссылка,
		|	ВТ_ТСтипизированная.ТС.Модель.Грузоподъемность * &КоэфГрузоподъемности + ЕСТЬNULL(ВТ_ТСтипизированная.Прицеп1.Модель.Грузоподъемность, 0) * &КоэфГрузоподъемности + ВЫБОР
		|		КОГДА ВТ_ТСтипизированная.Прицеп1 = ВТ_ТСтипизированная.Прицеп2
		|			ТОГДА 0
		|		ИНАЧЕ ЕСТЬNULL(ВТ_ТСтипизированная.Прицеп2.Модель.Грузоподъемность, 0) * &КоэфГрузоподъемности
		|	КОНЕЦ КАК Грузоподъемность,
		|	ВТ_ТСтипизированная.ТС.Модель.ОбъемКузова * &КоэфОбъемаКузова + ЕСТЬNULL(ВТ_ТСтипизированная.Прицеп1.Модель.ОбъемКузова, 0) * &КоэфОбъемаКузова + ВЫБОР
		|		КОГДА ВТ_ТСтипизированная.Прицеп1 = ВТ_ТСтипизированная.Прицеп2
		|			ТОГДА 0
		|		ИНАЧЕ ЕСТЬNULL(ВТ_ТСтипизированная.Прицеп2.Модель.ОбъемКузова, 0) * &КоэфОбъемаКузова
		|	КОНЕЦ КАК ОбъемКузова,
		|	ВТ_ТСтипизированная.ТС.Гараж КАК Гараж,
		|	ВТ_ТСтипизированная.ТС.Модель.МаксимальноеКоличествоУпаковок + ЕСТЬNULL(ВТ_ТСтипизированная.Прицеп1.Модель.МаксимальноеКоличествоУпаковок, 0) + ВЫБОР
		|		КОГДА ВТ_ТСтипизированная.Прицеп1 = ВТ_ТСтипизированная.Прицеп2
		|			ТОГДА 0
		|		ИНАЧЕ ЕСТЬNULL(ВТ_ТСтипизированная.Прицеп2.Модель.МаксимальноеКоличествоУпаковок, 0)
		|	КОНЕЦ КАК МаксимальноеКоличествоУпаковок,
		|	ВЫБОР
		|		КОГДА &ИспользоватьВПриоритетеСобственныйТранспорт
		|				И ВТ_ТСтипизированная.ТС.ПринадлежностьТС = ЗНАЧЕНИЕ(Перечисление.уатПринадлежностьТС.Собственное)
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Приоритет,
		|	ВЫБОР
		|		КОГДА ВТ_ТСтипизированная.ТС.ПринадлежностьТС = ЗНАЧЕНИЕ(Перечисление.уатПринадлежностьТС.Собственное)
		|				И &ВозвратВГаражСобственныеТС
		|			ТОГДА ИСТИНА
		|		КОГДА ВТ_ТСтипизированная.ТС.ПринадлежностьТС = ЗНАЧЕНИЕ(Перечисление.уатПринадлежностьТС.Привлеченное)
		|				И &ВозвратВГаражПривлеченныеТС
		|			ТОГДА ИСТИНА
		|		КОГДА ВТ_ТСтипизированная.ТС.ПринадлежностьТС = ЗНАЧЕНИЕ(Перечисление.уатПринадлежностьТС.Виртуальное)
		|				И &ВозвратВГаражВиртуальныеТС
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ВозвратВГараж
		|ПОМЕСТИТЬ ВТ_ТС_Подготовка
		|ИЗ
		|	ВТ_ТСтипизированная КАК ВТ_ТСтипизированная";
		
		Запрос.Выполнить();
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МАКСИМУМ(ТранспортныеСредства.Грузоподъемность) КАК МаксГрузоподъемность,
		|	МАКСИМУМ(ТранспортныеСредства.ОбъемКузова) КАК МаксОбъемКузова
		|ИЗ
		|	ВТ_ТС_Подготовка КАК ТранспортныеСредства";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда 
			МаксГрузоподъемность = Выборка.МаксГрузоподъемность;
			МаксОбъемКузова      = Выборка.МаксОбъемКузова;
		Иначе 
			МаксГрузоподъемность = 0;
			МаксОбъемКузова      = 0;
		КонецЕсли;
		
		пулы = Новый Массив();
		
		флИспользованиеКластеризации = уатЗащищенныеФункцииСервер_уэ.ПолучитьИспользованиеКластеризации();
		
		ДанныеИсходныхЗаказов = СформироватьТаблицуИсходныхЗаказов(
			Заказы, 
			ЗаказыПоКоординатам, 
			флИспользованиеКластеризации, 
			НастройкаКластеризации, 
			СжиматьЗаказы,
			АдресДепо,
			ИспользоватьХарактеристикиЗаказовНаТС
		);
		
		ДанныеПоТСИПереходам = СформироватьДанныеПоТСИПереходам(
			Запрос, 
			АдресДепо, 
			НастройкаКластеризации, 
			УчитыватьРазрешенныеТипыТС,
			МаксГрузоподъемность,
			МаксОбъемКузова, 
			ИндивидуальныйГаражТС, 
			флИспользованиеКластеризации,
			соотПараметрыВиртТС,
			ДанныеИсходныхЗаказов.МассивПунктов,
			ДанныеИсходныхЗаказов.МассивАдресов,
			ДанныеИсходныхЗаказов.НаборХарактеристик,
			ИспользоватьХарактеристикиЗаказовНаТС
		);
		
		ТаблицаИсходЗаказов                = ДанныеИсходныхЗаказов.ТаблицаЗаказов;
		СоотвТаблРасстояний                = ДанныеПоТСИПереходам.СоотвТаблРасстояний;
		СоотТипыТС                         = ДанныеПоТСИПереходам.СоотТипыТС;
		СоотРазрешенныеТипыПунктов         = ДанныеПоТСИПереходам.СоотРазрешенныеТипыПунктов;
		ТабТС                              = ДанныеПоТСИПереходам.ТабТС;
		СоотРазрешенныеТСПоХарактеристикам = ДанныеПоТСИПереходам.СоотРазрешенныеТСПоХарактеристикам;
		
		СоотРазрешенныеТСПоЗаказам = Новый Соответствие();
		
		ВекторОбход = Новый ТаблицаЗначений();
		ВекторОбход.Колонки.Добавить("Значение",        Новый ОписаниеТипов("ДокументСсылка.уатЗаказГрузоотправителя, УникальныйИдентификатор"));
		ВекторОбход.Колонки.Добавить("ОценкаПогрузка",  Новый ОписаниеТипов("Число"));
		ВекторОбход.Колонки.Добавить("ОценкаРазгрузка", Новый ОписаниеТипов("Число"));
		ВекторОбход.Колонки.Добавить("Приоритет",       Новый ОписаниеТипов("Число"));
		
		СоотвГруппЗаказов = Новый Соответствие();
		
		ТабЗаказы = Новый ТаблицаЗначений();
		ТабЗаказы.Колонки.Добавить("Ссылка",                     Новый ОписаниеТипов("УникальныйИдентификатор"));
		ТабЗаказы.Колонки.Добавить("ВесБрутто",                  Новый ОписаниеТипов("Число"));
		ТабЗаказы.Колонки.Добавить("Объем",                      Новый ОписаниеТипов("Число"));
		ТабЗаказы.Колонки.Добавить("ПунктПогрузки",              Новый ОписаниеТипов("СправочникСсылка.уатПунктыНазначения, СправочникСсылка.уатКластеры_уэ"));
		ТабЗаказы.Колонки.Добавить("ПунктРазгрузки",             Новый ОписаниеТипов("СправочникСсылка.уатПунктыНазначения, СправочникСсылка.уатКластеры_уэ"));
		ТабЗаказы.Колонки.Добавить("СтоянкаПунктОтправления",    Новый ОписаниеТипов("Число"));
		ТабЗаказы.Колонки.Добавить("СтоянкаПунктНазначения",     Новый ОписаниеТипов("Число"));
		ТабЗаказы.Колонки.Добавить("ДопСтоянкаПунктОтправления", Новый ОписаниеТипов("Число"));
		ТабЗаказы.Колонки.Добавить("ДопСтоянкаПунктНазначения",  Новый ОписаниеТипов("Число"));
		ТабЗаказы.Колонки.Добавить("Приоритет",                  Новый ОписаниеТипов("Число"));
		ТабЗаказы.Колонки.Добавить("АдресОтправления",           Новый ОписаниеТипов("СправочникСсылка.уатПунктыНазначения"));
		ТабЗаказы.Колонки.Добавить("АдресНазначения",            Новый ОписаниеТипов("СправочникСсылка.уатПунктыНазначения"));
		ТабЗаказы.Колонки.Добавить("FTL",                        Новый ОписаниеТипов("Булево"));
		ТабЗаказы.Колонки.Добавить("КоличествоУпаковок",         Новый ОписаниеТипов("Число"));
		ТабЗаказы.Колонки.Добавить("ОтправлениеС",               Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.Время)));
		ТабЗаказы.Колонки.Добавить("ОтправлениеПо",              Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.Время)));
		ТабЗаказы.Колонки.Добавить("ДоставкаС",                  Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.Время)));
		ТабЗаказы.Колонки.Добавить("ДоставкаПо",                 Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.Время)));
		ТабЗаказы.Колонки.Добавить("ЛатОтпр",                    Новый ОписаниеТипов("Число"));
		ТабЗаказы.Колонки.Добавить("ЛонОтпр",                    Новый ОписаниеТипов("Число"));
		ТабЗаказы.Колонки.Добавить("ЛатНазн",                    Новый ОписаниеТипов("Число"));
		ТабЗаказы.Колонки.Добавить("ЛонНазн",                    Новый ОписаниеТипов("Число"));
		ТабЗаказы.Колонки.Добавить("НаборХарактеристик",         Новый ОписаниеТипов("УникальныйИдентификатор"));
		
		Если СжиматьЗаказы Тогда 
			Если ПараметрыСжатия.МаксВремя = 0 Тогда 
				ПараметрыСжатия.МаксВремя = Цел(ОграничениеЧасов / 3);
			КонецЕсли;
			Если ПараметрыСжатия.МаксРасстояние = 0 Тогда 
				ПараметрыСжатия.МаксРасстояние = Цел(ОграничениеПоРасстоянию / 3);
			КонецЕсли;
			
			Если ПараметрыСжатия.МаксВес = 0 Или ПараметрыСжатия.МаксОбъем = 0 Или ПараметрыСжатия.МаксУпак = 0 Тогда 
				ВсегоТС            = 0;
				ГрузоподъемностьТС = 0;
				ОбъемКузоваТС      = 0;
				МаксУпаковокТС     = 0;
				Для Каждого ВыборкаТС Из ТабТС Цикл 
					КолТС = соотПараметрыВиртТС.Получить(ВыборкаТС.Ссылка);
					Если КолТС = Неопределено Тогда 
						КолТС = 1;
					КонецЕсли;
					
					Для СчТС = 1 По КолТС Цикл 
						ВсегоТС            = ВсегоТС + 1;
						ГрузоподъемностьТС = ГрузоподъемностьТС + ВыборкаТС.Грузоподъемность;
						ОбъемКузоваТС      = ОбъемКузоваТС + ВыборкаТС.ОбъемКузова;
						МаксУпаковокТС     = МаксУпаковокТС + ВыборкаТС.МаксимальноеКоличествоУпаковок;
					КонецЦикла;
				КонецЦикла;
				
				Если ПараметрыСжатия.МаксВес = 0 Тогда 
					ПараметрыСжатия.МаксВес = ?(ВсегоТС=0, 0, (ГрузоподъемностьТС/ВсегоТС)/3);
				КонецЕсли;
				
				Если ПараметрыСжатия.МаксОбъем = 0 Тогда 
					ПараметрыСжатия.МаксОбъем = ?(ВсегоТС=0, 0, (ОбъемКузоваТС/ВсегоТС)/3);
				КонецЕсли;
				
				Если ПараметрыСжатия.МаксУпак = 0 Тогда 
					ПараметрыСжатия.МаксУпак  = ?(ВсегоТС=0, 0, (МаксУпаковокТС/ВсегоТС)/3);
				КонецЕсли;
			КонецЕсли;
			
			Для Каждого СтрокаЛатОтпр Из ТаблицаИсходЗаказов.Строки Цикл 
				Для Каждого СтрокаЛонОтпр Из СтрокаЛатОтпр.Строки Цикл 
					Для Каждого СтрокаЛатНазн Из СтрокаЛонОтпр.Строки Цикл 
						Для Каждого СтрокаЛонНазн Из СтрокаЛатНазн.Строки Цикл 
							Если СтрокаЛонНазн.ПунктПогрузки = СтрокаЛонНазн.ПунктРазгрузки Тогда 
								мВремяВПути = 0;
								врОбщРасстояние = 0;
								
							Иначе 
								Узел1 = СоотвТаблРасстояний.Получить(СтрокаЛонНазн.ПунктПогрузки);
								Если Узел1 = Неопределено Тогда 
									Продолжить;
								КонецЕсли;
								Узел2 = Узел1.Получить(СтрокаЛонНазн.ПунктРазгрузки);
								Если Узел2 = Неопределено Тогда 
									Продолжить;
								КонецЕсли;
								мВремяВПути     = Узел2.Время;
								врОбщРасстояние = Узел2.Расстояние;
							КонецЕсли;
							
							Для Каждого НаборГруппировка Из СтрокаЛонНазн.Строки Цикл 
								ВсегоВес   = 0;
								ВсегоОбъем = 0;
								СтоянкаПО  = 0;
								СтоянкаПН  = 0;
								мПриоритет = 0;
								мУпаковок  = 0;
								
								ТекОтправлениеС  = '00010101000000';
								ТекОтправлениеПо = '00010101235959';
								ТекДоставкаС     = '00010101000000';
								ТекДоставкаПо    = '00010101235959';
								
								ДлительностьОкнаОтправления = 0;
								ДлительностьОкнаНазначения  = 0;
								
								мсвВложенныеЗаказы = Новый Массив();
								
								Для Каждого ВыборкаЗаказы Из НаборГруппировка.Строки Цикл
									
									Если УчитыватьОкнаПоЗаказам Тогда 
										Если мсвВложенныеЗаказы.Количество() = 0 Тогда 
											ТекОтправлениеС  = ВыборкаЗаказы.ОтправлениеС;
											ТекОтправлениеПо = ВыборкаЗаказы.ОтправлениеПо;
											
											ТекДоставкаС  = ВыборкаЗаказы.ДоставкаС;
											ТекДоставкаПо = ВыборкаЗаказы.ДоставкаПо;
											
											Если ТекОтправлениеС > ТекОтправлениеПо Тогда 
												ДлительностьОкнаОтправления = (ТекОтправлениеС - ТекОтправлениеПо) / 3600;
											Иначе 
												ДлительностьОкнаОтправления = (ТекОтправлениеПо - ТекОтправлениеС) / 3600;
											КонецЕсли;
											
											Если ТекДоставкаС > ТекДоставкаПо Тогда 
												ДлительностьОкнаНазначения = (ТекДоставкаС - ТекДоставкаПо) / 3600;
											Иначе 
												ДлительностьОкнаНазначения = (ТекДоставкаПо - ТекДоставкаС) / 3600;
											КонецЕсли;
											
										Иначе 
											// Проверка на пересечение окна по заказу и текущего окна группы.
											Если Не (уатОбщегоНазначения_проф.ВремяПосещенияВПределахОкна(ВыборкаЗаказы.ОтправлениеС, ТекОтправлениеС, ТекОтправлениеПо)
													Или уатОбщегоНазначения_проф.ВремяПосещенияВПределахОкна(ВыборкаЗаказы.ОтправлениеПо, ТекОтправлениеС, ТекОтправлениеПо)) Тогда 
												ДлительностьОкнаОтправления = -1;
												
											Иначе 
												Если Не (ТекОтправлениеС <= ТекОтправлениеПо И ВыборкаЗаказы.ОтправлениеС > ВыборкаЗаказы.ОтправлениеПо) Тогда 
													ТекОтправлениеС = Макс(ТекОтправлениеС, ВыборкаЗаказы.ОтправлениеС);
												КонецЕсли;
												ТекОтправлениеПо = Мин(ТекОтправлениеПо, ВыборкаЗаказы.ОтправлениеПо);
												
												Если ТекОтправлениеС > ТекОтправлениеПо Тогда 
													ДлительностьОкнаОтправления = (ТекОтправлениеС - ТекОтправлениеПо) / 3600;
												Иначе 
													ДлительностьОкнаОтправления = (ТекОтправлениеПо - ТекОтправлениеС) / 3600;
												КонецЕсли;
											КонецЕсли;
											
											// Проверка на пересечение окна по заказу и текущего окна группы.
											Если Не (уатОбщегоНазначения_проф.ВремяПосещенияВПределахОкна(ВыборкаЗаказы.ДоставкаС, ТекДоставкаС, ТекДоставкаПо)
													Или уатОбщегоНазначения_проф.ВремяПосещенияВПределахОкна(ВыборкаЗаказы.ДоставкаПо, ТекДоставкаС, ТекДоставкаПо)) Тогда 
												ДлительностьОкнаНазначения = -1;
												
											Иначе 
												Если Не (ТекДоставкаС <= ТекДоставкаПо И ВыборкаЗаказы.ДоставкаС > ВыборкаЗаказы.ДоставкаПо) Тогда 
													ТекДоставкаС = Макс(ТекДоставкаС, ВыборкаЗаказы.ДоставкаС);
												КонецЕсли;
												ТекДоставкаПо = Мин(ТекДоставкаПо, ВыборкаЗаказы.ДоставкаПо);
												
												Если ТекДоставкаС > ТекДоставкаПо Тогда 
													ДлительностьОкнаНазначения = (ТекДоставкаС - ТекДоставкаПо) / 3600;
												Иначе 
													ДлительностьОкнаНазначения = (ТекДоставкаПо - ТекДоставкаС) / 3600;
												КонецЕсли;
											КонецЕсли;
										КонецЕсли;
									КонецЕсли;
									
									ОбщВремя = мВремяВПути
										+ ВыборкаЗаказы.ДопСтоянкаПунктОтправления
										+ ВыборкаЗаказы.СтоянкаПунктОтправления
										+ ВыборкаЗаказы.ДопСтоянкаПунктНазначения
										+ ВыборкаЗаказы.СтоянкаПунктНазначения;
										
									Если Не ВыборкаЗаказы.FTL 
											И (МаксимальноеКоличествоЗаказовТС = 0 Или мсвВложенныеЗаказы.Количество() <= МаксимальноеКоличествоЗаказовТС)
											И (ПараметрыСжатия.МаксВремя = 0 Или ОбщВремя <= ПараметрыСжатия.МаксВремя * 3600)
											И (ПараметрыСжатия.МаксРасстояние = 0 Или врОбщРасстояние <= ПараметрыСжатия.МаксРасстояние)
											И (ПараметрыСжатия.МаксВес = 0 Или ВсегоВес <= ПараметрыСжатия.МаксВес)
											И (ПараметрыСжатия.МаксОбъем = 0 Или ВсегоОбъем <= ПараметрыСжатия.МаксОбъем)
											И (ПараметрыСжатия.МаксУпак = 0 Или мУпаковок <= ПараметрыСжатия.МаксУпак)
											И ДлительностьОкнаОтправления >= 0 И ДлительностьОкнаНазначения >=0 Тогда 
										мсвВложенныеЗаказы.Добавить(Новый Структура("Заказ, Пакет", ВыборкаЗаказы.Ссылка, ВыборкаЗаказы.СтрокаПакета));
										ВсегоВес   = ВсегоВес + ВыборкаЗаказы.ВесБрутто;
										ВсегоОбъем = ВсегоОбъем + ВыборкаЗаказы.Объем;
										мПриоритет = ?(мПриоритет<ВыборкаЗаказы.Приоритет, ВыборкаЗаказы.Приоритет, мПриоритет);
										мУпаковок  = мУпаковок + ВыборкаЗаказы.КоличествоУпаковок;
										
										СтоянкаПО = СтоянкаПО + ВыборкаЗаказы.СтоянкаПунктОтправления;
										СтоянкаПН = СтоянкаПН + ВыборкаЗаказы.СтоянкаПунктНазначения;
										
									ИначеЕсли ВыборкаЗаказы.FTL Тогда 
										Если мсвВложенныеЗаказы.Количество() Тогда 
											GUIDГруппы = Новый УникальныйИдентификатор();
											НовСтр = ТабЗаказы.Добавить();
											НовСтр.Ссылка                     = GUIDГруппы;
											НовСтр.ВесБрутто                  = ВсегоВес;
											НовСтр.Объем                      = ВсегоОбъем;
											НовСтр.ПунктПогрузки              = СтрокаЛонНазн.ПунктПогрузки;
											НовСтр.ПунктРазгрузки             = СтрокаЛонНазн.ПунктРазгрузки;
											НовСтр.СтоянкаПунктОтправления    = СтоянкаПО;
											НовСтр.СтоянкаПунктНазначения     = СтоянкаПН;
											НовСтр.ДопСтоянкаПунктОтправления = ВыборкаЗаказы.ДопСтоянкаПунктОтправления;
											НовСтр.ДопСтоянкаПунктНазначения  = ВыборкаЗаказы.ДопСтоянкаПунктНазначения;
											НовСтр.Приоритет                  = мПриоритет;
											НовСтр.АдресОтправления           = ВыборкаЗаказы.АдресОтправления;
											НовСтр.АдресНазначения            = ВыборкаЗаказы.АдресНазначения;
											НовСтр.FTL                        = Ложь;
											НовСтр.КоличествоУпаковок         = мУпаковок;
											НовСтр.ОтправлениеС               = ТекОтправлениеС;
											НовСтр.ОтправлениеПо              = ТекОтправлениеПо;
											НовСтр.ДоставкаС                  = ТекДоставкаС;
											НовСтр.ДоставкаПо                 = ТекДоставкаПо;
											НовСтр.ЛатОтпр                    = ВыборкаЗаказы.ЛатОтпр;
											НовСтр.ЛонОтпр                    = ВыборкаЗаказы.ЛонОтпр;
											НовСтр.ЛатНазн                    = ВыборкаЗаказы.ЛатНазн;
											НовСтр.ЛонНазн                    = ВыборкаЗаказы.ЛонНазн;
											НовСтр.НаборХарактеристик         = НаборГруппировка.НаборХарактеристик;
											
											СоотвГруппЗаказов.Вставить(GUIDГруппы, мсвВложенныеЗаказы);
											
											Если УчитыватьРазрешенныеТипыТС Тогда 
												УстановитьРазрешенныеТСЗаказов(СоотРазрешенныеТСПоЗаказам, СоотТипыТС, СоотРазрешенныеТипыПунктов,
													GUIDГруппы, ВыборкаЗаказы.АдресОтправления, ВыборкаЗаказы.АдресНазначения);
											КонецЕсли;
											
											мЦенаПогрузка = Неопределено;
											Для Каждого ТекТС Из ТабТС Цикл 
												Если ТекТС.Гараж = СтрокаЛонНазн.ПунктПогрузки Тогда 
													Если РежимОптимизации = 0 Тогда 
														мЦенаПогрузка = ?(мЦенаПогрузка=Неопределено, 0, Мин(мЦенаПогрузка, 0));
													Иначе 
														мЦенаПогрузка = ?(мЦенаПогрузка=Неопределено, 0, Мин(мЦенаПогрузка, 0));
													КонецЕсли;
													
												Иначе 
													Узел1 = СоотвТаблРасстояний.Получить(ТекТС.Гараж);
													Если Узел1 = Неопределено Тогда 
														Прервать;
													КонецЕсли;
													Узел2 = Узел1.Получить(СтрокаЛонНазн.ПунктПогрузки);
													Если Узел2 = Неопределено Тогда 
														Прервать;
													КонецЕсли;
													Если РежимОптимизации = 0 Тогда 
														мЦенаПогрузка = ?(мЦенаПогрузка=Неопределено, Узел2.Время, Мин(мЦенаПогрузка, Узел2.Время));
													Иначе 
														мЦенаПогрузка = ?(мЦенаПогрузка=Неопределено, Узел2.Расстояние, Мин(мЦенаПогрузка, Узел2.Расстояние));
													КонецЕсли;
												КонецЕсли;
											КонецЦикла;
											
											Если мЦенаПогрузка = Неопределено Тогда 
												Продолжить;
											КонецЕсли;
											
											мЦенаРазгрузка = Неопределено;
											Для Каждого ТекТС Из ТабТС Цикл 
												Если ТекТС.Гараж = СтрокаЛонНазн.ПунктРазгрузки Тогда 
													Если РежимОптимизации = 0 Тогда 
														мЦенаРазгрузка = ?(мЦенаРазгрузка=Неопределено, 0, Мин(мЦенаРазгрузка, 0));
													Иначе 
														мЦенаРазгрузка = ?(мЦенаРазгрузка=Неопределено, 0, Мин(мЦенаРазгрузка, 0));
													КонецЕсли;
													
												Иначе 
													Узел1 = СоотвТаблРасстояний.Получить(ТекТС.Гараж);
													Если Узел1 = Неопределено Тогда 
														Прервать;
													КонецЕсли;
													Узел2 = Узел1.Получить(СтрокаЛонНазн.ПунктРазгрузки);
													Если Узел2 = Неопределено Тогда 
														Прервать;
													КонецЕсли;
													Если РежимОптимизации = 0 Тогда 
														мЦенаРазгрузка = ?(мЦенаРазгрузка=Неопределено, Узел2.Время, Мин(мЦенаРазгрузка, Узел2.Время));
													Иначе 
														мЦенаРазгрузка = ?(мЦенаРазгрузка=Неопределено, Узел2.Расстояние, Мин(мЦенаРазгрузка, Узел2.Расстояние));
													КонецЕсли;
												КонецЕсли;
											КонецЦикла;
											
											Если мЦенаРазгрузка = Неопределено Тогда 
												Продолжить;
											КонецЕсли;
											
											НовСтрокаОбход = ВекторОбход.Добавить();
											НовСтрокаОбход.Значение        = GUIDГруппы;
											НовСтрокаОбход.ОценкаПогрузка  = мЦенаПогрузка;
											НовСтрокаОбход.ОценкаРазгрузка = мЦенаРазгрузка;
											НовСтрокаОбход.Приоритет       = НовСтр.Приоритет;
											
											ВсегоВес   = 0;
											ВсегоОбъем = 0;
											СтоянкаПО  = 0;
											СтоянкаПН  = 0;
											мПриоритет = 0;
											мУпаковок  = 0;
										КонецЕсли;
										
										GUIDГруппы = Новый УникальныйИдентификатор();
										НовСтр = ТабЗаказы.Добавить();
										НовСтр.Ссылка                     = GUIDГруппы;
										НовСтр.ВесБрутто                  = ВыборкаЗаказы.ВесБрутто;
										НовСтр.Объем                      = ВыборкаЗаказы.Объем;
										НовСтр.ПунктПогрузки              = СтрокаЛонНазн.ПунктПогрузки;
										НовСтр.ПунктРазгрузки             = СтрокаЛонНазн.ПунктРазгрузки;
										НовСтр.СтоянкаПунктОтправления    = ВыборкаЗаказы.СтоянкаПунктОтправления;
										НовСтр.СтоянкаПунктНазначения     = ВыборкаЗаказы.СтоянкаПунктНазначения;
										НовСтр.ДопСтоянкаПунктОтправления = ВыборкаЗаказы.ДопСтоянкаПунктОтправления;
										НовСтр.ДопСтоянкаПунктНазначения  = ВыборкаЗаказы.ДопСтоянкаПунктНазначения;
										НовСтр.Приоритет                  = ВыборкаЗаказы.Приоритет;
										НовСтр.АдресОтправления           = ВыборкаЗаказы.АдресОтправления;
										НовСтр.АдресНазначения            = ВыборкаЗаказы.АдресНазначения;
										НовСтр.FTL                        = Истина;
										НовСтр.КоличествоУпаковок         = ВыборкаЗаказы.КоличествоУпаковок;
										НовСтр.ОтправлениеС               = ТекОтправлениеС;
										НовСтр.ОтправлениеПо              = ТекОтправлениеПо;
										НовСтр.ДоставкаС                  = ТекДоставкаС;
										НовСтр.ДоставкаПо                 = ТекДоставкаПо;
										НовСтр.ЛатОтпр                    = ВыборкаЗаказы.ЛатОтпр;
										НовСтр.ЛонОтпр                    = ВыборкаЗаказы.ЛонОтпр;
										НовСтр.ЛатНазн                    = ВыборкаЗаказы.ЛатНазн;
										НовСтр.ЛонНазн                    = ВыборкаЗаказы.ЛонНазн;
										НовСтр.НаборХарактеристик         = НаборГруппировка.НаборХарактеристик;
										
										мсвВложенныеЗаказы = Новый Массив();
										мсвВложенныеЗаказы.Добавить(Новый Структура("Заказ, Пакет", ВыборкаЗаказы.Ссылка, ВыборкаЗаказы.СтрокаПакета));
										СоотвГруппЗаказов.Вставить(GUIDГруппы, мсвВложенныеЗаказы);
										
										Если УчитыватьРазрешенныеТипыТС Тогда 
											УстановитьРазрешенныеТСЗаказов(СоотРазрешенныеТСПоЗаказам, СоотТипыТС, СоотРазрешенныеТипыПунктов,
												GUIDГруппы, ВыборкаЗаказы.АдресОтправления, ВыборкаЗаказы.АдресНазначения);
										КонецЕсли;
										
										мЦенаПогрузка = Неопределено;
										Для Каждого ТекТС Из ТабТС Цикл 
											Если ТекТС.Гараж = СтрокаЛонНазн.ПунктПогрузки Тогда 
												Если РежимОптимизации = 0 Тогда 
													мЦенаПогрузка = ?(мЦенаПогрузка=Неопределено, 0, Мин(мЦенаПогрузка, 0));
												Иначе 
													мЦенаПогрузка = ?(мЦенаПогрузка=Неопределено, 0, Мин(мЦенаПогрузка, 0));
												КонецЕсли;
												
											Иначе 
												Узел1 = СоотвТаблРасстояний.Получить(ТекТС.Гараж);
												Если Узел1 = Неопределено Тогда 
													Прервать;
												КонецЕсли;
												Узел2 = Узел1.Получить(СтрокаЛонНазн.ПунктПогрузки);
												Если Узел2 = Неопределено Тогда 
													Прервать;
												КонецЕсли;
												Если РежимОптимизации = 0 Тогда 
													мЦенаПогрузка = ?(мЦенаПогрузка=Неопределено, Узел2.Время, Мин(мЦенаПогрузка, Узел2.Время));
												Иначе 
													мЦенаПогрузка = ?(мЦенаПогрузка=Неопределено, Узел2.Расстояние, Мин(мЦенаПогрузка, Узел2.Расстояние));
												КонецЕсли;
											КонецЕсли;
										КонецЦикла;
										
										Если мЦенаПогрузка = Неопределено Тогда 
											Продолжить;
										КонецЕсли;
										
										мЦенаРазгрузка = Неопределено;
										Для Каждого ТекТС Из ТабТС Цикл 
											Если ТекТС.Гараж = СтрокаЛонНазн.ПунктРазгрузки Тогда 
												Если РежимОптимизации = 0 Тогда 
													мЦенаРазгрузка = ?(мЦенаРазгрузка=Неопределено, 0, Мин(мЦенаРазгрузка, 0));
												Иначе 
													мЦенаРазгрузка = ?(мЦенаРазгрузка=Неопределено, 0, Мин(мЦенаРазгрузка, 0));
												КонецЕсли;
												
											Иначе 
												Узел1 = СоотвТаблРасстояний.Получить(ТекТС.Гараж);
												Если Узел1 = Неопределено Тогда 
													Прервать;
												КонецЕсли;
												Узел2 = Узел1.Получить(СтрокаЛонНазн.ПунктРазгрузки);
												Если Узел2 = Неопределено Тогда 
													Прервать;
												КонецЕсли;
												Если РежимОптимизации = 0 Тогда 
													мЦенаРазгрузка = ?(мЦенаРазгрузка=Неопределено, Узел2.Время, Мин(мЦенаРазгрузка, Узел2.Время));
												Иначе 
													мЦенаРазгрузка = ?(мЦенаРазгрузка=Неопределено, Узел2.Расстояние, Мин(мЦенаРазгрузка, Узел2.Расстояние));
												КонецЕсли;
											КонецЕсли;
										КонецЦикла;
										
										Если мЦенаРазгрузка = Неопределено Тогда 
											Продолжить;
										КонецЕсли;
										
										НовСтрокаОбход = ВекторОбход.Добавить();
										НовСтрокаОбход.Значение        = GUIDГруппы;
										НовСтрокаОбход.ОценкаПогрузка  = мЦенаПогрузка;
										НовСтрокаОбход.ОценкаРазгрузка = мЦенаРазгрузка;
										НовСтрокаОбход.Приоритет       = НовСтр.Приоритет;
										
										мсвВложенныеЗаказы = Новый Массив();
										
									Иначе 
										GUIDГруппы = Новый УникальныйИдентификатор();
										НовСтр = ТабЗаказы.Добавить();
										НовСтр.Ссылка                     = GUIDГруппы;
										НовСтр.ВесБрутто                  = ВсегоВес;
										НовСтр.Объем                      = ВсегоОбъем;
										НовСтр.ПунктПогрузки              = СтрокаЛонНазн.ПунктПогрузки;
										НовСтр.ПунктРазгрузки             = СтрокаЛонНазн.ПунктРазгрузки;
										НовСтр.СтоянкаПунктОтправления    = СтоянкаПО;
										НовСтр.СтоянкаПунктНазначения     = СтоянкаПН;
										НовСтр.ДопСтоянкаПунктОтправления = ВыборкаЗаказы.ДопСтоянкаПунктОтправления;
										НовСтр.ДопСтоянкаПунктНазначения  = ВыборкаЗаказы.ДопСтоянкаПунктНазначения;
										НовСтр.Приоритет                  = мПриоритет;
										НовСтр.АдресОтправления           = ВыборкаЗаказы.АдресОтправления;
										НовСтр.АдресНазначения            = ВыборкаЗаказы.АдресНазначения;
										НовСтр.FTL                        = Ложь;
										НовСтр.КоличествоУпаковок         = мУпаковок;
										НовСтр.ОтправлениеС               = ТекОтправлениеС;
										НовСтр.ОтправлениеПо              = ТекОтправлениеПо;
										НовСтр.ДоставкаС                  = ТекДоставкаС;
										НовСтр.ДоставкаПо                 = ТекДоставкаПо;
										НовСтр.ЛатОтпр                    = ВыборкаЗаказы.ЛатОтпр;
										НовСтр.ЛонОтпр                    = ВыборкаЗаказы.ЛонОтпр;
										НовСтр.ЛатНазн                    = ВыборкаЗаказы.ЛатНазн;
										НовСтр.ЛонНазн                    = ВыборкаЗаказы.ЛонНазн;
										НовСтр.НаборХарактеристик         = НаборГруппировка.НаборХарактеристик;
										
										СоотвГруппЗаказов.Вставить(GUIDГруппы, мсвВложенныеЗаказы);
										
										Если УчитыватьРазрешенныеТипыТС Тогда 
											УстановитьРазрешенныеТСЗаказов(СоотРазрешенныеТСПоЗаказам, СоотТипыТС, СоотРазрешенныеТипыПунктов,
												GUIDГруппы, ВыборкаЗаказы.АдресОтправления, ВыборкаЗаказы.АдресНазначения);
										КонецЕсли;
										
										мЦенаПогрузка = Неопределено;
										Для Каждого ТекТС Из ТабТС Цикл 
											Если ТекТС.Гараж = СтрокаЛонНазн.ПунктПогрузки Тогда 
												Если РежимОптимизации = 0 Тогда 
													мЦенаПогрузка = ?(мЦенаПогрузка=Неопределено, 0, Мин(мЦенаПогрузка, 0));
												Иначе 
													мЦенаПогрузка = ?(мЦенаПогрузка=Неопределено, 0, Мин(мЦенаПогрузка, 0));
												КонецЕсли;
												
											Иначе 
												Узел1 = СоотвТаблРасстояний.Получить(ТекТС.Гараж);
												Если Узел1 = Неопределено Тогда 
													Прервать;
												КонецЕсли;
												Узел2 = Узел1.Получить(СтрокаЛонНазн.ПунктПогрузки);
												Если Узел2 = Неопределено Тогда 
													Прервать;
												КонецЕсли;
												Если РежимОптимизации = 0 Тогда 
													мЦенаПогрузка = ?(мЦенаПогрузка=Неопределено, Узел2.Время, Мин(мЦенаПогрузка, Узел2.Время));
												Иначе 
													мЦенаПогрузка = ?(мЦенаПогрузка=Неопределено, Узел2.Расстояние, Мин(мЦенаПогрузка, Узел2.Расстояние));
												КонецЕсли;
											КонецЕсли;
										КонецЦикла;
										
										Если мЦенаПогрузка = Неопределено Тогда 
											Продолжить;
										КонецЕсли;
										
										мЦенаРазгрузка = Неопределено;
										Для Каждого ТекТС Из ТабТС Цикл 
											Если ТекТС.Гараж = СтрокаЛонНазн.ПунктРазгрузки Тогда 
												Если РежимОптимизации = 0 Тогда 
													мЦенаРазгрузка = ?(мЦенаРазгрузка=Неопределено, 0, Мин(мЦенаРазгрузка, 0));
												Иначе 
													мЦенаРазгрузка = ?(мЦенаРазгрузка=Неопределено, 0, Мин(мЦенаРазгрузка, 0));
												КонецЕсли;
												
											Иначе 
												Узел1 = СоотвТаблРасстояний.Получить(ТекТС.Гараж);
												Если Узел1 = Неопределено Тогда 
													Прервать;
												КонецЕсли;
												Узел2 = Узел1.Получить(СтрокаЛонНазн.ПунктРазгрузки);
												Если Узел2 = Неопределено Тогда 
													Прервать;
												КонецЕсли;
												Если РежимОптимизации = 0 Тогда 
													мЦенаРазгрузка = ?(мЦенаРазгрузка=Неопределено, Узел2.Время, Мин(мЦенаРазгрузка, Узел2.Время));
												Иначе 
													мЦенаРазгрузка = ?(мЦенаРазгрузка=Неопределено, Узел2.Расстояние, Мин(мЦенаРазгрузка, Узел2.Расстояние));
												КонецЕсли;
											КонецЕсли;
										КонецЦикла;
										
										Если мЦенаРазгрузка = Неопределено Тогда 
											Продолжить;
										КонецЕсли;
										
										НовСтрокаОбход = ВекторОбход.Добавить();
										НовСтрокаОбход.Значение        = GUIDГруппы;
										НовСтрокаОбход.ОценкаПогрузка  = мЦенаПогрузка;
										НовСтрокаОбход.ОценкаРазгрузка = мЦенаРазгрузка;
										НовСтрокаОбход.Приоритет       = НовСтр.Приоритет;
										
										ВсегоВес   = ВыборкаЗаказы.ВесБрутто;
										ВсегоОбъем = ВыборкаЗаказы.Объем;
										СтоянкаПО  = ВыборкаЗаказы.СтоянкаПунктОтправления;
										СтоянкаПН  = ВыборкаЗаказы.СтоянкаПунктНазначения;
										мсвВложенныеЗаказы = Новый Массив();
										мсвВложенныеЗаказы.Добавить(Новый Структура("Заказ, Пакет", ВыборкаЗаказы.Ссылка, ВыборкаЗаказы.СтрокаПакета));
										мПриоритет = ВыборкаЗаказы.Приоритет;
										мУпаковок  = ВыборкаЗаказы.КоличествоУпаковок;
										
										Если УчитыватьОкнаПоЗаказам Тогда 
											ТекОтправлениеС  = ВыборкаЗаказы.ОтправлениеС;
											ТекОтправлениеПо = ВыборкаЗаказы.ОтправлениеПо;
											
											ТекДоставкаС  = ВыборкаЗаказы.ДоставкаС;
											ТекДоставкаПо = ВыборкаЗаказы.ДоставкаПо;
											
											Если ТекОтправлениеС > ТекОтправлениеПо Тогда 
												ДлительностьОкнаОтправления = (ТекОтправлениеС - ТекОтправлениеПо) / 3600;
											Иначе 
												ДлительностьОкнаОтправления = (ТекОтправлениеПо - ТекОтправлениеС) / 3600;
											КонецЕсли;
											
											Если ТекДоставкаС > ТекДоставкаПо Тогда 
												ДлительностьОкнаНазначения = (ТекДоставкаС - ТекДоставкаПо) / 3600;
											Иначе 
												ДлительностьОкнаНазначения = (ТекДоставкаПо - ТекДоставкаС) / 3600;
											КонецЕсли;
										КонецЕсли;
									КонецЕсли;
								КонецЦикла;
								
								Если мсвВложенныеЗаказы.Количество() Тогда 
									GUIDГруппы = Новый УникальныйИдентификатор();
									НовСтр = ТабЗаказы.Добавить();
									НовСтр.Ссылка                     = GUIDГруппы;
									НовСтр.ВесБрутто                  = ВсегоВес;
									НовСтр.Объем                      = ВсегоОбъем;
									НовСтр.ПунктПогрузки              = СтрокаЛонНазн.ПунктПогрузки;
									НовСтр.ПунктРазгрузки             = СтрокаЛонНазн.ПунктРазгрузки;
									НовСтр.СтоянкаПунктОтправления    = СтоянкаПО;
									НовСтр.СтоянкаПунктНазначения     = СтоянкаПН;
									НовСтр.ДопСтоянкаПунктОтправления = ВыборкаЗаказы.ДопСтоянкаПунктОтправления;
									НовСтр.ДопСтоянкаПунктНазначения  = ВыборкаЗаказы.ДопСтоянкаПунктНазначения;
									НовСтр.Приоритет                  = мПриоритет;
									НовСтр.АдресОтправления           = ВыборкаЗаказы.АдресОтправления;
									НовСтр.АдресНазначения            = ВыборкаЗаказы.АдресНазначения;
									НовСтр.FTL                        = Ложь;
									НовСтр.КоличествоУпаковок         = мУпаковок;
									НовСтр.ОтправлениеС               = ТекОтправлениеС;
									НовСтр.ОтправлениеПо              = ТекОтправлениеПо;
									НовСтр.ДоставкаС                  = ТекДоставкаС;
									НовСтр.ДоставкаПо                 = ТекДоставкаПо;
									НовСтр.ЛатОтпр                    = ВыборкаЗаказы.ЛатОтпр;
									НовСтр.ЛонОтпр                    = ВыборкаЗаказы.ЛонОтпр;
									НовСтр.ЛатНазн                    = ВыборкаЗаказы.ЛатНазн;
									НовСтр.ЛонНазн                    = ВыборкаЗаказы.ЛонНазн;
									НовСтр.НаборХарактеристик         = НаборГруппировка.НаборХарактеристик;
									
									СоотвГруппЗаказов.Вставить(GUIDГруппы, мсвВложенныеЗаказы);
									
									Если УчитыватьРазрешенныеТипыТС Тогда 
										УстановитьРазрешенныеТСЗаказов(СоотРазрешенныеТСПоЗаказам, СоотТипыТС, СоотРазрешенныеТипыПунктов,
											GUIDГруппы, ВыборкаЗаказы.АдресОтправления, ВыборкаЗаказы.АдресНазначения);
									КонецЕсли;
									
									мЦенаПогрузка = Неопределено;
									Для Каждого ТекТС Из ТабТС Цикл 
										Если ТекТС.Гараж = СтрокаЛонНазн.ПунктПогрузки Тогда 
											Если РежимОптимизации = 0 Тогда 
												мЦенаПогрузка = ?(мЦенаПогрузка=Неопределено, 0, Мин(мЦенаПогрузка, 0));
											Иначе 
												мЦенаПогрузка = ?(мЦенаПогрузка=Неопределено, 0, Мин(мЦенаПогрузка, 0));
											КонецЕсли;
											
										Иначе 
											Узел1 = СоотвТаблРасстояний.Получить(ТекТС.Гараж);
											Если Узел1 = Неопределено Тогда 
												Прервать;
											КонецЕсли;
											Узел2 = Узел1.Получить(СтрокаЛонНазн.ПунктПогрузки);
											Если Узел2 = Неопределено Тогда 
												Прервать;
											КонецЕсли;
											Если РежимОптимизации = 0 Тогда 
												мЦенаПогрузка = ?(мЦенаПогрузка=Неопределено, Узел2.Время, Мин(мЦенаПогрузка, Узел2.Время));
											Иначе 
												мЦенаПогрузка = ?(мЦенаПогрузка=Неопределено, Узел2.Расстояние, Мин(мЦенаПогрузка, Узел2.Расстояние));
											КонецЕсли;
										КонецЕсли;
									КонецЦикла;
									
									Если мЦенаПогрузка = Неопределено Тогда 
										Продолжить;
									КонецЕсли;
									
									мЦенаРазгрузка = Неопределено;
									Для Каждого ТекТС Из ТабТС Цикл 
										Если ТекТС.Гараж = СтрокаЛонНазн.ПунктРазгрузки Тогда 
											Если РежимОптимизации = 0 Тогда 
												мЦенаРазгрузка = ?(мЦенаРазгрузка=Неопределено, 0, Мин(мЦенаРазгрузка, 0));
											Иначе 
												мЦенаРазгрузка = ?(мЦенаРазгрузка=Неопределено, 0, Мин(мЦенаРазгрузка, 0));
											КонецЕсли;
											
										Иначе 
											Узел1 = СоотвТаблРасстояний.Получить(ТекТС.Гараж);
											Если Узел1 = Неопределено Тогда 
												Прервать;
											КонецЕсли;
											Узел2 = Узел1.Получить(СтрокаЛонНазн.ПунктРазгрузки);
											Если Узел2 = Неопределено Тогда 
												Прервать;
											КонецЕсли;
											Если РежимОптимизации = 0 Тогда 
												мЦенаРазгрузка = ?(мЦенаРазгрузка=Неопределено, Узел2.Время, Мин(мЦенаРазгрузка, Узел2.Время));
											Иначе 
												мЦенаРазгрузка = ?(мЦенаРазгрузка=Неопределено, Узел2.Расстояние, Мин(мЦенаРазгрузка, Узел2.Расстояние));
											КонецЕсли;
										КонецЕсли;
									КонецЦикла;
									
									Если мЦенаРазгрузка = Неопределено Тогда 
										Продолжить;
									КонецЕсли;
									
									НовСтрокаОбход = ВекторОбход.Добавить();
									НовСтрокаОбход.Значение        = GUIDГруппы;
									НовСтрокаОбход.ОценкаПогрузка  = мЦенаПогрузка;
									НовСтрокаОбход.ОценкаРазгрузка = мЦенаРазгрузка;
									НовСтрокаОбход.Приоритет       = НовСтр.Приоритет;
								КонецЕсли;
							КонецЦикла;
						КонецЦикла;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
			
		Иначе 
			Для Каждого ВыборкаЗаказы Из ТаблицаИсходЗаказов Цикл 
				мЦенаПогрузка = Неопределено;
				Для Каждого ТекТС Из ТабТС Цикл 
					Если ТекТС.Гараж = ВыборкаЗаказы.ПунктПогрузки Тогда 
						Если РежимОптимизации = 0 Тогда 
							мЦенаПогрузка = ?(мЦенаПогрузка=Неопределено, 0, Мин(мЦенаПогрузка, 0));
						Иначе 
							мЦенаПогрузка = ?(мЦенаПогрузка=Неопределено, 0, Мин(мЦенаПогрузка, 0));
						КонецЕсли;
						
					Иначе 
						Узел1 = СоотвТаблРасстояний.Получить(ТекТС.Гараж);
						Если Узел1 = Неопределено Тогда 
							Прервать;
						КонецЕсли;
						Узел2 = Узел1.Получить(ВыборкаЗаказы.ПунктПогрузки);
						Если Узел2 = Неопределено Тогда 
							Прервать;
						КонецЕсли;
						Если РежимОптимизации = 0 Тогда 
							мЦенаПогрузка = ?(мЦенаПогрузка=Неопределено, Узел2.Время, Мин(мЦенаПогрузка, Узел2.Время));
						Иначе 
							мЦенаПогрузка = ?(мЦенаПогрузка=Неопределено, Узел2.Расстояние, Мин(мЦенаПогрузка, Узел2.Расстояние));
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				
				Если мЦенаПогрузка = Неопределено Тогда 
					Продолжить;
				КонецЕсли;
				
				мЦенаРазгрузка = Неопределено;
				Для Каждого ТекТС Из ТабТС Цикл 
					Если ТекТС.Гараж = ВыборкаЗаказы.ПунктРазгрузки Тогда 
						Если РежимОптимизации = 0 Тогда 
							мЦенаРазгрузка = ?(мЦенаРазгрузка=Неопределено, 0, Мин(мЦенаРазгрузка, 0));
						Иначе 
							мЦенаРазгрузка = ?(мЦенаРазгрузка=Неопределено, 0, Мин(мЦенаРазгрузка, 0));
						КонецЕсли;
						
					Иначе 
						Узел1 = СоотвТаблРасстояний.Получить(ТекТС.Гараж);
						Если Узел1 = Неопределено Тогда 
							Прервать;
						КонецЕсли;
						Узел2 = Узел1.Получить(ВыборкаЗаказы.ПунктРазгрузки);
						Если Узел2 = Неопределено Тогда 
							Прервать;
						КонецЕсли;
						Если РежимОптимизации = 0 Тогда 
							мЦенаРазгрузка = ?(мЦенаРазгрузка=Неопределено, Узел2.Время, Мин(мЦенаРазгрузка, Узел2.Время));
						Иначе 
							мЦенаРазгрузка = ?(мЦенаРазгрузка=Неопределено, Узел2.Расстояние, Мин(мЦенаРазгрузка, Узел2.Расстояние));
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				
				Если мЦенаРазгрузка = Неопределено Тогда 
					Продолжить;
				КонецЕсли;
				
				мсвЗаказы = Новый Массив();
				мсвЗаказы.Добавить(Новый Структура("Заказ, Пакет", ВыборкаЗаказы.Ссылка, ВыборкаЗаказы.СтрокаПакета));
				
				GUIDПакета = Новый УникальныйИдентификатор();
				СоотвГруппЗаказов.Вставить(GUIDПакета, мсвЗаказы);
				
				НовСтр = ТабЗаказы.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр, ВыборкаЗаказы,, "Ссылка");
				НовСтр.Ссылка = GUIDПакета;
				
				Если УчитыватьРазрешенныеТипыТС Тогда 
					УстановитьРазрешенныеТСЗаказов(СоотРазрешенныеТСПоЗаказам, СоотТипыТС, СоотРазрешенныеТипыПунктов,
						GUIDПакета, ВыборкаЗаказы.АдресОтправления, ВыборкаЗаказы.АдресНазначения);
				КонецЕсли;
				
				НовСтрокаОбход = ВекторОбход.Добавить();
				НовСтрокаОбход.Значение        = GUIDПакета;
				НовСтрокаОбход.ОценкаПогрузка  = мЦенаПогрузка;
				НовСтрокаОбход.ОценкаРазгрузка = мЦенаРазгрузка;
				НовСтрокаОбход.Приоритет       = ВыборкаЗаказы.Приоритет;
			КонецЦикла;
		КонецЕсли;
		
		ТабЗаказы.Индексы.Добавить("Ссылка");
		
		ВекторОбход.Сортировать("ОценкаПогрузка Возр, ОценкаРазгрузка Возр, Приоритет Убыв");
		
		ВсегоИтерацийСтатус = ВекторОбход.Количество() * КоличествоНаправленийПеревозки;
		ТекИтерацияСтатус = 0;
		
		Для Каждого ТекЭлемент Из ВекторОбход Цикл 
			ТекИтерацияСтатус = ТекИтерацияСтатус + КоличествоНаправленийПеревозки;
			ПоместитьВоВременноеХранилище(Новый Структура("СообщениеПользователю,Прогресс", НСтр("ru = 'Выполняется маршрутизация заказов'; en = 'Executing of orders routing'"), Цел(ТекИтерацияСтатус*100 / ВсегоИтерацийСтатус)), АдресВрХранилища);
			ДлительныеОперации.СообщитьПрогресс(Цел(ТекИтерацияСтатус*100 / ВсегоИтерацийСтатус), НСтр("en='Executing of orders routing';ru='Выполняется маршрутизация заказов'"));
			ТабОценок = Новый ТаблицаЗначений();
			ТабОценок.Колонки.Добавить("Значение",  Новый ОписаниеТипов("Структура"));
			ТабОценок.Колонки.Добавить("Оценка",    Новый ОписаниеТипов("Число"));
			ТабОценок.Колонки.Добавить("Приоритет", Новый ОписаниеТипов("Число"));
			
			ДанныеЗаказа = ТабЗаказы.Найти(ТекЭлемент.Значение, "Ссылка");
			
			Для Каждого ТекПул Из пулы Цикл 
				мсвРазрешенныеТС = Неопределено;
				Если УчитыватьРазрешенныеТипыТС Тогда 
					мсвРазрешенныеТС = СоотРазрешенныеТСПоЗаказам.Получить(ДанныеЗаказа.Ссылка);
				КонецЕсли;
				
				Если Не мсвРазрешенныеТС = Неопределено И мсвРазрешенныеТС.Найти(ТекПул.ТС) = Неопределено Тогда 
					Продолжить;
				КонецЕсли;
				
				мсвРазрешенныеТСПоХарактеристикам = Неопределено;
				Если ИспользоватьХарактеристикиЗаказовНаТС Тогда 
					мсвРазрешенныеТСПоХарактеристикам = СоотРазрешенныеТСПоХарактеристикам.Получить(ДанныеЗаказа.НаборХарактеристик);
				КонецЕсли;
				
				Если Не мсвРазрешенныеТСПоХарактеристикам = Неопределено И мсвРазрешенныеТСПоХарактеристикам.Найти(ТекПул.ТС) = Неопределено Тогда 
					Продолжить;
				КонецЕсли;
				
				Если МаксимальноеКоличествоЗаказовТС <> 0 И ((ТекПул.маршрут.Количество() / 2) + 1) > МаксимальноеКоличествоЗаказовТС Тогда 
					Продолжить;
				КонецЕсли;
				
				ИндВставкиПогрузки = Неопределено;
				
				ПредПул = Новый Массив();
				Для СчПоиска = 0 По ТекПул.маршрут.Количество()-1 Цикл 
					ТекЭлемент = ТекПул.маршрут[СчПоиска];
					
					ПредПул.Добавить(ТекЭлемент);
					
					Если ИндВставкиПогрузки = Неопределено И ТекЭлемент.пункт = ДанныеЗаказа.ПунктПогрузки Тогда 
						ИндВставкиПогрузки = СчПоиска;
					КонецЕсли;
				КонецЦикла;
				
				Если ИндВставкиПогрузки = Неопределено Тогда 
					// проверить, возможно, тут надо указывать ненулевые время/расстояние
					ПредПул.Добавить(Новый Структура("заказ, пункт, Адрес, Лат, Лон, Операция, Ожидание, Время, Расстояние",
						ДанныеЗаказа.Ссылка, ДанныеЗаказа.ПунктПогрузки, ДанныеЗаказа.АдресОтправления, ДанныеЗаказа.ЛатОтпр, ДанныеЗаказа.ЛонОтпр, уатТипыТочекМаршрута_Погрузка, 0, 0, 0));
				Иначе 
					// проверить, возможно, тут надо указывать ненулевые время/расстояние
					ПредПул.Вставить(ИндВставкиПогрузки+1, Новый Структура("заказ, пункт, Адрес, Лат, Лон, Операция, Ожидание, Время, Расстояние",
						ДанныеЗаказа.Ссылка, ДанныеЗаказа.ПунктПогрузки, ДанныеЗаказа.АдресОтправления, ДанныеЗаказа.ЛатОтпр, ДанныеЗаказа.ЛонОтпр, уатТипыТочекМаршрута_Погрузка, 0, 0, 0));
				КонецЕсли;
				// проверить, возможно, тут надо указывать ненулевые время/расстояние
				ПредПул.Добавить(Новый Структура("заказ, пункт, Адрес, Лат, Лон, Операция, Ожидание, Время, Расстояние",
					ДанныеЗаказа.Ссылка, ДанныеЗаказа.ПунктРазгрузки, ДанныеЗаказа.АдресНазначения, ДанныеЗаказа.ЛатНазн, ДанныеЗаказа.ЛонНазн, уатТипыТочекМаршрута_Разгрузка, 0, 0, 0));
				
				Для ИндЭлемент = 0 По ПредПул.Количество()-1 Цикл 
					Для ИндРазмещения = 0 По ПредПул.Количество()-1 Цикл 
						Если ИндЭлемент > 0 И ИндЭлемент = ИндРазмещения Тогда 
							Продолжить;
						КонецЕсли;
						
						НовПул = Новый Массив();
						
						Для Каждого ТекЭлемент Из ПредПул Цикл 
							НовПул.Добавить(Новый Структура("заказ, пункт, Адрес, Лат, Лон, Операция, Ожидание, Время, Расстояние",
								ТекЭлемент.заказ, ТекЭлемент.пункт, ТекЭлемент.Адрес, ТекЭлемент.Лат, ТекЭлемент.Лон, ТекЭлемент.Операция, ТекЭлемент.Ожидание, ТекЭлемент.Время, ТекЭлемент.Расстояние));
						КонецЦикла;
						
						ДанныеЭлемента = НовПул[ИндЭлемент];
						НовПул.Удалить(ИндЭлемент);
						НовПул.Вставить(ИндРазмещения, ДанныеЭлемента);
						
						ИдентификаторПеремещенногоГруза = ДанныеЭлемента.Заказ;
						
						НовПулКоличество = НовПул.Количество();
						
						Если НовПул[НовПулКоличество-1].операция = уатТипыТочекМаршрута_Погрузка Тогда 
							Продолжить;
						КонецЕсли;
						
						флПулКорректен = Истина;
						
						Для СчПроверка1 = 0 По НовПулКоличество-2 Цикл 
							флПроверен = Ложь;
							
							Если ТабЗаказы.Найти(НовПул[СчПроверка1].заказ, "Ссылка").FTL 
									И Не (НовПул[СчПроверка1].заказ = НовПул[СчПроверка1+1].заказ
									И НовПул[СчПроверка1].операция = уатТипыТочекМаршрута_Погрузка
									И НовПул[СчПроверка1+1].операция = уатТипыТочекМаршрута_Разгрузка) Тогда 
								флПулКорректен = Ложь;
								Прервать;
								
							ИначеЕсли НовПул[СчПроверка1].Операция = уатТипыТочекМаршрута_Погрузка
								И НовПул[СчПроверка1].Заказ = ИдентификаторПеремещенногоГруза Тогда 
								Для СчПроверка2 = СчПроверка1+1 По НовПулКоличество-1 Цикл 
									Если НовПул[СчПроверка2].Заказ = ИдентификаторПеремещенногоГруза И НовПул[СчПроверка2].Операция = уатТипыТочекМаршрута_Разгрузка Тогда 
										флПроверен = Истина;
										Прервать;
									КонецЕсли;
								КонецЦикла;
								
							Иначе 
								Продолжить;
							КонецЕсли;
							
							Если Не флПроверен Тогда 
								флПулКорректен = Ложь;
								Прервать;
							КонецЕсли;
						КонецЦикла;
						
						Если Не флПулКорректен Тогда 
							Продолжить;
						КонецЕсли;
						
						Встав = Истина;
						ОбщВремя = 0;
						ОбщРасстояние = 0;
						ПредПосещенныйПункт = Неопределено;
						
						ВремяВыездаНаМаршрут = ВремяВыезда - НачалоДня(ВремяВыезда);
						Если РежимВремениВыездаИзГаража = 0 И НовПулКоличество Тогда 
							// Время следования от гаража до первого пункта.
							ПунктСтарт = ТекПул.Гараж;
							ПунктФиниш = НовПул[0].пункт;
							АдресСтарт = ТекПул.АдресГаража;
							АдресФиниш = НовПул[0].Адрес;
							
							ВремяДоПервогоПункта = 0;
							мРасстояние = 0;
							
							Если ПунктСтарт = ПунктФиниш Тогда 
								Если Не АдресСтарт = АдресФиниш Тогда 
									ДанныеПоКластеру = Обработки.уатАРМЛогиста_уэ.ВремяРасстояниеПоКоординатам(ТекПул.ШиротаГаража, ТекПул.ДолготаГаража, НовПул[0].Лат, НовПул[0].Лон);
									ВремяДоПервогоПункта = ДанныеПоКластеру.Время;
									мРасстояние = ДанныеПоКластеру.Расстояние;
								КонецЕсли;
								
							Иначе 
								Узел1 = СоотвТаблРасстояний.Получить(ПунктСтарт);
								Если Не Узел1 = Неопределено Тогда 
									Узел2 = Узел1.Получить(ПунктФиниш);
									Если Не Узел2 = Неопределено Тогда 
										ВремяДоПервогоПункта = Узел2.Время;
										мРасстояние          = Узел2.Расстояние;
									КонецЕсли;
								КонецЕсли;
							КонецЕсли;
							
							СтрокаЗаказа = ТабЗаказы.Найти(НовПул[0].заказ, "Ссылка");
							Если Не СтрокаЗаказа = Неопределено Тогда 
								ВремяВыездаНаМаршрут = СтрокаЗаказа.ОтправлениеС - '00010101';
								
								ВремяДоПервогоПункта = уатЗащищенныеФункцииСервер_уэ.ПолучитьВремяВПутиВСекундахСУчетомСреднейСкорости(
									мРасстояние, ВремяДоПервогоПункта, ВремяВыездаНаМаршрут, ТабСкоростей);
								
								ВремяВыездаНаМаршрут = ВремяВыездаНаМаршрут - ВремяДоПервогоПункта;
							КонецЕсли;
						КонецЕсли;
						
						МаксимальныйВес   = 0;
						МаксимальныйОбъем = 0;
						ВсегоУпаковок     = 0;
						
						ТекВес      = 0;
						ТекОбъем    = 0;
						ТекУпаковок = 0;
						
						Для СчОбх = -1 По НовПулКоличество-1 Цикл
							ДопЗадержка = 0;
							
							Если СчОбх = -1 Тогда 
								ПунктСтарт = ТекПул.Гараж;
								АдресСтарт = ТекПул.АдресГаража;
								ЛатСтарт   = ТекПул.ШиротаГаража;
								ЛонСтарт   = ТекПул.ДолготаГаража;
							Иначе 
								ПунктСтарт = НовПул[СчОбх].пункт;
								АдресСтарт = НовПул[СчОбх].Адрес;
								ЛатСтарт   = НовПул[СчОбх].Лат;
								ЛонСтарт   = НовПул[СчОбх].Лон;
							КонецЕсли;
							
							Если СчОбх = НовПулКоличество-1 Тогда 
								Если Не ТекПул.ВозвратВГараж Тогда 
									Продолжить;
								КонецЕсли;
								ПунктФиниш = ТекПул.Гараж;
								АдресФиниш = ТекПул.АдресГаража;
								ЛатФиниш   = ТекПул.ШиротаГаража;
								ЛонФиниш   = ТекПул.ДолготаГаража;
							Иначе 
								ПунктФиниш = НовПул[СчОбх+1].пункт;
								АдресФиниш = НовПул[СчОбх+1].Адрес;
								ЛатФиниш   = НовПул[СчОбх+1].Лат;
								ЛонФиниш   = НовПул[СчОбх+1].Лон;
							КонецЕсли;
							
							Если ПунктСтарт = ПунктФиниш Тогда 
								Если АдресСтарт = АдресФиниш Тогда 
									мВремя = 0;
									мРасстояние = 0;
								Иначе 
									ДанныеПоКластеру = Обработки.уатАРМЛогиста_уэ.ВремяРасстояниеПоКоординатам(ЛатСтарт, ЛонСтарт, ЛатФиниш, ЛонФиниш);
									мВремя = ДанныеПоКластеру.Время;
									мРасстояние = ДанныеПоКластеру.Расстояние;
								КонецЕсли;
								
							Иначе 
								Узел1 = СоотвТаблРасстояний.Получить(ПунктСтарт);
								Если Узел1 = Неопределено Тогда 
									Встав = Ложь;
									Прервать;
								КонецЕсли;
								Узел2 = Узел1.Получить(ПунктФиниш);
								Если Узел2 = Неопределено Тогда 
									Встав = Ложь;
									Прервать;
								КонецЕсли;
								мВремя      = Узел2.Время;
								мРасстояние = Узел2.Расстояние;
							КонецЕсли;
							
							ВремяВТочке = ВремяВыездаНаМаршрут + ОбщВремя;
							
							мВремя = уатЗащищенныеФункцииСервер_уэ.ПолучитьВремяВПутиВСекундахСУчетомСреднейСкорости(мРасстояние,
								мВремя * 3600, ВремяВТочке, ТабСкоростей);
							
							ВремяВТочке = ВремяВТочке + мВремя;
							
							Если Не СчОбх = НовПулКоличество-1 Тогда 
								СтрокаЗаказа = ТабЗаказы.Найти(НовПул[СчОбх+1].заказ, "Ссылка");
								Если Не СтрокаЗаказа = Неопределено Тогда 
									Если НовПул[СчОбх+1].Операция = уатТипыТочекМаршрута_Погрузка Тогда 
										ОжиданиеПосещения = 0;
										Если УчитыватьОкнаПоЗаказам И Не уатЗащищенныеФункцииСервер_уэ.ВремяПосещенияВСекундахВПределахОкна(
											ВремяВТочке, СтрокаЗаказа.ОтправлениеС, СтрокаЗаказа.ОтправлениеПо, ОжиданиеПосещения) Тогда 
											Встав = Ложь;
											Прервать;
										КонецЕсли;
										
										Если ОжиданиеПосещения > 0 И ПредПосещенныйПункт = СтрокаЗаказа.АдресОтправления Тогда 
											Встав = Ложь;
											Прервать;
										КонецЕсли;
										
										НовПул[СчОбх+1].Ожидание = ОжиданиеПосещения;
										НовПул[СчОбх+1].Время = мВремя;
										НовПул[СчОбх+1].Расстояние = мРасстояние;
										
										Если ОжиданиеПосещения > 0 Тогда 
											ВремяВТочке = ВремяВТочке + ОжиданиеПосещения;
											мВремя = мВремя + ОжиданиеПосещения;
										КонецЕсли;
										
										Если Не ПредПосещенныйПункт = СтрокаЗаказа.АдресОтправления Тогда 
											мВремя = мВремя + СтрокаЗаказа.ДопСтоянкаПунктОтправления;
											ВремяВТочке = ВремяВТочке + СтрокаЗаказа.ДопСтоянкаПунктОтправления;
										КонецЕсли;
										
										мВремя = мВремя + СтрокаЗаказа.СтоянкаПунктОтправления;
										ВремяВТочке = ВремяВТочке + СтрокаЗаказа.СтоянкаПунктОтправления;
										
										ПредПосещенныйПункт = СтрокаЗаказа.АдресОтправления;
										
										ТекВес      = ТекВес + СтрокаЗаказа.ВесБрутто;
										ТекОбъем    = ТекОбъем + СтрокаЗаказа.Объем;
										ТекУпаковок = ТекУпаковок + СтрокаЗаказа.КоличествоУпаковок;
										
									Иначе 
										ОжиданиеПосещения = 0;
										Если УчитыватьОкнаПоЗаказам И Не уатЗащищенныеФункцииСервер_уэ.ВремяПосещенияВСекундахВПределахОкна(
											ВремяВТочке, СтрокаЗаказа.ДоставкаС, СтрокаЗаказа.ДоставкаПо, ОжиданиеПосещения) Тогда 
											Встав = Ложь;
											Прервать;
										КонецЕсли;
										
										Если ОжиданиеПосещения > 0 И ПредПосещенныйПункт = СтрокаЗаказа.АдресНазначения Тогда 
											Встав = Ложь;
											Прервать;
										КонецЕсли;
										
										НовПул[СчОбх+1].Ожидание = ОжиданиеПосещения;
										НовПул[СчОбх+1].Время = мВремя;
										НовПул[СчОбх+1].Расстояние = мРасстояние;
										
										Если ОжиданиеПосещения > 0 Тогда 
											ВремяВТочке = ВремяВТочке + ОжиданиеПосещения;
											мВремя = мВремя + ОжиданиеПосещения;
										КонецЕсли;
										
										Если Не ПредПосещенныйПункт = СтрокаЗаказа.АдресНазначения Тогда 
											мВремя = мВремя + СтрокаЗаказа.ДопСтоянкаПунктНазначения;
											ВремяВТочке = ВремяВТочке + СтрокаЗаказа.ДопСтоянкаПунктНазначения;
										КонецЕсли;
										
										мВремя = мВремя + СтрокаЗаказа.СтоянкаПунктНазначения;
										ВремяВТочке = ВремяВТочке + СтрокаЗаказа.СтоянкаПунктНазначения;
										
										ПредПосещенныйПункт = СтрокаЗаказа.АдресНазначения;
										
										ТекВес      = ТекВес - СтрокаЗаказа.ВесБрутто;
										ТекОбъем    = ТекОбъем - СтрокаЗаказа.Объем;
										ТекУпаковок = ТекУпаковок - СтрокаЗаказа.КоличествоУпаковок;
									КонецЕсли;
									
									МаксимальныйВес   = Макс(МаксимальныйВес, ТекВес);
									МаксимальныйОбъем = Макс(МаксимальныйОбъем, ТекОбъем);
									ВсегоУпаковок     = Макс(ВсегоУпаковок, ТекУпаковок);
								КонецЕсли;
							КонецЕсли;
							
							ОбщВремя      = ОбщВремя + мВремя;
							ОбщРасстояние = ОбщРасстояние + мРасстояние;
						КонецЦикла;
						
						Если Не Встав Тогда 
							Продолжить;
						КонецЕсли;
						
						ТекОценка = ?(РежимОптимизации = 0, ОбщВремя, ОбщРасстояние);
						
						Если Не ОграничениеЧасов = 0 И ОбщВремя > ОграничениеЧасов * 3600 Тогда 
							Встав = Ложь;
							Продолжить;
						КонецЕсли;
						
						Если Не ОграничениеПоРасстоянию = 0 И ОбщРасстояние > ОграничениеПоРасстоянию Тогда 
							Встав = Ложь;
							Продолжить;
						КонецЕсли;
						
						Если Не МаксимальноеЧислоПунктов = 0 Тогда 
							мсвПунктыМаршрута = Новый Массив();
							мсвПунктыМаршрута.Добавить(ТекПул.АдресГаража);
							
							Для Каждого ТекЭлМаршрута Из НовПул Цикл 
								СтрокаТабЗаказы = ТабЗаказы.Найти(ТекЭлМаршрута.заказ, "Ссылка");
								Если Не СтрокаТабЗаказы = Неопределено Тогда 
									Если ТекЭлМаршрута.Операция = уатТипыТочекМаршрута_Погрузка Тогда 
										ТекАдресЗаказа = СтрокаТабЗаказы.АдресОтправления;
									Иначе 
										ТекАдресЗаказа = СтрокаТабЗаказы.АдресНазначения;
									КонецЕсли;
									
									Если Не мсвПунктыМаршрута[мсвПунктыМаршрута.Количество()-1] = ТекАдресЗаказа Тогда 
										мсвПунктыМаршрута.Добавить(ТекАдресЗаказа);
									КонецЕсли;
								КонецЕсли;
							КонецЦикла;
							
							Если ТекПул.ВозвратВГараж Тогда 
								Если Не мсвПунктыМаршрута[мсвПунктыМаршрута.Количество()-1] = ТекПул.АдресГаража Тогда 
									мсвПунктыМаршрута.Добавить(ТекПул.АдресГаража);
								КонецЕсли;
							КонецЕсли;
							
							Если мсвПунктыМаршрута.Количество() > МаксимальноеЧислоПунктов Тогда 
								Встав = Ложь;
								Продолжить;
							КонецЕсли;
						КонецЕсли;
						
						Если (ТекПул.ГрузоподъемностьТС <> 0 И ТекПул.ГрузоподъемностьТС < МаксимальныйВес)
								Или (ТекПул.ОбъемКузоваТС <> 0 И ТекПул.ОбъемКузоваТС < МаксимальныйОбъем) 
								Или (ТекПул.МаксимальноеКоличествоУпаковок <> 0 И ТекПул.МаксимальноеКоличествоУпаковок < ВсегоУпаковок) Тогда
							
							ТабПодходящихТС = Новый ТаблицаЗначений();
							ТабПодходящихТС.Колонки.Добавить("Ссылка",    Новый ОписаниеТипов("СправочникСсылка.уатТС"));
							ТабПодходящихТС.Колонки.Добавить("Приоритет", Новый ОписаниеТипов("Число"));
							ТабПодходящихТС.Колонки.Добавить("Порядок",   Новый ОписаниеТипов("Число"));
							
							Для Каждого ТекТС Из ТабТС Цикл 
								Если (ТекТС.Грузоподъемность <> 0 И ТекТС.Грузоподъемность < МаксимальныйВес)
										Или (ТекТС.ОбъемКузова <> 0 И ТекТС.ОбъемКузова < МаксимальныйОбъем) 
										Или (ТекТС.МаксимальноеКоличествоУпаковок <> 0 И ТекТС.МаксимальноеКоличествоУпаковок < ВсегоУпаковок) Тогда 
									Продолжить;
								КонецЕсли;
								
								Если УчитыватьРазрешенныеТипыТС Тогда 
									флТСдоступенПоТипам = Истина;
									Для Каждого ТекЭлПула Из НовПул Цикл 
										Если Не ТекЭлПула.Операция = уатТипыТочекМаршрута_Погрузка Тогда 
											Продолжить;
										КонецЕсли;
										
										мсвРазрешенныеТС = СоотРазрешенныеТСПоЗаказам.Получить(ТекЭлПула.заказ);
										Если Не мсвРазрешенныеТС = Неопределено И мсвРазрешенныеТС.Найти(ТекТС.Ссылка) = Неопределено Тогда 
											флТСдоступенПоТипам = Ложь;
											Прервать;
										КонецЕсли;
									КонецЦикла;
									
									Если Не флТСдоступенПоТипам Тогда 
										Продолжить;
									КонецЕсли;
								КонецЕсли;
								
								флРазрешеноПоХарактеристикам = Истина;
								
								Если ИспользоватьХарактеристикиЗаказовНаТС Тогда 
									Для Каждого ТекЭлПула Из НовПул Цикл 
										Если Не ТекЭлПула.Операция = уатТипыТочекМаршрута_Погрузка Тогда 
											Продолжить;
										КонецЕсли;
										
										ТекСтрокаЗаказ = ТабЗаказы.Найти(ТекЭлПула.заказ, "Ссылка");
										мсвРазрешенныеТС = СоотРазрешенныеТСПоХарактеристикам.Получить(ТекСтрокаЗаказ.НаборХарактеристик);
										Если Не мсвРазрешенныеТС = Неопределено И мсвРазрешенныеТС.Найти(ТекТС.Ссылка) = Неопределено Тогда 
											флРазрешеноПоХарактеристикам = Ложь;
											Прервать;
										КонецЕсли;
									КонецЦикла;
								КонецЕсли;
								
								Если Не флРазрешеноПоХарактеристикам Тогда 
									Продолжить;
								КонецЕсли;
								
								текВремя = 0;
								текРасстояние = 0;
								
								Если ТекТС.Гараж = НовПул[0].пункт Тогда 
									Если Не ТекТС.АдресГаража = НовПул[0].Адрес Тогда 
										ДанныеПоКластеру = Обработки.уатАРМЛогиста_уэ.ВремяРасстояниеПоКоординатам(ТекТС.ШиротаГаража, ТекТС.ДолготаГаража, НовПул[0].Лат, НовПул[0].Лон);
										текВремя = ДанныеПоКластеру.Время;
										текРасстояние = ДанныеПоКластеру.Расстояние;
									КонецЕсли;
									
								Иначе 
									Узел1 = СоотвТаблРасстояний.Получить(ТекТС.Гараж);
									Если Узел1 = Неопределено Тогда 
										Продолжить;
									КонецЕсли;
									Узел2 = Узел1.Получить(НовПул[0].пункт);
									Если Узел2 = Неопределено Тогда 
										Продолжить;
									КонецЕсли;
									текВремя = Узел2.Время;
									текРасстояние = Узел2.Расстояние;
								КонецЕсли;
								
								НовПодходящееТС = ТабПодходящихТС.Добавить();
								НовПодходящееТС.Ссылка    = ТекТС.Ссылка;
								НовПодходящееТС.Приоритет = ТекТС.Приоритет;
								НовПодходящееТС.Порядок   = ?(РежимОптимизации = 0, текВремя, текРасстояние);
							КонецЦикла;
							
							Если ТабПодходящихТС.Количество() = 0 Тогда 
								Встав = Ложь;
								Продолжить;
							КонецЕсли;
							
							ТабПодходящихТС.Сортировать("Приоритет Убыв, Порядок Возр");
							
							НовТС = ТабПодходящихТС[0].Ссылка;
						Иначе 
							НовТС = Неопределено;
						КонецЕсли;
						
						Если Встав Тогда 
							НовСтрокаОценки = ТабОценок.Добавить();
							НовСтрокаОценки.Значение = Новый Структура("Пул,НовПул,НовОценка,НовТС,ВремяВыездаНаМаршрут,МаксимальныйВес,МаксимальныйОбъем,ВсегоУпаковок",
								ТекПул,
								НовПул,
								ТекОценка,
								НовТС,
								ВремяВыездаНаМаршрут,
								МаксимальныйВес,
								МаксимальныйОбъем,
								ВсегоУпаковок
							);
							НовСтрокаОценки.Оценка = ТекОценка-ТекПул.оценка;
							НовСтрокаОценки.Приоритет = ДанныеЗаказа.Приоритет;
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
			
			Если ТабТС.Количество() Тогда 
				МаксимальныйВес   = ДанныеЗаказа.ВесБрутто;
				МаксимальныйОбъем = ДанныеЗаказа.Объем;
				ВсегоУпаковок     = ДанныеЗаказа.КоличествоУпаковок;
				
				СтрокаТС = Неопределено;
				
				ТабПодходящихТС = Новый ТаблицаЗначений();
				ТабПодходящихТС.Колонки.Добавить("Ссылка",    Новый ОписаниеТипов("СправочникСсылка.уатТС"));
				ТабПодходящихТС.Колонки.Добавить("Приоритет", Новый ОписаниеТипов("Число"));
				ТабПодходящихТС.Колонки.Добавить("Порядок",   Новый ОписаниеТипов("Число"));
				
				мсвРазрешенныеТС = Неопределено;
				Если УчитыватьРазрешенныеТипыТС Тогда 
					мсвРазрешенныеТС = СоотРазрешенныеТСПоЗаказам.Получить(ДанныеЗаказа.Ссылка);
				КонецЕсли;
				
				мсвРазрешенныеТСПоХарактеристикам = Неопределено;
				Если ИспользоватьХарактеристикиЗаказовНаТС Тогда 
					мсвРазрешенныеТСПоХарактеристикам = СоотРазрешенныеТСПоХарактеристикам.Получить(ДанныеЗаказа.НаборХарактеристик);
				КонецЕсли;
				
				Для Каждого ТекТС Из ТабТС Цикл 
					Если (ТекТС.Грузоподъемность <> 0 И ТекТС.Грузоподъемность < МаксимальныйВес)
							Или (ТекТС.ОбъемКузова <> 0 И ТекТС.ОбъемКузова < МаксимальныйОбъем) 
							Или (ТекТС.МаксимальноеКоличествоУпаковок <> 0 И ТекТС.МаксимальноеКоличествоУпаковок < ВсегоУпаковок) 
							Или (Не мсвРазрешенныеТС = Неопределено И мсвРазрешенныеТС.Найти(ТекТС.Ссылка) = Неопределено)
							Или (Не мсвРазрешенныеТСПоХарактеристикам = Неопределено И мсвРазрешенныеТСПоХарактеристикам.Найти(ТекТС.Ссылка) = Неопределено) Тогда 
						Продолжить;
					КонецЕсли;
					
					текВремя = 0;
					текРасстояние = 0;
					
					Если ТекТС.Гараж = ДанныеЗаказа.ПунктПогрузки Тогда 
						Если Не ТекТС.АдресГаража = ДанныеЗаказа.АдресОтправления Тогда 
							ДанныеПоКластеру = Обработки.уатАРМЛогиста_уэ.ВремяРасстояниеПоКоординатам(ТекТС.ШиротаГаража, ТекТС.ДолготаГаража, ДанныеЗаказа.ЛатОтпр, ДанныеЗаказа.ЛонОтпр);
							текВремя = ДанныеПоКластеру.Время;
							текРасстояние = ДанныеПоКластеру.Расстояние;
						КонецЕсли;
						
					Иначе 
						Узел1 = СоотвТаблРасстояний.Получить(ТекТС.Гараж);
						Если Узел1 = Неопределено Тогда 
							Продолжить;
						КонецЕсли;
						Узел2 = Узел1.Получить(ДанныеЗаказа.ПунктПогрузки);
						Если Узел2 = Неопределено Тогда 
							Продолжить;
						КонецЕсли;
						текВремя = Узел2.Время;
						текРасстояние = Узел2.Расстояние;
					КонецЕсли;
					
					НовПодходящееТС = ТабПодходящихТС.Добавить();
					НовПодходящееТС.Ссылка    = ТекТС.Ссылка;
					НовПодходящееТС.Приоритет = ТекТС.Приоритет;
					НовПодходящееТС.Порядок = ?(РежимОптимизации = 0, текВремя, текРасстояние);
				КонецЦикла;
				
				Если Не ТабПодходящихТС.Количество() = 0 Тогда 
					ТабПодходящихТС.Сортировать("Приоритет Убыв, Порядок Возр");
					
					СтрокаТС = ТабТС.Найти(ТабПодходящихТС[0].Ссылка, "Ссылка");
					
					ОбщВремя = 0;
					ОбщРасстояние = 0;
					Встав = Истина;
					мсвПосещенныеПункты = Новый Массив();
					
					ВремяВыездаНаМаршрут = ВремяВыезда - НачалоДня(ВремяВыезда);
					Если РежимВремениВыездаИзГаража = 0 Тогда 
						// Время следования от гаража до первого пункта.
						ПунктСтарт = СтрокаТС.Гараж;
						ПунктФиниш = ДанныеЗаказа.ПунктПогрузки;
						АдресСтарт = СтрокаТС.АдресГаража;
						АдресФиниш = ДанныеЗаказа.АдресОтправления;
						
						ВремяДоПервогоПункта = 0;
						мРасстояние = 0;
						
						Если ПунктСтарт = ПунктФиниш Тогда 
							Если Не АдресСтарт = АдресФиниш Тогда 
								ДанныеПоКластеру = Обработки.уатАРМЛогиста_уэ.ВремяРасстояниеПоКоординатам(СтрокаТС.ШиротаГаража, СтрокаТС.ДолготаГаража, ДанныеЗаказа.ЛатОтпр, ДанныеЗаказа.ЛонОтпр);
								ВремяДоПервогоПункта = ДанныеПоКластеру.Время;
								мРасстояние = ДанныеПоКластеру.Расстояние;
							КонецЕсли;
							
						Иначе 
							Узел1 = СоотвТаблРасстояний.Получить(ПунктСтарт);
							Если Не Узел1 = Неопределено Тогда 
								Узел2 = Узел1.Получить(ПунктФиниш);
								Если Не Узел2 = Неопределено Тогда 
									ВремяДоПервогоПункта = Узел2.Время;
									мРасстояние          = Узел2.Расстояние;
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
						
						ВремяВыездаНаМаршрут = ДанныеЗаказа.ОтправлениеС - '00010101';
						
						мВремя = уатЗащищенныеФункцииСервер_уэ.ПолучитьВремяВПутиВСекундахСУчетомСреднейСкорости(мРасстояние,
							ВремяДоПервогоПункта, ВремяВыездаНаМаршрут, ТабСкоростей);
						
						ВремяВыездаНаМаршрут = ВремяВыездаНаМаршрут - ВремяДоПервогоПункта;
					КонецЕсли;
					
					Для СчОбх = 0 По 2 Цикл
						Если СчОбх = 0 Тогда 
							ПунктСтарт = СтрокаТС.Гараж;
							ПунктФиниш = ДанныеЗаказа.ПунктПогрузки;
							АдресСтарт = СтрокаТС.АдресГаража;
							АдресФиниш = ДанныеЗаказа.АдресОтправления;
							ЛатСтарт   = СтрокаТС.ШиротаГаража;
							ЛонСтарт   = СтрокаТС.ДолготаГаража;
							ЛатФиниш   = ДанныеЗаказа.ЛатОтпр;
							ЛонФиниш   = ДанныеЗаказа.ЛонОтпр;
							
						ИначеЕсли СчОбх = 2 Тогда 
							Если Не СтрокаТС.ВозвратВГараж Тогда 
								Продолжить;
							КонецЕсли;
							ПунктСтарт = ДанныеЗаказа.ПунктРазгрузки;
							ПунктФиниш = СтрокаТС.Гараж;
							АдресСтарт = ДанныеЗаказа.АдресНазначения;
							АдресФиниш = СтрокаТС.АдресГаража;
							ЛатСтарт   = ДанныеЗаказа.ЛатНазн;
							ЛонСтарт   = ДанныеЗаказа.ЛонНазн;
							ЛатФиниш   = СтрокаТС.ШиротаГаража;
							ЛонФиниш   = СтрокаТС.ДолготаГаража;
							
						Иначе 
							ПунктСтарт = ДанныеЗаказа.ПунктПогрузки;
							ПунктФиниш = ДанныеЗаказа.ПунктРазгрузки;
							АдресСтарт = ДанныеЗаказа.АдресОтправления;
							АдресФиниш = ДанныеЗаказа.АдресНазначения;
							ЛатСтарт   = ДанныеЗаказа.ЛатОтпр;
							ЛонСтарт   = ДанныеЗаказа.ЛонОтпр;
							ЛатФиниш   = ДанныеЗаказа.ЛатНазн;
							ЛонФиниш   = ДанныеЗаказа.ЛонНазн;
						КонецЕсли;
						
						мВремя = 0;
						мРасстояние = 0;
						
						Если ПунктСтарт = ПунктФиниш Тогда 
							Если Не АдресСтарт = АдресФиниш Тогда 
								ДанныеПоКластеру = Обработки.уатАРМЛогиста_уэ.ВремяРасстояниеПоКоординатам(ЛатСтарт, ЛонСтарт, ЛатФиниш, ЛонФиниш);
								мВремя = ДанныеПоКластеру.Время;
								мРасстояние = ДанныеПоКластеру.Расстояние;
							КонецЕсли;
							
						Иначе 
							Узел1 = СоотвТаблРасстояний.Получить(ПунктСтарт);
							Если Узел1 = Неопределено Тогда 
								Встав = Ложь;
								Прервать;
							КонецЕсли;
							Узел2 = Узел1.Получить(ПунктФиниш);
							Если Узел2 = Неопределено Тогда 
								Встав = Ложь;
								Прервать;
							КонецЕсли;
							
							мВремя      = Узел2.Время;
							мРасстояние = Узел2.Расстояние;
						КонецЕсли;
						
						ВремяВТочке = ВремяВыездаНаМаршрут + ОбщВремя;
						
						мВремя = уатЗащищенныеФункцииСервер_уэ.ПолучитьВремяВПутиВСекундахСУчетомСреднейСкорости(мРасстояние,
							мВремя, ВремяВТочке, ТабСкоростей);
						
						ВремяВТочке = ВремяВТочке + мВремя;
						
						Если СчОбх = 0 Тогда 
							ВремяПунктПогрузки = мВремя;
							РасстояниеПунктПогрузки = мРасстояние;
							ОжиданиеПогрузки = 0;
							Если УчитыватьОкнаПоЗаказам И Не уатЗащищенныеФункцииСервер_уэ.ВремяПосещенияВСекундахВПределахОкна(
								ВремяВТочке, ДанныеЗаказа.ОтправлениеС, ДанныеЗаказа.ОтправлениеПо, ОжиданиеПогрузки) Тогда 
								Встав = Ложь;
								Прервать;
							КонецЕсли;
							
							Если ОжиданиеПогрузки > 0 Тогда 
								ВремяВТочке = ВремяВТочке + ОжиданиеПогрузки;
								мВремя = мВремя + ОжиданиеПогрузки;
							КонецЕсли;
							
							Если мсвПосещенныеПункты.Найти(ДанныеЗаказа.АдресОтправления) = Неопределено Тогда 
								мсвПосещенныеПункты.Добавить(ДанныеЗаказа.АдресОтправления);
								мВремя = мВремя + ДанныеЗаказа.ДопСтоянкаПунктОтправления;
								ВремяВТочке = ВремяВТочке + ДанныеЗаказа.ДопСтоянкаПунктОтправления;
							КонецЕсли;
							
							мВремя = мВремя + ДанныеЗаказа.СтоянкаПунктОтправления;
							ВремяВТочке = ВремяВТочке + ДанныеЗаказа.СтоянкаПунктОтправления;
							
						ИначеЕсли СчОбх = 1 Тогда
							ВремяПунктРазгрузки = мВремя;
							РасстояниеПунктРазгрузки = мРасстояние;
							ОжиданиеРазгрузки = 0;
							Если УчитыватьОкнаПоЗаказам И Не уатЗащищенныеФункцииСервер_уэ.ВремяПосещенияВСекундахВПределахОкна(
								ВремяВТочке, ДанныеЗаказа.ДоставкаС, ДанныеЗаказа.ДоставкаПо, ОжиданиеРазгрузки) Тогда 
								Встав = Ложь;
								Прервать;
							КонецЕсли;
							
							Если ОжиданиеРазгрузки > 0 Тогда 
								ВремяВТочке = ВремяВТочке + ОжиданиеРазгрузки;
								мВремя = мВремя + ОжиданиеРазгрузки;
							КонецЕсли;
							
							Если мсвПосещенныеПункты.Найти(ДанныеЗаказа.АдресНазначения) = Неопределено Тогда 
								мсвПосещенныеПункты.Добавить(ДанныеЗаказа.АдресНазначения);
								мВремя = мВремя + ДанныеЗаказа.ДопСтоянкаПунктНазначения;
								ВремяВТочке = ВремяВТочке + ДанныеЗаказа.ДопСтоянкаПунктНазначения;
							КонецЕсли;
							
							мВремя = мВремя + ДанныеЗаказа.СтоянкаПунктНазначения;
							ВремяВТочке = ВремяВТочке + ДанныеЗаказа.СтоянкаПунктНазначения;
						КонецЕсли;
						
						ОбщВремя      = ОбщВремя + мВремя;
						ОбщРасстояние = ОбщРасстояние + мРасстояние;
						
						Если ?(ОграничениеЧасов=0, Ложь, ОбщВремя > ОграничениеЧасов * 3600) Тогда 
							Встав = Ложь;
							Прервать;
						КонецЕсли;
						
						Если ?(ОграничениеПоРасстоянию=0, Ложь, ОбщРасстояние > ОграничениеПоРасстоянию) Тогда 
							Встав = Ложь;
							Прервать;
						КонецЕсли;
						
						Если Не Встав Тогда 
							Прервать;
						КонецЕсли;
					КонецЦикла;
					
					Если Не МаксимальноеЧислоПунктов = 0 Тогда 
						мсвПунктыМаршрута = Новый Массив();
						мсвПунктыМаршрута.Добавить(СтрокаТС.АдресГаража);
						
						ТекАдресЗаказа = ДанныеЗаказа.АдресОтправления;
						Если Не мсвПунктыМаршрута[мсвПунктыМаршрута.Количество()-1] = ТекАдресЗаказа Тогда 
							мсвПунктыМаршрута.Добавить(ТекАдресЗаказа);
						КонецЕсли;
						
						ТекАдресЗаказа = ДанныеЗаказа.АдресНазначения;
						Если Не мсвПунктыМаршрута[мсвПунктыМаршрута.Количество()-1] = ТекАдресЗаказа Тогда 
							мсвПунктыМаршрута.Добавить(ТекАдресЗаказа);
						КонецЕсли;
						
						Если СтрокаТС.ВозвратВГараж Тогда 
							Если Не мсвПунктыМаршрута[мсвПунктыМаршрута.Количество()-1] = СтрокаТС.АдресГаража Тогда 
								мсвПунктыМаршрута.Добавить(СтрокаТС.АдресГаража);
							КонецЕсли;
						КонецЕсли;
						
						Если мсвПунктыМаршрута.Количество() > МаксимальноеЧислоПунктов Тогда 
							Встав = Ложь;
							Продолжить;
						КонецЕсли;
					КонецЕсли;
					
					Если Встав Тогда 
						НовПул = Новый Массив();
						НовПул.Добавить(Новый Структура("заказ, пункт, Адрес, Лат, Лон, Операция, Ожидание, Время, Расстояние",
							ДанныеЗаказа.Ссылка, ДанныеЗаказа.ПунктПогрузки, ДанныеЗаказа.АдресОтправления,
							ДанныеЗаказа.ЛатОтпр, ДанныеЗаказа.ЛонОтпр, уатТипыТочекМаршрута_Погрузка, ОжиданиеПогрузки, ВремяПунктПогрузки, РасстояниеПунктПогрузки));
						НовПул.Добавить(Новый Структура("заказ, пункт, Адрес, Лат, Лон, Операция, Ожидание, Время, Расстояние",
							ДанныеЗаказа.Ссылка, ДанныеЗаказа.ПунктРазгрузки, ДанныеЗаказа.АдресНазначения,
							ДанныеЗаказа.ЛатНазн, ДанныеЗаказа.ЛонНазн, уатТипыТочекМаршрута_Разгрузка, ОжиданиеРазгрузки, ВремяПунктРазгрузки, РасстояниеПунктРазгрузки));
						
						НовСтрокаОценки = ТабОценок.Добавить();
						НовСтрокаОценки.Значение = Новый Структура("Пул,НовПул,НовОценка,НовТС,ВремяВыездаНаМаршрут,МаксимальныйВес,МаксимальныйОбъем,ВсегоУпаковок",
							Неопределено,
							НовПул,
							?(РежимОптимизации = 0, ОбщВремя, ОбщРасстояние),
							ТабПодходящихТС[0].Ссылка,
							ВремяВыездаНаМаршрут,
							МаксимальныйВес,
							МаксимальныйОбъем,
							ВсегоУпаковок
						);
						НовСтрокаОценки.Оценка = ?(РежимОптимизации = 0, ОбщВремя, ОбщРасстояние);
						НовСтрокаОценки.Приоритет = ДанныеЗаказа.Приоритет;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			ТабОценок.Сортировать("Оценка Возр, Приоритет Убыв");
			
			Для Каждого ТекВариант Из ТабОценок Цикл 
				Если ТекВариант.Значение.пул = Неопределено Тогда 
					СтрокаТС = ТабТС.Найти(ТекВариант.Значение.НовТС, "Ссылка");
					
					ДанныеПула = Новый Структура("ТС,ГрузоподъемностьТС,ОбъемКузоваТС,ПорядокТС,ВозвратВГараж,Гараж,АдресГаража,ШиротаГаража,ДолготаГаража,МаксимальноеКоличествоУпаковок,
						|оценка,маршрут,МаксимальныйВес,МаксимальныйОбъем,ВремяВыездаНаМаршрут,ПриоритетТС",
						СтрокаТС.Ссылка,
						СтрокаТС.Грузоподъемность,
						СтрокаТС.ОбъемКузова,
						СтрокаТС.Порядок,
						СтрокаТС.ВозвратВГараж,
						СтрокаТС.Гараж,
						СтрокаТС.АдресГаража,
						СтрокаТС.ШиротаГаража,
						СтрокаТС.ДолготаГаража,
						СтрокаТС.МаксимальноеКоличествоУпаковок,
						ТекВариант.Значение.НовОценка,
						Новый Массив(),
						ТекВариант.Значение.МаксимальныйВес,
						ТекВариант.Значение.МаксимальныйОбъем,
						ТекВариант.Значение.ВремяВыездаНаМаршрут,
						СтрокаТС.Приоритет);
						
					Для Каждого ТекЭлПула Из ТекВариант.Значение.НовПул Цикл 
						ДанныеПула.маршрут.Добавить(Новый Структура("заказ, пункт, Адрес, Лат, Лон, Операция, Ожидание, Время, Расстояние",
							ТекЭлПула.заказ,
							ТекЭлПула.пункт,
							ТекЭлПула.Адрес,
							ТекЭлПула.Лат,
							ТекЭлПула.Лон,
							ТекЭлПула.Операция,
							ТекЭлПула.Ожидание,
							ТекЭлПула.Время,
							ТекЭлПула.Расстояние));
					КонецЦикла;
					
					пулы.Добавить(ДанныеПула);
					ТабТС.Удалить(СтрокаТС);
					Прервать;
					
				Иначе
					Если Не ТекВариант.Значение.НовТС = Неопределено Тогда 
						СтрокаТС = ТабТС.Найти(ТекВариант.Значение.НовТС, "Ссылка");
						
						// вернуть старый ТС
						НовСтрТС = ТабТС.Добавить();
						НовСтрТС.Ссылка                         = ТекВариант.Значение.пул.ТС;
						НовСтрТС.Грузоподъемность               = ТекВариант.Значение.пул.ГрузоподъемностьТС;
						НовСтрТС.ОбъемКузова                    = ТекВариант.Значение.пул.ОбъемКузоваТС;
						НовСтрТС.Порядок                        = ТекВариант.Значение.пул.ПорядокТС;
						НовСтрТС.ВозвратВГараж                  = ТекВариант.Значение.пул.ВозвратВГараж;
						НовСтрТС.Гараж                          = ТекВариант.Значение.пул.Гараж;
						НовСтрТС.АдресГаража                    = ТекВариант.Значение.пул.АдресГаража;
						НовСтрТС.ШиротаГаража                   = ТекВариант.Значение.пул.ШиротаГаража;
						НовСтрТС.ДолготаГаража                  = ТекВариант.Значение.пул.ДолготаГаража;
						НовСтрТС.МаксимальноеКоличествоУпаковок = ТекВариант.Значение.пул.МаксимальноеКоличествоУпаковок;
						НовСтрТС.Приоритет                      = ТекВариант.Значение.пул.ПриоритетТС;
						
						// подставить новый в пул
						ТекВариант.Значение.пул.ТС                             = СтрокаТС.Ссылка;
						ТекВариант.Значение.пул.ГрузоподъемностьТС             = СтрокаТС.Грузоподъемность;
						ТекВариант.Значение.пул.ОбъемКузоваТС                  = СтрокаТС.ОбъемКузова;
						ТекВариант.Значение.пул.ПорядокТС                      = СтрокаТС.Порядок;
						ТекВариант.Значение.пул.ВозвратВГараж                  = СтрокаТС.ВозвратВГараж;
						ТекВариант.Значение.пул.Гараж                          = СтрокаТС.Гараж;
						ТекВариант.Значение.пул.АдресГаража                    = СтрокаТС.АдресГаража;
						ТекВариант.Значение.пул.ШиротаГаража                   = СтрокаТС.ШиротаГаража;
						ТекВариант.Значение.пул.ДолготаГаража                  = СтрокаТС.ДолготаГаража;
						ТекВариант.Значение.пул.МаксимальноеКоличествоУпаковок = СтрокаТС.МаксимальноеКоличествоУпаковок;
						ТекВариант.Значение.пул.ПриоритетТС                    = СтрокаТС.Приоритет;
						
						// удалить новый ТС из таблицы
						ТабТС.Удалить(СтрокаТС);
						
						ТабТС.Сортировать("Приоритет Убыв, Порядок Возр");
					КонецЕсли;
					
					ТекВариант.Значение.Пул.маршрут.Очистить();
					
					Для Каждого ТекСтрока Из ТекВариант.Значение.НовПул Цикл 
						ТекВариант.Значение.Пул.маршрут.Добавить(ТекСтрока);
					КонецЦикла;
					
					ТекВариант.Значение.Пул.оценка = ТекВариант.Значение.НовОценка;
					ТекВариант.Значение.Пул.МаксимальныйВес = МаксимальныйВес;
					ТекВариант.Значение.Пул.МаксимальныйОбъем = МаксимальныйОбъем;
					ТекВариант.Значение.Пул.ВремяВыездаНаМаршрут = ТекВариант.Значение.ВремяВыездаНаМаршрут;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		Для Каждого ТекПул Из пулы Цикл 
			мсвНовПул = Новый Массив();
			Для Каждого ТекМаршрут Из ТекПул.маршрут Цикл 
				мсвИсходныеЗаказы = СоотвГруппЗаказов.Получить(ТекМаршрут.заказ);
				Для СчИсхЗаказ = 0 По мсвИсходныеЗаказы.Количество() - 1 Цикл
					ТекИсхЗаказ = мсвИсходныеЗаказы[СчИсхЗаказ];
					
					Если СжиматьЗаказы Тогда 
						СтрокиЗаказа = ТаблицаИсходЗаказов.Строки.НайтиСтроки(Новый Структура("Ссылка, СтрокаПакета", ТекИсхЗаказ.Заказ, ТекИсхЗаказ.Пакет), Истина);
					Иначе 
						СтрокиЗаказа = ТаблицаИсходЗаказов.НайтиСтроки(Новый Структура("Ссылка, СтрокаПакета", ТекИсхЗаказ.Заказ, ТекИсхЗаказ.Пакет));
					КонецЕсли;
					
					Если СчИсхЗаказ = 0 Тогда 
						ТекОжидание = ТекМаршрут.Ожидание;
					Иначе 
						ТекОжидание = 0;
					КонецЕсли;
					
					мсвНовПул.Добавить(Новый Структура("заказ, Груз, Количество, Операция, Ожидание, Время, Расстояние, НомерСтроки",
						ТекИсхЗаказ.Заказ, СтрокиЗаказа[0].Груз, СтрокиЗаказа[0].Количество, ТекМаршрут.Операция, ТекОжидание,
						ТекМаршрут.Время, ТекМаршрут.Расстояние, СтрокиЗаказа[0].СтрокаПакета));
				КонецЦикла;
			КонецЦикла;
			
			// В строке каждого заказа указано время/расстояние от предыдущего пункта,
			// а должно быть время/расстояние до следующего пункта, поэтому их надо сдвинуть
			Для Сч = 0 По мсвНовПул.Количество()-2 Цикл
				ТекущаяСтрока   = мсвНовПул[Сч];
				СледующаяСтрока = мсвНовПул[Сч+1];
				ТекущаяСтрока.Время      = СледующаяСтрока.Время;
				ТекущаяСтрока.Расстояние = СледующаяСтрока.Расстояние;
			КонецЦикла;
			Если мсвНовПул.Количество() > 0 Тогда
				ПоследняяСтрока = мсвНовПул[мсвНовПул.Количество()-1];
				ПоследняяСтрока.Время      = 0;
				ПоследняяСтрока.Расстояние = 0;
			КонецЕсли;
			
			ТекПул.маршрут = мсвНовПул;
			
			// Преобразование времени из секунд в формат ЧЧ:ММ
			ТекПул.ВремяВыездаНаМаршрут = НачалоДня(ВремяВыезда) + ТекПул.ВремяВыездаНаМаршрут;
			Для Каждого ТекСтрока Из ТекПул.маршрут Цикл
				ТекСтрока.Ожидание = уатОбщегоНазначения.уатВремяВЧЧ_ММ(ТекСтрока.Ожидание);
				ТекСтрока.Время = уатОбщегоНазначения.уатВремяВЧЧ_ММ(ТекСтрока.Время);
			КонецЦикла;
			
		КонецЦикла;
		
		МенеджерВТ.Закрыть();
		
		Для Каждого СтрокаПула Из пулы Цикл 
			СтрокаПула.Вставить("НаправлениеПеревозки", ТекНаправление.НаправлениеПеревозки);
			КонечныеПулы.Добавить(СтрокаПула);
			
			МаксИндСтрок = ВхМсвТС.Количество() - 1;
			Для ИндСтроки = 0 По МаксИндСтрок Цикл 
				Если ВхМсвТС[МаксИндСтрок - ИндСтроки].ТС = СтрокаПула.ТС Тогда 
					ВхМсвТС.Удалить(МаксИндСтрок - ИндСтроки);
				КонецЕсли;
			КонецЦикла;
			
			МаксИндСтрок = ВхМсвВиртТС.Количество() - 1;
			Для ИндСтроки = 0 По МаксИндСтрок Цикл 
				Если ВхМсвВиртТС[МаксИндСтрок - ИндСтроки].ТС = СтрокаПула.ТС Тогда 
					ВхМсвВиртТС[МаксИндСтрок - ИндСтроки].КоличествоВиртуальныхТС = ВхМсвВиртТС[МаксИндСтрок - ИндСтроки].КоличествоВиртуальныхТС - 1;
					Если ВхМсвВиртТС[МаксИндСтрок - ИндСтроки].КоличествоВиртуальныхТС < 1 Тогда 
						ВхМсвВиртТС.Удалить(МаксИндСтрок - ИндСтроки);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(Новый Структура("СообщениеПользователю, пулы", НСтр("ru = 'Выполняется маршрутизация заказов'; en = 'Executing of orders routing'"), КонечныеПулы), АдресВрХранилища);
	
КонецПроцедуры

Функция СформироватьТаблицуИсходныхЗаказов(мсвЗаказы, мсвЗаказыПоКоординатам, флИспользованиеКластеризации, НастройкаКластеризации,
		СжиматьЗаказы, АдресДепо, ИспользоватьХарактеристикиЗаказовНаТС)
	
	ЗаказыБезКоординат = Новый Массив();
	Для Каждого ТекЗаказ Из мсвЗаказы Цикл 
		ЗаказыБезКоординат.Добавить(ТекЗаказ.Заказ);
	КонецЦикла;
	
	ТабЗаказыПоКоординатам = Новый ТаблицаЗначений();
	ТабЗаказыПоКоординатам.Колонки.Добавить("Ссылка",                   Новый ОписаниеТипов("ДокументСсылка.уатЗаказГрузоотправителя"));
	ТабЗаказыПоКоординатам.Колонки.Добавить("ПунктПогрузки",            Новый ОписаниеТипов("СправочникСсылка.уатКластеры_уэ"));
	ТабЗаказыПоКоординатам.Колонки.Добавить("ПунктРазгрузки",           Новый ОписаниеТипов("СправочникСсылка.уатКластеры_уэ"));
	ТабЗаказыПоКоординатам.Колонки.Добавить("Приоритет",                Новый ОписаниеТипов("Число"));
	ТабЗаказыПоКоординатам.Колонки.Добавить("АдресОтправления",         Новый ОписаниеТипов("СправочникСсылка.уатПунктыНазначения"));
	ТабЗаказыПоКоординатам.Колонки.Добавить("АдресНазначения",          Новый ОписаниеТипов("СправочникСсылка.уатПунктыНазначения"));
	ТабЗаказыПоКоординатам.Колонки.Добавить("ОтправлениеС",             Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.Время)));
	ТабЗаказыПоКоординатам.Колонки.Добавить("ОтправлениеПо",            Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.Время)));
	ТабЗаказыПоКоординатам.Колонки.Добавить("ДоставкаС",                Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.Время)));
	ТабЗаказыПоКоординатам.Колонки.Добавить("ДоставкаПо",               Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.Время)));
	ТабЗаказыПоКоординатам.Колонки.Добавить("ТребованиеКТСТипМоделиТС", Новый ОписаниеТипов("СправочникСсылка.уатТипыТС"));
	ТабЗаказыПоКоординатам.Колонки.Добавить("ТребованиеКТСТипТС",       Новый ОписаниеТипов("СправочникСсылка.уатТипыТС"));
	ТабЗаказыПоКоординатам.Колонки.Добавить("ЛатОтпр",                  Новый ОписаниеТипов("Число"));
	ТабЗаказыПоКоординатам.Колонки.Добавить("ЛонОтпр",                  Новый ОписаниеТипов("Число"));
	ТабЗаказыПоКоординатам.Колонки.Добавить("ЛатНазн",                  Новый ОписаниеТипов("Число"));
	ТабЗаказыПоКоординатам.Колонки.Добавить("ЛонНазн",                  Новый ОписаниеТипов("Число"));
	
	Для Каждого ТекЗаказКоорд Из мсвЗаказыПоКоординатам Цикл 
		НовСтр = ТабЗаказыПоКоординатам.Добавить();
		НовСтр.Ссылка                   = ТекЗаказКоорд.Заказ;
		НовСтр.ПунктПогрузки            = ТекЗаказКоорд.КластерОтправления;
		НовСтр.ПунктРазгрузки           = ТекЗаказКоорд.КластерНазначения;
		НовСтр.Приоритет                = ТекЗаказКоорд.ПриоритетМаршрутизации;
		НовСтр.АдресОтправления         = ТекЗаказКоорд.АдресОтправления;
		НовСтр.АдресНазначения          = ТекЗаказКоорд.АдресНазначения;
		НовСтр.ОтправлениеС             = ТекЗаказКоорд.ОтправлениеС;
		НовСтр.ОтправлениеПо            = ТекЗаказКоорд.ОтправлениеПо;
		НовСтр.ДоставкаС                = ТекЗаказКоорд.ДоставкаС;
		НовСтр.ДоставкаПо               = ТекЗаказКоорд.ДоставкаПо;
		НовСтр.ТребованиеКТСТипМоделиТС = ТекЗаказКоорд.Заказ.ТребованиеКТС.ТипТС;
		НовСтр.ТребованиеКТСТипТС       = ТекЗаказКоорд.Заказ.ТребованиеКТСТипТС;
		НовСтр.ЛатОтпр                  = ТекЗаказКоорд.ЛатОтпр;
		НовСтр.ЛонОтпр                  = ТекЗаказКоорд.ЛонОтпр;
		НовСтр.ЛатНазн                  = ТекЗаказКоорд.ЛатНазн;
		НовСтр.ЛонНазн                  = ТекЗаказКоорд.ЛонНазн;
	КонецЦикла;
	
	ТекстОбщегоЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТабЗаказыПоКоординатам.Ссылка КАК Ссылка,
	|	ТабЗаказыПоКоординатам.ПунктПогрузки КАК ПунктПогрузки,
	|	ТабЗаказыПоКоординатам.ПунктРазгрузки КАК ПунктРазгрузки,
	|	ТабЗаказыПоКоординатам.Приоритет КАК Приоритет,
	|	ТабЗаказыПоКоординатам.АдресОтправления КАК АдресОтправления,
	|	ТабЗаказыПоКоординатам.АдресНазначения КАК АдресНазначения,
	|	ТабЗаказыПоКоординатам.ОтправлениеС КАК ОтправлениеС,
	|	ТабЗаказыПоКоординатам.ОтправлениеПо КАК ОтправлениеПо,
	|	ТабЗаказыПоКоординатам.ДоставкаС КАК ДоставкаС,
	|	ТабЗаказыПоКоординатам.ДоставкаПо КАК ДоставкаПо,
	|	ТабЗаказыПоКоординатам.ТребованиеКТСТипМоделиТС КАК ТребованиеКТСТипМоделиТС,
	|	ТабЗаказыПоКоординатам.ТребованиеКТСТипТС КАК ТребованиеКТСТипТС,
	|	ТабЗаказыПоКоординатам.ЛатОтпр КАК ЛатОтпр,
	|	ТабЗаказыПоКоординатам.ЛонОтпр КАК ЛонОтпр,
	|	ТабЗаказыПоКоординатам.ЛатНазн КАК ЛатНазн,
	|	ТабЗаказыПоКоординатам.ЛонНазн КАК ЛонНазн
	|ПОМЕСТИТЬ ВТ_ЗаказыПоКоординатам
	|ИЗ
	|	&ТабЗаказыПоКоординатам КАК ТабЗаказыПоКоординатам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказНаПеревозку.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА &флИспользованиеКластеризации
	|			ТОГДА ЕСТЬNULL(уатПривязкаПунктовОтправления.Кластер, ЗНАЧЕНИЕ(Справочник.уатКластеры_уэ.ПустаяСсылка))
	|		ИНАЧЕ ВЫРАЗИТЬ(ЗаказНаПеревозку.АдресОтправления КАК Справочник.уатПунктыНазначения)
	|	КОНЕЦ КАК ПунктПогрузки,
	|	ВЫБОР
	|		КОГДА &флИспользованиеКластеризации
	|			ТОГДА ЕСТЬNULL(уатПривязкаПунктовНазначения.Кластер, ЗНАЧЕНИЕ(Справочник.уатКластеры_уэ.ПустаяСсылка))
	|		ИНАЧЕ ВЫРАЗИТЬ(ЗаказНаПеревозку.АдресНазначения КАК Справочник.уатПунктыНазначения)
	|	КОНЕЦ КАК ПунктРазгрузки,
	|	ЗаказНаПеревозку.Приоритет КАК Приоритет,
	|	ЗаказНаПеревозку.АдресОтправления КАК АдресОтправления,
	|	ЗаказНаПеревозку.АдресНазначения КАК АдресНазначения,
	|	ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), МИНУТА, РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ЗаказНаПеревозку.ОтправлениеС, ДЕНЬ), ЗаказНаПеревозку.ОтправлениеС, МИНУТА)) КАК ОтправлениеС,
	|	ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), МИНУТА, РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ЗаказНаПеревозку.ОтправлениеПо, ДЕНЬ), ЗаказНаПеревозку.ОтправлениеПо, МИНУТА)) КАК ОтправлениеПо,
	|	ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), МИНУТА, РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ЗаказНаПеревозку.ДоставкаС, ДЕНЬ), ЗаказНаПеревозку.ДоставкаС, МИНУТА)) КАК ДоставкаС,
	|	ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), МИНУТА, РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ЗаказНаПеревозку.ДоставкаПо, ДЕНЬ), ЗаказНаПеревозку.ДоставкаПо, МИНУТА)) КАК ДоставкаПо,
	|	ЗаказНаПеревозку.ТребованиеКТС.ТипТС КАК ТребованиеКТСТипМоделиТС,
	|	ЗаказНаПеревозку.ТребованиеКТСТипТС КАК ТребованиеКТСТипТС,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ЗаказНаПеревозку.АдресОтправления) = ТИП(Справочник.уатПунктыНазначения)
	|			ТОГДА ЗаказНаПеревозку.АдресОтправления.Лат
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЛатОтпр,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ЗаказНаПеревозку.АдресОтправления) = ТИП(Справочник.уатПунктыНазначения)
	|			ТОГДА ЗаказНаПеревозку.АдресОтправления.Лон
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЛонОтпр,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ЗаказНаПеревозку.АдресНазначения) = ТИП(Справочник.уатПунктыНазначения)
	|			ТОГДА ЗаказНаПеревозку.АдресНазначения.Лат
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЛатНазн,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ЗаказНаПеревозку.АдресНазначения) = ТИП(Справочник.уатПунктыНазначения)
	|			ТОГДА ЗаказНаПеревозку.АдресНазначения.Лон
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЛонНазн
	|ПОМЕСТИТЬ ВТ_Документы
	|ИЗ
	|	Документ.уатЗаказГрузоотправителя КАК ЗаказНаПеревозку
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уатПривязкаПунктовНазначенияККластерам_уэ КАК уатПривязкаПунктовОтправления
	|		ПО (&флИспользованиеКластеризации)
	|			И ЗаказНаПеревозку.АдресОтправления = уатПривязкаПунктовОтправления.ПунктНазначения
	|			И (уатПривязкаПунктовОтправления.Кластер.НастройкаКластеризации = &НастройкаКластеризации)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уатПривязкаПунктовНазначенияККластерам_уэ КАК уатПривязкаПунктовНазначения
	|		ПО (&флИспользованиеКластеризации)
	|			И ЗаказНаПеревозку.АдресНазначения = уатПривязкаПунктовНазначения.ПунктНазначения
	|			И (уатПривязкаПунктовНазначения.Кластер.НастройкаКластеризации = &НастройкаКластеризации)
	|ГДЕ
	|	ЗаказНаПеревозку.Ссылка В(&ЗаказыБезКоординат)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ЗаказыПоКоординатам.Ссылка,
	|	ВТ_ЗаказыПоКоординатам.ПунктПогрузки,
	|	ВТ_ЗаказыПоКоординатам.ПунктРазгрузки,
	|	ВТ_ЗаказыПоКоординатам.Приоритет,
	|	ВТ_ЗаказыПоКоординатам.АдресОтправления,
	|	ВТ_ЗаказыПоКоординатам.АдресНазначения,
	|	ВТ_ЗаказыПоКоординатам.ОтправлениеС,
	|	ВТ_ЗаказыПоКоординатам.ОтправлениеПо,
	|	ВТ_ЗаказыПоКоординатам.ДоставкаС,
	|	ВТ_ЗаказыПоКоординатам.ДоставкаПо,
	|	ВТ_ЗаказыПоКоординатам.ТребованиеКТСТипМоделиТС,
	|	ВТ_ЗаказыПоКоординатам.ТребованиеКТСТипТС,
	|	ВТ_ЗаказыПоКоординатам.ЛатОтпр,
	|	ВТ_ЗаказыПоКоординатам.ЛонОтпр,
	|	ВТ_ЗаказыПоКоординатам.ЛатНазн,
	|	ВТ_ЗаказыПоКоординатам.ЛонНазн
	|ИЗ
	|	ВТ_ЗаказыПоКоординатам КАК ВТ_ЗаказыПоКоординатам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Документы.ПунктПогрузки КАК Пункт
	|ИЗ
	|	ВТ_Документы КАК ВТ_Документы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Документы.ПунктРазгрузки
	|ИЗ
	|	ВТ_Документы КАК ВТ_Документы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_Документы.АдресОтправления КАК Адрес
	|ИЗ
	|	ВТ_Документы КАК ВТ_Документы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Документы.АдресНазначения
	|ИЗ
	|	ВТ_Документы КАК ВТ_Документы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&АдресДепо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Документы.Ссылка КАК Ссылка,
	|	уатЗаказГрузоотправителяХарактеристики.Характеристика КАК Характеристика
	|ИЗ
	|	ВТ_Документы КАК ВТ_Документы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уатЗаказГрузоотправителя.Характеристики КАК уатЗаказГрузоотправителяХарактеристики
	|		ПО ВТ_Документы.Ссылка = уатЗаказГрузоотправителяХарактеристики.Ссылка
	|ИТОГИ ПО
	|	Ссылка";
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц();
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	
	Запрос.УстановитьПараметр("ЗаказыБезКоординат",           ЗаказыБезКоординат);
	Запрос.УстановитьПараметр("ТабЗаказыПоКоординатам",       ТабЗаказыПоКоординатам);
	Запрос.УстановитьПараметр("флИспользованиеКластеризации", флИспользованиеКластеризации);
	Запрос.УстановитьПараметр("НастройкаКластеризации",       НастройкаКластеризации);
	Запрос.УстановитьПараметр("АдресДепо",                    АдресДепо);
	
	Запрос.Текст = ТекстОбщегоЗапроса;
	
	РезультатПакет = Запрос.ВыполнитьПакет();
	
	мсвПунктов = РезультатПакет[2].Выгрузить().ВыгрузитьКолонку("Пункт");
	мсвАдресов = РезультатПакет[3].Выгрузить().ВыгрузитьКолонку("Адрес");
	
	НаборХарактеристик = Новый Соответствие();
	
	ТаблНаборыПоЗаказам = Новый ТаблицаЗначений();
	ТаблНаборыПоЗаказам.Колонки.Добавить("Заказ",              Новый ОписаниеТипов("ДокументСсылка.уатЗаказГрузоотправителя"));
	ТаблНаборыПоЗаказам.Колонки.Добавить("НаборХарактеристик", Новый ОписаниеТипов("УникальныйИдентификатор"));
	
	Если ИспользоватьХарактеристикиЗаказовНаТС Тогда 
		ХарактеристикиЗаказов = РезультатПакет[4].Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Для Каждого СтрокаЗаказ Из ХарактеристикиЗаказов.Строки Цикл 
			ХарактеристикиЗаказа = Новый Массив();
			
			Для Каждого СтрокаХарактеристики Из СтрокаЗаказ.Строки Цикл 
				Если Не СтрокаХарактеристики.Характеристика = Null Тогда 
					ХарактеристикиЗаказа.Добавить(СтрокаХарактеристики.Характеристика);
				КонецЕсли;
			КонецЦикла;
			
			idНабора = Неопределено;
			
			Для Каждого ТекНабор Из НаборХарактеристик Цикл 
				флНаборИдентичен = Истина;
				
				Если Не ТекНабор.Значение.Количество() = ХарактеристикиЗаказа.Количество() Тогда 
					флНаборИдентичен = Ложь;
					
				Иначе 
					Для Каждого ТекХарактеристика Из ХарактеристикиЗаказа Цикл 
						Если ТекНабор.Значение.Найти(ТекХарактеристика) = Неопределено Тогда 
							флНаборИдентичен = Ложь;
							Прервать;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				
				Если флНаборИдентичен Тогда 
					idНабора = ТекНабор.Ключ;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если idНабора = Неопределено Тогда 
				idНабора = Новый УникальныйИдентификатор();
				НаборХарактеристик.Вставить(idНабора, ХарактеристикиЗаказа);
			КонецЕсли;
			
			НовСтрока = ТаблНаборыПоЗаказам.Добавить();
			НовСтрока.Заказ = СтрокаЗаказ.Ссылка;
			НовСтрока.НаборХарактеристик = idНабора;
		КонецЦикла;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("НаборыПоЗаказам", ТаблНаборыПоЗаказам);
	
	ТекстЗапросаПоЗаказам =
	"ВЫБРАТЬ
	|	НаборыПоЗаказам.Заказ КАК Заказ,
	|	НаборыПоЗаказам.НаборХарактеристик КАК НаборХарактеристик
	|ПОМЕСТИТЬ ВТ_НаборыПоЗаказам
	|ИЗ
	|	&НаборыПоЗаказам КАК НаборыПоЗаказам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_Документы.Ссылка КАК Ссылка,
	|	ЕСТЬNULL(ТЧГрузовойСостав.НомерСтроки, ЕСТЬNULL(ТЧТоварныйСостав.НомерСтроки, НЕОПРЕДЕЛЕНО)) КАК СтрокаПакета,
	|	ЕСТЬNULL(ТЧГрузовойСостав.ГрузовоеМесто, ЕСТЬNULL(ТЧТоварныйСостав.Номенклатура, НЕОПРЕДЕЛЕНО)) КАК Груз,
	|	ЕСТЬNULL(ТЧГрузовойСостав.КоличествоМест, ЕСТЬNULL(ТЧТоварныйСостав.Количество, 1)) КАК Количество,
	|	ЕСТЬNULL(ТЧГрузовойСостав.ВесБрутто, ЕСТЬNULL(ТЧТоварныйСостав.ВесБрутто, ВТ_Документы.Ссылка.ВесБрутто)) КАК ВесБрутто,
	|	ЕСТЬNULL(ТЧГрузовойСостав.Объем, ЕСТЬNULL(ТЧТоварныйСостав.Объем, ВТ_Документы.Ссылка.Объем)) КАК Объем,
	|	ЕСТЬNULL(ТЧГрузовойСостав.КоличествоМест, ЕСТЬNULL(ТЧТоварныйСостав.КоличествоМест, ВТ_Документы.Ссылка.КоличествоМест)) КАК КоличествоУпаковок,
	|	ВТ_Документы.ПунктПогрузки КАК ПунктПогрузки,
	|	ВТ_Документы.ПунктРазгрузки КАК ПунктРазгрузки,
	|	ЕСТЬNULL(уатЗаказГрузоотправителя.СтоянкаПунктОтправления, 0) КАК СтоянкаПунктОтправления,
	|	ЕСТЬNULL(уатЗаказГрузоотправителя.СтоянкаПунктНазначения, 0) КАК СтоянкаПунктНазначения,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_Документы.АдресОтправления.СтоянкаДоп, 0) = 0
	|			ТОГДА ЕСТЬNULL(ВТ_Документы.АдресОтправления.ТипПункта.СтоянкаДоп, 0)
	|		ИНАЧЕ ЕСТЬNULL(ВТ_Документы.АдресОтправления.СтоянкаДоп, 0)
	|	КОНЕЦ КАК ДопСтоянкаПунктОтправления,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_Документы.АдресНазначения.СтоянкаДоп, 0) = 0
	|			ТОГДА ЕСТЬNULL(ВТ_Документы.АдресНазначения.ТипПункта.СтоянкаДоп, 0)
	|		ИНАЧЕ ЕСТЬNULL(ВТ_Документы.АдресНазначения.СтоянкаДоп, 0)
	|	КОНЕЦ КАК ДопСтоянкаПунктНазначения,
	|	ВТ_Документы.Приоритет КАК Приоритет,
	|	ВТ_Документы.АдресОтправления КАК АдресОтправления,
	|	ВТ_Документы.АдресНазначения КАК АдресНазначения,
	|	ЕСТЬNULL(уатЗаказГрузоотправителя.FTL, ЛОЖЬ) КАК FTL,
	|	ВТ_Документы.ОтправлениеС КАК ОтправлениеС,
	|	ВТ_Документы.ОтправлениеПо КАК ОтправлениеПо,
	|	ВТ_Документы.ДоставкаС КАК ДоставкаС,
	|	ВТ_Документы.ДоставкаПо КАК ДоставкаПо,
	|	ВТ_Документы.ЛатОтпр КАК ЛатОтпр,
	|	ВТ_Документы.ЛонОтпр КАК ЛонОтпр,
	|	ВТ_Документы.ЛатНазн КАК ЛатНазн,
	|	ВТ_Документы.ЛонНазн КАК ЛонНазн,
	|	НаборыПоЗаказам.НаборХарактеристик КАК НаборХарактеристик
	|ИЗ
	|	ВТ_Документы КАК ВТ_Документы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уатЗаказГрузоотправителя.ГрузовойСостав КАК ТЧГрузовойСостав
	|		ПО ВТ_Документы.Ссылка = ТЧГрузовойСостав.Ссылка
	|			И (ВТ_Документы.Ссылка.ДетализацияЗакрытия = ЗНАЧЕНИЕ(Перечисление.уатДетализацияЗаказаГрузоотправителя_уэ.ПоГрузовымМестам))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уатЗаказГрузоотправителя.Товары КАК ТЧТоварныйСостав
	|		ПО ВТ_Документы.Ссылка = ТЧТоварныйСостав.Ссылка
	|			И (ВТ_Документы.Ссылка.ДетализацияЗакрытия = ЗНАЧЕНИЕ(Перечисление.уатДетализацияЗаказаГрузоотправителя_уэ.ПоТоварам))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НаборыПоЗаказам КАК НаборыПоЗаказам
	|		ПО ВТ_Документы.Ссылка = НаборыПоЗаказам.Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уатЗаказГрузоотправителя КАК уатЗаказГрузоотправителя
	|		ПО ВТ_Документы.Ссылка = уатЗаказГрузоотправителя.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОтправлениеС,
	|	ОтправлениеПо,
	|	ДоставкаС,
	|	ДоставкаПо
	|ИТОГИ
	|	МАКСИМУМ(ПунктПогрузки),
	|	МАКСИМУМ(ПунктРазгрузки),
	|	МАКСИМУМ(АдресОтправления),
	|	МАКСИМУМ(АдресНазначения)
	|ПО
	|	ЛатОтпр,
	|	ЛонОтпр,
	|	ЛатНазн,
	|	ЛонНазн,
	|	НаборХарактеристик";
	
	СхемаЗапроса = Новый СхемаЗапроса();
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапросаПоЗаказам);
	
	Если Не СжиматьЗаказы Тогда 
		СхемаЗапроса.ПакетЗапросов[1].КонтрольныеТочкиИтогов.Очистить();
	КонецЕсли;
	
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	РезультатПакет = Запрос.ВыполнитьПакет();
	РезультатЗапроса = РезультатПакет[1].Выгрузить(?(СжиматьЗаказы, ОбходРезультатаЗапроса.ПоГруппировкам, ОбходРезультатаЗапроса.Прямой));
	
	ТабРассмотренныеГрузы = Новый ТаблицаЗначений();
	ТабРассмотренныеГрузы.Колонки.Добавить("Ссылка");
	ТабРассмотренныеГрузы.Колонки.Добавить("Груз");
	
	Для Каждого ТекЗаказ Из мсвЗаказы Цикл 
		НовСтрока = ТабРассмотренныеГрузы.Добавить();
		НовСтрока.Ссылка = ТекЗаказ.Заказ;
		НовСтрока.Груз   = ТекЗаказ.Груз;
		
		Если СжиматьЗаказы Тогда 
			НайдСтроки = РезультатЗапроса.Строки.НайтиСтроки(Новый Структура("Ссылка, Груз", ТекЗаказ.Заказ, ТекЗаказ.Груз), Истина);
		Иначе 
			НайдСтроки = РезультатЗапроса.НайтиСтроки(Новый Структура("Ссылка, Груз", ТекЗаказ.Заказ, ТекЗаказ.Груз));
		КонецЕсли;
		
		КоличествоУчтено = ТекЗаказ.Количество;
		
		мсвСтрокиУдалить = Новый Массив();
		
		Сч = НайдСтроки.Количество()-1;
		Пока Сч >= 0 Цикл 
			ТекСтрока = НайдСтроки[Сч];
			
			Если КоличествоУчтено = 0 Тогда 
				мсвСтрокиУдалить.Добавить(ТекСтрока);
				
			ИначеЕсли ТекСтрока.Количество < КоличествоУчтено Тогда 
				КоличествоУчтено = КоличествоУчтено - ТекСтрока.Количество;
			Иначе 
				КоэфПересчета = ?(ТекСтрока.Количество = 0, 0, КоличествоУчтено / ТекСтрока.Количество);
				
				ТекСтрока.Количество = КоличествоУчтено;
				КоличествоУчтено = 0;
				
				ТекСтрока.ВесБрутто          = ТекСтрока.ВесБрутто * КоэфПересчета;
				ТекСтрока.Объем              = ТекСтрока.Объем * КоэфПересчета;
				ТекСтрока.КоличествоУпаковок = ТекСтрока.КоличествоУпаковок * КоэфПересчета;
			КонецЕсли;
			
			Сч = Сч - 1;
		КонецЦикла;
		
		Для Каждого ТекСтрокаУдалить Из мсвСтрокиУдалить Цикл 
			Если СжиматьЗаказы Тогда 
				Если ТекСтрокаУдалить.Родитель = Неопределено Тогда
					РезультатЗапроса.Строки.Удалить(ТекСтрокаУдалить);
				Иначе
					ТекСтрокаУдалить.Родитель.Строки.Удалить(ТекСтрокаУдалить);
				КонецЕсли;
			Иначе 
				РезультатЗапроса.Удалить(ТекСтрокаУдалить);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Для Каждого ТекЗаказ Из мсвЗаказыПоКоординатам Цикл 
		НовСтрока = ТабРассмотренныеГрузы.Добавить();
		НовСтрока.Ссылка = ТекЗаказ.Заказ;
		НовСтрока.Груз   = ТекЗаказ.Груз;
		
		Если СжиматьЗаказы Тогда 
			НайдСтроки = РезультатЗапроса.Строки.НайтиСтроки(Новый Структура("Ссылка, Груз", ТекЗаказ.Заказ, ТекЗаказ.Груз), Истина);
		Иначе 
			НайдСтроки = РезультатЗапроса.НайтиСтроки(Новый Структура("Ссылка, Груз", ТекЗаказ.Заказ, ТекЗаказ.Груз));
		КонецЕсли;
		
		КоличествоУчтено = ТекЗаказ.Количество;
		
		мсвСтрокиУдалить = Новый Массив();
		
		Сч = НайдСтроки.Количество()-1;
		Пока Сч >= 0 Цикл 
			ТекСтрока = НайдСтроки[Сч];
			
			Если КоличествоУчтено = 0 Тогда 
				мсвСтрокиУдалить.Добавить(ТекСтрока);
				
			ИначеЕсли ТекСтрока.Количество < КоличествоУчтено Тогда 
				КоличествоУчтено = КоличествоУчтено - ТекСтрока.Количество;
			Иначе 
				КоэфПересчета = ?(ТекСтрока.Количество = 0, 0, КоличествоУчтено / ТекСтрока.Количество);
				
				ТекСтрока.Количество = КоличествоУчтено;
				КоличествоУчтено = 0;
				
				ТекСтрока.ВесБрутто          = ТекСтрока.ВесБрутто * КоэфПересчета;
				ТекСтрока.Объем              = ТекСтрока.Объем * КоэфПересчета;
				ТекСтрока.КоличествоУпаковок = ТекСтрока.КоличествоУпаковок * КоэфПересчета;
			КонецЕсли;
			
			Сч = Сч - 1;
		КонецЦикла;
		
		Для Каждого ТекСтрокаУдалить Из мсвСтрокиУдалить Цикл 
			Если СжиматьЗаказы Тогда 
				Если ТекСтрокаУдалить.Родитель = Неопределено Тогда
					РезультатЗапроса.Строки.Удалить(ТекСтрокаУдалить);
				Иначе
					ТекСтрокаУдалить.Родитель.Строки.Удалить(ТекСтрокаУдалить);
				КонецЕсли;
			Иначе 
				РезультатЗапроса.Удалить(ТекСтрокаУдалить);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Если СжиматьЗаказы Тогда 
		Для Каждого СтрокаЛатОтпр Из РезультатЗапроса.Строки Цикл 
			Для Каждого СтрокаЛонОтпр Из СтрокаЛатОтпр.Строки Цикл 
				Для Каждого СтрокаЛатНазн Из СтрокаЛонОтпр.Строки Цикл 
					Для Каждого СтрокаЛонНазн Из СтрокаЛатНазн.Строки Цикл 
						Для Каждого ТекНабор Из СтрокаЛонНазн.Строки Цикл 
							мсвСтрокиУдалить = Новый Массив();
							
							Для Каждого ТекСтрока Из ТекНабор.Строки Цикл 
								НайдСтроки = ТабРассмотренныеГрузы.НайтиСтроки(Новый Структура("Ссылка, Груз", ТекСтрока.Ссылка, ТекСтрока.Груз));
								Если НайдСтроки.Количество() = 0 Тогда 
									мсвСтрокиУдалить.Добавить(ТекСтрока);
								Иначе
									// Преобразование времени из формата ЧЧ:ММ в секунды для ускорения вычислений
									ТекСтрока.ДопСтоянкаПунктОтправления = уатОбщегоНазначения.уатВремяВСекунды(ТекСтрока.ДопСтоянкаПунктОтправления);
									ТекСтрока.СтоянкаПунктОтправления = уатОбщегоНазначения.уатВремяВСекунды(ТекСтрока.СтоянкаПунктОтправления);
									ТекСтрока.ДопСтоянкаПунктНазначения = уатОбщегоНазначения.уатВремяВСекунды(ТекСтрока.ДопСтоянкаПунктНазначения);
									ТекСтрока.СтоянкаПунктНазначения = уатОбщегоНазначения.уатВремяВСекунды(ТекСтрока.СтоянкаПунктНазначения);
								КонецЕсли;
							КонецЦикла;
							
							Для Каждого ТекСтрокаУдалить Из мсвСтрокиУдалить Цикл 
								Если ТекСтрокаУдалить.Родитель = Неопределено Тогда
									РезультатЗапроса.Строки.Удалить(ТекСтрокаУдалить);
								Иначе
									ТекСтрокаУдалить.Родитель.Строки.Удалить(ТекСтрокаУдалить);
								КонецЕсли;
							КонецЦикла;
						КонецЦикла;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
		
	Иначе 
		мсвСтрокиУдалить = Новый Массив();
		
		Для Каждого ТекСтрока Из РезультатЗапроса Цикл 
			НайдСтроки = ТабРассмотренныеГрузы.НайтиСтроки(Новый Структура("Ссылка, Груз", ТекСтрока.Ссылка, ТекСтрока.Груз));
			Если НайдСтроки.Количество() = 0 Тогда 
				мсвСтрокиУдалить.Добавить(ТекСтрока);
			Иначе
				// Преобразование времени из формата ЧЧ:ММ в секунды для ускорения вычислений
				ТекСтрока.ДопСтоянкаПунктОтправления = уатОбщегоНазначения.уатВремяВСекунды(ТекСтрока.ДопСтоянкаПунктОтправления);
				ТекСтрока.СтоянкаПунктОтправления = уатОбщегоНазначения.уатВремяВСекунды(ТекСтрока.СтоянкаПунктОтправления);
				ТекСтрока.ДопСтоянкаПунктНазначения = уатОбщегоНазначения.уатВремяВСекунды(ТекСтрока.ДопСтоянкаПунктНазначения);
				ТекСтрока.СтоянкаПунктНазначения = уатОбщегоНазначения.уатВремяВСекунды(ТекСтрока.СтоянкаПунктНазначения);
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого ТекСтрокаУдалить Из мсвСтрокиУдалить Цикл 
			РезультатЗапроса.Удалить(ТекСтрокаУдалить);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Новый Структура("ТаблицаЗаказов, МассивПунктов, МассивАдресов, НаборХарактеристик", РезультатЗапроса, мсвПунктов, мсвАдресов, НаборХарактеристик);
	
КонецФункции // СформироватьТаблицуИсходныхЗаказов()

Функция СформироватьДанныеПоТСИПереходам(Запрос, АдресДепо, НастройкаКластеризации, УчитыватьРазрешенныеТипыТС, МаксГрузоподъемность,
		МаксОбъемКузова, ИндивидуальныйГаражТС, флИспользованиеКластеризации, соотПараметрыВиртТС, мсвПунктыПоЗаказу, мсвАдресаПоЗаказу,
		НаборХарактеристик, ИспользоватьХарактеристикиЗаказовНаТС)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТранспортныеСредства.Ссылка КАК Ссылка,
	|	ТранспортныеСредства.Грузоподъемность КАК Грузоподъемность,
	|	ТранспортныеСредства.ОбъемКузова КАК ОбъемКузова,
	|	(ВЫБОР
	|		КОГДА &МаксГрузоподъемность = 0
	|			ТОГДА 0
	|		ИНАЧЕ ТранспортныеСредства.Грузоподъемность / &МаксГрузоподъемность
	|	КОНЕЦ + ВЫБОР
	|		КОГДА &МаксОбъемКузова = 0
	|			ТОГДА 0
	|		ИНАЧЕ ТранспортныеСредства.ОбъемКузова / &МаксОбъемКузова
	|	КОНЕЦ) / 2 КАК Порядок,
	|	ВЫБОР
	|		КОГДА &флИспользованиеКластеризации
	|			ТОГДА ЕСТЬNULL(уатПривязкаПунктовНазначенияККластерам_уэ.Кластер, ЗНАЧЕНИЕ(Справочник.уатКластеры_уэ.ПустаяСсылка))
	|		КОГДА &ИндивидуальныйГаражТС
	|			ТОГДА ТранспортныеСредства.Гараж
	|		ИНАЧЕ &АдресДепо
	|	КОНЕЦ КАК Гараж,
	|	ВЫБОР
	|		КОГДА &ИндивидуальныйГаражТС
	|			ТОГДА ТранспортныеСредства.Гараж
	|		ИНАЧЕ &АдресДепо
	|	КОНЕЦ КАК АдресГаража,
	|	ВЫБОР
	|		КОГДА &ИндивидуальныйГаражТС
	|			ТОГДА ТранспортныеСредства.Гараж.Лат
	|		ИНАЧЕ &АдресДепоШирота
	|	КОНЕЦ КАК ШиротаГаража,
	|	ВЫБОР
	|		КОГДА &ИндивидуальныйГаражТС
	|			ТОГДА ТранспортныеСредства.Гараж.Лон
	|		ИНАЧЕ &АдресДепоДолгота
	|	КОНЕЦ КАК ДолготаГаража,
	|	ТранспортныеСредства.МаксимальноеКоличествоУпаковок КАК МаксимальноеКоличествоУпаковок,
	|	ТранспортныеСредства.Приоритет КАК Приоритет,
	|	ТранспортныеСредства.ВозвратВГараж КАК ВозвратВГараж
	|ПОМЕСТИТЬ ВТ_ТС
	|ИЗ
	|	ВТ_ТС_Подготовка КАК ТранспортныеСредства
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уатПривязкаПунктовНазначенияККластерам_уэ КАК уатПривязкаПунктовНазначенияККластерам_уэ
	|		ПО (&флИспользованиеКластеризации)
	|			И (ВЫБОР
	|				КОГДА &ИндивидуальныйГаражТС
	|					ТОГДА ТранспортныеСредства.Гараж = уатПривязкаПунктовНазначенияККластерам_уэ.ПунктНазначения
	|				ИНАЧЕ &АдресДепо = уатПривязкаПунктовНазначенияККластерам_уэ.ПунктНазначения
	|			КОНЕЦ)
	|			И (уатПривязкаПунктовНазначенияККластерам_уэ.Кластер.НастройкаКластеризации = &НастройкаКластеризации)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВложенныйЗапрос.Пункт КАК Пункт
	|ПОМЕСТИТЬ ВТ_Пункты
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		уатКластеры_уэ.Ссылка КАК Пункт
	|	ИЗ
	|		Справочник.уатКластеры_уэ КАК уатКластеры_уэ
	|	ГДЕ
	|		уатКластеры_уэ.Ссылка В(&мсвПунктыПоЗаказу)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		уатПунктыНазначения.Ссылка
	|	ИЗ
	|		Справочник.уатПунктыНазначения КАК уатПунктыНазначения
	|	ГДЕ
	|		уатПунктыНазначения.Ссылка В(&мсвПунктыПоЗаказу)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ВТ_ТС.Гараж
	|	ИЗ
	|		ВТ_ТС КАК ВТ_ТС) КАК ВложенныйЗапрос
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ТС.Ссылка КАК Ссылка,
	|	ВТ_ТС.Грузоподъемность КАК Грузоподъемность,
	|	ВТ_ТС.ОбъемКузова КАК ОбъемКузова,
	|	ВТ_ТС.Порядок КАК Порядок,
	|	ВТ_ТС.Гараж КАК Гараж,
	|	ВТ_ТС.АдресГаража КАК АдресГаража,
	|	ВТ_ТС.ШиротаГаража КАК ШиротаГаража,
	|	ВТ_ТС.ДолготаГаража КАК ДолготаГаража,
	|	ВТ_ТС.МаксимальноеКоличествоУпаковок КАК МаксимальноеКоличествоУпаковок,
	|	ВТ_ТС.Приоритет КАК Приоритет,
	|	ВТ_ТС.ВозвратВГараж КАК ВозвратВГараж
	|ИЗ
	|	ВТ_ТС КАК ВТ_ТС
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет УБЫВ,
	|	Порядок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.Пункт1 КАК Пункт1,
	|	ВложенныйЗапрос.Пункт2 КАК Пункт2,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.Пункт1 = ВложенныйЗапрос.Пункт2
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаВремяРасстояниеПрямое.Время, ЕСТЬNULL(ТаблицаВремяРасстояниеОбратное.Время, -1))
	|	КОНЕЦ КАК Время,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.Пункт1 = ВложенныйЗапрос.Пункт2
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаВремяРасстояниеПрямое.Расстояние, ЕСТЬNULL(ТаблицаВремяРасстояниеОбратное.Расстояние, -1))
	|	КОНЕЦ КАК Расстояние
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПунктыПогрузки.Пункт КАК Пункт1,
	|		ПунктыРазгрузки.Пункт КАК Пункт2
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ВТ_Пункты.Пункт КАК Пункт
	|		ИЗ
	|			ВТ_Пункты КАК ВТ_Пункты) КАК ПунктыПогрузки,
	|		(ВЫБРАТЬ
	|			ВТ_Пункты.Пункт КАК Пункт
	|		ИЗ
	|			ВТ_Пункты КАК ВТ_Пункты) КАК ПунктыРазгрузки) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уатРасстоянияМеждуКластерами_уэ КАК ТаблицаВремяРасстояниеПрямое
	|		ПО ВложенныйЗапрос.Пункт1 = ТаблицаВремяРасстояниеПрямое.КластерОтправления
	|			И ВложенныйЗапрос.Пункт2 = ТаблицаВремяРасстояниеПрямое.КластерПрибытия
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уатРасстоянияМеждуКластерами_уэ КАК ТаблицаВремяРасстояниеОбратное
	|		ПО ВложенныйЗапрос.Пункт1 = ТаблицаВремяРасстояниеОбратное.КластерПрибытия
	|			И ВложенныйЗапрос.Пункт2 = ТаблицаВремяРасстояниеОбратное.КластерОтправления
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ВложенныйЗапрос.Пункт1 = ВложенныйЗапрос.Пункт2
	|				ТОГДА 0
	|			ИНАЧЕ ЕСТЬNULL(ТаблицаВремяРасстояниеПрямое.Время, ЕСТЬNULL(ТаблицаВремяРасстояниеОбратное.Время, -1))
	|		КОНЕЦ <> -1
	|	И ВЫБОР
	|			КОГДА ВложенныйЗапрос.Пункт1 = ВложенныйЗапрос.Пункт2
	|				ТОГДА 0
	|			ИНАЧЕ ЕСТЬNULL(ТаблицаВремяРасстояниеПрямое.Расстояние, ЕСТЬNULL(ТаблицаВремяРасстояниеОбратное.Расстояние, -1))
	|		КОНЕЦ <> -1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.Пункт1 КАК Пункт1,
	|	ВложенныйЗапрос.Пункт2 КАК Пункт2,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.Пункт1 = ВложенныйЗапрос.Пункт2
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаВремяРасстояниеПрямое.Время, ЕСТЬNULL(ТаблицаВремяРасстояниеОбратное.Время, -1))
	|	КОНЕЦ КАК Время,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.Пункт1 = ВложенныйЗапрос.Пункт2
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаВремяРасстояниеПрямое.Расстояние, ЕСТЬNULL(ТаблицаВремяРасстояниеОбратное.Расстояние, -1))
	|	КОНЕЦ КАК Расстояние
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПунктыПогрузки.Пункт КАК Пункт1,
	|		ПунктыРазгрузки.Пункт КАК Пункт2
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ВТ_Пункты.Пункт КАК Пункт
	|		ИЗ
	|			ВТ_Пункты КАК ВТ_Пункты) КАК ПунктыПогрузки,
	|		(ВЫБРАТЬ
	|			ВТ_Пункты.Пункт КАК Пункт
	|		ИЗ
	|			ВТ_Пункты КАК ВТ_Пункты) КАК ПунктыРазгрузки) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уатРасстоянияМеждуПунктами КАК ТаблицаВремяРасстояниеПрямое
	|		ПО ВложенныйЗапрос.Пункт1 = ТаблицаВремяРасстояниеПрямое.Пункт1
	|			И ВложенныйЗапрос.Пункт2 = ТаблицаВремяРасстояниеПрямое.Пункт2
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уатРасстоянияМеждуПунктами КАК ТаблицаВремяРасстояниеОбратное
	|		ПО ВложенныйЗапрос.Пункт1 = ТаблицаВремяРасстояниеОбратное.Пункт2
	|			И ВложенныйЗапрос.Пункт2 = ТаблицаВремяРасстояниеОбратное.Пункт1
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ВложенныйЗапрос.Пункт1 = ВложенныйЗапрос.Пункт2
	|				ТОГДА 0
	|			ИНАЧЕ ЕСТЬNULL(ТаблицаВремяРасстояниеПрямое.Время, ЕСТЬNULL(ТаблицаВремяРасстояниеОбратное.Время, -1))
	|		КОНЕЦ <> -1
	|	И ВЫБОР
	|			КОГДА ВложенныйЗапрос.Пункт1 = ВложенныйЗапрос.Пункт2
	|				ТОГДА 0
	|			ИНАЧЕ ЕСТЬNULL(ТаблицаВремяРасстояниеПрямое.Расстояние, ЕСТЬNULL(ТаблицаВремяРасстояниеОбратное.Расстояние, -1))
	|		КОНЕЦ <> -1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблТиповТС.Ссылка КАК Ссылка,
	|	ТаблТиповТС.ТипТС КАК ТипТС
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_ТС.Ссылка КАК Ссылка,
	|		уатТС.ТипТС КАК ТипТС
	|	ИЗ
	|		ВТ_ТС КАК ВТ_ТС
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.уатТС КАК уатТС
	|			ПО ВТ_ТС.Ссылка = уатТС.Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВТ_ТС.Ссылка,
	|		уатМоделиТС.ТипТС
	|	ИЗ
	|		ВТ_ТС КАК ВТ_ТС
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.уатТС КАК уатТС
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.уатМоделиТС КАК уатМоделиТС
	|				ПО уатТС.Модель = уатМоделиТС.Ссылка
	|			ПО ВТ_ТС.Ссылка = уатТС.Ссылка) КАК ТаблТиповТС
	|ИТОГИ ПО
	|	ТипТС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВТ_ТС.Ссылка КАК Ссылка,
	|	уатТСХарактеристики.Характеристика КАК Характеристика
	|ИЗ
	|	ВТ_ТС КАК ВТ_ТС
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.уатТС.Характеристики КАК уатТСХарактеристики
	|		ПО ВТ_ТС.Ссылка = уатТСХарактеристики.Ссылка
	|ИТОГИ ПО
	|	Ссылка";
	
	Запрос.УстановитьПараметр("АдресДепо",                    АдресДепо);
	Запрос.УстановитьПараметр("АдресДепоШирота",              АдресДепо.Лат);
	Запрос.УстановитьПараметр("АдресДепоДолгота",             АдресДепо.Лон);
	Запрос.УстановитьПараметр("НастройкаКластеризации",       НастройкаКластеризации);
	Запрос.УстановитьПараметр("МаксГрузоподъемность",         МаксГрузоподъемность);
	Запрос.УстановитьПараметр("МаксОбъемКузова",              МаксОбъемКузова);
	Запрос.УстановитьПараметр("ИндивидуальныйГаражТС",        ИндивидуальныйГаражТС);
	Запрос.УстановитьПараметр("флИспользованиеКластеризации", флИспользованиеКластеризации);
	Запрос.УстановитьПараметр("мсвПунктыПоЗаказу",            мсвПунктыПоЗаказу);
	
	Запрос.Текст = ТекстЗапроса;
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	СоотвТаблРасстояний = Новый Соответствие();
	Если флИспользованиеКластеризации Тогда 
		ВыборкаПунктов = РезультатЗапроса[3].Выбрать();
	Иначе 
		ВыборкаПунктов = РезультатЗапроса[4].Выбрать();
	КонецЕсли;
	Пока ВыборкаПунктов.Следующий() Цикл 
		СтрокаП1 = СоотвТаблРасстояний.Получить(ВыборкаПунктов.Пункт1);
		Если СтрокаП1 = Неопределено Тогда 
			СоотвТаблРасстояний.Вставить(ВыборкаПунктов.Пункт1, Новый Соответствие());
			СтрокаП1 = СоотвТаблРасстояний.Получить(ВыборкаПунктов.Пункт1);
			СтрокаП1.Вставить(ВыборкаПунктов.Пункт1, Новый Структура("Время,Расстояние", 0, 0));
		КонецЕсли;
		СтрокаП2 = СтрокаП1.Получить(ВыборкаПунктов.Пункт2);
		Если СтрокаП2 = Неопределено Тогда 
			СтрокаП1.Вставить(ВыборкаПунктов.Пункт2, Новый Структура("Время,Расстояние", Неопределено, Неопределено));
			СтрокаП2 = СтрокаП1.Получить(ВыборкаПунктов.Пункт2);
		КонецЕсли;
		СтрокаП2.Время      = ВыборкаПунктов.Время;
		СтрокаП2.Расстояние = ВыборкаПунктов.Расстояние;
	КонецЦикла;
	
	СоотТипыТС = Новый Соответствие();
	СоотРазрешенныеТипыПунктов = Новый Соответствие();
	Если УчитыватьРазрешенныеТипыТС Тогда 
		ВыборкаТипыТС = РезультатЗапроса[5].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаТипыТС.Следующий() Цикл 
			мсвТСПоТипу = Новый Массив();
			ВыборкаТСДетально = ВыборкаТипыТС.Выбрать();
			Пока ВыборкаТСДетально.Следующий() Цикл 
				мсвТСПоТипу.Добавить(ВыборкаТСДетально.Ссылка);
			КонецЦикла;
			Если мсвТСПоТипу.Количество() Тогда 
				СоотТипыТС.Вставить(ВыборкаТипыТС.ТипТС, мсвТСПоТипу);
			КонецЕсли;
		КонецЦикла;
		
		ВыборкаТипыПунктов = уатОбщегоНазначения.ПолучитьРазрешенныеТипыТС(мсвАдресаПоЗаказу).Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаТипыПунктов.Следующий() Цикл 
			мсвТипыПунктов = Новый Массив();
			ВыборкаТипыДетально = ВыборкаТипыПунктов.Выбрать();
			Пока ВыборкаТипыДетально.Следующий() Цикл 
				мсвТипыПунктов.Добавить(ВыборкаТипыДетально.ТипТС);
			КонецЦикла;
			Если мсвТипыПунктов.Количество() Тогда 
				СоотРазрешенныеТипыПунктов.Вставить(ВыборкаТипыПунктов.ПунктПогрузки, мсвТипыПунктов);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ТабТС = Новый ТаблицаЗначений();
	ТабТС.Колонки.Добавить("Ссылка",                         Новый ОписаниеТипов("СправочникСсылка.уатТС"));
	ТабТС.Колонки.Добавить("Грузоподъемность",               Новый ОписаниеТипов("Число"));
	ТабТС.Колонки.Добавить("ОбъемКузова",                    Новый ОписаниеТипов("Число"));
	ТабТС.Колонки.Добавить("Порядок",                        Новый ОписаниеТипов("Число"));
	ТабТС.Колонки.Добавить("Гараж",                          Новый ОписаниеТипов("СправочникСсылка.уатПунктыНазначения, СправочникСсылка.уатКластеры_уэ"));
	ТабТС.Колонки.Добавить("АдресГаража",                    Новый ОписаниеТипов("СправочникСсылка.уатПунктыНазначения"));
	ТабТС.Колонки.Добавить("ШиротаГаража",                   Новый ОписаниеТипов("Число"));
	ТабТС.Колонки.Добавить("ДолготаГаража",                  Новый ОписаниеТипов("Число"));
	ТабТС.Колонки.Добавить("МаксимальноеКоличествоУпаковок", Новый ОписаниеТипов("Число"));
	ТабТС.Колонки.Добавить("Приоритет",                      Новый ОписаниеТипов("Число"));
	ТабТС.Колонки.Добавить("ВозвратВГараж",                  Новый ОписаниеТипов("Булево"));
	
	ВыборкаТС = РезультатЗапроса[2].Выбрать();
	Пока ВыборкаТС.Следующий() Цикл 
		КолТС = соотПараметрыВиртТС.Получить(ВыборкаТС.Ссылка);
		Если КолТС = Неопределено Тогда 
			КолТС = 1;
		КонецЕсли;
		
		Для СчТС = 1 По КолТС Цикл 
			НовСтрокаТС = ТабТС.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрокаТС, ВыборкаТС);
		КонецЦикла;
	КонецЦикла;
	
	СоотРазрешенныеТСПоХарактеристикам = Новый Соответствие();
	
	Если ИспользоватьХарактеристикиЗаказовНаТС Тогда 
		ХарактеристикиТС = РезультатЗапроса[6].Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Для Каждого ТекНабор Из НаборХарактеристик Цикл 
			РазрешенныеТС = Новый Массив();
			
			Для Каждого СтрокаТС Из ХарактеристикиТС.Строки Цикл 
				ТекХарактеристики = Новый Массив();
				
				Для Каждого СтрокаХарактеристики Из СтрокаТС.Строки Цикл 
					Если Не СтрокаХарактеристики.Характеристика = Null Тогда 
						ТекХарактеристики.Добавить(СтрокаХарактеристики.Характеристика);
					КонецЕсли;
				КонецЦикла;
				
				флНаборРазрешен = Истина;
				
				Для Каждого ТекХарактеристика Из ТекНабор.Значение Цикл 
					Если ТекХарактеристики.Найти(ТекХарактеристика) = Неопределено Тогда 
						флНаборРазрешен = Ложь;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				Если флНаборРазрешен Тогда 
					РазрешенныеТС.Добавить(СтрокаТС.Ссылка);
				КонецЕсли;
			КонецЦикла;
			
			СоотРазрешенныеТСПоХарактеристикам.Вставить(ТекНабор.Ключ, РазрешенныеТС);
		КонецЦикла;
	КонецЕсли;
	
	Результат = Новый Структура();
	Результат.Вставить("СоотвТаблРасстояний",                СоотвТаблРасстояний);
	Результат.Вставить("СоотТипыТС",                         СоотТипыТС);
	Результат.Вставить("СоотРазрешенныеТипыПунктов",         СоотРазрешенныеТипыПунктов);
	Результат.Вставить("ТабТС",                              ТабТС);
	Результат.Вставить("СоотРазрешенныеТСПоХарактеристикам", СоотРазрешенныеТСПоХарактеристикам);
	
	Возврат Результат;
	
КонецФункции // СформироватьДанныеПоТСИПереходам()

Процедура УстановитьРазрешенныеТСЗаказов(СоотРазрешенныеТСПоЗаказам, СоотТипыТС, СоотРазрешенныеТипыПунктов, Заказ, АдресОтправления, АдресНазначения)
	
	РазрешенныеТипыПогрузка  = СоотРазрешенныеТипыПунктов.Получить(АдресОтправления);
	РазрешенныеТипыРазгрузка = СоотРазрешенныеТипыПунктов.Получить(АдресНазначения);
	
	Если РазрешенныеТипыПогрузка = Неопределено Тогда 
		РазрешенныеТипыПогрузка = Новый Массив();
	КонецЕсли;
	
	Если РазрешенныеТипыРазгрузка = Неопределено Тогда 
		РазрешенныеТипыРазгрузка = Новый Массив();
	КонецЕсли;
	
	Если РазрешенныеТипыПогрузка.Количество() И РазрешенныеТипыРазгрузка.Количество() Тогда 
		// Разрешены только те, которые есть в обоих массивах.
		мсвДоступныеТС = Новый Массив();
		
		Для Каждого ТекТип Из РазрешенныеТипыПогрузка Цикл 
			Если РазрешенныеТипыРазгрузка.Найти(ТекТип) = Неопределено Тогда 
				Продолжить;
			КонецЕсли;
			
			ДоступныеТС = СоотТипыТС.Получить(ТекТип);
			Если ДоступныеТС = Неопределено Тогда 
				ДоступныеТС = Новый Массив();
			КонецЕсли;
			
			Для Каждого ТекТС Из ДоступныеТС Цикл 
				мсвДоступныеТС.Добавить(ТекТС);
			КонецЦикла;
		КонецЦикла;
		
		СоотРазрешенныеТСПоЗаказам.Вставить(Заказ, мсвДоступныеТС);
		
	ИначеЕсли РазрешенныеТипыПогрузка.Количество() Тогда
		мсвДоступныеТС = Новый Массив();
		
		Для Каждого ТекТип Из РазрешенныеТипыПогрузка Цикл 
			ДоступныеТС = СоотТипыТС.Получить(ТекТип);
			Если ДоступныеТС = Неопределено Тогда 
				ДоступныеТС = Новый Массив();
			КонецЕсли;
			
			Для Каждого ТекТС Из ДоступныеТС Цикл 
				мсвДоступныеТС.Добавить(ТекТС);
			КонецЦикла;
		КонецЦикла;
		
		СоотРазрешенныеТСПоЗаказам.Вставить(Заказ, мсвДоступныеТС);
		
	ИначеЕсли РазрешенныеТипыРазгрузка.Количество() Тогда
		мсвДоступныеТС = Новый Массив();
		
		Для Каждого ТекТип Из РазрешенныеТипыРазгрузка Цикл 
			ДоступныеТС = СоотТипыТС.Получить(ТекТип);
			Если ДоступныеТС = Неопределено Тогда 
				ДоступныеТС = Новый Массив();
			КонецЕсли;
			
			Для Каждого ТекТС Из ДоступныеТС Цикл 
				мсвДоступныеТС.Добавить(ТекТС);
			КонецЦикла;
		КонецЦикла;
		
		СоотРазрешенныеТСПоЗаказам.Вставить(Заказ, мсвДоступныеТС);
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьЗаказыПоНаправлениямПеревозки(ВхЗаказы, ВхЗаказыПоКоординатам, УчитыватьНаправленияПеревозки)
	
	ЗащищеннаяОбработка = уатЗащищенныеФункцииСервер.ПолучитьЗащищеннуюОбработку();
	Возврат ЗащищеннаяОбработка.ПолучитьЗаказыПоНаправлениямПеревозки(ВхЗаказы, ВхЗаказыПоКоординатам, УчитыватьНаправленияПеревозки);
	
КонецФункции

Функция ПолучитьТаблицуВходныхТС(мсвТС, мсвВиртТС, соотПараметрыВиртТС)
	
	ЗащищеннаяОбработка = уатЗащищенныеФункцииСервер.ПолучитьЗащищеннуюОбработку();
	Возврат ЗащищеннаяОбработка.ПолучитьТаблицуВходныхТС(мсвТС, мсвВиртТС, соотПараметрыВиртТС);
	
КонецФункции

#Область Яндекс

Функция ЗаполнитьСтруктуруТС(ТекТС, СтруктураНастроекАРМ, НастройкиМаршрутизации,
	ТаблицаLocation, Массив_locations, ПересчетМетрик,
	СчДобавленныхОбъектов, флПереносДаты = Ложь, СоответствиеГеозон, СоответвиеЗаказов, ДатаПланирования, ИспользоватьГруппыБалансировкиМаршрутов = Ложь)
	
	флRarusVRP = СтруктураНастроекАРМ.НастройкаАлгоритмМаршрутизации = 4;
	
	vehiclesCompanyCost           = НастройкиМаршрутизации.vehiclesCompanyCost;
	vehiclesCompanyCost_fixed     = НастройкиМаршрутизации.vehiclesCompanyCost_fixed;
	vehiclesCompanyCost_run       = НастройкиМаршрутизации.vehiclesCompanyCost_run;
	vehiclesCompanyCost_km        = НастройкиМаршрутизации.vehiclesCompanyCost_km;
	vehiclesCompanyCost_hour      = НастройкиМаршрутизации.vehiclesCompanyCost_hour;
	vehiclesCompanyCost_location  = НастройкиМаршрутизации.vehiclesCompanyCost_location;
	
	vehiclesExternalCost          = НастройкиМаршрутизации.vehiclesExternalCost;
	vehiclesExternalCost_fixed    = НастройкиМаршрутизации.vehiclesExternalCost_fixed;
	vehiclesExternalCost_run      = НастройкиМаршрутизации.vehiclesExternalCost_run;
	vehiclesExternalCost_km       = НастройкиМаршрутизации.vehiclesExternalCost_km;
	vehiclesExternalCost_hour     = НастройкиМаршрутизации.vehiclesExternalCost_hour;
	vehiclesExternalCost_location = НастройкиМаршрутизации.vehiclesExternalCost_location;
	
	vehiclesVirtualCost           = НастройкиМаршрутизации.vehiclesVirtualCost;
	vehiclesVirtualCost_fixed     = НастройкиМаршрутизации.vehiclesVirtualCost_fixed;
	vehiclesVirtualCost_run       = НастройкиМаршрутизации.vehiclesVirtualCost_run;
	vehiclesVirtualCost_km        = НастройкиМаршрутизации.vehiclesVirtualCost_km;
	vehiclesVirtualCost_hour      = НастройкиМаршрутизации.vehiclesVirtualCost_hour;
	vehiclesVirtualCost_location  = НастройкиМаршрутизации.vehiclesVirtualCost_location;
	

	НастройкаИспользоватьВПриоритетеСобственныйТранспорт = СтруктураНастроекАРМ.НастройкаИспользоватьВПриоритетеСобственныйТранспорт;
	НастройкаИспользоватьХарактеристикиЗаказовНаТС       = СтруктураНастроекАРМ.НастройкаИспользоватьХарактеристикиЗаказовНаТС;
	НастройкаПонижающийКоэффициентЗагрузкиКузоваПоВесу   = СтруктураНастроекАРМ.НастройкаПонижающийКоэффициентЗагрузкиКузоваПоВесу;
	НастройкаПонижающийКоэффициентЗагрузкиКузоваПоОбъему = СтруктураНастроекАРМ.НастройкаПонижающийКоэффициентЗагрузкиКузоваПоВесу;
	НастройкаМаксимальноеЧислоЗаказовМаршрута            = СтруктураНастроекАРМ.НастройкаМаксимальноеЧислоЗаказовМаршрута;
	
	НастройкаИспользоватьЗакреплениеТСЗаказовНаТСзаГеозонами = СтруктураНастроекАРМ.НастройкаИспользоватьЗакреплениеТСЗаказовНаТСзаГеозонами;

	НастройкаВыездСоСкладаСобственныеТС                  = СтруктураНастроекАРМ.НастройкаВыездСоСкладаСобственныеТС;
	НастройкаВыездСоСкладаПривлеченныеТС                 = СтруктураНастроекАРМ.НастройкаВыездСоСкладаПривлеченныеТС;
	НастройкаВыездСоСкладаВиртуальныеТС                  = СтруктураНастроекАРМ.НастройкаВыездСоСкладаВиртуальныеТС;
	НастройкаЗаездНаСкладСобственныеТС                   = СтруктураНастроекАРМ.НастройкаЗаездНаСкладСобственныеТС;
	НастройкаЗаездНаСкладПривлеченныеТС                  = СтруктураНастроекАРМ.НастройкаЗаездНаСкладПривлеченныеТС;
	НастройкаЗаездНаСкладВиртуальныеТС                   = СтруктураНастроекАРМ.НастройкаЗаездНаСкладВиртуальныеТС;
	НастройкаВыездИзГаражаСобственныеТС                  = СтруктураНастроекАРМ.НастройкаВыездИзГаражаСобственныеТС;
	НастройкаВыездИзГаражаПривлеченныеТС                 = СтруктураНастроекАРМ.НастройкаВыездИзГаражаПривлеченныеТС;
	НастройкаВыездИзГаражаВиртуальныеТС                  = СтруктураНастроекАРМ.НастройкаВыездИзГаражаВиртуальныеТС;
	НастройкаВозвратВГаражСобственныеТС                  = СтруктураНастроекАРМ.НастройкаВозвратВГаражСобственныеТС;
	НастройкаВозвратВГаражПривлеченныеТС                 = СтруктураНастроекАРМ.НастройкаВыездИзГаражаПривлеченныеТС;
	НастройкаВозвратВГаражВиртуальныеТС                  = СтруктураНастроекАРМ.НастройкаВозвратВГаражВиртуальныеТС;
	
	Структура_vehicle = Новый Структура();
	
	ТС = ТекТС.ТС;
	
	МаксимальноеЧислоЗаказовМаршрута = ?(ЗначениеЗаполнено(ТекТС.МаксимальноеКоличествоУпаковок)
	И СтруктураНастроекАРМ.НастройкаУчитыватьМаксимальноеКоличествоУпаковок = Истина,
		ТекТС.МаксимальноеКоличествоУпаковок, НастройкаМаксимальноеЧислоЗаказовМаршрута);
	capacity = Новый Массив(); 
	
	ЕстьХарКиВместимости   = Ложь;
	СтруктураВместимостьТС = Новый Структура();
	Если ЗначениеЗаполнено(МаксимальноеЧислоЗаказовМаршрута) Тогда
		СтруктураВместимостьТС.Вставить("units", МаксимальноеЧислоЗаказовМаршрута);
		ЕстьХарКиВместимости = Истина;
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекТС.Грузоподъемность) Тогда
		СтруктураВместимостьТС.Вставить("weight_kg", ТекТС.Грузоподъемность);
		ЕстьХарКиВместимости = Истина;
	КонецЕсли; 
	Если ЗначениеЗаполнено(НастройкаПонижающийКоэффициентЗагрузкиКузоваПоВесу) 
		ИЛИ ЗначениеЗаполнено(НастройкаПонижающийКоэффициентЗагрузкиКузоваПоОбъему) Тогда 
		СтруктураПределыЗагрузкиТС = Новый Структура();
		Если ЗначениеЗаполнено(НастройкаПонижающийКоэффициентЗагрузкиКузоваПоВесу) Тогда
			СтруктураПределыЗагрузкиТС.Вставить("weight_perc", НастройкаПонижающийКоэффициентЗагрузкиКузоваПоВесу);
		КонецЕсли;
		Если ЗначениеЗаполнено(НастройкаПонижающийКоэффициентЗагрузкиКузоваПоОбъему) Тогда
			СтруктураПределыЗагрузкиТС.Вставить("volume_perc", НастройкаПонижающийКоэффициентЗагрузкиКузоваПоОбъему);
		КонецЕсли;
		СтруктураВместимостьТС.Вставить("limits", СтруктураПределыЗагрузкиТС);
		ЕстьХарКиВместимости = Истина;
	КонецЕсли;
	
	ПолезныйРазмерГлубина = ТС.ПолезныйРазмерДлина / 1000;
	ПолезныйРазмерШирина  = ТС.ПолезныйРазмерШирина / 1000;
	ПолезныйРазмерВысота  = ТС.ПолезныйРазмерВысота / 1000;
	
	Если СтруктураНастроекАРМ.НастройкаУчетЖесткихГабаритовГруза 
		И ПолезныйРазмерГлубина > 0
		И ПолезныйРазмерШирина > 0
		И ПолезныйРазмерВысота > 0 Тогда
		
		СтруктураМетрическиеРазмерыТС = Новый Структура();
		СтруктураМетрическиеРазмерыТС.Вставить("height_m", ПолезныйРазмерВысота);
		СтруктураМетрическиеРазмерыТС.Вставить("width_m",  ПолезныйРазмерШирина);
		СтруктураМетрическиеРазмерыТС.Вставить("depth_m",  ПолезныйРазмерГлубина);
		
		СтруктураВместимостьТС.Вставить("volume", СтруктураМетрическиеРазмерыТС);
		ЕстьХарКиВместимости = Истина;
	Иначе
		ПолезныйРазмерГлубина  = ТекТС.ОбъемКузова;
		Если ПолезныйРазмерГлубина > 0 Тогда
			Если флRarusVRP Тогда
				СтруктураМетрическиеРазмерыТС = Новый Структура("height_m, width_m, depth_m", 1, 1, ПолезныйРазмерГлубина);
				СтруктураВместимостьТС.Вставить("volume", СтруктураМетрическиеРазмерыТС);
			Иначе
				СтруктураВместимостьТС.Вставить("volume_cbm", ПолезныйРазмерГлубина); 
			КонецЕсли;
			ЕстьХарКиВместимости = Истина;
		КонецЕсли;
	КонецЕсли; 
	Если ЕстьХарКиВместимости Тогда
		Структура_vehicle.Вставить("capacity", СтруктураВместимостьТС);
	КонецЕсли;
	
	breaks = Новый Массив();
	Если ЗначениеЗаполнено(ТС.ОсновнойРежимРаботы) Тогда
		Для Каждого ТекСтрока Из ТС.ОсновнойРежимРаботы.Перерывы Цикл
			Часов = Час(ТекСтрока.Длительность);
			Минут = Минута(ТекСтрока.Длительность);
			Если (Часов <> 0
				ИЛИ Минут <> 0)
				И ЗначениеЗаполнено(ТекСтрока.ВремяДоПерерываМинимум)
				И ЗначениеЗаполнено(ТекСтрока.ВремяДоПерерываМаксимум) Тогда
				rest_duration_s = (Часов*3600) + (Минут*60);
				work_time_range_till_rest = Формат(ТекСтрока.ВремяДоПерерываМинимум, "ДФ=HH:mm") + "-"
					+ Формат(ТекСтрока.ВремяДоПерерываМаксимум, "ДФ=HH:mm");
				breaks.Добавить(Новый Структура("rest_duration_s, work_time_range_till_rest", rest_duration_s, work_time_range_till_rest));
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если breaks.Количество() <> 0 Тогда
		Структура_vehicle.Вставить("rest_schedule", Новый Структура("breaks", breaks));
	КонецЕсли;
	
	Структура_shift = Новый Структура();
	
	НастройкаМаксимальнаяПродолжительностьСмены = СтруктураНастроекАРМ.НастройкаМаксимальнаяПродолжительностьСмены;
	Если ТипЗнч(НастройкаМаксимальнаяПродолжительностьСмены) = Тип("Строка") Тогда
		Попытка
			НастройкаМаксимальнаяПродолжительностьСмены = Дата(НастройкаМаксимальнаяПродолжительностьСмены);
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТС.МаксимальнаяПродолжительностьСмены) Тогда
		Структура_shift.Вставить("max_duration_s",     ТС.МаксимальнаяПродолжительностьСмены - '00010101000000');
	ИначеЕсли ЗначениеЗаполнено(НастройкаМаксимальнаяПродолжительностьСмены) Тогда
		Структура_shift.Вставить("max_duration_s",     НастройкаМаксимальнаяПродолжительностьСмены - '00010101000000');
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТС.МаксимальныйПробегЗаСмену) Тогда
		Структура_shift.Вставить("max_mileage_km",     ТС.МаксимальныйПробегЗаСмену);
	ИначеЕсли ЗначениеЗаполнено(СтруктураНастроекАРМ.НастройкаМаксимальныйПробегЗаСмену) Тогда
		Структура_shift.Вставить("max_mileage_km",     СтруктураНастроекАРМ.НастройкаМаксимальныйПробегЗаСмену);
	КонецЕсли;
	
	Структура_shift.Вставить("service_duration_s", ТС.ВремяПересменки - '00010101000000');
	Если ЗначениеЗаполнено(ТС.МинимальноеЧислоПунктов) Тогда
		Структура_shift.Вставить("minimal_stops",      ТС.МинимальноеЧислоПунктов);
	ИначеЕсли ЗначениеЗаполнено(СтруктураНастроекАРМ.НастройкаМинимальноеКоличествоОстановок) Тогда 
		Структура_shift.Вставить("minimal_stops",      СтруктураНастроекАРМ.НастройкаМинимальноеКоличествоОстановок);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТС.МаксимальноеЧислоПунктов) Тогда
		Структура_shift.Вставить("maximal_stops",  ТС.МаксимальноеЧислоПунктов);
	ИначеЕсли ЗначениеЗаполнено(СтруктураНастроекАРМ.НастройкаМаксимальноеКоличествоОстановок) Тогда
		Структура_shift.Вставить("maximal_stops",  СтруктураНастроекАРМ.НастройкаМаксимальноеКоличествоОстановок);
	КонецЕсли;
	
	locationsPenalty_early_fixed   = ?(ЗначениеЗаполнено(ТС.ШтрафЗаОкноФиксирРанее), ТС.ШтрафЗаОкноФиксирРанее, НастройкиМаршрутизации.locationsPenalty_early_fixed);
	locationsPenalty_early_minute  = ?(ЗначениеЗаполнено(ТС.ШтрафЗаОкноМинутаРанее), ТС.ШтрафЗаОкноМинутаРанее, НастройкиМаршрутизации.locationsPenalty_early_minute);
	locationsPenalty_late_fixed    = ?(ЗначениеЗаполнено(ТС.ШтрафЗаОкноФиксирПозднее), ТС.ШтрафЗаОкноФиксирПозднее, НастройкиМаршрутизации.locationsPenalty_late_fixed);
	locationsPenalty_late_minute   = ?(ЗначениеЗаполнено(ТС.ШтрафЗаОкноМинутаПозднее), ТС.ШтрафЗаОкноМинутаПозднее, НастройкиМаршрутизации.locationsPenalty_late_minute);
	
	ЕстьШтрафы = Ложь;
	СтруктураШтрафов = Новый Структура();
	Если ЗначениеЗаполнено(ТС.ШтрафЗаОкноФиксир)
		ИЛИ ЗначениеЗаполнено(ТС.ШтрафЗаОкноМинута) Тогда
		out_of_time = Новый Структура();
		Если ЗначениеЗаполнено(ТС.ШтрафЗаОкноФиксир) Тогда
			out_of_time.Вставить("fixed", ТС.ШтрафЗаОкноФиксир);
		КонецЕсли;
		Если ЗначениеЗаполнено(ТС.ШтрафЗаОкноМинута) Тогда
			out_of_time.Вставить("minute", ТС.ШтрафЗаОкноМинута);
		КонецЕсли;
		СтруктураШтрафов.Вставить("out_of_time", out_of_time);
		ЕстьШтрафы = Истина;
	КонецЕсли;
	Если ЗначениеЗаполнено(locationsPenalty_early_fixed)
		ИЛИ ЗначениеЗаполнено(locationsPenalty_early_minute) Тогда
		early = Новый Структура();
		Если ЗначениеЗаполнено(locationsPenalty_early_fixed) Тогда
			early.Вставить("fixed", locationsPenalty_early_fixed);
		КонецЕсли;
		Если ЗначениеЗаполнено(locationsPenalty_early_minute) Тогда
			early.Вставить("minute", locationsPenalty_early_minute);
		КонецЕсли;
		СтруктураШтрафов.Вставить("early", early);
		ЕстьШтрафы = Истина;
	КонецЕсли;
	Если ЗначениеЗаполнено(locationsPenalty_late_fixed)
		ИЛИ ЗначениеЗаполнено(locationsPenalty_late_minute) Тогда
		late = Новый Структура();
		Если ЗначениеЗаполнено(locationsPenalty_late_fixed) Тогда
			late.Вставить("fixed", locationsPenalty_late_fixed);
		КонецЕсли;
		Если ЗначениеЗаполнено(locationsPenalty_late_minute) Тогда
			late.Вставить("minute", locationsPenalty_late_minute);
		КонецЕсли;
		СтруктураШтрафов.Вставить("late", late);
		ЕстьШтрафы = Истина;
	КонецЕсли;
	Если ЗначениеЗаполнено(ТС.ШтрафЗаНевыполнениеЗаказаФиксир)
		ИЛИ ЗначениеЗаполнено(ТС.ШтрафЗаНевыполнениеЗаказа) Тогда
		stop_lack = Новый Структура();
		Если ЗначениеЗаполнено(ТС.ШтрафЗаНевыполнениеЗаказаФиксир) Тогда
			stop_lack.Вставить("fixed", ТС.ШтрафЗаНевыполнениеЗаказаФиксир);
		КонецЕсли;
		Если ЗначениеЗаполнено(ТС.ШтрафЗаНевыполнениеЗаказа) Тогда
			stop_lack.Вставить("per_stop", ТС.ШтрафЗаНевыполнениеЗаказа);
		КонецЕсли;
		СтруктураШтрафов.Вставить("stop_lack", stop_lack);
		ЕстьШтрафы = Истина;
	КонецЕсли;
	Если ЗначениеЗаполнено(ТС.ШтрафЗаПревышениеМаксимумаЗаказовФиксир)
		ИЛИ ЗначениеЗаполнено(ТС.ШтрафЗаПревышениеМаксимумаЗаказов) Тогда
		stop_excess = Новый Структура();
		Если ЗначениеЗаполнено(ТС.ШтрафЗаПревышениеМаксимумаЗаказовФиксир) Тогда
			stop_excess.Вставить("fixed", ТС.ШтрафЗаПревышениеМаксимумаЗаказовФиксир);
		КонецЕсли;
		Если ЗначениеЗаполнено(ТС.ШтрафЗаПревышениеМаксимумаЗаказов) Тогда
			stop_excess.Вставить("per_stop", ТС.ШтрафЗаПревышениеМаксимумаЗаказов);
		КонецЕсли;
		СтруктураШтрафов.Вставить("stop_excess", stop_excess);
		ЕстьШтрафы = Истина;
	КонецЕсли;
	Если ЗначениеЗаполнено(ТС.ШтрафЗаПревышениеМаксимальногоПробегаЗаСменуФиксир)
		ИЛИ ЗначениеЗаполнено(ТС.ШтрафЗаПревышениеМаксимальногоПробегаЗаСмену) Тогда
		max_mileage = Новый Структура();
		Если ЗначениеЗаполнено(ТС.ШтрафЗаПревышениеМаксимальногоПробегаЗаСменуФиксир) Тогда
			max_mileage.Вставить("fixed", ТС.ШтрафЗаПревышениеМаксимальногоПробегаЗаСменуФиксир);
		КонецЕсли;
		Если ЗначениеЗаполнено(ТС.ШтрафЗаПревышениеМаксимальногоПробегаЗаСмену) Тогда
			max_mileage.Вставить("km", ТС.ШтрафЗаПревышениеМаксимальногоПробегаЗаСмену);
		КонецЕсли;
		СтруктураШтрафов.Вставить("max_mileage", max_mileage);
		ЕстьШтрафы = Истина;
	КонецЕсли;
	Если ЕстьШтрафы Тогда
		Структура_shift.Вставить("penalty", СтруктураШтрафов);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТС.ОсновнойРежимРаботы) 
		И ИспользоватьГруппыБалансировкиМаршрутов Тогда
		ГруппаБалансировкиМаршрутов = ТС.ОсновнойРежимРаботы.ГруппаБалансировкиМаршрутов;
		Если ЗначениеЗаполнено(ГруппаБалансировкиМаршрутов) Тогда
			Структура_shift.Вставить("balanced_group_id", Строка(ГруппаБалансировкиМаршрутов.УникальныйИдентификатор()));
		КонецЕсли;
	КонецЕсли;
	Структура_shift.Вставить("id",                 Строка(Новый УникальныйИдентификатор()));
	

	ОсновнойРежимРаботы = ТС.ОсновнойРежимРаботы;
	
	ВремяНачалоПоРежиму = ОсновнойРежимРаботы.НачалоРаботы;
	ВремяКонецПоРежиму  = ?(ЗначениеЗаполнено(ОсновнойРежимРаботы), ОсновнойРежимРаботы.КонецРаботы, '00010101235959'); 
	
	флагСдвигДаты       = ВремяКонецПоРежиму < ВремяНачалоПоРежиму;
	
	Если НЕ ЗначениеЗаполнено(ВремяНачалоПоРежиму)
		И (НЕ ЗначениеЗаполнено(ВремяКонецПоРежиму)
		ИЛИ (Час(ВремяКонецПоРежиму) = 23 И Минута(ВремяКонецПоРежиму) = 59)) Тогда
		
		Если СтруктураНастроекАРМ.Свойство("ТекОкноС") 
			И СтруктураНастроекАРМ.ТекОкноС > ВремяНачалоПоРежиму Тогда
			Структура_shift.Вставить(
			"time_window", 
			Строка(День(СтруктураНастроекАРМ.ТекОкноС) - 1)
			+ "." + Формат(СтруктураНастроекАРМ.ТекОкноС, "ДФ=HH:mm:ss; ДП=00:00:00") + "-"
			+ "1.23:59:59"
			);
			Структура_vehicle.Вставить(
			"time_window_format", 
			"%1." + Формат(СтруктураНастроекАРМ.ТекОкноС, "ДФ=HH:mm:ss; ДП=00:00:00") + "-"
			+ "%2.23:59:59"
			);
		Иначе
			Структура_shift.Вставить(
			"time_window", 
			"0.00:00:00 - 1.23:59:59"
			); 
			
			Структура_vehicle.Вставить(
			"time_window_format", 
			"%1.00:00:00 - %2.23:59:59"
			);
		КонецЕсли;
	Иначе
		ТекОкноС = ВремяНачалоПоРежиму;
		Если СтруктураНастроекАРМ.Свойство("ТекОкноС")
			И СтруктураНастроекАРМ.ТекОкноС > ВремяНачалоПоРежиму 
			И флагСдвигДаты Тогда
			ТекОкноС = СтруктураНастроекАРМ.ТекОкноС;
		КонецЕсли;
		
		Если флПереносДаты 
			И НЕ флагСдвигДаты Тогда
			Структура_shift.Вставить(
			"time_window", 
			"1." + Формат(ВремяНачалоПоРежиму, "ДФ=HH:mm:ss; ДП=00:00:00") + "-" +
			"1." + Формат(ВремяКонецПоРежиму, "ДФ=HH:mm:ss; ДП=00:00:00")
			);
			Структура_vehicle.Вставить(
			"time_window_format", 
			"%1." + Формат(ВремяНачалоПоРежиму, "ДФ=HH:mm:ss; ДП=00:00:00") + "-" +
			"%2." + Формат(ВремяКонецПоРежиму, "ДФ=HH:mm:ss; ДП=00:00:00")
			);
		Иначе
			Структура_shift.Вставить(
			"time_window", 
			"0." + Формат(ТекОкноС, "ДФ=HH:mm:ss; ДП=00:00:00") + "-" +
			?(флагСдвигДаты, "1.", "0.") + Формат(ВремяКонецПоРежиму, "ДФ=HH:mm:ss; ДП=00:00:00")
			);
			Структура_vehicle.Вставить(
			"time_window_format", 
			"%1." + Формат(ТекОкноС, "ДФ=HH:mm:ss; ДП=00:00:00") + "-%2." +
			Формат(ВремяКонецПоРежиму, "ДФ=HH:mm:ss; ДП=00:00:00")
			);
		КонецЕсли;
	КонецЕсли;
	
	Структура_shift.Вставить("hard_window", НЕ ТС.РазрешитьНарушениеРежимаРаботы);
	Массив_shifts = Новый Массив();
	Массив_shifts.Добавить(Структура_shift);
	Структура_vehicle.Вставить("shifts", Массив_shifts);
	Структура_vehicle.Вставить("max_runs", ?(ЗначениеЗаполнено(ТС.КоличествоЕздок), ТС.КоличествоЕздок, 0)); 
	
	Если ТекТС.Свойство("ЗаказыДляДопланирования") Тогда
		
		МассивЗаказов     = Новый Массив();
		Для Каждого ТекСтрока Из ТекТС.ЗаказыДляДопланирования Цикл
			СоответвиеЗаказа = СоответвиеЗаказов.Получить(ТекСтрока.Номер + "_" + ТекСтрока.ИдентификаторСтроки);
			Если СоответвиеЗаказа = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			idЗаказа = Новый Структура("id", СоответвиеЗаказа);
			
			МассивЗаказов.Добавить(idЗаказа);
		КонецЦикла;
		planned_route = Новый Структура();
		planned_route.Вставить("locations", МассивЗаказов);
		
		Структура_vehicle.Вставить("planned_route", planned_route);
	КонецЕсли;
	
	Если флRarusVRP
		И СтруктураНастроекАРМ.НастройкаИспользоватьМногорейсовыеМаршруты
		И ЗначениеЗаполнено(ТекТС.ДатаВыездаТС) Тогда
		Структура_vehicle.Вставить("departure_time", ТекТС.ДатаВыездаТС - НачалоДня(ДатаПланирования));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТС.МетодПередвижения) Тогда
		Структура_vehicle.Вставить("routing_mode", ТС.МетодПередвижения);
	КонецЕсли;
	
	Модель = ТС.Модель;
	
	КастомнаяСтоимостьМаршрута = ?(ЗначениеЗаполнено(ТС.КастомнаяСтоимостьМаршрута),  ТС.КастомнаяСтоимостьМаршрута,  Модель.КастомнаяСтоимостьМаршрута);
	vehicleCost_fixed          = ?(ЗначениеЗаполнено(ТС.СтоимостьТСФиксир),  ТС.СтоимостьТСФиксир,  Модель.СтоимостьТСФиксир);
	vehicleCost_km             = ?(ЗначениеЗаполнено(ТС.СтоимостьТСЗаКм),    ТС.СтоимостьТСЗаКм,    Модель.СтоимостьТСЗаКм);
	vehicleCost_hour           = ?(ЗначениеЗаполнено(ТС.СтоимостьТСЗаЧас),   ТС.СтоимостьТСЗаЧас,   Модель.СтоимостьТСЗаЧас);
	vehicleCost_location       = ?(ЗначениеЗаполнено(ТС.СтоимостьТСЗаЗаказ), ТС.СтоимостьТСЗаЗаказ, Модель.СтоимостьТСЗаЗаказ);
	vehicleCost_run            = ?(ЗначениеЗаполнено(ТС.СтоимостьТСЗаЕздку), ТС.СтоимостьТСЗаЕздку, Модель.СтоимостьТСЗаЕздку);
	
	Структура_vehicle.Вставить("service_duration_multiplier",        ?(НЕ ЗначениеЗаполнено(ТС.КоэффициентКорректирующийВремяНаОбработкуЗаказа), 1, ТС.КоэффициентКорректирующийВремяНаОбработкуЗаказа));
	Структура_vehicle.Вставить("shared_service_duration_multiplier", ?(НЕ ЗначениеЗаполнено(ТС.КоэффициентКорректирующийВремяНаАдрес), 1, ТС.КоэффициентКорректирующийВремяНаАдрес));
	
	Если ТС.ПринадлежностьТС = Перечисления.уатПринадлежностьТС.Привлеченное Тогда 
		Структура_vehicle.Вставить("visit_depot_at_start", НастройкаВыездСоСкладаПривлеченныеТС);
		Структура_vehicle.Вставить("return_to_depot",      НастройкаЗаездНаСкладПривлеченныеТС);
		Если флRarusVRP Тогда
			Структура_vehicle.Вставить("priority", Ложь);
		Иначе
			Структура_vehicle.Вставить("priority", 100);
		КонецЕсли;
		
		КастомнаяСтоимостьМаршрута     = ?(ЗначениеЗаполнено(КастомнаяСтоимостьМаршрута), КастомнаяСтоимостьМаршрута, vehiclesExternalCost);
		СтоимостьЗаФактИспользованияТС = ?(vehicleCost_fixed > 0, vehicleCost_fixed, vehiclesExternalCost_fixed);
		СтоимостьЗаРейс                = ?(vehicleCost_run > 0, vehicleCost_run, vehiclesExternalCost_run);
		СтоимостьЗаКм                  = ?(vehicleCost_km > 0, vehicleCost_km, vehiclesExternalCost_km); 
		СтоимостьЗаЧас                 = ?(vehicleCost_hour > 0, vehicleCost_hour, vehiclesExternalCost_hour);
		СтоимостьЗаПункт               = ?(vehicleCost_location > 0, vehicleCost_location, vehiclesExternalCost_location);
		
		Если флRarusVRP Тогда
			СтруктураСтоимостьТС = Новый Структура();
			СтруктураСтоимостьТС.Вставить("fixed",    СтоимостьЗаФактИспользованияТС);
			СтруктураСтоимостьТС.Вставить("run",      СтоимостьЗаРейс);
			СтруктураСтоимостьТС.Вставить("km",       СтоимостьЗаКм);
			СтруктураСтоимостьТС.Вставить("hour",     СтоимостьЗаЧас);
			СтруктураСтоимостьТС.Вставить("location", СтоимостьЗаПункт);
			Структура_vehicle.Вставить("cost",        СтруктураСтоимостьТС);
		Иначе
			Если ЗначениеЗаполнено(КастомнаяСтоимостьМаршрута) Тогда
				 Структура_vehicle.Вставить("cost", КастомнаяСтоимостьМаршрута);
			ИначеЕсли ЗначениеЗаполнено(СтоимостьЗаФактИспользованияТС)
				ИЛИ ЗначениеЗаполнено(СтоимостьЗаРейс)
				ИЛИ ЗначениеЗаполнено(СтоимостьЗаКм) 
				ИЛИ ЗначениеЗаполнено(СтоимостьЗаЧас) 
				ИЛИ ЗначениеЗаполнено(СтоимостьЗаПункт) Тогда 
				СтруктураСтоимостьТС = Новый Структура();
				Если ЗначениеЗаполнено(СтоимостьЗаФактИспользованияТС) Тогда
					СтруктураСтоимостьТС.Вставить("fixed", СтоимостьЗаФактИспользованияТС);
				КонецЕсли;
				Если ЗначениеЗаполнено(СтоимостьЗаРейс) Тогда
					СтруктураСтоимостьТС.Вставить("run", СтоимостьЗаРейс);
				КонецЕсли;
				Если ЗначениеЗаполнено(СтоимостьЗаКм) Тогда
					СтруктураСтоимостьТС.Вставить("km", СтоимостьЗаКм);
				КонецЕсли;
				Если ЗначениеЗаполнено(СтоимостьЗаЧас) Тогда
					СтруктураСтоимостьТС.Вставить("hour", СтоимостьЗаЧас);
				КонецЕсли;
				Если ЗначениеЗаполнено(СтоимостьЗаПункт) Тогда
					СтруктураСтоимостьТС.Вставить("location", СтоимостьЗаПункт);
				КонецЕсли;
				Структура_vehicle.Вставить("cost", СтруктураСтоимостьТС);
			КонецЕсли;
		КонецЕсли;
		ДобавитьВыездИзГаража(НастройкаВыездИзГаражаПривлеченныеТС, ТС, СтруктураНастроекАРМ, Массив_locations, Структура_vehicle, СчДобавленныхОбъектов);
		ДобавитьЗаездВГараж(НастройкаВозвратВГаражПривлеченныеТС, ТС, СтруктураНастроекАРМ, Массив_locations, Структура_vehicle, СчДобавленныхОбъектов);
		
	ИначеЕсли ТС.ПринадлежностьТС = Перечисления.уатПринадлежностьТС.Виртуальное Тогда 
		Структура_vehicle.Вставить("visit_depot_at_start", НастройкаВыездСоСкладаВиртуальныеТС);
		Структура_vehicle.Вставить("return_to_depot",      НастройкаЗаездНаСкладВиртуальныеТС);
		Если флRarusVRP Тогда
			Структура_vehicle.Вставить("priority", Ложь);
		Иначе
			Структура_vehicle.Вставить("priority", 100);
		КонецЕсли;
		
		КастомнаяСтоимостьМаршрута     = ?(ЗначениеЗаполнено(КастомнаяСтоимостьМаршрута), КастомнаяСтоимостьМаршрута, vehiclesVirtualCost);
		СтоимостьЗаФактИспользованияТС = ?(vehicleCost_fixed > 0, vehicleCost_fixed, vehiclesVirtualCost_fixed);
		СтоимостьЗаРейс                = ?(vehicleCost_run > 0, vehicleCost_run, vehiclesVirtualCost_run);
		СтоимостьЗаКм                  = ?(vehicleCost_km > 0, vehicleCost_km, vehiclesVirtualCost_km); 
		СтоимостьЗаЧас                 = ?(vehicleCost_hour > 0, vehicleCost_hour, vehiclesVirtualCost_hour);
		СтоимостьЗаПункт               = ?(vehicleCost_location > 0, vehicleCost_location, vehiclesVirtualCost_location);
		
		Если флRarusVRP Тогда
			СтруктураСтоимостьТС = Новый Структура();
			СтруктураСтоимостьТС.Вставить("fixed",    СтоимостьЗаФактИспользованияТС);
			СтруктураСтоимостьТС.Вставить("run",      СтоимостьЗаРейс);
			СтруктураСтоимостьТС.Вставить("km",       СтоимостьЗаКм);
			СтруктураСтоимостьТС.Вставить("hour",     СтоимостьЗаЧас);
			СтруктураСтоимостьТС.Вставить("location", СтоимостьЗаПункт);
			Структура_vehicle.Вставить("cost",        СтруктураСтоимостьТС);
		Иначе
			Если ЗначениеЗаполнено(КастомнаяСтоимостьМаршрута) Тогда
				 Структура_vehicle.Вставить("cost", КастомнаяСтоимостьМаршрута);
			ИначеЕсли ЗначениеЗаполнено(СтоимостьЗаФактИспользованияТС)
				ИЛИ ЗначениеЗаполнено(СтоимостьЗаРейс)
				ИЛИ ЗначениеЗаполнено(СтоимостьЗаКм) 
				ИЛИ ЗначениеЗаполнено(СтоимостьЗаЧас) 
				ИЛИ ЗначениеЗаполнено(СтоимостьЗаПункт) Тогда 
				СтруктураСтоимостьТС = Новый Структура();
				Если ЗначениеЗаполнено(СтоимостьЗаФактИспользованияТС) Тогда
					СтруктураСтоимостьТС.Вставить("fixed", СтоимостьЗаФактИспользованияТС);
				КонецЕсли;
				Если ЗначениеЗаполнено(СтоимостьЗаРейс) Тогда
					СтруктураСтоимостьТС.Вставить("run", СтоимостьЗаРейс);
				КонецЕсли;
				Если ЗначениеЗаполнено(СтоимостьЗаКм) Тогда
					СтруктураСтоимостьТС.Вставить("km", СтоимостьЗаКм);
				КонецЕсли;
				Если ЗначениеЗаполнено(СтоимостьЗаЧас) Тогда
					СтруктураСтоимостьТС.Вставить("hour", СтоимостьЗаЧас);
				КонецЕсли;
				Если ЗначениеЗаполнено(СтоимостьЗаПункт) Тогда
					СтруктураСтоимостьТС.Вставить("location", СтоимостьЗаПункт);
				КонецЕсли;
				Структура_vehicle.Вставить("cost", СтруктураСтоимостьТС);
			КонецЕсли; 
		КонецЕсли;

		ДобавитьВыездИзГаража(НастройкаВыездИзГаражаВиртуальныеТС, ТС, СтруктураНастроекАРМ, Массив_locations, Структура_vehicle, СчДобавленныхОбъектов);
		ДобавитьЗаездВГараж(НастройкаВозвратВГаражВиртуальныеТС, ТС, СтруктураНастроекАРМ, Массив_locations, Структура_vehicle, СчДобавленныхОбъектов);
		
	Иначе 
		Структура_vehicle.Вставить("visit_depot_at_start", НастройкаВыездСоСкладаСобственныеТС);
		Структура_vehicle.Вставить("return_to_depot",      НастройкаЗаездНаСкладСобственныеТС);
		Если флRarusVRP Тогда
			Структура_vehicle.Вставить("priority", НастройкаИспользоватьВПриоритетеСобственныйТранспорт);
		Иначе
			Структура_vehicle.Вставить("priority", ?(НастройкаИспользоватьВПриоритетеСобственныйТранспорт, 200, 100));
		КонецЕсли;
		
		КастомнаяСтоимостьМаршрута     = ?(ЗначениеЗаполнено(КастомнаяСтоимостьМаршрута), КастомнаяСтоимостьМаршрута, vehiclesCompanyCost);
		СтоимостьЗаФактИспользованияТС = ?(vehicleCost_fixed > 0, vehicleCost_fixed, vehiclesCompanyCost_fixed);
		СтоимостьЗаРейс                = ?(vehicleCost_run > 0, vehicleCost_run, vehiclesCompanyCost_run);
		СтоимостьЗаКм                  = ?(vehicleCost_km > 0, vehicleCost_km, vehiclesCompanyCost_km); 
		СтоимостьЗаЧас                 = ?(vehicleCost_hour > 0, vehicleCost_hour, vehiclesCompanyCost_hour);
		СтоимостьЗаПункт               = ?(vehicleCost_location > 0, vehicleCost_location, vehiclesCompanyCost_location);
		
		Если флRarusVRP Тогда
			СтруктураСтоимостьТС = Новый Структура();
			СтруктураСтоимостьТС.Вставить("fixed",    СтоимостьЗаФактИспользованияТС);
			СтруктураСтоимостьТС.Вставить("run",      СтоимостьЗаРейс);
			СтруктураСтоимостьТС.Вставить("km",       СтоимостьЗаКм);
			СтруктураСтоимостьТС.Вставить("hour",     СтоимостьЗаЧас);
			СтруктураСтоимостьТС.Вставить("location", СтоимостьЗаПункт);
			Структура_vehicle.Вставить("cost",        СтруктураСтоимостьТС);
		Иначе
			Если ЗначениеЗаполнено(КастомнаяСтоимостьМаршрута) Тогда
				 Структура_vehicle.Вставить("cost", КастомнаяСтоимостьМаршрута);
			ИначеЕсли ЗначениеЗаполнено(СтоимостьЗаФактИспользованияТС)
				ИЛИ ЗначениеЗаполнено(СтоимостьЗаРейс)
				ИЛИ ЗначениеЗаполнено(СтоимостьЗаКм) 
				ИЛИ ЗначениеЗаполнено(СтоимостьЗаЧас) 
				ИЛИ ЗначениеЗаполнено(СтоимостьЗаПункт) Тогда 
				СтруктураСтоимостьТС = Новый Структура();
				Если ЗначениеЗаполнено(СтоимостьЗаФактИспользованияТС) Тогда
					СтруктураСтоимостьТС.Вставить("fixed", СтоимостьЗаФактИспользованияТС);
				КонецЕсли;
				Если ЗначениеЗаполнено(СтоимостьЗаРейс) Тогда
					СтруктураСтоимостьТС.Вставить("run", СтоимостьЗаРейс);
				КонецЕсли;
				Если ЗначениеЗаполнено(СтоимостьЗаКм) Тогда
					СтруктураСтоимостьТС.Вставить("km", СтоимостьЗаКм);
				КонецЕсли;
				Если ЗначениеЗаполнено(СтоимостьЗаЧас) Тогда
					СтруктураСтоимостьТС.Вставить("hour", СтоимостьЗаЧас);
				КонецЕсли;
				Если ЗначениеЗаполнено(СтоимостьЗаПункт) Тогда
					СтруктураСтоимостьТС.Вставить("location", СтоимостьЗаПункт);
				КонецЕсли;
				Структура_vehicle.Вставить("cost", СтруктураСтоимостьТС);
			КонецЕсли; 
		КонецЕсли;
		
		ДобавитьВыездИзГаража(НастройкаВыездИзГаражаСобственныеТС, ТС, СтруктураНастроекАРМ, Массив_locations, Структура_vehicle, СчДобавленныхОбъектов);
		ДобавитьЗаездВГараж(НастройкаВозвратВГаражСобственныеТС, ТС, СтруктураНастроекАРМ, Массив_locations, Структура_vehicle, СчДобавленныхОбъектов);
		
	КонецЕсли;
	
	Если НЕ флRarusVRP Тогда
		// Теги используются только для Яндекса
		Структура_vehicle.Вставить("tags",          Новый Массив());
		Структура_vehicle.Вставить("excluded_tags", Новый Массив());
		
		Если НастройкаИспользоватьХарактеристикиЗаказовНаТС Тогда 
			Для Каждого СтрокаХарактеристики Из ТекТС.ТС.Характеристики Цикл 
				Структура_vehicle.tags.Добавить(Строка(СтрокаХарактеристики.Характеристика.УникальныйИдентификатор()));
			КонецЦикла;
		КонецЕсли;
		
		Если НастройкаИспользоватьЗакреплениеТСЗаказовНаТСзаГеозонами Тогда
			Если СтруктураНастроекАРМ.ТипАвторизации = "OAuth-токен" Тогда
				
				СвойстваГеозон = СоответствиеГеозон.Получить(ТекТС.ТС);
				Если СвойстваГеозон <> Неопределено Тогда 
					РазрешенныеГеозоны = СвойстваГеозон.РазрешенныеГеозоны;
					ЗапрещенныеГеозоны = СвойстваГеозон.ЗапрещенныеГеозоны;
					
					Если РазрешенныеГеозоны.Количество() <> 0 Тогда
						Структура_vehicle.Вставить("allowed_zones", Новый Массив());
						Для Каждого СтрокаГеозоны Из РазрешенныеГеозоны Цикл 
							Структура_vehicle.allowed_zones.Добавить(СтрокаГеозоны);
						КонецЦикла; 
					КонецЕсли;
					Если ЗапрещенныеГеозоны.Количество() <> 0 Тогда
						Структура_vehicle.Вставить("forbidden_zones", Новый Массив());
						Для Каждого СтрокаГеозоны Из ЗапрещенныеГеозоны Цикл 
							Структура_vehicle.forbidden_zones.Добавить(СтрокаГеозоны);
						КонецЦикла; 
					КонецЕсли;
				КонецЕсли;
			Иначе
				СтруктураСвойств = СоответствиеГеозон.Получить(ТекТС.ТС);
				Если СтруктураСвойств <> Неопределено Тогда
					мсвРазрешенныеГеозоны = СтруктураСвойств.РазрешенныеГеозоны;
					Для Каждого СтрокаХарактеристики Из мсвРазрешенныеГеозоны Цикл 
						Структура_vehicle.tags.Добавить(СтрокаХарактеристики);
					КонецЦикла;
				КонецЕсли; 
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТС.КоэффициентКорректировкиВремениПоездки) Тогда 
		Структура_vehicle.Вставить("travel_time_multiplier", ТС.КоэффициентКорректировкиВремениПоездки);
	Иначе
		Структура_vehicle.Вставить("travel_time_multiplier", НастройкиМаршрутизации.travel_time_multiplier);
	КонецЕсли;
	
	Если ПересчетМетрик Тогда
		visited_locations = Новый Массив();
		СтрокиLocation = ТаблицаLocation.НайтиСтроки(Новый Структура("ТС, МЛ", ТекТС.ТС, ТекТС.МЛ));
		Для Каждого ТекLocation Из СтрокиLocation Цикл	
			СтруктураVisited_locations	 = Новый Структура("id", ТекLocation.id);
			visited_locations.Добавить(СтруктураVisited_locations);
		КонецЦикла;
		Структура_vehicle.Вставить("visited_locations", visited_locations);
	КонецЕсли;
	
	ИнформацияОВодителе = "";
	Если ТекТС.ТС.ПринадлежностьТС = Перечисления.уатПринадлежностьТС.Собственное Тогда 
		тблЭкипаж = уатЗащищенныеФункцииСервер.ЭкипажТС(ТекТС.ТС, ДатаПланирования);
		Водитель  = тблЭкипаж.Найти(Перечисления.уатЧленыЭкипажа.ОсновнойВодитель, "ЧленЭкипажа");
		Если Водитель <> Неопределено Тогда
			Водитель  = Водитель.Сотрудник;
		КонецЕсли;
	Иначе
		Водитель = ТекТС.ТС.Водитель;
	КонецЕсли;	
	Если ЗначениеЗаполнено(Водитель) Тогда
		 ИнформацияОВодителе = " (" + Водитель + ")";
	КонецЕсли;
	
	Если ТекТС.Свойство("ref") Тогда
		Структура_vehicle.Вставить("ref", ТекТС.ref + ИнформацияОВодителе);
		Структура_vehicle.Вставить("id",  ТекТС.GUID);
	КонецЕсли;
	
	Возврат Структура_vehicle;
	
КонецФункции

Функция ЗаполнитьСтруктуруПараметровСклада(ДатаПланирования, Склад, СтруктураНастроекАРМ, НастройкиМаршрутизации, флагСдвигДаты, СчДобавленныхОбъектов, тблАдреса, РежимОптимизации = Ложь, РежимОптимизацииМаршрута = Ложь)
	
	Если РежимОптимизации Тогда
		флRarusVRP = СтруктураНастроекАРМ.НастройкаАлгоритмОптимизации = "RarusVRP";
	Иначе
		флRarusVRP = СтруктураНастроекАРМ.НастройкаАлгоритмМаршрутизации = 4;
	КонецЕсли;
	
	НастройкаАдресВыезда = Склад;
	
	Структура_depot = Новый Структура();

	Если РежимОптимизацииМаршрута Тогда 
		ТекОкноС  = '00010101000000';
		ТекОкноПо = '00010101235959';
	Иначе
		Если РежимОптимизации Тогда
			ТекОкноС  = СтруктураНастроекАРМ.Оптимизация_НастройкаВремяВыездаТранспортныхСредств;
			ТекОкноПо = ?(СтруктураНастроекАРМ.Оптимизация_НастройкаВремяВозвратаТранспортныхСредств = '00010101000000', '00010101235959', СтруктураНастроекАРМ.Оптимизация_НастройкаВремяВозвратаТранспортныхСредств);
		Иначе
			ТекОкноС  = СтруктураНастроекАРМ.НастройкаВремяВыездаТранспортныхСредств;
			ТекОкноПо = ?(СтруктураНастроекАРМ.НастройкаВремяВозвратаТранспортныхСредств = '00010101000000', '00010101235959', СтруктураНастроекАРМ.НастройкаВремяВозвратаТранспортныхСредств); 
		КонецЕсли;
	КонецЕсли;

	Если ТипЗнч(ТекОкноС) = Тип("Строка") Тогда
		Попытка
			ТекОкноС         = Дата(ТекОкноС);
			ТекОкноПо        = Дата(ТекОкноПо);
			ДатаПланирования = Дата(ДатаПланирования);
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	Если ТекОкноПо < ТекОкноС Тогда 
		ТекОкноПо     = ТекОкноПо + 86400;
		флагСдвигДаты = Истина;
	КонецЕсли;
	
	Если флагСдвигДаты Тогда
		СтруктураНастроекАРМ.Вставить("ТекОкноС", ТекОкноС);
		ДатаПланирования = НачалоДня(ДатаПланирования - 1);
	КонецЕсли;
	
	Если флRarusVRP Тогда
		Если НЕ ЗначениеЗаполнено(ТекОкноС)
			И (НЕ ЗначениеЗаполнено(ТекОкноПо)
			ИЛИ (Час(ТекОкноПо) = 23 И Минута(ТекОкноПо) = 59)) Тогда
			ТекОкноС = '00010101000000';
			ТекОкноПо = '00010102235959';
		КонецЕсли;
		Структура_depot.Вставить("Time_window_start", ТекОкноС - НачалоДня(ТекОкноС));
		Структура_depot.Вставить("Time_window_end",   ТекОкноПо - НачалоДня(ТекОкноС));
		НайденнаяСтрока = тблАдреса.Найти(Склад, "Адрес");
		Если НайденнаяСтрока = Неопределено Тогда
			Структура_depot.Вставить("point_number", 0);
		Иначе
			Структура_depot.Вставить("point_number", НайденнаяСтрока.НомерСтроки);
		КонецЕсли;
	Иначе
		Если НЕ ЗначениеЗаполнено(ТекОкноС)
			И (НЕ ЗначениеЗаполнено(ТекОкноПо)
			ИЛИ (Час(ТекОкноПо) = 23 И Минута(ТекОкноПо) = 59)) Тогда
			Структура_depot.Вставить(
			"time_window", 
			"0.00:00:00 - 1.23:59:59"
			); 
			
			Структура_depot.Вставить(
			"time_window_format", 
			"%1.00:00:00 - %2.23:59:59"
			);
		Иначе
			Структура_depot.Вставить(
			"time_window", 
			"" + Строка(День(ТекОкноС) - 1) + "." + Формат(ТекОкноС, "ДФ=HH:mm:ss; ДП=00:00:00") + "-" +
			Строка(День(ТекОкноПо) - 1) + "." + Формат(ТекОкноПо, "ДФ=HH:mm:ss; ДП=00:00:00")
			);
			
			Структура_depot.Вставить(
			"time_window_format", 
			"%1." + Формат(ТекОкноС, "ДФ=HH:mm:ss; ДП=00:00:00") +
			"-%2." + Формат(ТекОкноПо, "ДФ=HH:mm:ss; ДП=00:00:00")
			);
		КонецЕсли;
	КонецЕсли;

	Если РежимОптимизации Тогда
		Структура_depot.Вставить("hard_window", СтруктураНастроекАРМ.Оптимизация_НастройкаУчитыватьОкнаПоЗаказам);
	Иначе
		Структура_depot.Вставить("hard_window", СтруктураНастроекАРМ.НастройкаУчитыватьОкнаПоЗаказамПриМаршрутизации); 
	КонецЕсли;
	 
	МассивОконЗагрузки   = Новый Массив(); 
	МассивОконРазгрузки  = Новый Массив();
	МассивОконДозагрузки = Новый Массив();
	Для Каждого ТекОкно Из НастройкиМаршрутизации.ТаблицаОконСклада Цикл   
		СтруктураДанных = Новый Структура("");
		
		ОкноС   = Дата(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(ТекОкно.ОкноС, "T", ""), "Z", ""), ":", ""), "-", ""));
		ОкноПо  = Дата(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(ТекОкно.ОкноПо, "T", ""), "Z", ""), ":", ""), "-", ""));
		
		флагСдвигДатыОкна = Ложь;
		Если ОкноПо < ОкноС Тогда 
			ОкноПо = ОкноПо + 86400;
			флагСдвигДатыОкна = Истина;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ОкноС)
			И (НЕ ЗначениеЗаполнено(ОкноПо)
			ИЛИ (Час(ОкноПо) = 23 И Минута(ОкноПо) = 59)) Тогда
			СтруктураДанных.Вставить(
			"time_window", 
			"0.00:00:00 - 1.23:59:59"
			); 
			
			СтруктураДанных.Вставить(
			"time_window_format", 
			"%1.00:00:00 - %2.23:59:59"
			);
		Иначе
			СтруктураДанных.Вставить(
			"time_window", 
			"" + Строка(День(ОкноС) - 1) + "." + Формат(ОкноС, "ДФ=HH:mm:ss; ДП=00:00:00") + "-" +
			Строка(День(ОкноПо) - 1) + "." + Формат(ОкноПо, "ДФ=HH:mm:ss; ДП=00:00:00")
			);
			
			СтруктураДанных.Вставить(
			"time_window_format", 
			"%1." + Формат(ОкноС, "ДФ=HH:mm:ss; ДП=00:00:00") +
			"-%2." + Формат(ОкноПо, "ДФ=HH:mm:ss; ДП=00:00:00")
			);
		КонецЕсли;
		
		Если ТекОкно.ТипОкна = "Окно загрузки" Тогда
			МассивОконЗагрузки.Добавить(СтруктураДанных);
			Если НЕ флагСдвигДаты 
				И флагСдвигДатыОкна Тогда
				ДатаПланирования = НачалоДня(ДатаПланирования - 1);
				флагСдвигДаты    = Истина;
			КонецЕсли;
		ИначеЕсли ТекОкно.ТипОкна = "Окно разгрузки" Тогда
			МассивОконРазгрузки.Добавить(СтруктураДанных);
		ИначеЕсли ТекОкно.ТипОкна = "Окно дозагрузки" Тогда 
			МассивОконДозагрузки.Добавить(СтруктураДанных);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивОконЗагрузки.Количество() Тогда
		Структура_depot.Вставить("time_windows_loading", Новый Структура("time_windows",
		МассивОконЗагрузки)); 
	КонецЕсли;  
	Если МассивОконРазгрузки.Количество() Тогда
		Структура_depot.Вставить("time_windows_unloading", Новый Структура("time_windows",
		МассивОконРазгрузки));
	КонецЕсли;
	Если МассивОконДозагрузки.Количество() Тогда
		Структура_depot.Вставить("time_windows_refilling", Новый Структура("time_windows,",
		МассивОконДозагрузки));
	КонецЕсли;
	
	Структура_depot.Вставить("point", Новый Структура("lat, lon", Склад.Лат, Склад.Лон));
	
	Если ТипЗнч(Склад) = Тип("СправочникСсылка.уатПунктыНазначения") Тогда
		Структура_throughput = Новый Структура();
		
		ЕстьПропускнаяСпособность = Ложь;
		Если ЗначениеЗаполнено(Склад.ПропускнаяСпособностьСкладаТС) Тогда
			Структура_throughput.Вставить("vehicle_count", Склад.ПропускнаяСпособностьСкладаТС);
			ЕстьПропускнаяСпособность = Истина;
			
		ИначеЕсли НЕ РежимОптимизации Тогда
			Если СтруктураНастроекАРМ.НастройкаУчитыватьМаксимальноеКоличествоУпаковок Тогда
				Если ЗначениеЗаполнено(Склад.ПропускнаяСпособностьСкладаЕдЧ) Тогда
					Структура_throughput.Вставить("units_per_hour", Склад.ПропускнаяСпособностьСкладаЕдЧ);
					ЕстьПропускнаяСпособность = Истина;
				КонецЕсли;
			Иначе
				Если ЗначениеЗаполнено(Склад.ПропускнаяСпособностьСкладаКгЧ) Тогда
					Структура_throughput.Вставить("kg_per_hour", Склад.ПропускнаяСпособностьСкладаКгЧ);
					ЕстьПропускнаяСпособность = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если ЕстьПропускнаяСпособность Тогда
			Структура_depot.Вставить("throughput", Структура_throughput);
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ РежимОптимизацииМаршрута Тогда 
		ЕстьШтрафы = Ложь;
		СтруктураШтрафов = Новый Структура();
		Если ЗначениеЗаполнено(НастройкиМаршрутизации.depotPenalty_outOfTime_fixed)
			ИЛИ ЗначениеЗаполнено(НастройкиМаршрутизации.depotPenalty_outOfTime_minute) Тогда
			out_of_time = Новый Структура();
			Если ЗначениеЗаполнено(НастройкиМаршрутизации.depotPenalty_outOfTime_fixed) Тогда
				out_of_time.Вставить("fixed", НастройкиМаршрутизации.depotPenalty_outOfTime_fixed);
			КонецЕсли;
			Если ЗначениеЗаполнено(НастройкиМаршрутизации.depotPenalty_outOfTime_minute) Тогда
				out_of_time.Вставить("minute", НастройкиМаршрутизации.depotPenalty_outOfTime_minute);
			КонецЕсли;
			СтруктураШтрафов.Вставить("out_of_time", out_of_time);
			ЕстьШтрафы = Истина;
		КонецЕсли;
		Если ЗначениеЗаполнено(НастройкиМаршрутизации.depotPenalty_throughput_fixed)
			ИЛИ ЗначениеЗаполнено(НастройкиМаршрутизации.depotPenalty_throughput_kg)
			ИЛИ ЗначениеЗаполнено(НастройкиМаршрутизации.depotPenalty_throughput_unit)
			ИЛИ ЗначениеЗаполнено(НастройкиМаршрутизации.depotPenalty_throughput_vehicle) Тогда
			
			throughput = Новый Структура();
			Если ЗначениеЗаполнено(НастройкиМаршрутизации.depotPenalty_throughput_fixed) Тогда
				throughput.Вставить("fixed", НастройкиМаршрутизации.depotPenalty_throughput_fixed);
			КонецЕсли;
			Если ЗначениеЗаполнено(НастройкиМаршрутизации.depotPenalty_throughput_kg) Тогда
				throughput.Вставить("kg", НастройкиМаршрутизации.depotPenalty_throughput_kg);
			КонецЕсли;
			Если ЗначениеЗаполнено(НастройкиМаршрутизации.depotPenalty_throughput_unit) Тогда
				throughput.Вставить("unit", НастройкиМаршрутизации.depotPenalty_throughput_unit);
			КонецЕсли; 
			Если ЗначениеЗаполнено(НастройкиМаршрутизации.depotPenalty_throughput_vehicle) Тогда
				throughput.Вставить("unit", НастройкиМаршрутизации.depotPenalty_throughput_vehicle);
			КонецЕсли;
			СтруктураШтрафов.Вставить("throughput", throughput);
			ЕстьШтрафы = Истина;
		КонецЕсли;
		Если ЕстьШтрафы Тогда
			Структура_depot.Вставить("penalty", СтруктураШтрафов);
		КонецЕсли;;
		
		ТипТС = Новый Массив; //тип ТС заранее не известен
		СтоянкаПоГаражу = уатЗащищенныеФункцииСервер_уэ.ПолучитьВремяСтоянкиВПункте(НастройкаАдресВыезда, ТипТС);
		СтоянкаПоГаражуЧас = Цел(СтоянкаПоГаражу);
		СтоянкаПоГаражуМин = (СтоянкаПоГаражу - СтоянкаПоГаражуЧас) * 100;
		СтоянкаПоГаражу = СтоянкаПоГаражуЧас * 3600 + СтоянкаПоГаражуМин * 60;
		Структура_depot.Вставить("service_duration_s",  СтоянкаПоГаражу);
		Структура_depot.Вставить("flexible_start_time", НастройкиМаршрутизации.flexible_start_time);
	КонецЕсли;
    Структура_depot.Вставить("title", НастройкаАдресВыезда.Наименование);
	Структура_depot.Вставить("ref",   НастройкаАдресВыезда.Наименование); // Сноска с информацией о месте
	
	Структура_depot.Вставить("id", уатВнешнийМаршрутизаторСервер_уэ.СформироватьИдентификаторОбъекта(НастройкаАдресВыезда, СчДобавленныхОбъектов));
	СчДобавленныхОбъектов = СчДобавленныхОбъектов + 1;
	
	
	Возврат Структура_depot;
	
КонецФункции

Функция ЗаполнитьСтруктуруПараметровСервисаПланированияМаршрутов(ДатаПланирования, СтруктураНастроекАРМ,
	НастройкиМаршрутизации, ТаблицаГруппПунктов, ИспользуемыеГруппыСовместимости, МассивГеозон, РежимОптимизации = Ложь, РежимОптимизацииМаршрута = Ложь)
	
	ЧасовойПояс   = ?(РежимОптимизации, СтруктураНастроекАРМ.Оптимизация_НастройкаЧасовойПояс, СтруктураНастроекАРМ.НастройкаЧасовойПояс);
	
	Структура_options = Новый Структура(); 
	Структура_options.Вставить("time_zone", ЧасовойПояс);
	Если РежимОптимизацииМаршрута Тогда
		Возврат Структура_options;
	КонецЕсли;
	
	СжиматьЗаказы = ?(РежимОптимизации, СтруктураНастроекАРМ.Оптимизация_НастройкаСжиматьЗаказы, СтруктураНастроекАРМ.НастройкаСжиматьЗаказы);

	Структура_options.Вставить("routing_mode",                       НастройкиМаршрутизации.routing_mode);
	Структура_options.Вставить("weighted_drop_penalty",              НастройкиМаршрутизации.weighted_drop_penalty);
	Структура_options.Вставить("critical_lateness_risk_probability", НастройкиМаршрутизации.critical_lateness_risk_probability);
	Структура_options.Вставить("date",                               Формат(НачалоДня(ДатаПланирования), "ДФ=yyyy-MM-dd; ДП=0001-01-01"));
	Структура_options.Вставить("minimize_lateness_risk",             НастройкиМаршрутизации.minimize_lateness_risk);
	Структура_options.Вставить("restart_on_drop",                    НастройкиМаршрутизации.restart_on_drop);
	Структура_options.Вставить("merge_multiorders",                  СжиматьЗаказы);
	Структура_options.Вставить("proximity_factor",                   НастройкиМаршрутизации.proximity_factor);
	Структура_options.Вставить("global_proximity_factor",            НастройкиМаршрутизации.global_proximity_factor);
	Структура_options.Вставить("post_optimization",                  НастройкиМаршрутизации.post_optimization);
	Структура_options.Вставить("avoid_tolls",                        НастройкиМаршрутизации.avoid_tolls);
	
	Если РежимОптимизации Тогда 
		Если СтруктураНастроекАРМ.Оптимизация_НастройкаУчитыватьОкнаПоЗаказам Тогда
			Структура_options.Вставить("penalize_late_service", СтруктураНастроекАРМ.Оптимизация_НастройкаУчитыватьОкнаПоЗаказамНастройка = 1);
		КонецЕсли;
		Если СтруктураНастроекАРМ.НастройкаАлгоритмОптимизации = "RarusVRP" Тогда
			Если СтруктураНастроекАРМ.Оптимизация_НастройкаРежимОптимизации = 1 Тогда 
				Структура_options.Вставить("minimize", "distance");
				
			ИначеЕсли СтруктураНастроекАРМ.Оптимизация_НастройкаРежимОптимизации = 2 Тогда 
				Структура_options.Вставить("minimize", "cost");
				
			Иначе 
				Структура_options.Вставить("minimize", "time");
			КонецЕсли;
			Если ЗначениеЗаполнено(СтруктураНастроекАРМ.Оптимизация_НастройкаКоличествоДнейМаршрутизации) Тогда
				Структура_options.Вставить("maximum_time_days", СтруктураНастроекАРМ.Оптимизация_НастройкаКоличествоДнейМаршрутизации);
			КонецЕсли;
		Иначе
			Если ЗначениеЗаполнено(НастройкиМаршрутизации.default_speed_km_h) Тогда
				Структура_options.Вставить("default_speed_km_h", НастройкиМаршрутизации.default_speed_km_h);
			КонецЕсли;
			Структура_options.Вставить("minimize", "cost");
		КонецЕсли; 
	Иначе 
		Если СтруктураНастроекАРМ.НастройкаУчитыватьОкнаПоЗаказамПриМаршрутизации Тогда
			Структура_options.Вставить("penalize_late_service", СтруктураНастроекАРМ.НастройкаУчитыватьОкнаПоЗаказамПриМаршрутизацииНастройка = 1);
		КонецЕсли;
		Если СтруктураНастроекАРМ.НастройкаАлгоритмМаршрутизации = 4 Тогда
			Если СтруктураНастроекАРМ.НастройкаРежимОптимизации = 1 Тогда 
				Структура_options.Вставить("minimize", "distance");
				
			ИначеЕсли СтруктураНастроекАРМ.НастройкаРежимОптимизации = 2 Тогда 
				Структура_options.Вставить("minimize", "cost");
				
			Иначе 
				Структура_options.Вставить("minimize", "time");
			КонецЕсли;
			Если ЗначениеЗаполнено(СтруктураНастроекАРМ.НастройкаКоличествоДнейМаршрутизации) Тогда
				Структура_options.Вставить("maximum_time_days", СтруктураНастроекАРМ.НастройкаКоличествоДнейМаршрутизации);
			КонецЕсли;
		Иначе
			Если ЗначениеЗаполнено(НастройкиМаршрутизации.default_speed_km_h) Тогда
				Структура_options.Вставить("default_speed_km_h", НастройкиМаршрутизации.default_speed_km_h);
			КонецЕсли;
			Структура_options.Вставить("minimize", "cost");
		КонецЕсли;
	КонецЕсли;
	
	Если НастройкиМаршрутизации.quality = "manual" Тогда 
		Структура_options.Вставить("solver_time_limit_s", НастройкиМаршрутизации.solver_time_limit);
		Структура_options.Вставить("thread_count",        НастройкиМаршрутизации.thread_count);
	Иначе 
		Структура_options.Вставить("quality", НастройкиМаршрутизации.quality);
	КонецЕсли;
	
	Если СтруктураНастроекАРМ.НастройкаУчитыватьГруппыСовместимости Тогда
		НесовместимыеГруппы = уатВнешнийМаршрутизаторСервер_уэ.ПолучитьНесовместимыеГруппы(СтруктураНастроекАРМ.НастройкаУчитыватьГруппыСовместимости,
			НастройкиМаршрутизации, ИспользуемыеГруппыСовместимости);
		Структура_options.Вставить("incompatible_load_types", НесовместимыеГруппы);
	КонецЕсли;
	
	ТипАвторизации = уатЭлектронныеКартыСервер.ПолучитьНастройкуСервераКартографииМаршрутизации("Маршрутизация_ТипАвторизации");
	Если ТипАвторизации = "OAuth-токен" Тогда
		Если СтруктураНастроекАРМ.НастройкаУчетГеозон Тогда
			ТаблицаНесовместимыхГеозон = НастройкиМаршрутизации.ТаблицаНесовместимыхГеозон;
			
			НесовместимыеГеозоны = Новый Массив();
			Для Каждого ТекЭлемент Из ТаблицаНесовместимыхГеозон Цикл
				ТекНесовместимыеГеозоны = Новый Массив();
				Для Каждого ТекЗона Из ТекЭлемент Цикл
					Если СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(ТекЗона) Тогда 
						Геозона = Справочники.уатГеозоны_уэ.ПолучитьСсылку(Новый УникальныйИдентификатор(ТекЗона));
						Если ЗначениеЗаполнено(Геозона.НомерЯндекс) Тогда 
							ТекЗона = Геозона.НомерЯндекс; 
							Если МассивГеозон.Найти(ТекЗона) = Неопределено Тогда
								МассивГеозон.Добавить(ТекЗона);
							КонецЕсли;
						Иначе 
							Если МассивГеозон.Найти(Геозона) = Неопределено Тогда
								МассивГеозон.Добавить(Геозона);
							КонецЕсли; 
						КонецЕсли;
					Иначе
						Если МассивГеозон.Найти(ТекЗона) = Неопределено Тогда
							МассивГеозон.Добавить(ТекЗона);
						КонецЕсли;
					КонецЕсли;
					ТекНесовместимыеГеозоны.Добавить(ТекЗона);
				КонецЦикла; 
				Если ТекНесовместимыеГеозоны.Количество() Тогда 
					НесовместимыеГеозоны.Добавить(ТекНесовместимыеГеозоны);
				КонецЕсли;
			КонецЦикла;
			Структура_options.Вставить("incompatible_zones", НесовместимыеГеозоны);
		Иначе 
			Если НЕ СтруктураНастроекАРМ.НастройкаИспользоватьЗакреплениеТСЗаказовНаТСзаГеозонами Тогда
				Структура_options.Вставить("ignore_zones", Истина);
			КонецЕсли;
		КонецЕсли;  
	КонецЕсли;
	
	Если ТаблицаГруппПунктов.Количество() <> 0 Тогда
		МассивГруппПунктов = Новый Массив();
		Для Каждого ТекГруппа Из ТаблицаГруппПунктов Цикл
			Если ТекГруппа.Значение.Количество() > 1 Тогда
				МассивГруппПунктов.Добавить(Новый Структура("title, location_ids, solid, dependent", ТекГруппа.Заголовок,
				ТекГруппа.Значение, ТекГруппа.Неразрывная, ТекГруппа.Неделимая));
			КонецЕсли;
		КонецЦикла;
		Если МассивГруппПунктов.Количество() <> 0 Тогда
			Структура_options.Вставить("location_groups", МассивГруппПунктов);
		КонецЕсли;
	КонецЕсли;

	Если ЗначениеЗаполнено(НастройкиМаршрутизации.multiordersPenalty_per_extra_visit) Тогда
		Структура_penalty_multiorders = Новый Структура("per_extra_visit",
		НастройкиМаршрутизации.multiordersPenalty_per_extra_visit);  
		Структура_penalty = Новый Структура("multiorders", Структура_penalty_multiorders);
		Структура_options.Вставить("penalty", Структура_penalty);
	КонецЕсли;
	
	Возврат Структура_options;

КонецФункции

Функция ЗаполнитьСписокПунктовНазначение(ДатаПланирования, ТаблицаЗаказов, СтруктураНастроекАРМ,
	НастройкиМаршрутизации, Таблицаlocation, ТаблицаГруппПунктов, флагСдвигДаты, СчДобавленныхОбъектов, тблАдреса,
	СоответствиеГеозон, СоответвиеЗаказов, РазрешенныеТСПоЗаказам, ИспользуемыеГруппыСовместимости, РежимОптимизации = Ложь)
	
	Если РежимОптимизации Тогда
		флRarusVRP = СтруктураНастроекАРМ.НастройкаАлгоритмОптимизации = "RarusVRP";
	Иначе
		флRarusVRP = СтруктураНастроекАРМ.НастройкаАлгоритмМаршрутизации = 4;
	КонецЕсли;
	
	Массив_locations = Новый Массив();
	
	// Заполняем пункты доставки (delivery_to_any)
	Если флRarusVRP Тогда
		ИдентификаторыПунктовДоставки = Новый Массив; 
		ФлагПунктыВыдачи = Ложь;
	Иначе
		ИдентификаторыПунктовДоставки = ЗаполнитьПунктыДоставки(Массив_locations, СтруктураНастроекАРМ, НастройкиМаршрутизации, СчДобавленныхОбъектов, РежимОптимизации);
		ФлагПунктыВыдачи = ИдентификаторыПунктовДоставки.Количество() <> 0;
	КонецЕсли;

	СоответствиеГруппПунктов = Новый Соответствие();
	ТаблицаГруппПунктов      = уатВнешнийМаршрутизаторСервер_уэ.ПолучитьГруппыПунктов(СтруктураНастроекАРМ.НастройкаГруппироватьПунктыВОднуМашину, НастройкиМаршрутизации, СоответствиеГруппПунктов, РежимОптимизации);
	
	СоответвиеУчтеныхГрупп = Новый Соответствие();
	Для Каждого ТекЗаказ Из ТаблицаЗаказов Цикл
		
		// Если заполнен параметр delivery_to_any, пункты назначения заказа не учитываем
		// В этом случает требуется указать пункт отправления и заполнить delivery_to_any
		//
		Если НЕ ФлагПунктыВыдачи Тогда
			Структура_location   = ЗаполнитьСтруктуруПунктаНазначенияDelivery(ДатаПланирования, ТекЗаказ, СтруктураНастроекАРМ,
				НастройкиМаршрутизации, Таблицаlocation, флагСдвигДаты, СчДобавленныхОбъектов, тблАдреса, СоответствиеГеозон, 
				РазрешенныеТСПоЗаказам, ИспользуемыеГруппыСовместимости, РежимОптимизации);
				
			ТекГруппаПунктов = СоответствиеГруппПунктов.Получить(ТекЗаказ.АдресНазначения);

			Если ТекГруппаПунктов <> Неопределено Тогда
				СтрокиГруппы = ТаблицаГруппПунктов.НайтиСтроки(Новый Структура("Заголовок", ТекГруппаПунктов));
				Если СтрокиГруппы.Количество() <> 0 Тогда
					Если НЕ РежимОптимизации
						И ЗначениеЗаполнено(ТекЗаказ.location_group)
						И СтрокиГруппы[0].Значение.Количество() <> 0 Тогда
						
						// Доставка грузов неразрывно, время уже учли
						Структура_location.shared_service_duration_s = 0;
						Структура_location.service_duration_s        = 0;
					КонецЕсли;    
					
					ЭлементыГруппы = СтрокиГруппы[0].Значение;
					ЭлементыГруппы.Добавить(Структура_location.id);
					СтрокиГруппы[0].Значение = ЭлементыГруппы;
					
				КонецЕсли; 
			ИначеЕсли НЕ РежимОптимизации
				И ЗначениеЗаполнено(ТекЗаказ.location_group) Тогда
				СтрокиГруппы = ТаблицаГруппПунктов.НайтиСтроки(Новый Структура("Заголовок", ТекЗаказ.location_group));
				Если СтрокиГруппы.Количество() <> 0 Тогда
					ЭлементыГруппы = СтрокиГруппы[0].Значение;
					ЭлементыГруппы.Добавить(Структура_location.id);
					СтрокиГруппы[0].Значение    = ЭлементыГруппы; 
					
					// Доставка грузов неразрывно, время уже учли
					Структура_location.shared_service_duration_s = 0;
					Структура_location.service_duration_s        = 0;
				Иначе   
					ЭлементыГруппы = Новый Массив();
					ЭлементыГруппы.Добавить(Структура_location.id);
					
					НоваяГруппа = ТаблицаГруппПунктов.Добавить(); 
					НоваяГруппа.Заголовок   = ТекЗаказ.location_group;
					НоваяГруппа.Неразрывная = Истина;
					НоваяГруппа.Неделимая   = Истина;
					
					НоваяГруппа.Значение  = ЭлементыГруппы;
				КонецЕсли;     
			КонецЕсли;
			
			СоответвиеЗаказов.Вставить(ТекЗаказ.GUID,
				Структура_location.id);
			
			Массив_locations.Добавить(Структура_location);
			
			СчДобавленныхОбъектов = СчДобавленныхОбъектов + 1;
		КонецЕсли;
		
		// Если адрес отправления заказа не является складом,
		// должны указать этот пункт и заполнить delivery_to с id адреса прибытия по этому заказу.
		// Параментр delivery_to и delivery_to_any являются взамиисключающими.
		// Заполняем депо.
		Если СтруктураНастроекАРМ.НастройкаАдресВыезда <> ТекЗаказ.АдресОтправления
			ИЛИ ФлагПунктыВыдачи 
			ИЛИ флRarusVRP Тогда
			
			Если НЕ РежимОптимизации
				И СтруктураНастроекАРМ.НастройкаУчетЖесткихГабаритовГруза Тогда
				ТипГабаритов = ?(ЗначениеЗаполнено(СтруктураНастроекАРМ.НастройкаУчетЖесткихГабаритовГрузаНастройка), 
							СтруктураНастроекАРМ.НастройкаУчетЖесткихГабаритовГрузаНастройка, "rigid");
				Если ТипЗнч(ТекЗаказ.Груз) = Тип("СправочникСсылка.Номенклатура") Тогда
					ХарактеристикиНоменклатуры = уатОбщегоНазначения.ПолучитьВесОбъемНоменклатуры(ТекЗаказ.Груз, ТекЗаказ.Груз.ЕдиницаХраненияОстатков, ТекЗаказ.Количество);
					ПолезныйРазмерГлубина             = ХарактеристикиНоменклатуры.Длина;
					ПолезныйРазмерШирина              = ХарактеристикиНоменклатуры.Ширина;
					ПолезныйРазмерВысота              = ХарактеристикиНоменклатуры.Высота;
				ИначеЕсли ТипЗнч(ТекЗаказ.Груз) = Тип("СправочникСсылка.уатГрузовыеМеста_уэ") Тогда
					ПолезныйРазмерГлубина   = ТекЗаказ.Длина;
					ПолезныйРазмерШирина    = ТекЗаказ.Ширина;
					ПолезныйРазмерВысота    = ТекЗаказ.Высота;
				Иначе
					ПолезныйРазмерГлубина   = ТекЗаказ.Объем;
					ПолезныйРазмерШирина    = 1;
					ПолезныйРазмерВысота    = 1;
					ТипГабаритов = "bulk";
				КонецЕсли;

			Иначе
				ПолезныйРазмерВысота     = 1;
				ПолезныйРазмерШирина     = 1;
				ПолезныйРазмерГлубина    = ТекЗаказ.Объем;
				ТипГабаритов = "bulk";
			КонецЕсли;

			Если НЕ РежимОптимизации
				И СтруктураНастроекАРМ.НастройкаУчитыватьМаксимальноеКоличествоГрузов Тогда
				units = ?(СтруктураНастроекАРМ.НастройкаМаксимальноеЧислоЗаказовМаршрута = 0, 0, 1);
			Иначе
				units = ТекЗаказ.КоличествоУпаковок;
			КонецЕсли;

			Структура_locationДепо = Новый Структура;
			Структура_locationДепо.Вставить("shipment_size", 
			Новый Структура("volume, units, weight_kg", 
			Новый Структура("height_m, width_m, depth_m, type", ПолезныйРазмерВысота, ПолезныйРазмерШирина, ПолезныйРазмерГлубина, ТипГабаритов),
			units,
			ТекЗаказ.ВесБрутто
			)
			);

			СтоянкаПогрузка = ТекЗаказ.СтоянкаПунктНазначения;
			СтоянкаПогрузкаЧас = Цел(СтоянкаПогрузка);
			СтоянкаПогрузкаМин = (СтоянкаПогрузка - СтоянкаПогрузкаЧас) * 100;
			СтоянкаПогрузка = СтоянкаПогрузкаЧас * 3600 + СтоянкаПогрузкаМин * 60;
			Структура_locationДепо.Вставить("depot_duration_s", СтоянкаПогрузка);
			
			СтоянкаРазгрузка = ТекЗаказ.СтоянкаПунктОтправления;
			СтоянкаРазгрузкаЧас = Цел(СтоянкаРазгрузка);
			СтоянкаРазгрузкаМин = (СтоянкаРазгрузка - СтоянкаРазгрузкаЧас) * 100;
			СтоянкаРазгрузка = СтоянкаРазгрузкаЧас * 3600 + СтоянкаРазгрузкаМин * 60;
			Структура_locationДепо.Вставить("service_duration_s", СтоянкаРазгрузка);
				
			Если ФлагПунктыВыдачи Тогда
				Если флRarusVRP Тогда
					СекундВДне = 86400;
					Структура_locationДепо.Вставить("Time_window_start", 0);
					Структура_locationДепо.Вставить("Time_window_end", СекундВДне-1);
				Иначе
					Структура_locationДепо.Вставить("time_window", "0.00:00:00-23:59:59");
				КонецЕсли;
				Структура_locationДепо.Вставить("hard_window", Ложь);
				
				Если СтруктураНастроекАРМ.НастройкаАдресВыезда <> ТекЗаказ.АдресОтправления Тогда
					ДопСтоянкаРазгрузка = ТекЗаказ.ДопСтоянкаПунктОтправления;
					ДопСтоянкаРазгрузкаЧас = Цел(ДопСтоянкаРазгрузка);
					ДопСтоянкаРазгрузкаМин = (ДопСтоянкаРазгрузка - ДопСтоянкаРазгрузкаЧас) * 100;
					ДопСтоянкаРазгрузка = ДопСтоянкаРазгрузкаЧас * 3600 + ДопСтоянкаРазгрузкаМин * 60;
					Структура_locationДепо.Вставить("shared_service_duration_s", ДопСтоянкаРазгрузка);
				КонецЕсли;

			Иначе

				ДопСтоянкаРазгрузка		 = ТекЗаказ.ДопСтоянкаПунктОтправления;
				ДопСтоянкаРазгрузкаЧас	 = Цел(ДопСтоянкаРазгрузка);
				ДопСтоянкаРазгрузкаМин	 = (ДопСтоянкаРазгрузка - ДопСтоянкаРазгрузкаЧас) * 100;
				ДопСтоянкаРазгрузка		 = ДопСтоянкаРазгрузкаЧас * 3600 + ДопСтоянкаРазгрузкаМин * 60;
				Структура_locationДепо.Вставить("shared_service_duration_s", ДопСтоянкаРазгрузка);

				ТекОкноС  = ТекЗаказ.ОтправлениеС;
				ТекОкноПо = ?(ТекЗаказ.ОтправлениеПо = '00010101000000', '00010101235959', ТекЗаказ.ОтправлениеПо);
				
				ТекОкноС  = ТекОкноС  - НачалоДня(ТекОкноС);
				ТекОкноПо = ТекОкноПо - НачалоДня(ТекОкноПо); 
				ТекОкноС  = ?(РежимОптимизации, НачалоДня(ДатаПланирования), НачалоДня(ТекЗаказ.ОтправлениеСДата))  + ТекОкноС;
				ТекОкноПо = ?(РежимОптимизации, НачалоДня(ДатаПланирования), НачалоДня(ТекЗаказ.ОтправлениеПоДата)) + ТекОкноПо;
	 				
				Если флRarusVRP Тогда
					Структура_locationДепо.Вставить("Time_window_start", ТекОкноС - НачалоДня(ДатаПланирования));
					Структура_locationДепо.Вставить("Time_window_end",   ТекОкноПо - НачалоДня(ДатаПланирования));
				Иначе    
					Если НЕ РежимОптимизации
						И СтруктураНастроекАРМ.НастройкаВременноеОкноДействуетЕжедневно Тогда
						МассивДатПланирования = уатВнешнийМаршрутизаторСервер_уэ.ПолучитьМассивДатПланирования(ТекОкноС, ТекОкноПо);
						
						МассивОкон   = Новый Массив(); 
						ВвремяНачала    = ТекОкноС  - НачалоДня(ТекОкноС);
						ВвремяОкончания = ТекОкноПо - НачалоДня(ТекОкноПо);
						
						Для Каждого ТекДата Из МассивДатПланирования Цикл 
							МассивОкон.Добавить(Новый Структура("time_window", 
							"" + Формат(НачалоДня(ТекДата) + ВвремяНачала, "ДФ=гггг-ММ-ддTЧЧ:мм:сс" + ?(СтруктураНастроекАРМ.НастройкаЧасовойПояс>=0, "+", "") + Формат(СтруктураНастроекАРМ.НастройкаЧасовойПояс, "ЧЦ=2; ЧВН=") + ":00") + "/" +
							Формат(НачалоДня(ТекДата) + ВвремяОкончания, "ДФ=гггг-ММ-ддTЧЧ:мм:сс" + ?(СтруктураНастроекАРМ.НастройкаЧасовойПояс>=0, "+", "") + Формат(СтруктураНастроекАРМ.НастройкаЧасовойПояс, "ЧЦ=2; ЧВН=") + ":00")
							));
						КонецЦикла;
						Структура_locationДепо.Вставить("time_windows", МассивОкон);
					Иначе   
						НастройкаЧасовойПояс = ?(РежимОптимизации, СтруктураНастроекАРМ.Оптимизация_НастройкаЧасовойПояс, СтруктураНастроекАРМ.НастройкаЧасовойПояс);
						
						Структура_locationДепо.Вставить(
						"time_window", 
						"" + Формат(ТекОкноС, "ДФ=гггг-ММ-ддTЧЧ:мм:сс" + ?(НастройкаЧасовойПояс>=0, "+", "") + Формат(НастройкаЧасовойПояс, "ЧЦ=2; ЧВН=") + ":00") + "/" +
						Формат(ТекОкноПо, "ДФ=гггг-ММ-ддTЧЧ:мм:сс" + ?(НастройкаЧасовойПояс>=0, "+", "") + Формат(НастройкаЧасовойПояс, "ЧЦ=2; ЧВН=") + ":00")
						);
					КонецЕсли;
				КонецЕсли;
				
				Структура_locationДепо.Вставить("hard_window",  СтруктураНастроекАРМ.НастройкаУчитыватьОкнаПоЗаказамПриМаршрутизации);
				
				ЕстьШтрафы = Ложь;
				СтруктураШтрафов = Новый Структура();
				Если ЗначениеЗаполнено(НастройкиМаршрутизации.locationsPenalty_outOfTime_fixed)
					ИЛИ ЗначениеЗаполнено(НастройкиМаршрутизации.locationsPenalty_outOfTime_minute) Тогда
					out_of_time = Новый Структура();
					Если ЗначениеЗаполнено(НастройкиМаршрутизации.locationsPenalty_outOfTime_fixed) Тогда
						out_of_time.Вставить("fixed", НастройкиМаршрутизации.locationsPenalty_outOfTime_fixed);
					КонецЕсли;
					Если ЗначениеЗаполнено(НастройкиМаршрутизации.locationsPenalty_outOfTime_minute) Тогда
						out_of_time.Вставить("minute", НастройкиМаршрутизации.locationsPenalty_outOfTime_minute);
					КонецЕсли;
					СтруктураШтрафов.Вставить("out_of_time", out_of_time);
					ЕстьШтрафы = Истина;
				КонецЕсли;
				Если ЗначениеЗаполнено(НастройкиМаршрутизации.locationsPenalty_early_fixed)
					ИЛИ ЗначениеЗаполнено(НастройкиМаршрутизации.locationsPenalty_early_minute) Тогда
					early = Новый Структура();
					Если ЗначениеЗаполнено(НастройкиМаршрутизации.locationsPenalty_early_fixed) Тогда
						early.Вставить("fixed", НастройкиМаршрутизации.locationsPenalty_early_fixed);
					КонецЕсли;
					Если ЗначениеЗаполнено(НастройкиМаршрутизации.locationsPenalty_early_minute) Тогда
						early.Вставить("minute", НастройкиМаршрутизации.locationsPenalty_early_minute);
					КонецЕсли;
					СтруктураШтрафов.Вставить("early", early);
					ЕстьШтрафы = Истина;
				КонецЕсли;
				Если ЗначениеЗаполнено(НастройкиМаршрутизации.locationsPenalty_late_fixed)
					ИЛИ ЗначениеЗаполнено(НастройкиМаршрутизации.locationsPenalty_late_minute) Тогда
					late = Новый Структура();
					Если ЗначениеЗаполнено(НастройкиМаршрутизации.locationsPenalty_late_fixed) Тогда
						late.Вставить("fixed", НастройкиМаршрутизации.locationsPenalty_late_fixed);
					КонецЕсли;
					Если ЗначениеЗаполнено(НастройкиМаршрутизации.locationsPenalty_late_minute) Тогда
						late.Вставить("minute", НастройкиМаршрутизации.locationsPenalty_late_minute);
					КонецЕсли;
					СтруктураШтрафов.Вставить("late", late);
					ЕстьШтрафы = Истина;
				КонецЕсли;
				Если ЗначениеЗаполнено(НастройкиМаршрутизации.locationsPenalty_drop) Тогда
					drop = Новый Структура();
					Если ЗначениеЗаполнено(НастройкиМаршрутизации.locationsPenalty_drop) Тогда
						drop.Вставить("fixed", НастройкиМаршрутизации.locationsPenalty_drop);
					КонецЕсли;
					СтруктураШтрафов.Вставить("drop", НастройкиМаршрутизации.locationsPenalty_drop);
					ЕстьШтрафы = Истина;
				КонецЕсли;
				Если ЕстьШтрафы Тогда
					Структура_locationДепо.Вставить("penalty", СтруктураШтрафов);
				КонецЕсли;
				
				Если НЕ РежимОптимизации Тогда
					Если флRarusVRP Тогда
						// Для алгоритма Рарус VRP заполняются идентификаторы разрешенных ТС
						РазрешенныеТС = РазрешенныеТСПоЗаказам[ТекЗаказ.Ссылка];
						Если РазрешенныеТС <> Неопределено Тогда
							Структура_locationДепо.Вставить("AllowedVehicles", Новый Массив);
							Для Каждого ТС Из РазрешенныеТС Цикл
								Структура_locationДепо.AllowedVehicles.Добавить(ТС.GUID);
							КонецЦикла;
						КонецЕсли;
					Иначе
						// Теги используются только для Яндекса
						Структура_locationДепо.Вставить("required_tags", Новый Массив());
						
						Если СтруктураНастроекАРМ.НастройкаИспользоватьХарактеристикиЗаказовНаТС Тогда 
							Для Каждого СтрокаХарактеристики Из ТекЗаказ.Ссылка.Характеристики Цикл 
								Структура_locationДепо.required_tags.Добавить(Строка(СтрокаХарактеристики.Характеристика.УникальныйИдентификатор()));
							КонецЦикла;
						КонецЕсли;
						
						Если СтруктураНастроекАРМ.НастройкаИспользоватьЗакреплениеТСЗаказовНаТСзаГеозонами
							И НЕ СтруктураНастроекАРМ.ТипАвторизации = "OAuth-токен" Тогда
							Если СтруктураНастроекАРМ.НастройкаПривязкаКГеозоне = 0 Тогда
								Пункт = ТекЗаказ.АдресОтправления;
							Иначе
								Пункт = ТекЗаказ.АдресНазначения;
							КонецЕсли;
							мсвГеозон = СоответствиеГеозон.Получить(Пункт);
							Если мсвГеозон <> Неопределено Тогда
								Для Каждого СтрокаХарактеристики Из мсвГеозон Цикл 
									Структура_locationДепо.required_tags.Добавить(СтрокаХарактеристики);
								КонецЦикла;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
				ДопСтоянкаРазгрузка = ТекЗаказ.ДопСтоянкаПунктОтправления;
				ДопСтоянкаРазгрузкаЧас = Цел(ДопСтоянкаРазгрузка);
				ДопСтоянкаРазгрузкаМин = (ДопСтоянкаРазгрузка - ДопСтоянкаРазгрузкаЧас) * 100;
				ДопСтоянкаРазгрузка = ДопСтоянкаРазгрузкаЧас * 3600 + ДопСтоянкаРазгрузкаМин * 60;
				Структура_locationДепо.Вставить("shared_service_duration_s", ДопСтоянкаРазгрузка);

			КонецЕсли;
			
			Если НЕ РежимОптимизации
				И ЗначениеЗаполнено(ТекЗаказ.location_group) Тогда 
				Если СоответвиеУчтеныхГрупп.Получить(ТекЗаказ.location_group) <> Неопределено Тогда
					Структура_locationДепо.shared_service_duration_s = 0;
					Структура_locationДепо.service_duration_s        = 0;
				Иначе
					СоответвиеУчтеныхГрупп.Вставить(ТекЗаказ.location_group, ТекЗаказ.location_group);
				КонецЕсли;
			КонецЕсли;
			
			Структура_locationДепо.Вставить("point", Новый Структура("lat, lon", ТекЗаказ.ЛатОтпр, ТекЗаказ.ЛонОтпр));
			Если флRarusVRP Тогда
				НайденнаяСтрока = тблАдреса.Найти(ТекЗаказ.АдресОтправления, "Адрес");
				Если НайденнаяСтрока = Неопределено Тогда
					Структура_locationДепо.Вставить("point_number", 0);
				Иначе
					Структура_locationДепо.Вставить("point_number", НайденнаяСтрока.НомерСтроки);
				КонецЕсли;
			КонецЕсли;      
			Структура_locationДепо.Вставить("sequence_order", ТекЗаказ.Приоритет);  
			
			Если ЗначениеЗаполнено(ТекЗаказ.Ссылка) Тогда
				Структура_locationДепо.Вставить("description",  Строка(ТекЗаказ.АдресОтправления));
				
				Если ЗначениеЗаполнено(ТекЗаказ.Ссылка.Грузоотправитель) Тогда
					Структура_locationДепо.Вставить("title", "Грузоотправитель: " + ТекЗаказ.Ссылка.Грузоотправитель);
				ИначеЕсли ЗначениеЗаполнено(ТекЗаказ.Ссылка.Контрагент) Тогда 
					Структура_locationДепо.Вставить("title", "Контрагент: " + ТекЗаказ.Ссылка.Контрагент);
				КонецЕсли;
			Конецесли;
			Структура_locationДепо.Вставить("ref",      Строка(ТекЗаказ.GUID)); 
			Если ЗначениеЗаполнено(ТекЗаказ.Ссылка) Тогда
				Структура_locationДепо.Вставить("comments", ТекЗаказ.Ссылка.КомментарийВодителю);
			КонецЕсли;
			Структура_locationДепо.Вставить("id",       уатВнешнийМаршрутизаторСервер_уэ.СформироватьИдентификаторОбъекта(ТекЗаказ.АдресОтправления, СчДобавленныхОбъектов));
			Структура_locationДепо.Вставить("type",     "pickup");

			Если ФлагПунктыВыдачи Тогда
				Структура_locationДепо.Вставить("delivery_to_any",  ИдентификаторыПунктовДоставки);
				
				СоответвиеЗаказов.Вставить(ТекЗаказ.GUID,
				ИдентификаторыПунктовДоставки);
			Иначе
				// Заполняем идентификатор следующего пункта по маршруту
				Структура_locationДепо.Вставить("delivery_to",  Структура_location.id);
				
				СоответвиеЗаказов.Вставить(ТекЗаказ.GUID,
				Структура_location.id);
			КонецЕсли;
			
			Массив_locations.Добавить(Структура_locationДепо);
			
			СчДобавленныхОбъектов = СчДобавленныхОбъектов + 1;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Массив_locations;
	
КонецФункции

Функция ЗаполнитьСтруктуруПунктаНазначенияDelivery(ДатаПланирования, ТекЗаказ, СтруктураНастроекАРМ, НастройкиМаршрутизации,
	Таблицаlocation, флагСдвигДаты, СчДобавленныхОбъектов, тблАдреса, СоответствиеГеозон, РазрешенныеТСПоЗаказам, 
	ИспользуемыеГруппыСовместимости, РежимОптимизации = Ложь)
	
	Если РежимОптимизации Тогда
		флRarusVRP = СтруктураНастроекАРМ.НастройкаАлгоритмОптимизации = "RarusVRP";
	Иначе
		флRarusVRP = СтруктураНастроекАРМ.НастройкаАлгоритмМаршрутизации = 4;
	КонецЕсли;

	НастройкаЧасовойПояс = ?(РежимОптимизации, СтруктураНастроекАРМ.Оптимизация_НастройкаЧасовойПояс, СтруктураНастроекАРМ.НастройкаЧасовойПояс);
	
	Структура_location = Новый Структура();
	
	ТекОкноС  = ТекЗаказ.ДоставкаС;
	ТекОкноПо = ?(ТекЗаказ.ДоставкаПо = '00010101000000', '00010101235959', ТекЗаказ.ДоставкаПо);
	
	ТекОкноС  = ТекОкноС  - НачалоДня(ТекОкноС);
	ТекОкноПо = ТекОкноПо - НачалоДня(ТекОкноПо);
	ТекОкноС  = ?(РежимОптимизации, НачалоДня(ДатаПланирования), НачалоДня(ТекЗаказ.ДоставкаСДата))  + ТекОкноС;
	ТекОкноПо = ?(РежимОптимизации, НачалоДня(ДатаПланирования), НачалоДня(ТекЗаказ.ДоставкаПоДата)) + ТекОкноПо;
	
	Если флRarusVRP Тогда
		Структура_location.Вставить("Time_window_start", ТекОкноС - НачалоДня(ДатаПланирования));
		Структура_location.Вставить("Time_window_end",   ТекОкноПо - НачалоДня(ДатаПланирования));
	Иначе  
		Если НЕ РежимОптимизации
			И СтруктураНастроекАРМ.НастройкаВременноеОкноДействуетЕжедневно Тогда  
			МассивДатПланирования = уатВнешнийМаршрутизаторСервер_уэ.ПолучитьМассивДатПланирования(ТекОкноС, ТекОкноПо);
			
			МассивОкон   = Новый Массив(); 
			ВвремяНачала    = ТекОкноС  - НачалоДня(ТекОкноС);
			ВвремяОкончания = ТекОкноПо - НачалоДня(ТекОкноПо);

			Для Каждого ТекДата Из МассивДатПланирования Цикл 
				МассивОкон.Добавить(Новый Структура("time_window", 
				"" + Формат(НачалоДня(ТекДата) + ВвремяНачала, "ДФ=гггг-ММ-ддTЧЧ:мм:сс" + ?(НастройкаЧасовойПояс>=0, "+", "") + Формат(НастройкаЧасовойПояс, "ЧЦ=2; ЧВН=") + ":00") + "/" +
				Формат(НачалоДня(ТекДата) + ВвремяОкончания, "ДФ=гггг-ММ-ддTЧЧ:мм:сс" + ?(НастройкаЧасовойПояс>=0, "+", "") + Формат(НастройкаЧасовойПояс, "ЧЦ=2; ЧВН=") + ":00")
				));
			КонецЦикла;
			Структура_location.Вставить("time_windows", МассивОкон);
		Иначе
			Структура_location.Вставить(
			"time_window", 
			"" + Формат(ТекОкноС, "ДФ=гггг-ММ-ддTЧЧ:мм:сс" + ?(НастройкаЧасовойПояс>=0, "+", "") + Формат(НастройкаЧасовойПояс, "ЧЦ=2; ЧВН=") + ":00") + "/" +
			Формат(ТекОкноПо, "ДФ=гггг-ММ-ддTЧЧ:мм:сс" + ?(НастройкаЧасовойПояс>=0, "+", "") + Формат(НастройкаЧасовойПояс, "ЧЦ=2; ЧВН=") + ":00")
			);
		КонецЕсли;
	КонецЕсли;
	
	Структура_location.Вставить("hard_window", СтруктураНастроекАРМ.НастройкаУчитыватьОкнаПоЗаказамПриМаршрутизации);
	
	Структура_location.Вставить("point", Новый Структура("lat, lon", ТекЗаказ.ЛатНазн, ТекЗаказ.ЛонНазн));
	
	Если флRarusVRP Тогда
		НайденнаяСтрока = тблАдреса.Найти(ТекЗаказ.АдресНазначения, "Адрес");
		Если НайденнаяСтрока = Неопределено Тогда
			Структура_location.Вставить("point_number", 0);
		Иначе
			Структура_location.Вставить("point_number", НайденнаяСтрока.НомерСтроки);
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ РежимОптимизации
		И СтруктураНастроекАРМ.НастройкаУчетЖесткихГабаритовГруза Тогда
		ТипГабаритов = ?(ЗначениеЗаполнено(СтруктураНастроекАРМ.НастройкаУчетЖесткихГабаритовГрузаНастройка), 
			СтруктураНастроекАРМ.НастройкаУчетЖесткихГабаритовГрузаНастройка, "rigid");
		Если ТипЗнч(ТекЗаказ.Груз) = Тип("СправочникСсылка.Номенклатура") Тогда
			ХарактеристикиНоменклатуры = уатОбщегоНазначения.ПолучитьВесОбъемНоменклатуры(ТекЗаказ.Груз, ТекЗаказ.Груз.ЕдиницаХраненияОстатков, ТекЗаказ.Количество);
			ПолезныйРазмерВысота            = ХарактеристикиНоменклатуры.Высота;
			ПолезныйРазмерШирина            = ХарактеристикиНоменклатуры.Ширина;
			ПолезныйРазмерГлубина           = ХарактеристикиНоменклатуры.Длина;
		ИначеЕсли ТипЗнч(ТекЗаказ.Груз) = Тип("СправочникСсылка.уатГрузовыеМеста_уэ") Тогда
			ПолезныйРазмерВысота   = ТекЗаказ.Высота;
			ПолезныйРазмерШирина   = ТекЗаказ.Ширина;
			ПолезныйРазмерГлубина  = ТекЗаказ.Длина;
		Иначе
			ПолезныйРазмерВысота   = 1;
			ПолезныйРазмерШирина   = 1;
			ПолезныйРазмерГлубина  = ТекЗаказ.Объем;
			ТипГабаритов = "bulk";
		КонецЕсли;

	Иначе
		ПолезныйРазмерВысота  = 1;
		ПолезныйРазмерШирина  = 1;
		ПолезныйРазмерГлубина = ТекЗаказ.Объем;
		ТипГабаритов = "bulk";
	КонецЕсли;
	
	Если СтруктураНастроекАРМ.НастройкаУчитыватьМаксимальноеКоличествоГрузов = Неопределено Тогда
		 СтруктураНастроекАРМ.НастройкаУчитыватьМаксимальноеКоличествоГрузов = Истина;
	 КонецЕсли;
	 
	Если НЕ РежимОптимизации
		И СтруктураНастроекАРМ.НастройкаУчитыватьМаксимальноеКоличествоГрузов Тогда
		units = ?(СтруктураНастроекАРМ.НастройкаМаксимальноеЧислоЗаказовМаршрута = 0, 0, 1);
	Иначе
		units = ТекЗаказ.КоличествоУпаковок;
	КонецЕсли;

	Структура_location.Вставить("shipment_size", 
	Новый Структура("volume, units, weight_kg", 
	Новый Структура("height_m, width_m, depth_m, type", ПолезныйРазмерВысота, ПолезныйРазмерШирина, ПолезныйРазмерГлубина, ТипГабаритов),
	units,
	ТекЗаказ.ВесБрутто
	)
	); 

	ЕстьШтрафы = Ложь;
	СтруктураШтрафов = Новый Структура();
	Если ЗначениеЗаполнено(НастройкиМаршрутизации.locationsPenalty_outOfTime_fixed)
		ИЛИ ЗначениеЗаполнено(НастройкиМаршрутизации.locationsPenalty_outOfTime_minute) Тогда
		out_of_time = Новый Структура();
		Если ЗначениеЗаполнено(НастройкиМаршрутизации.locationsPenalty_outOfTime_fixed) Тогда
			out_of_time.Вставить("fixed", НастройкиМаршрутизации.locationsPenalty_outOfTime_fixed);
		КонецЕсли;
		Если ЗначениеЗаполнено(НастройкиМаршрутизации.locationsPenalty_outOfTime_minute) Тогда
			out_of_time.Вставить("minute", НастройкиМаршрутизации.locationsPenalty_outOfTime_minute);
		КонецЕсли;
		СтруктураШтрафов.Вставить("out_of_time", out_of_time);
		ЕстьШтрафы = Истина;
	КонецЕсли;
	Если ЗначениеЗаполнено(НастройкиМаршрутизации.locationsPenalty_early_fixed)
		ИЛИ ЗначениеЗаполнено(НастройкиМаршрутизации.locationsPenalty_early_minute) Тогда
		early = Новый Структура();
		Если ЗначениеЗаполнено(НастройкиМаршрутизации.locationsPenalty_early_fixed) Тогда
			early.Вставить("fixed", НастройкиМаршрутизации.locationsPenalty_early_fixed);
		КонецЕсли;
		Если ЗначениеЗаполнено(НастройкиМаршрутизации.locationsPenalty_early_minute) Тогда
			early.Вставить("minute", НастройкиМаршрутизации.locationsPenalty_early_minute);
		КонецЕсли;
		СтруктураШтрафов.Вставить("early", early);
		ЕстьШтрафы = Истина;
	КонецЕсли;
	Если ЗначениеЗаполнено(НастройкиМаршрутизации.locationsPenalty_late_fixed)
		ИЛИ ЗначениеЗаполнено(НастройкиМаршрутизации.locationsPenalty_late_minute) Тогда
		late = Новый Структура();
		Если ЗначениеЗаполнено(НастройкиМаршрутизации.locationsPenalty_late_fixed) Тогда
			late.Вставить("fixed", НастройкиМаршрутизации.locationsPenalty_late_fixed);
		КонецЕсли;
		Если ЗначениеЗаполнено(НастройкиМаршрутизации.locationsPenalty_late_minute) Тогда
			late.Вставить("minute", НастройкиМаршрутизации.locationsPenalty_late_minute);
		КонецЕсли;
		СтруктураШтрафов.Вставить("late", late);
		ЕстьШтрафы = Истина;
	КонецЕсли;
	Если ЗначениеЗаполнено(НастройкиМаршрутизации.locationsPenalty_drop) Тогда
		drop = Новый Структура();
		Если ЗначениеЗаполнено(НастройкиМаршрутизации.locationsPenalty_drop) Тогда
			drop.Вставить("fixed", НастройкиМаршрутизации.locationsPenalty_drop);
		КонецЕсли;
		СтруктураШтрафов.Вставить("drop", НастройкиМаршрутизации.locationsPenalty_drop);
		ЕстьШтрафы = Истина;
	КонецЕсли;
	Если ЕстьШтрафы Тогда
		Структура_location.Вставить("penalty", СтруктураШтрафов);
	КонецЕсли;
	
	Если НЕ РежимОптимизации Тогда
		Если флRarusVRP Тогда
			// Для алгоритма Рарус VRP заполняются идентификаторы разрешенных ТС
			РазрешенныеТС = РазрешенныеТСПоЗаказам[ТекЗаказ.Ссылка];
			Если РазрешенныеТС <> Неопределено Тогда
				Структура_location.Вставить("AllowedVehicles", Новый Массив);
				Для Каждого ТС Из РазрешенныеТС Цикл
					Структура_location.AllowedVehicles.Добавить(ТС.GUID);
				КонецЦикла;
			КонецЕсли;
		Иначе
			// Теги используются только для Яндекса
			Структура_location.Вставить("required_tags", Новый Массив());
			
			Если СтруктураНастроекАРМ.НастройкаИспользоватьХарактеристикиЗаказовНаТС Тогда 
				Для Каждого СтрокаХарактеристики Из ТекЗаказ.Ссылка.Характеристики Цикл 
					Структура_location.required_tags.Добавить(Строка(СтрокаХарактеристики.Характеристика.УникальныйИдентификатор()));
				КонецЦикла;
			КонецЕсли;
			
			Если СтруктураНастроекАРМ.НастройкаИспользоватьЗакреплениеТСЗаказовНаТСзаГеозонами 
				И НЕ СтруктураНастроекАРМ.ТипАвторизации = "OAuth-токен" Тогда 
				Если СтруктураНастроекАРМ.НастройкаПривязкаКГеозоне = 0 Тогда
					Пункт = ТекЗаказ.АдресОтправления;
				Иначе
					Пункт = ТекЗаказ.АдресНазначения;
				КонецЕсли;
				мсвГеозон = СоответствиеГеозон.Получить(Пункт);
				Если мсвГеозон <> Неопределено Тогда
					Для Каждого СтрокаХарактеристики Из мсвГеозон Цикл 
						Структура_location.required_tags.Добавить(СтрокаХарактеристики);
					КонецЦикла;
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;
		
		Если СтруктураНастроекАРМ.НастройкаУчитыватьГруппыСовместимости Тогда 
			load_types = Новый Массив();
			
			Если флRarusVRP И ТекЗаказ.Ссылка.ГруппыСовместимости.Количество() > 0 Тогда
				// Для маршрутизации Рарус VRP учитывается только одна (первая) группа совместимости из Заказа на ТС
				СтрокаСовместимости = ТекЗаказ.Ссылка.ГруппыСовместимости[0];
				уатВнешнийМаршрутизаторСервер_уэ.ДобавитьГруппуСовместимостиИзСтроки(СтрокаСовместимости, load_types, ИспользуемыеГруппыСовместимости);
			ИначеЕсли ТекЗаказ.Ссылка.ГруппыСовместимости.Количество() > 0 Тогда
				Для Каждого СтрокаСовместимости Из ТекЗаказ.Ссылка.ГруппыСовместимости Цикл
					уатВнешнийМаршрутизаторСервер_уэ.ДобавитьГруппуСовместимостиИзСтроки(СтрокаСовместимости, load_types, ИспользуемыеГруппыСовместимости);
				КонецЦикла;
			ИначеЕсли ТекЗаказ.Ссылка.ГруппыСовместимости.Количество() = 0
				И Не НастройкиМаршрутизации.ПустаяГруппаСовместимостиСовместима Тогда
				СтрокаСовместимости = Новый Структура("ГруппаСовместимости", Справочники.уатГруппыСовместимости_уэ.ПустаяСсылка());
				уатВнешнийМаршрутизаторСервер_уэ.ДобавитьГруппуСовместимостиИзСтроки(СтрокаСовместимости, load_types, ИспользуемыеГруппыСовместимости);
			Иначе
				// Заказ с пустыми группами совместимости должен быть совместим со всеми другими группами совместимости.
				// Для внешних маршрутизаторов Рарус VRP и Яндекс по умолчанию это именно так, ничего делать не требуется
			КонецЕсли;
			
			Структура_location.Вставить("load_types", load_types);
		КонецЕсли;
	КонецЕсли;

	СтоянкаПогрузка = ТекЗаказ.СтоянкаПунктОтправления;
	СтоянкаПогрузкаЧас = Цел(СтоянкаПогрузка);
	СтоянкаПогрузкаМин = (СтоянкаПогрузка - СтоянкаПогрузкаЧас) * 100;
	СтоянкаПогрузка = СтоянкаПогрузкаЧас * 3600 + СтоянкаПогрузкаМин * 60;
	Структура_location.Вставить("depot_duration_s", СтоянкаПогрузка);
	
	СтоянкаРазгрузка = ТекЗаказ.СтоянкаПунктНазначения;
	СтоянкаРазгрузкаЧас = Цел(СтоянкаРазгрузка);
	СтоянкаРазгрузкаМин = (СтоянкаРазгрузка - СтоянкаРазгрузкаЧас) * 100;
	СтоянкаРазгрузка = СтоянкаРазгрузкаЧас * 3600 + СтоянкаРазгрузкаМин * 60;
	Структура_location.Вставить("service_duration_s", СтоянкаРазгрузка);
	
	ДопСтоянкаРазгрузка = ТекЗаказ.ДопСтоянкаПунктНазначения;
	ДопСтоянкаРазгрузкаЧас = Цел(ДопСтоянкаРазгрузка);
	ДопСтоянкаРазгрузкаМин = (ДопСтоянкаРазгрузка - ДопСтоянкаРазгрузкаЧас) * 100;
	ДопСтоянкаРазгрузка = ДопСтоянкаРазгрузкаЧас * 3600 + ДопСтоянкаРазгрузкаМин * 60;
	Структура_location.Вставить("shared_service_duration_s", ДопСтоянкаРазгрузка);
	
	Структура_location.Вставить("sequence_order", ТекЗаказ.Приоритет); 
	
	Если ЗначениеЗаполнено(ТекЗаказ.Ссылка) Тогда
		Структура_location.Вставить("description",  Строка(ТекЗаказ.АдресНазначения));
		
		Если ЗначениеЗаполнено(ТекЗаказ.Ссылка.Грузополучатель) Тогда
			Структура_location.Вставить("title", "Грузополучатель: " + ТекЗаказ.Ссылка.Грузополучатель); 
		ИначеЕсли ЗначениеЗаполнено(ТекЗаказ.Ссылка.Контрагент) Тогда 
			Структура_location.Вставить("title", "Контрагент: " + ТекЗаказ.Ссылка.Контрагент);
		КонецЕсли;
	Конецесли;

	Структура_location.Вставить("ref",      Строка(ТекЗаказ.GUID));
	Если ЗначениеЗаполнено(ТекЗаказ.Ссылка) Тогда
		Структура_location.Вставить("comments", ТекЗаказ.Ссылка.КомментарийВодителю);
	КонецЕсли;
	Структура_location.Вставить("id",  уатВнешнийМаршрутизаторСервер_уэ.СформироватьИдентификаторОбъекта(ТекЗаказ.АдресНазначения, СчДобавленныхОбъектов));
	
	Строкаlocation = Таблицаlocation.Добавить();
	ЗаполнитьЗначенияСвойств(Строкаlocation, ТекЗаказ);
	Строкаlocation.id = Структура_location.id;
	
	Возврат Структура_location;

КонецФункции

Функция ЗаполнитьПунктыДоставки(Массив_locations, СтруктураНастроекАРМ, НастройкиМаршрутизации, СчДобавленныхОбъектов, РежимОптимизации = Ложь)
	
	ИдентификаторыПунктовВыдачи = Новый Массив();
	
	Для Каждого ТекСтрока Из НастройкиМаршрутизации.ТаблицаПунктыВыдачи Цикл 
		
		Структура_location = Новый Структура();
		
		Пункт = Справочники.уатПунктыНазначения.ПолучитьСсылку(Новый УникальныйИдентификатор(ТекСтрока));
	
		ВремяДоступностиС  = Пункт.ВремяДоступностиС;
		ВремяДоступностиПо = Пункт.ВремяДоступностиПо;
		Если ЗначениеЗаполнено(ВремяДоступностиС)
			ИЛИ ЗначениеЗаполнено(ВремяДоступностиПо) Тогда
			Структура_location.Вставить("time_window", "0." + Формат(ВремяДоступностиС, "ДФ=ЧЧ:мм:сс; ДП=") + "-0." + Формат(ВремяДоступностиПо, "ДФ=ЧЧ:мм:сс"));
		Иначе
			Структура_location.Вставить(
			"time_window", 
			"0.00:00:00-0.23:59:59");
		КонецЕсли;
		
		Структура_location.Вставить("hard_window", СтруктураНастроекАРМ.НастройкаУчитыватьОкнаПоЗаказамПриМаршрутизации);

		ДопСтоянка    = уатЗащищенныеФункцииСервер_уэ.ПолучитьВремяСтоянкиВПункте(Пункт, Неопределено);
		ДопСтоянкаЧас = Цел(ДопСтоянка);
		ДопСтоянкаМин = (ДопСтоянка - ДопСтоянкаЧас) * 100;
		ДопСтоянка = ДопСтоянкаЧас * 3600 + ДопСтоянкаМин * 60;
		Структура_location.Вставить("shared_service_duration_s", ДопСтоянка);

		Структура_location.Вставить("point", Новый Структура("lat, lon", Пункт.Лат, Пункт.Лон));
		
		ЕстьШтрафы = Ложь;
		СтруктураШтрафов = Новый Структура();
		Если ЗначениеЗаполнено(НастройкиМаршрутизации.locationsPenalty_outOfTime_fixed)
			ИЛИ ЗначениеЗаполнено(НастройкиМаршрутизации.locationsPenalty_outOfTime_minute) Тогда
			out_of_time = Новый Структура();
			Если ЗначениеЗаполнено(НастройкиМаршрутизации.locationsPenalty_outOfTime_fixed) Тогда
				out_of_time.Вставить("fixed", НастройкиМаршрутизации.locationsPenalty_outOfTime_fixed);
			КонецЕсли;
			Если ЗначениеЗаполнено(НастройкиМаршрутизации.locationsPenalty_outOfTime_minute) Тогда
				out_of_time.Вставить("minute", НастройкиМаршрутизации.locationsPenalty_outOfTime_minute);
			КонецЕсли;
			СтруктураШтрафов.Вставить("out_of_time", out_of_time);
			ЕстьШтрафы = Истина;
		КонецЕсли;
		Если ЗначениеЗаполнено(НастройкиМаршрутизации.locationsPenalty_early_fixed)
			ИЛИ ЗначениеЗаполнено(НастройкиМаршрутизации.locationsPenalty_early_minute) Тогда
			early = Новый Структура();
			Если ЗначениеЗаполнено(НастройкиМаршрутизации.locationsPenalty_early_fixed) Тогда
				early.Вставить("fixed", НастройкиМаршрутизации.locationsPenalty_early_fixed);
			КонецЕсли;
			Если ЗначениеЗаполнено(НастройкиМаршрутизации.locationsPenalty_early_minute) Тогда
				early.Вставить("minute", НастройкиМаршрутизации.locationsPenalty_early_minute);
			КонецЕсли;
			СтруктураШтрафов.Вставить("early", early);
			ЕстьШтрафы = Истина;
		КонецЕсли;
		Если ЗначениеЗаполнено(НастройкиМаршрутизации.locationsPenalty_late_fixed)
			ИЛИ ЗначениеЗаполнено(НастройкиМаршрутизации.locationsPenalty_late_minute) Тогда
			late = Новый Структура();
			Если ЗначениеЗаполнено(НастройкиМаршрутизации.locationsPenalty_late_fixed) Тогда
				late.Вставить("fixed", НастройкиМаршрутизации.locationsPenalty_late_fixed);
			КонецЕсли;
			Если ЗначениеЗаполнено(НастройкиМаршрутизации.locationsPenalty_late_minute) Тогда
				late.Вставить("minute", НастройкиМаршрутизации.locationsPenalty_late_minute);
			КонецЕсли;
			СтруктураШтрафов.Вставить("late", late);
			ЕстьШтрафы = Истина;
		КонецЕсли;
		Если ЗначениеЗаполнено(НастройкиМаршрутизации.locationsPenalty_drop) Тогда
			drop = Новый Структура();
			Если ЗначениеЗаполнено(НастройкиМаршрутизации.locationsPenalty_drop) Тогда
				drop.Вставить("fixed", НастройкиМаршрутизации.locationsPenalty_drop);
			КонецЕсли;
			СтруктураШтрафов.Вставить("drop", НастройкиМаршрутизации.locationsPenalty_drop);
			ЕстьШтрафы = Истина;
		КонецЕсли;
		
		Если ЕстьШтрафы Тогда
			Структура_location.Вставить("penalty", СтруктураШтрафов);
		КонецЕсли;
			
		Структура_location.Вставить("required_tags", Новый Массив());
		
		Структура_location.Вставить("ref",   Пункт.Наименование);
		Структура_location.Вставить("id",    уатВнешнийМаршрутизаторСервер_уэ.СформироватьИдентификаторОбъекта(Пункт, СчДобавленныхОбъектов));
		
		ИдентификаторыПунктовВыдачи.Добавить(Структура_location.id);

		СчДобавленныхОбъектов = СчДобавленныхОбъектов + 1;
		
		Структура_location.Вставить("type",  "drop_off");
		Массив_locations.Добавить(Структура_location);
	КонецЦикла;
	
	Возврат ИдентификаторыПунктовВыдачи;
	
КонецФункции

Процедура ДобавитьВыездИзГаража(НастройкаВыездИзГаража, Объект, СтруктураНастроекАРМ, Массив_locations, Структура_vehicle, СчДобавленныхОбъектов)
	Если ТипЗнч(Объект) = Тип("СправочникСсылка.уатТС") Тогда
		Пункт = Объект.Гараж;
	Иначе
		Пункт = Объект;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Пункт)
		И НастройкаВыездИзГаража Тогда

		Структура_locationГараж = Новый Структура("point, ref, id, type, time_window");
		
		ВремяДоступностиС  = Пункт.ВремяДоступностиС;
		ВремяДоступностиПо = Пункт.ВремяДоступностиПо;
		Если ЗначениеЗаполнено(ВремяДоступностиС)
			ИЛИ ЗначениеЗаполнено(ВремяДоступностиПо) Тогда
			Если НЕ ЗначениеЗаполнено(ВремяДоступностиС) Тогда
				Структура_locationГараж.time_window  = "0.00:00:00-0." + Формат(ВремяДоступностиПо, "ДФ=ЧЧ:мм:сс");
			ИначеЕсли НЕ ЗначениеЗаполнено(ВремяДоступностиПо) Тогда
				Структура_locationГараж.time_window  = "0." + Формат(ВремяДоступностиС, "ДФ=ЧЧ:мм:сс") + "-0.23:59:59" + Формат(ВремяДоступностиПо, "ДФ=ЧЧ:мм:сс");
			Иначе
				Структура_locationГараж.time_window  = "0." + Формат(ВремяДоступностиС, "ДФ=ЧЧ:мм:сс") + "-0." + Формат(ВремяДоступностиПо, "ДФ=ЧЧ:мм:сс");
			КонецЕсли;
		Иначе
			Структура_locationГараж.time_window               = "0.00:00:00-0.23:59:59";
		КонецЕсли;
		Структура_locationГараж.Вставить("hard_window",  СтруктураНастроекАРМ.НастройкаУчитыватьОкнаПоЗаказамПриМаршрутизации);
		
		Структура_locationГараж.point                     = Новый Структура("lat, lon", Пункт.Лат, Пункт.Лон);
		Структура_locationГараж.ref                       = Пункт.Наименование + " #Гараж#" + Строка(Пункт.УникальныйИдентификатор());
		Структура_locationГараж.id                        = уатВнешнийМаршрутизаторСервер_уэ.СформироватьИдентификаторОбъекта(Пункт, СчДобавленныхОбъектов);
		Структура_locationГараж.type                      = "garage";
		
		ДопСтоянка    = уатЗащищенныеФункцииСервер_уэ.ПолучитьВремяСтоянкиВПункте(Пункт, Неопределено);
		ДопСтоянкаЧас = Цел(ДопСтоянка);
		ДопСтоянкаМин = (ДопСтоянка - ДопСтоянкаЧас) * 100;
		ДопСтоянка = ДопСтоянкаЧас * 3600 + ДопСтоянкаМин * 60;
		Структура_locationГараж.Вставить("shared_service_duration_s", ДопСтоянка);

		Структура_vehicle.Вставить("start_at", Структура_locationГараж.id);
		Массив_locations.Добавить(Структура_locationГараж);
		
		СчДобавленныхОбъектов = СчДобавленныхОбъектов + 1;
		
	Иначе
		Структура_vehicle.Вставить("visit_depot_at_start", Истина);
	КонецЕсли;
КонецПроцедуры

Процедура ДобавитьЗаездВГараж(НастройкаВозвратВГараж, Объект, СтруктураНастроекАРМ, Массив_locations, Структура_vehicle, СчДобавленныхОбъектов, РежимОптимизации = Ложь)
	Если ТипЗнч(Объект) = Тип("СправочникСсылка.уатТС") Тогда
		Пункт = Объект.Гараж;
	Иначе
		Пункт = Объект;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Пункт)
		И НастройкаВозвратВГараж Тогда
		
		Структура_locationГараж = Новый Структура("point, ref, id, type, time_window");
		
		ВремяДоступностиС  = Пункт.ВремяДоступностиС;
		ВремяДоступностиПо = Пункт.ВремяДоступностиПо;
		Если ЗначениеЗаполнено(ВремяДоступностиС)
			ИЛИ ЗначениеЗаполнено(ВремяДоступностиПо) Тогда
			Если НЕ ЗначениеЗаполнено(ВремяДоступностиС) Тогда
				Структура_locationГараж.time_window  = "0.00:00:00-0." + Формат(ВремяДоступностиПо, "ДФ=ЧЧ:мм:сс");
			ИначеЕсли НЕ ЗначениеЗаполнено(ВремяДоступностиПо) Тогда
				Структура_locationГараж.time_window  = "0." + Формат(ВремяДоступностиС, "ДФ=ЧЧ:мм:сс") + "-0.23:59:59" + Формат(ВремяДоступностиПо, "ДФ=ЧЧ:мм:сс");
			Иначе
				Структура_locationГараж.time_window  = "0." + Формат(ВремяДоступностиС, "ДФ=ЧЧ:мм:сс") + "-0." + Формат(ВремяДоступностиПо, "ДФ=ЧЧ:мм:сс");
			КонецЕсли;
		Иначе
			Структура_locationГараж.time_window     = "0.00:00:00-0.23:59:59";
		КонецЕсли; 
		УчитыватьОкнаПоЗаказам = ?(РежимОптимизации, СтруктураНастроекАРМ.Оптимизация_НастройкаУчитыватьОкнаПоЗаказам, СтруктураНастроекАРМ.НастройкаУчитыватьОкнаПоЗаказамПриМаршрутизации);
		
		Структура_locationГараж.Вставить("hard_window",  УчитыватьОкнаПоЗаказам);
		Структура_locationГараж.point                     = Новый Структура("lat, lon", Пункт.Лат, Пункт.Лон);
		Структура_locationГараж.ref                       = Пункт.Наименование + " #Гараж#" + Строка(Пункт.УникальныйИдентификатор());
		Структура_locationГараж.id                        = уатВнешнийМаршрутизаторСервер_уэ.СформироватьИдентификаторОбъекта(Пункт, СчДобавленныхОбъектов);
		Структура_locationГараж.type                      = "garage";
		
		ДопСтоянка    = уатЗащищенныеФункцииСервер_уэ.ПолучитьВремяСтоянкиВПункте(Пункт, Неопределено);
		ДопСтоянкаЧас = Цел(ДопСтоянка);
		ДопСтоянкаМин = (ДопСтоянка - ДопСтоянкаЧас) * 100;
		ДопСтоянка = ДопСтоянкаЧас * 3600 + ДопСтоянкаМин * 60;
		Структура_locationГараж.Вставить("shared_service_duration_s", ДопСтоянка);
		
		Структура_vehicle.Вставить("finish_at", Структура_locationГараж.id);
		Массив_locations.Добавить(Структура_locationГараж);
		
		СчДобавленныхОбъектов = СчДобавленныхОбъектов + 1;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#КонецОбласти

