#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Выполняет заполнение предопределенных элементов справочника
//
Процедура ЗаполнитьПредопределенныеДанные() Экспорт
		
	СпрОбъект = Справочники.уатУчетныеЗаписиСистемыМониторинга.Omnicomm.ПолучитьОбъект();
	СпрОбъект.СистемаМониторинга				 = Справочники.уатВнешниеСистемы.Omnicomm;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатУчетныеЗаписиСистемыМониторинга.Wialon.ПолучитьОбъект();
	СпрОбъект.СистемаМониторинга				 = Справочники.уатВнешниеСистемы.Wialon;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатУчетныеЗаписиСистемыМониторинга.АвтоГРАФ.ПолучитьОбъект();
	СпрОбъект.СистемаМониторинга				 = Справочники.уатВнешниеСистемы.АвтоГРАФ;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатУчетныеЗаписиСистемыМониторинга.АвтоГРАФ5.ПолучитьОбъект();
	СпрОбъект.СистемаМониторинга				 = Справочники.уатВнешниеСистемы.АвтоГРАФ;
	СпрОбъект.Версия							 = Перечисления.уатВерсииАвтоГРАФ.АвтоГРАФ_5;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатУчетныеЗаписиСистемыМониторинга.СКАУТ.ПолучитьОбъект();
	СпрОбъект.СистемаМониторинга				 = Справочники.уатВнешниеСистемы.СКАУТ;
	СпрОбъект.Записать();

	МассивПСМ = Новый Массив();
	уатРаботаСРасширениями.ПСМ_ЗаполнитьМассивВнешихСистем(МассивПСМ);
	Если МассивПСМ.Количество() > 0 Тогда
		уатРаботаСРасширениями.ПСМ_ЗаполнитьУчетнуюЗаписьСистемыМониторинга(МассивПСМ[0]);
	Иначе
		СпрОбъект = Справочники.уатУчетныеЗаписиСистемыМониторинга.ПСМ.ПолучитьОбъект();
		СпрОбъект.СистемаМониторинга = "";
		СпрОбъект.Записать();
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Обработать данные для перехода на новую версию
//
Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию() Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	уатУчетныеЗаписиСистемыМониторинга.Ссылка КАК Ссылка,
	|	уатУчетныеЗаписиСистемыМониторинга.Пароль КАК Пароль,
	|	уатУчетныеЗаписиСистемыМониторинга.СистемаМониторинга.НаименованиеПС КАК НаименованиеПС
	|ИЗ
	|	Справочник.уатУчетныеЗаписиСистемыМониторинга КАК уатУчетныеЗаписиСистемыМониторинга
	|ГДЕ
	|	(ВЫРАЗИТЬ(уатУчетныеЗаписиСистемыМониторинга.Пароль КАК СТРОКА(200))) <> """"";
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		УчетнаяЗапись = Выборка.Ссылка.ПолучитьОбъект();
		УстановитьПривилегированныйРежим(Истина);
		ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(УчетнаяЗапись.Ссылка, Выборка.Пароль);
		УстановитьПривилегированныйРежим(Ложь);
		
		Если НЕ ЗначениеЗаполнено(Выборка.НаименованиеПС) Тогда
			УчетнаяЗапись.Пароль = "";
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(УчетнаяЗапись);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#КонецЕсли