#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	СценарийСПлановойВыработкой = Неопределено;
	СценарийПланированияРемонтов = Неопределено;
	
	Для Каждого ТекПараметр Из ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		Если Строка(ТекПараметр.Параметр) = ЭтотОбъект.СхемаКомпоновкиДанных.Параметры.СценарийСПлановойВыработкой.Имя Тогда
			СценарийСПлановойВыработкой = ТекПараметр.Значение;
		КонецЕсли;
		Если Строка(ТекПараметр.Параметр) = ЭтотОбъект.СхемаКомпоновкиДанных.Параметры.СценарийПланированияРемонтов.Имя Тогда
			СценарийПланированияРемонтов = ТекПараметр.Значение;
		КонецЕсли;
	КонецЦикла;
	
	//СценарийСПлановойВыработкой = ЭтотОбъект.СхемаКомпоновкиДанных.Параметры.СценарийСПлановойВыработкой;
	//СценарийПланированияРемонтов = ЭтотОбъект.СхемаКомпоновкиДанных.Параметры.СценарийПланированияРемонтов;
	
	//Если СценарийСПлановойВыработкой.Периодичность <> СценарийПланированияРемонтов.Периодичность Тогда
	//	ТекстНСтр = НСтр("ru = 'Требуется использовать сценарии планирования с одинаковой периодичностью.'; en = 'It is required to use planning scenarios with the same frequency.'");
	//	ОбщегоНазначения.СообщитьПользователю(ТекстНСтр);
	//	Отказ = Истина;
	//КонецЕсли;
	//
	//Если СценарийСПлановойВыработкой.Раздел <> Перечисления.уатРазделыПланирования.Выработка Тогда
	//	ТекстНСтр = НСтр("ru = 'Сценарий с планировой выработкой должен иметь раздел ""Выработка"".'; en = 'A scenario with planned production must have a ""Production"" section.'");
	//	ОбщегоНазначения.СообщитьПользователю(ТекстНСтр);
	//	Отказ = Истина;
	//КонецЕсли;
	//
	//Если СценарийПланированияРемонтов.Раздел <> Перечисления.уатРазделыПланирования.РемонтыИТО Тогда
	//	ТекстНСтр = НСтр("ru = 'Сценарий планирования ремонтов должен иметь раздел ""Ремонты и ТО"".'; en = 'The repair planning scenario should have a ""Repairs and Maintenance"" section.'");
	//	ОбщегоНазначения.СообщитьПользователю(ТекстНСтр);
	//	Отказ = Истина;
	//КонецЕсли;
	
КонецПроцедуры

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДокументРезультат.Очистить();
	
	СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	НастройкиКомпоновщикаНастроек = КомпоновщикНастроек.ПолучитьНастройки();
	
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("ТабДанныхПоТО", ПолучитьДанныеПоТО(НастройкиКомпоновщикаНастроек));
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновщикаНастроек, ДанныеРасшифровки);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДанныеПоТО(НастройкиКомпоновщикаНастроек)
	
	Сценарий = НастройкиКомпоновщикаНастроек.ПараметрыДанных.Элементы.Найти("СценарийПланированияРемонтов").Значение;
	ХарактеристикиСценария = уатОбщегоНазначения_проф.ЗаполнитьХарактеристикиСценария(Сценарий);
	НачалоПериода = НастройкиКомпоновщикаНастроек.ПараметрыДанных.Элементы.Найти("ПериодОтчета").Значение.ДатаНачала;
	КонецПериода = НастройкиКомпоновщикаНастроек.ПараметрыДанных.Элементы.Найти("ПериодОтчета").Значение.ДатаОкончания;
	
	СоставПлана = Новый ТаблицаЗначений;
	СоставПлана.Колонки.Добавить("ДетализацияПланирования");
	СоставПлана.Колонки.Добавить("ПараметрВыработки");
	СоставПлана.Колонки.Добавить("Номенклатура");
	СоставПлана.Колонки.Добавить("Колонна");
	СоставПлана.Колонки.Добавить("ВидОбслуживания");
	СоставПлана.Колонки.Добавить("ПлановаяДатаОбслуживания");
	СоставПлана.Колонки.Добавить("Подразделение");
	уатОбщегоНазначения_проф.ЗаполнитьСоставПланаПериод(ЭтотОбъект, НачалоПериода,
		ХарактеристикиСценария, 0, "СоставПлана");
	
	флТС                      = ХарактеристикиСценария.флТС;
	флКолонна                 = Истина;
	флСреднесуточнаяВыработка = ХарактеристикиСценария.флРемонтыИТО;
	флПараметрВыработки       = ХарактеристикиСценария.флПараметрВыработки ИЛИ ХарактеристикиСценария.флВыработка
		Или флСреднесуточнаяВыработка;
	флВидПеревозки            = ХарактеристикиСценария.флВидПеревозки;
	флКонтрагент              = ХарактеристикиСценария.флКонтрагент;
	флДоговор                 = ХарактеристикиСценария.флДоговор;
	флМаршрут                 = ХарактеристикиСценария.флМаршрут;
	флОбъектСтроительства     = ХарактеристикиСценария.флОбъектСтроительства;
	флНаправлениеПеревозки    = ХарактеристикиСценария.флНаправлениеПеревозки;
	флНоменклатураГруза       = ХарактеристикиСценария.флНоменклатураГруза;
	флУслуга                  = ХарактеристикиСценария.флУслуга;
	флСтатья                  = ХарактеристикиСценария.флСтатья;
	флВидОбслуживания         = ХарактеристикиСценария.флРемонтыИТО;
	флПлановаяДатаТО          = ХарактеристикиСценария.флРемонтыИТО;
	флНоменклатураТО          = ХарактеристикиСценария.флНоменклатураТО;
	
	ПоляСвертки    = ?(флПараметрВыработки, "ПараметрВыработки", "");
	ПоляСвертки    = ПоляСвертки + ?(флВидПеревозки, ?(ЗначениеЗаполнено(ПоляСвертки), ", ", "") + "ВидПеревозки", "");
	ПоляСвертки    = ПоляСвертки + ?(флКонтрагент, ?(ЗначениеЗаполнено(ПоляСвертки),   ", ", "") + "Контрагент", "");
	ПоляСвертки    = ПоляСвертки + ?(флДоговор, ?(ЗначениеЗаполнено(ПоляСвертки),  ", ", "") + "Договор", "");
	ПоляСвертки    = ПоляСвертки + ?(флМаршрут, ?(ЗначениеЗаполнено(ПоляСвертки),  ", ", "") + "Маршрут", "");
	ПоляСвертки    = ПоляСвертки + ?(флОбъектСтроительства, ?(ЗначениеЗаполнено(ПоляСвертки), ", ", "") + "ОбъектСтроительства", "");
	ПоляСвертки    = ПоляСвертки + ?(флНаправлениеПеревозки, ?(ЗначениеЗаполнено(ПоляСвертки), ", ", "") + "НаправлениеПеревозки", "");
	ПоляСвертки    = ПоляСвертки + ?(флНоменклатураГруза Или флНоменклатураТО, ?(ЗначениеЗаполнено(ПоляСвертки), ", ", "") + "Номенклатура", "");
	ПоляСвертки    = ПоляСвертки + ?(флУслуга, ?(ЗначениеЗаполнено(ПоляСвертки), ", ", "") + "Услуга", "");
	ПоляСвертки    = ПоляСвертки + ?(флСтатья, ?(ЗначениеЗаполнено(ПоляСвертки), ", ", "") + "Статья", "");
	ПоляСвертки    = ПоляСвертки + ?(флВидОбслуживания, ?(ЗначениеЗаполнено(ПоляСвертки), ", ", "") + "ВидОбслуживания", "");
	ПоляСвертки    = ПоляСвертки + ?(флПлановаяДатаТО, ?(ЗначениеЗаполнено(ПоляСвертки), ", ", "") + "ПлановаяДатаОбслуживания", "");
	ПоляСвертки    = ПоляСвертки + ?(флСреднесуточнаяВыработка, ?(ЗначениеЗаполнено(ПоляСвертки), ", ", "") + "НачальнаяВыработка", "");
	ПоляСвертки    = ПоляСвертки + ?(флСреднесуточнаяВыработка, ?(ЗначениеЗаполнено(ПоляСвертки), ", ", "") + "СреднесуточнаяВыработка", "");
	ПоляСвертки    = ПоляСвертки + ?(флСреднесуточнаяВыработка, ?(ЗначениеЗаполнено(ПоляСвертки), ", ", "") + "ЗначениеПараметраВыработки", "");
	ПоляСвертки    = ПоляСвертки + ?(флСреднесуточнаяВыработка, ?(ЗначениеЗаполнено(ПоляСвертки), ", ", "") + "ДатаПоследнегоТО", "");
	ПоляСвертки    = ПоляСвертки + ?(флСреднесуточнаяВыработка, ?(ЗначениеЗаполнено(ПоляСвертки), ", ", "") + "ВыработкаПослеПоследнегоТО", "");
	ПоляСвертки    = ПоляСвертки + ?(ЗначениеЗаполнено(ПоляСвертки), ", ", "") + "Подразделение";
	
	СхемаКомпоновкиДанных = ПолучитьМакет("КомпоновкаДанныхСреднесуточнаяВыработка");
	СхемаКомпоновкиДанных.Параметры.ДетализацияТС.Значение   = ХарактеристикиСценария.ВариантАналитикиТС;
	
	СхемаКомпоновкиДанных.Параметры.ДатаНач.Значение = НачалоПериода;
	СхемаКомпоновкиДанных.Параметры.ДатаКон.Значение = КонецПериода;
	
	СхемаКомпоновкиДанных.Параметры.Сценарий.Значение = Сценарий;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки     = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,,,, Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,,, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	тблЗапросДанные = Новый ТаблицаЗначений;
	ПроцессорВывода.УстановитьОбъект(тблЗапросДанные);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	тблЗапросДанные.Свернуть("ДетализацияПланирования, " + ПоляСвертки, "Количество, Сумма, СуммаНДС");
	Для Каждого ТекСтрока Из тблЗапросДанные Цикл
		
		Если флСреднесуточнаяВыработка
			И ТекСтрока.СреднесуточнаяВыработка > 0 Тогда
			СекундВДне = 24*60*60;
			ДатыТО = Новый Массив;
			
			// Первое ТО - до него может быть меньше дней, т.к. часть выработки могла произойти до начала периода планирования
			ВыработкиДоСледующегоТО = ТекСтрока.ВыработкаПослеПоследнегоТО + ТекСтрока.ЗначениеПараметраВыработки - ТекСтрока.НачальнаяВыработка;
			Если ВыработкиДоСледующегоТО <= 0 Тогда
				ПлановаяДатаСледующегоТО = НачалоДня(НачалоПериода);
			Иначе
				ДнейДоТО = ВыработкиДоСледующегоТО / ТекСтрока.СреднесуточнаяВыработка;
				Если ДнейДоТО < Цел(ДнейДоТО) Тогда
					ДнейДоТО = Цел(ДнейДоТО) + 1;
				КонецЕсли;
				ПлановаяДатаСледующегоТО = НачалоДня(НачалоПериода) + ДнейДоТО * СекундВДне;
			КонецЕсли;
			
			// Последующие ТО
			ВыработкиДоСледующегоТО = ТекСтрока.ВыработкаПослеПоследнегоТО + ТекСтрока.ЗначениеПараметраВыработки;
			Пока ПлановаяДатаСледующегоТО < КонецДня(КонецПериода) Цикл
				ДатыТО.Добавить(ПлановаяДатаСледующегоТО);
				ДнейДоТО = ВыработкиДоСледующегоТО / ТекСтрока.СреднесуточнаяВыработка;
				Если ДнейДоТО < Цел(ДнейДоТО) Тогда
					ДнейДоТО = Цел(ДнейДоТО) + 1;
				КонецЕсли;
				ПлановаяДатаСледующегоТО = НачалоДня(НачалоПериода) + ДнейДоТО * СекундВДне;
			КонецЦикла;
			
			Если ДатыТО.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Если флПараметрВыработки
			И Не флСреднесуточнаяВыработка
			И ХарактеристикиСценария.МассивПараметровВыработки.Найти(ТекСтрока.ПараметрВыработки) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = СоставПлана.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		НоваяСтрока["СоставПланаКоличество_Всего"] = ТекСтрока.Количество;
		НоваяСтрока["СоставПланаСумма_Всего"]      = ТекСтрока.Сумма;
		НоваяСтрока["СоставПланаСуммаНДС_Всего"]   = ТекСтрока.СуммаНДС;
		Если флПараметрВыработки И ТекСтрока.ПараметрВыработки.Временный Тогда
			НоваяСтрока["СоставПланаКоличество_Всего"] = НоваяСтрока["СоставПланаКоличество_Всего"] / 3600;
		КонецЕсли;
		Если НоваяСтрока["СоставПланаКоличество_Всего"] > 0 Тогда
			НоваяСтрока["СоставПланаЦена_Всего"] = НоваяСтрока["СоставПланаСумма_Всего"] / НоваяСтрока["СоставПланаКоличество_Всего"]
		КонецЕсли;
		
		Если флСреднесуточнаяВыработка
			И ТекСтрока.СреднесуточнаяВыработка > 0 Тогда
			НоваяСтрока.ПлановаяДатаОбслуживания = ДатыТО[0];
			Для Сч = 1 По ДатыТО.Количество()-1 Цикл
				СтрокаДополнительногоТО = СоставПлана.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаДополнительногоТО, НоваяСтрока);
				СтрокаДополнительногоТО.ПлановаяДатаОбслуживания = ДатыТО[Сч];
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

#КонецОбласти

#КонецЕсли