#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// Позволяет переопределить ограничение, указанное в модуле менеджера объекта метаданных.
//
// Параметры:
//  Ограничение - Структура:
//    * Текст                             - Строка - ограничение доступа для пользователей.
//                                          Если пустая строка, значит, доступ разрешен.
//    * ТекстДляВнешнихПользователей      - Строка - ограничение доступа для внешних пользователей.
//                                          Если пустая строка, значит, доступ запрещен.
//    * ПоВладельцуБезЗаписиКлючейДоступа - Неопределено - определить автоматически.
//                                        - Булево - если Ложь, то всегда записывать ключи доступа,
//                                          если Истина, тогда не записывать ключи доступа,
//                                          а использовать ключи доступа владельца (требуется,
//                                          чтобы ограничение было строго по объекту-владельцу).
//   * ПоВладельцуБезЗаписиКлючейДоступаДляВнешнихПользователей - Неопределено, Булево - также
//                                          как у параметра ПоВладельцуБезЗаписиКлючейДоступа.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(Подразделение)";
	
	Ограничение.ТекстДляВнешнихПользователей = Ограничение.Текст;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьДополнительныеРеквизитыДляРеестра() Экспорт
	
	Результат = Новый Структура("Информация", "Дебитор");
	Возврат Результат;
	
КонецФункции

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	мЗапрос = Новый Запрос;
	мЗапрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	мЗапрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	уатВзаимозачетСостав.Ссылка.Дата КАК Период,
	|	уатВзаимозачетСостав.Ссылка КАК Регистратор,
	|	уатВзаимозачетСостав.Ссылка.Кредитор КАК Контрагент,
	|	уатВзаимозачетСостав.Ссылка.Организация КАК Организация,
	|	уатВзаимозачетСостав.СделкаКредитора КАК Сделка,
	|	уатВзаимозачетСостав.ДоговорКредитора КАК ДоговорКонтрагента,
	|	уатВзаимозачетСостав.ВалютаКредитора КАК Валюта,
	|	уатВзаимозачетСостав.КурсКредитора КАК Курс,
	|	уатВзаимозачетСостав.КратностьКредитора КАК Кратность,
	|	уатВзаимозачетСостав.СуммаКредитора КАК СуммаВзаиморасчетов,
	|	уатВзаимозачетСостав.СуммаКредитора КАК СуммаУпр
	|ИЗ
	|	Документ.уатВзаимозачет.Состав КАК уатВзаимозачетСостав
	|ГДЕ
	|	уатВзаимозачетСостав.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	уатВзаимозачетСостав.Ссылка.Дата,
	|	уатВзаимозачетСостав.Ссылка,
	|	уатВзаимозачетСостав.Ссылка.Дебитор,
	|	уатВзаимозачетСостав.Ссылка.Организация,
	|	уатВзаимозачетСостав.СделкаДебитора,
	|	уатВзаимозачетСостав.ДоговорДебитора,
	|	уатВзаимозачетСостав.ВалютаДебитора,
	|	уатВзаимозачетСостав.КурсДебитора,
	|	уатВзаимозачетСостав.КратностьДебитора,
	|	уатВзаимозачетСостав.СуммаДебитора,
	|	уатВзаимозачетСостав.СуммаДебитора
	|ИЗ
	|	Документ.уатВзаимозачет.Состав КАК уатВзаимозачетСостав
	|ГДЕ
	|	уатВзаимозачетСостав.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатВзаимозачетСостав.Ссылка.Дата КАК Период,
	|	уатВзаимозачетСостав.Ссылка КАК Регистратор,
	|	уатВзаимозачетСостав.Ссылка.Дебитор КАК Контрагент,
	|	уатВзаимозачетСостав.Ссылка.Организация КАК Организация,
	|	уатВзаимозачетСостав.СделкаДебитора КАК Сделка,
	|	уатВзаимозачетСостав.СделкаДебитора КАК ОбъектОплаты,
	|	ВЫБОР
	|		КОГДА уатВзаимозачетСостав.ДоговорДебитора.ВедениеВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказамНаТС)
	|			ТОГДА уатВзаимозачетСостав.СделкаДебитора
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказНаТС,
	|	ВЫБОР
	|		КОГДА уатВзаимозачетСостав.ДоговорДебитора.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.уатПолучателиУслуг.НашаОрганизация)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.уатПолучателиУслуг.Контрагент)
	|	КОНЕЦ КАК ПолучательУслуг,
	|	уатВзаимозачетСостав.ДоговорДебитора КАК ДоговорКонтрагента,
	|	уатВзаимозачетСостав.ВалютаДебитора КАК Валюта,
	|	уатВзаимозачетСостав.КурсДебитора КАК Курс,
	|	уатВзаимозачетСостав.КратностьДебитора КАК Кратность,
	|	уатВзаимозачетСостав.СуммаДебитора КАК СуммаРасход,
	|	0 КАК СуммаРасходУпр,
	|	0 КАК СуммаПриход,
	|	0 КАК СуммаПриходУпр
	|ИЗ
	|	Документ.уатВзаимозачет.Состав КАК уатВзаимозачетСостав
	|ГДЕ
	|	уатВзаимозачетСостав.Ссылка = &Ссылка
	|	И (уатВзаимозачетСостав.ДоговорДебитора.ВедениеВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказамНаТС)
	|			ИЛИ уатВзаимозачетСостав.ДоговорДебитора.ВедениеВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоНакладным)
	|			ИЛИ уатВзаимозачетСостав.ДоговорДебитора.ВедениеВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	уатВзаимозачетСостав.Ссылка.Дата,
	|	уатВзаимозачетСостав.Ссылка,
	|	уатВзаимозачетСостав.Ссылка.Кредитор,
	|	уатВзаимозачетСостав.Ссылка.Организация,
	|	уатВзаимозачетСостав.СделкаКредитора,
	|	уатВзаимозачетСостав.СделкаКредитора,
	|	ВЫБОР
	|		КОГДА уатВзаимозачетСостав.ДоговорКредитора.ВедениеВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказамНаТС)
	|			ТОГДА уатВзаимозачетСостав.СделкаКредитора
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА уатВзаимозачетСостав.ДоговорКредитора.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.уатПолучателиУслуг.НашаОрганизация)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.уатПолучателиУслуг.Контрагент)
	|	КОНЕЦ,
	|	уатВзаимозачетСостав.ДоговорКредитора,
	|	уатВзаимозачетСостав.ВалютаКредитора,
	|	уатВзаимозачетСостав.КурсКредитора,
	|	уатВзаимозачетСостав.КратностьКредитора,
	|	0,
	|	0,
	|	уатВзаимозачетСостав.СуммаКредитора,
	|	0
	|ИЗ
	|	Документ.уатВзаимозачет.Состав КАК уатВзаимозачетСостав
	|ГДЕ
	|	уатВзаимозачетСостав.Ссылка = &Ссылка
	|	И (уатВзаимозачетСостав.ДоговорКредитора.ВедениеВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказамНаТС)
	|			ИЛИ уатВзаимозачетСостав.ДоговорКредитора.ВедениеВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоНакладным)
	|			ИЛИ уатВзаимозачетСостав.ДоговорКредитора.ВедениеВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам))";
	МассивРезультатов = мЗапрос.ВыполнитьПакет();
	
	// взаиморасчеты
	тблВзаиморасчеты = МассивРезультатов[0].Выгрузить();
	Для Каждого ТекСтрока Из тблВзаиморасчеты Цикл
		Если СтруктураДополнительныеСвойства.Свойство("ВалютаУпрУчета") Тогда
			Если ТекСтрока.Валюта <> СтруктураДополнительныеСвойства.ВалютаУпрУчета Тогда
				ТекСтрока.СуммаУпр = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.СуммаУпр,
					ТекСтрока.Валюта,    СтруктураДополнительныеСвойства.ВалютаУпрУчета,
					ТекСтрока.Курс,      СтруктураДополнительныеСвойства.КурсУпр,
					ТекСтрока.Кратность, СтруктураДополнительныеСвойства.КратностьУпр,,
					ДокументСсылка);
			КонецЕсли;
		Иначе
			ТекСтрока.СтоимостьУпр = 0;								
		КонецЕсли;
	КонецЦикла;
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаВзаиморасчетов", тблВзаиморасчеты);
	
	// платежный календарь
	ТаблицаПлатежныйКалендарь = МассивРезультатов[1].Выгрузить();
	Для Каждого ТекСтрока Из ТаблицаПлатежныйКалендарь Цикл		
		ТекСтрока.СуммаПриходУпр = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.СуммаПриход,
			ТекСтрока.Валюта,    СтруктураДополнительныеСвойства.ВалютаУпрУчета,
			ТекСтрока.Курс,      СтруктураДополнительныеСвойства.КурсУпр,
			ТекСтрока.Кратность, СтруктураДополнительныеСвойства.КратностьУпр,,
			ДокументСсылка);
		ТекСтрока.СуммаРасходУпр = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.СуммаРасход,
			ТекСтрока.Валюта,    СтруктураДополнительныеСвойства.ВалютаУпрУчета,
			ТекСтрока.Курс,      СтруктураДополнительныеСвойства.КурсУпр,
			ТекСтрока.Кратность, СтруктураДополнительныеСвойства.КратностьУпр,,
			ДокументСсылка);
	КонецЦикла;
	ТаблицаПлатежныйКалендарь.Свернуть(
		"ПолучательУслуг, Период, Регистратор, Организация, Контрагент, ДоговорКонтрагента, Сделка, ЗаказНаТС, Валюта, ОбъектОплаты",
		"СуммаПриход, СуммаПриходУпр, СуммаРасход, СуммаРасходУпр");
	// Разделение на 2 таблицы - расхода и прихода.
	// Расход будет закрывать долг по ФИФО, как платежный документ.
	// Приход будет добавлять долг, как Сделка
	ТаблицаПлатежныйКалендарьКредитор = ТаблицаПлатежныйКалендарь.СкопироватьКолонки();
	ТаблицаПлатежныйКалендарьКредитор.Колонки.Добавить("ЭтапОплаты", Новый ОписаниеТипов("СправочникСсылка.уатЭтапыОплаты"));
	мсвСтрокиКредитор = Новый Массив;
	Для Каждого ТекСтрока Из ТаблицаПлатежныйКалендарь Цикл
		Если ТекСтрока.СуммаПриход > 0 Тогда
			НоваяСтрокаКредитор = ТаблицаПлатежныйКалендарьКредитор.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаКредитор, ТекСтрока);
			Если СтрНайти("уатПоступлениеТоваровУслуг, уатРеализацияУслуг, уатСчетНаОплатуПокупателю, уатСчетНаОплатуПоставщика",
				ТекСтрока.Сделка.Метаданные().Имя) <> 0 Тогда
				НоваяСтрокаКредитор.ЭтапОплаты = ТекСтрока.Сделка.ЭтапОплаты;
			КонецЕсли;
			мсвСтрокиКредитор.Добавить(ТекСтрока);
		КонецЕсли;
	КонецЦикла;
	Для Каждого ТекСтрока Из мсвСтрокиКредитор Цикл
		ТаблицаПлатежныйКалендарь.Удалить(ТекСтрока);
	КонецЦикла;
	// распределение отдельно, сначала по Расходу, затем по Приходу
	уатПроведение_проф.РаспределитьПлатежныйКалендарьПоГрафикуОплаты(ТаблицаПлатежныйКалендарь, ДокументСсылка);
	уатПроведение_проф.РаспределитьПлатежныйКалендарьПоГрафикуОплаты(ТаблицаПлатежныйКалендарьКредитор, ДокументСсылка, Новый Структура("Приход", Истина));
	// Обратное объединение в одну таблицу движений
	Для Каждого ТекСтрокаКредитор Из ТаблицаПлатежныйКалендарьКредитор Цикл
		НоваяСтрока = ТаблицаПлатежныйКалендарь.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаКредитор);
	КонецЦикла;
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПлатежныйКалендарь", ТаблицаПлатежныйКалендарь);
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

Процедура ВыполнитьКонтроль(ДокументСсылка, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
	Заглушка = Истина;	
КонецПроцедуры // ВыполнитьКонтроль()

#КонецОбласти

#КонецЕсли