#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТолькоПросмотр = ДатыЗапретаИзменениеЗапрещено("Документ.уатПутевойЛист", ПараметрКоманды);
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВладелецФайла",  ПараметрКоманды);
	ПараметрыФормы.Вставить("ТолькоПросмотр", ТолькоПросмотр);
	
	ОткрытьФорму("Обработка.РаботаСФайлами.Форма.ПрисоединенныеФайлы",
	             ПараметрыФормы,
	             ПараметрыВыполненияКоманды.Источник,
	             ПараметрыВыполненияКоманды.Уникальность,
	             ПараметрыВыполненияКоманды.Окно);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ДатыЗапретаИзменениеЗапрещено(ПолноеИмя, Источник)
	
	Возврат ДатыЗапретаИзменения.ИзменениеЗапрещено(ПолноеИмя, Источник);
	
КонецФункции


#КонецОбласти