
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если ВидУведомления <> Справочники.уатСпособыВзаимодействий_уэ.ЗаданиеПользователю Тогда
		ИндексУдаляемого = ПроверяемыеРеквизиты.Найти("ЗаданиеВажность");
		Если Не ИндексУдаляемого = Неопределено Тогда 
			ПроверяемыеРеквизиты.Удалить(ИндексУдаляемого);
		КонецЕсли;
		
		ИндексУдаляемого = ПроверяемыеРеквизиты.Найти("ЗаданиеНаименование");
		Если Не ИндексУдаляемого = Неопределено Тогда 
			ПроверяемыеРеквизиты.Удалить(ИндексУдаляемого);
		КонецЕсли;
	КонецЕсли;
	
	Если ВидУведомления <> Справочники.уатСпособыВзаимодействий_уэ.ЭлектронноеПисьмо
		И ВидУведомления <> Справочники.уатСпособыВзаимодействий_уэ.SMSСообщение Тогда
		ИндексУдаляемого = ПроверяемыеРеквизиты.Найти("ОтветственныйУведомления");
		Если Не ИндексУдаляемого = Неопределено Тогда 
			ПроверяемыеРеквизиты.Удалить(ИндексУдаляемого);
		КонецЕсли;
	КонецЕсли;
	
	Если ВидУведомления <> Справочники.уатСпособыВзаимодействий_уэ.ЭлектронноеПисьмо Тогда
		ИндексУдаляемого = ПроверяемыеРеквизиты.Найти("УчетнаяЗаписьЭлектроннойПочты");
		Если Не ИндексУдаляемого = Неопределено Тогда 
			ПроверяемыеРеквизиты.Удалить(ИндексУдаляемого);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
