
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений();
	ДанныеВыбора.Добавить(Перечисления.уатРазделыПланирования.Выработка);
	ДанныеВыбора.Добавить(Перечисления.уатРазделыПланирования.ПредоставленныеУслуги);
	ДанныеВыбора.Добавить(Перечисления.уатРазделыПланирования.ДоходыРасходы);
	Если ПолучитьФункциональнуюОпцию("уатИспользоватьЗакреплениеМаршрутныхЛистовЗаПеревозчиками_уэ") Тогда
		ДанныеВыбора.Добавить(Перечисления.уатРазделыПланирования.ОбъемыПеревозок);
	КонецЕсли;
	Если уатОбщегоНазначенияПовтИсп.ВариантПоставкиТакси()
		И ПолучитьФункциональнуюОпцию("такИспользоватьАрендуТС") Тогда
		ДанныеВыбора.Добавить(Перечисления.уатРазделыПланирования.Аренда);
	КонецЕсли;
	Если уатОбщегоНазначенияПовтИсп.ВариантПоставкиКОРП() И ПолучитьФункциональнуюОпцию("уатИспользоватьЖДПеревозки") Тогда
		ДанныеВыбора.Добавить(Перечисления.уатРазделыПланирования.ЗаказыНаЖДПеревозки);
	КонецЕсли;
	ДанныеВыбора.Добавить(Перечисления.уатРазделыПланирования.РемонтыИТО);

КонецПроцедуры

#КонецОбласти
