////////////////////////////////////////////////////////////////////////////////
//МОДУЛЬ СОДЕРЖИТ ПРОЦЕДУРЫ И ФУНКЦИИ ПОДСИСТЕМЫ БП
//
////////////////////////////////////////////////////////////////////////////////


#Область СлужебныйПрограммныйИнтерфейс

// Формирует текст сообщения, подставляя значения
// параметров в шаблоны сообщений.
//
// Параметры
//  ВидПоля       - Строка - может принимать значения:
//                  Поле, Колонка, Список
//  ВидСообщения  - Строка - может принимать значения:
//                  Заполнение, Корректность
//  Параметр1     - Строка - имя поля
//  Параметр2     - Строка - номер строки
//  Параметр3     - Строка - имя списка
//  Параметр4     - Строка - текст сообщения о некорректности заполнения
//
// Возвращаемое значение:
//   Строка - текст сообщения
//
Функция ПолучитьТекстСообщения(ВидПоля = "Поле", ВидСообщения = "Заполнение",
	Параметр1 = "", Параметр2 = "",	Параметр3 = "", Параметр4 = "") Экспорт
	
	ТекстСообщения = "";
	
	Если ВРег(ВидПоля) = "ПОЛЕ" Тогда
		Если ВРег(ВидСообщения) = "ЗАПОЛНЕНИЕ" Тогда
			Шаблон = НСтр("en='Field ""% 1"" is empty';ru='Поле ""%1"" не заполнено'");
		ИначеЕсли ВРег(ВидСообщения) = "КОРРЕКТНОСТЬ" Тогда
			Шаблон = НСтр("en='Field ""%1"" is incorrect."
""
"%4';ru='Поле ""%1"" заполнено некорректно."
""
"%4'");
		КонецЕсли;
	ИначеЕсли ВРег(ВидПоля) = "КОЛОНКА" Тогда
		Если ВРег(ВидСообщения) = "ЗАПОЛНЕНИЕ" Тогда
			Шаблон = НСтр("en='Not filled column ''%1 '' in line %2 of list ""%3""';ru='Не заполнена колонка ""%1"" в строке %2 списка ""%3""'");
		ИначеЕсли ВРег(ВидСообщения) = "КОРРЕКТНОСТЬ" Тогда
			Шаблон = НСтр("en='Incomplete column ""%1"" in line %2 of list ""%3""."
""
"%4';ru='Некорректно заполнена колонка ""%1"" в строке %2 списка ""%3""."
""
"%4'");
		КонецЕсли;
	ИначеЕсли ВРег(ВидПоля) = "СПИСОК" Тогда
		Если ВРег(ВидСообщения) = "ЗАПОЛНЕНИЕ" Тогда
			Шаблон = НСтр("en='Not entered any line to list ""%3""';ru='Не введено ни одной строки в список ""%3""'");
		ИначеЕсли ВРег(ВидСообщения) = "КОРРЕКТНОСТЬ" Тогда
			Шаблон = НСтр("en='Incorrectly filled list ""%3""."
""
"%4';ru='Некорректно заполнен список ""%3""."
""
"%4'");
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон, Параметр1, Параметр2, Параметр3, Параметр4);

КонецФункции // ПолучитьТекстСообщения()

// Возвращает строковое представление предмета или массива предметов.
//
// Параметры:
//  Предмет - Строка - Параметры прописи предмета в представлении.
//  СигнатураПредмета - Строка - Подстрока, идентифицирующая начало строкового представления предмета.
//  ПервыйПредметСписка - Произвольный - Ссылка на первый предмет из списка, который будет выведен в представлении.
//  КоличествоПредметов - Число - Количество ссылок на предметы в списке.
//  ФорматнаяСтрока - Строка - Строка, определяющая параметры форматирования представления.
//
// Возвращаемое значение:
//  Строка - представление списка предметов.
//
Функция ПредставлениеСсылкиПредмета(Предмет, СигнатураПредмета, ПервыйПредметСписка, КоличествоПредметов, ФорматнаяСтрока = Неопределено) Экспорт
	
	Результат = "";
	
	Если Не ЗначениеЗаполнено(Предмет) Или Не ЗначениеЗаполнено(СигнатураПредмета)
		Или Не ЗначениеЗаполнено(ПервыйПредметСписка) Или Не ЗначениеЗаполнено(КоличествоПредметов) Тогда
		
		Возврат Результат;
		
	КонецЕсли;
	
	Если КоличествоПредметов = 1 Тогда
		Возврат Строка(ПервыйПредметСписка);
	КонецЕсли;
	
	Если ФорматнаяСтрока = Неопределено Тогда
		ФорматнаяСтрока  = "Л = ru_RU; ЧДЦ=0";
	КонецЕсли;
	
	ПрописьЧисла   = ЧислоПрописью(КоличествоПредметов, ФорматнаяСтрока, Предмет);
	ИндексПредмета = СтрНайти(ПрописьЧисла, СигнатураПредмета);
	ТекстПредметы = Строка(КоличествоПредметов) + " "
		+ Сред(ПрописьЧисла, ИндексПредмета, СтрДлина(ПрописьЧисла)- ИндексПредмета - 3);
		
	Результат = СтрШаблон(
		НСтр("ru = '%1 (%2 и еще %3)'; en = '%1 (%2 and %3 more)'"),
		ТекстПредметы, 
		Строка(ПервыйПредметСписка),
		КоличествоПредметов - 1);
		
	Возврат Результат;
	
КонецФункции

#КонецОбласти
