////////////////////////////////////////////////////////////////////////////////
// Управление автотранспортом.
// 
// Процедуры и функции общего назначения.
// 
// Содержит код, используемый в варианте поставке КОРП
////////////////////////////////////////////////////////////////////////////////


#Область СлужебныйПрограммныйИнтерфейс

#Область Уведомления

// Процедура преобразует запись регистра сведений "Очередь уведомлений" в документ, задачу или напоминание
Процедура ОбработатьУведомление(УведомлениеМенеджерЗаписи) Экспорт

	МодульРаботаСУведомлениями = ОбщегоНазначения.ОбщийМодуль("уатРаботаСУведомлениями_уэ");
	МодульРаботаСУведомлениями.ОбработатьУведомление(УведомлениеМенеджерЗаписи);
	
КонецПроцедуры

// Процедура создает запись регистра сведений "Очередь уведомлений"
Процедура СформироватьУведомление(Документ, Событие, ДополнительныеПараметры = Неопределено) Экспорт
	
	МодульРаботаСУведомлениями = ОбщегоНазначения.ОбщийМодуль("уатРаботаСУведомлениями_уэ");
	МодульРаботаСУведомлениями.СформироватьУведомление(Документ, Событие, ДополнительныеПараметры);	
	
КонецПроцедуры

// Процедура формирует сообщения по записям в регистре сведений "Очередь уведомлений".
// Вызывается регламентным заданием "Формирование и рассылка уведомлений по правилам".
Процедура РассылкаУведомлений() Экспорт
	
	МодульРаботаСУведомлениями = ОбщегоНазначения.ОбщийМодуль("уатРаботаСУведомлениями_уэ");
	МодульРаботаСУведомлениями.РассылкаУведомлений();
	
КонецПроцедуры

// Функция формирует список получателей уведомлений по документу
Функция СформироватьСписокПолучателейУведомлений(Документ, ТипДокумента = Неопределено) Экспорт
	
	МодульРаботаСУведомлениями = ОбщегоНазначения.ОбщийМодуль("уатРаботаСУведомлениями_уэ");
	Возврат МодульРаботаСУведомлениями.СформироватьСписокПолучателейУведомлений(Документ, ТипДокумента);
	
КонецФункции

#КонецОбласти

#КонецОбласти
