
#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	НастройкиКомпоновщикаНастроек = КомпоновщикНастроек.ПолучитьНастройки();
	НастройкаСценарий = НастройкиКомпоновщикаНастроек.ПараметрыДанных.Элементы.Найти("Сценарий");
	Если НастройкаСценарий <> Неопределено И НастройкаСценарий.Использование Тогда
		Сценарий = НастройкаСценарий.Значение;
	Иначе
		Сценарий = Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Сценарий) Тогда
		ХарактеристикиСценария = уатОбщегоНазначения_проф.ЗаполнитьХарактеристикиСценария(Сценарий);
		УдалитьЛишниеГруппировки(КомпоновщикНастроек.Настройки.Структура, ХарактеристикиСценария);
		УдалитьЛишниеПоля(КомпоновщикНастроек.Настройки.Выбор, ХарактеристикиСценария);
		УстановитьЗаголовкиПолей(КомпоновщикНастроек.Настройки.УсловноеОформление, ХарактеристикиСценария);
	КонецЕсли;
	
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Процедура УдалитьЛишниеГруппировки(Структура, ХарактеристикиСценария)
	
	Для Каждого ЭлементСтруктуры Из Структура Цикл
		Для Каждого ЭлементГруппировки Из ЭлементСтруктуры.ПоляГруппировки.Элементы Цикл
			Если ТипЗнч(ЭлементГруппировки) = Тип("ПолеГруппировкиКомпоновкиДанных")
				И Строка(ЭлементГруппировки.Поле) = "Маршрут"
				И Не ХарактеристикиСценария.флМаршрут Тогда
				ЭлементГруппировки.Использование = Ложь;
			ИначеЕсли ТипЗнч(ЭлементГруппировки) = Тип("ПолеГруппировкиКомпоновкиДанных")
				И Строка(ЭлементГруппировки.Поле) = "ВидПеревозки"
				И Не ХарактеристикиСценария.флВидПеревозки Тогда
				ЭлементГруппировки.Использование = Ложь;
			ИначеЕсли ТипЗнч(ЭлементГруппировки) = Тип("ПолеГруппировкиКомпоновкиДанных")
				И Строка(ЭлементГруппировки.Поле) = "ОбъектСтроительства"
				И Не ХарактеристикиСценария.флОбъектСтроительства Тогда
				ЭлементГруппировки.Использование = Ложь;
			ИначеЕсли ТипЗнч(ЭлементГруппировки) = Тип("ПолеГруппировкиКомпоновкиДанных")
				И Строка(ЭлементГруппировки.Поле) = "НаправлениеПеревозки"
				И Не ХарактеристикиСценария.флНаправлениеПеревозки Тогда
				ЭлементГруппировки.Использование = Ложь;
			ИначеЕсли ТипЗнч(ЭлементГруппировки) = Тип("ПолеГруппировкиКомпоновкиДанных")
				И Строка(ЭлементГруппировки.Поле) = "ВидТС"
				И Не ХарактеристикиСценария.флТС Тогда
				ЭлементГруппировки.Использование = Ложь;
			КонецЕсли;
		КонецЦикла;
		УдалитьЛишниеГруппировки(ЭлементСтруктуры.Структура, ХарактеристикиСценария);
	КонецЦикла;
	
КонецПроцедуры

Процедура УдалитьЛишниеПоля(Выбор, ХарактеристикиСценария)
	
	Для Каждого ЭлементВыбора Из Выбор.Элементы Цикл
		Если ТипЗнч(ЭлементВыбора) = Тип("ВыбранноеПолеКомпоновкиДанных")
			И Строка(ЭлементВыбора.Поле) = "КоличествоВыработкаПлан"
			И ХарактеристикиСценария.ПланированиеОбъемовВПроцентах Тогда
			ЭлементВыбора.Использование = Ложь;
		ИначеЕсли ТипЗнч(ЭлементВыбора) = Тип("ВыбранноеПолеКомпоновкиДанных")
			И Строка(ЭлементВыбора.Поле) = "РасхождениеВыработки"
			И ХарактеристикиСценария.ПланированиеОбъемовВПроцентах Тогда
			ЭлементВыбора.Использование = Ложь;
		ИначеЕсли
			ТипЗнч(ЭлементВыбора) = Тип("ВыбранноеПолеКомпоновкиДанных")
			И Строка(ЭлементВыбора.Поле) = "ПроцентКоличествоВыработкаПлан"
			И Не ХарактеристикиСценария.ПланированиеОбъемовВПроцентах Тогда
			ЭлементВыбора.Использование = Ложь;
		ИначеЕсли ТипЗнч(ЭлементВыбора) = Тип("ВыбранноеПолеКомпоновкиДанных")
			И Строка(ЭлементВыбора.Поле) = "РасхождениеВыработкиПроцент"
			И Не ХарактеристикиСценария.ПланированиеОбъемовВПроцентах Тогда
			ЭлементВыбора.Использование = Ложь;
		КонецЕсли;
		
		Если ТипЗнч(ЭлементВыбора) = Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда
			УдалитьЛишниеПоля(ЭлементВыбора, ХарактеристикиСценария)
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьЗаголовкиПолей(УсловноеОформление, ХарактеристикиСценария)
	
	Если ХарактеристикиСценария.флМаршрут Тогда
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		ЭлементУсловногоОформления.ИспользоватьВОбщемИтоге               = ИспользованиеУсловногоОформленияКомпоновкиДанных.НеИспользовать;
		ЭлементУсловногоОформления.ИспользоватьВГруппировке              = ИспользованиеУсловногоОформленияКомпоновкиДанных.НеИспользовать;
		ЭлементУсловногоОформления.ИспользоватьВЗаголовке                = ИспользованиеУсловногоОформленияКомпоновкиДанных.НеИспользовать;
		ЭлементУсловногоОформления.ИспользоватьВЗаголовкеПолей           = ИспользованиеУсловногоОформленияКомпоновкиДанных.Использовать;
		ЭлементУсловногоОформления.ИспользоватьВИерархическойГруппировке = ИспользованиеУсловногоОформленияКомпоновкиДанных.НеИспользовать;
		ЭлементУсловногоОформления.ИспользоватьВОтборе                   = ИспользованиеУсловногоОформленияКомпоновкиДанных.НеИспользовать;
		ЭлементУсловногоОформления.ИспользоватьВПараметрах               = ИспользованиеУсловногоОформленияКомпоновкиДанных.НеИспользовать;
		
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", Строка(ХарактеристикиСценария.ВариантАналитикиМаршрут));
		ПолеОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("Маршрут");
		
	КонецЕсли;
	
	Если ХарактеристикиСценария.флТС Тогда
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		ЭлементУсловногоОформления.ИспользоватьВОбщемИтоге               = ИспользованиеУсловногоОформленияКомпоновкиДанных.НеИспользовать;
		ЭлементУсловногоОформления.ИспользоватьВГруппировке              = ИспользованиеУсловногоОформленияКомпоновкиДанных.НеИспользовать;
		ЭлементУсловногоОформления.ИспользоватьВЗаголовке                = ИспользованиеУсловногоОформленияКомпоновкиДанных.НеИспользовать;
		ЭлементУсловногоОформления.ИспользоватьВЗаголовкеПолей           = ИспользованиеУсловногоОформленияКомпоновкиДанных.Использовать;
		ЭлементУсловногоОформления.ИспользоватьВИерархическойГруппировке = ИспользованиеУсловногоОформленияКомпоновкиДанных.НеИспользовать;
		ЭлементУсловногоОформления.ИспользоватьВОтборе                   = ИспользованиеУсловногоОформленияКомпоновкиДанных.НеИспользовать;
		ЭлементУсловногоОформления.ИспользоватьВПараметрах               = ИспользованиеУсловногоОформленияКомпоновкиДанных.НеИспользовать;
		
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", Строка(ХарактеристикиСценария.ВариантАналитикиТС));
		ПолеОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ВидТС");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
