#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Задает настройки размещения вариантов отчетов в панели отчетов.
// См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//
// Параметры:
//   Настройки - Коллекция - Используется для описания настроек отчетов и вариантов
//       см. описание к ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//   НастройкиОтчета - СтрокаДереваЗначений - Настройки размещения всех вариантов отчета.
//       см. ""Реквизиты для изменения"" функции ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "РасшифровкаФормулыБюджетногоОтчета");
	НастройкиВарианта.ВидимостьПоУмолчанию = Ложь;
	
КонецПроцедуры

// Вызывается при создании формы отчета на сервере.
//
// Параметры:
//  Форма				 - 	 - 
//  Отказ				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	ДополнительныеСвойства = Новый Структура();
	Для Каждого КлючИЗначение из Форма.Параметры.ХранимыеПараметрыОтчета Цикл
		ДополнительныеСвойства.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	
	АдресПараметровОтчета = ПоместитьВоВременноеХранилище(ДополнительныеСвойства, Форма.УникальныйИдентификатор);
	
	РеквизитФормы = Новый РеквизитФормы("АдресПараметровОтчета", Новый ОписаниеТипов("Строка"));
	МассивДобавления = Новый Массив;
	МассивДобавления.Добавить(РеквизитФормы);
	Форма.ИзменитьРеквизиты(МассивДобавления);
	
	Форма.АдресПараметровОтчета = АдресПараметровОтчета;
	
КонецПроцедуры

// Вызывается в одноименном обработчике формы отчета после выполнения кода формы.
//  
//  Подробнее - см. ФормаОтчетаПереопределяемый.ПередЗагрузкойВариантаНаСервере
//
// Параметры:
//  ЭтаФорма		 - 	 - 
//  НовыеНастройкиКД - 	 - 
//
Процедура ПередЗагрузкойВариантаНаСервере(ЭтаФорма, НовыеНастройкиКД) Экспорт
	
	Отчет = ЭтаФорма.Отчет;
	КомпоновщикНастроек = Отчет.КомпоновщикНастроек;
	НовыеНастройкиКД = КомпоновщикНастроек.Настройки;
	НовыеНастройкиКД.ДополнительныеСвойства.Вставить("АдресПараметровОтчета", ЭтаФорма.АдресПараметровОтчета);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли