
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений();
	ДанныеВыбора.Добавить(Перечисления.уатПредметыДоговоровКонтрагентов.Перевозка);
	Если уатОбщегоНазначенияПовтИсп.ВариантПоставкиТакси() Тогда
		Если ПолучитьФункциональнуюОпцию("такИспользоватьЗаказыТакси") Тогда
			ДанныеВыбора.Добавить(Перечисления.уатПредметыДоговоровКонтрагентов.Такси);
		КонецЕсли;
		Если ПолучитьФункциональнуюОпцию("такИспользоватьАрендуТС") Тогда
			ДанныеВыбора.Добавить(Перечисления.уатПредметыДоговоровКонтрагентов.Аренда);
		КонецЕсли; 
	КонецЕсли; 
	ДанныеВыбора.Добавить(Перечисления.уатПредметыДоговоровКонтрагентов.ПрочиеУслуги);
	
КонецПроцедуры
