#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция Прочитать(ВидНастройки, УзелИнтеграции = Неопределено) Экспорт
	
	ИдентификаторБазы = ИдентификаторТекущейБазы();
	Настройки = РегистрыСведений.GDS_НастройкиВнешнихСоединений.Прочитать(ИдентификаторБазы, ВидНастройки, УзелИнтеграции);
	
	Возврат Настройки;
	
КонецФункции

Функция СтрокаСоединенияТекущейБазы() Экспорт
	
	Возврат СтрокаСоединенияИнформационнойБазы();
	
КонецФункции

Функция ИдентификаторТекущейБазы() Экспорт
	
	Возврат ХэшСтроки(СтрокаСоединенияИнформационнойБазы());
	
КонецФункции

Функция ХэшСтроки(ИсходнаяСтрока) Экспорт
	
	НормализованнаяСтрока = НормализоватьСтроку(ИсходнаяСтрока);
	
	Хеширование = Новый ХешированиеДанных(ХешФункция.MD5);
	Хеширование.Добавить(ПолучитьДвоичныеДанныеИзСтроки(НормализованнаяСтрока));
	
	Возврат СтрЗаменить(Хеширование.ХешСумма, " ", "");
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НормализоватьСтроку(ИсходнаяСтрока)
	
	Если ИсходнаяСтрока = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	НормализованнаяСтрока = НРег(СокрЛП(Строка(ИсходнаяСтрока)));
	НормализованнаяСтрока = СтрЗаменить(НормализованнаяСтрока, Символы.Таб, "");
	НормализованнаяСтрока = СтрЗаменить(НормализованнаяСтрока, Символы.ПС, "");
	НормализованнаяСтрока = СтрЗаменить(НормализованнаяСтрока, Символы.ВК, "");
	НормализованнаяСтрока = СтрЗаменить(НормализованнаяСтрока, " ", "");
	
	Возврат НормализованнаяСтрока;
	
КонецФункции

#КонецОбласти

#КонецЕсли
