
#Область СлужебныйПрограммныйИнтерфейс

Процедура СоздатьСоединение(Логин, Пароль, ЭтотОбъект) Экспорт
	
	Если Не ЗначениеЗаполнено(Логин) Тогда
		ТекстОшибки = НСтр("ru = 'Заполните логин'; en = 'Fill in your login'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецЕсли; 
	Если Не ЗначениеЗаполнено(Пароль) Тогда
		ТекстОшибки = НСтр("ru = 'Заполните пароль'; en = 'Fill in the password'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецЕсли;

	ОбработчикиСокета = Новый ОбработчикиWebSocketКлиентСоединения;
	ОбработчикиСокета.Модуль = ЭтотОбъект;
	ОбработчикиСокета.ОбработчикОткрытияСоединения = "ВебСокет_ОбработчикОткрытия";
	ОбработчикиСокета.ОбработчикЗакрытияСоединения = "ВебСокет_ОбработчикЗакрытия";
	ОбработчикиСокета.ОбработчикПолученияСообщения = "ВебСокет_ОбработчикПолученияСообщения";
	ОбработчикиСокета.ОбработчикОшибки             = "ВебСокет_ОбработчикОшибки";  
	
	ПараметрыСоединения = Новый ПараметрыWebSocketКлиентСоединения; 
	ПараметрыСоединения.Пользователь = Логин;
	ПараметрыСоединения.Пароль       = Пароль;  
	

	ПараметрыСоединенияЗаголовки = уатМобильноеПриложениеВодителяСерверREST.ЗаполнитьЗаголовкиПодключения(); 
	ПараметрыСоединения.Заголовки.Вставить("InfoBaseConnection", ПараметрыСоединенияЗаголовки.InfoBaseConnection);
	ПараметрыСоединения.Заголовки.Вставить("InfoBaseID",         ПараметрыСоединенияЗаголовки.InfoBaseID);
	ПараметрыСоединения.Заголовки.Вставить("ServerIP",           ПараметрыСоединенияЗаголовки.ServerIP);
	
	WebSocketКлиентСоединения.ОткрытьСоединение("ВодительУАТ_ApiKey", уатМобильноеПриложениеВодителяСерверREST.ПолучитьURLСервера(), ОбработчикиСокета, ПараметрыСоединения); 
	
КонецПроцедуры

Процедура ЗакрытьСоединение() Экспорт
	
	ВебСокет = WebSocketКлиентСоединения.ПолучитьСоединение("ВодительУАТ_ApiKey"); 
	Если ВебСокет = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ВебСокет.Закрыть();
	
КонецПроцедуры

Функция ПриПолученииСообщенияАвторизации(Соединение, Сообщение, ЭтоОшибка = Ложь) Экспорт
	
	Список_keys = Новый СписокЗначений();
	
	Попытка
		Response = уатМобильноеПриложениеВодителяСервер.СтрокуJSONВЗначение(Сообщение);
	Исключение
		Параметры = ПараметрыСоединения(Соединение); 
		Параметры.Вставить("Сообщение" ,Сообщение); 
		Параметры.Вставить("Описание",  "ApiKeys");
		Параметры.Вставить("Команда",   "ApiKeys");
		
		Логин = "";
		уатМобильноеПриложениеВодителяСерверREST.ЗаписатьВЛог("ПриПолученииСообщения", Соединение.Ключ, Логин, Параметры);
		
		ЭтоОшибка = Истина;
		Возврат Список_keys;
	КонецПопытки;  
	
	Параметры = ПараметрыСоединения(Соединение); 
	Параметры.Вставить("Сообщение" ,Сообщение); 
	Параметры.Вставить("Описание",  "ApiKeys");
	Параметры.Вставить("Команда",   "ApiKeys");
	
	Логин = "";
	уатМобильноеПриложениеВодителяСерверREST.ЗаписатьВЛог("ПриПолученииСообщения", Соединение.Ключ, Логин, Параметры);
	
	api_keys = Response.Получить("api_keys"); 
	Если ТипЗнч(api_keys) = Тип("Массив") Тогда
		Для Каждого ТекСтрока Из api_keys Цикл 
			api_key = ТекСтрока.Получить("api_key");
			info_base_connection = ТекСтрока.Получить("info_base_connection");
			
			Список_keys.Добавить(ТекСтрока.Получить("api_key"), api_key + ?(ЗначениеЗаполнено(info_base_connection),
			" " + "(" + info_base_connection + ")", ""));
			
		КонецЦикла;
	Конецесли;
	Возврат Список_keys;
КонецФункции

Функция ПараметрыСоединения(Соединение) Экспорт
	
	СтруктураСоединение = Новый Структура;
	СтруктураСоединение.Вставить("URLСервера", Соединение.URLСервера);
	СтруктураСоединение.Вставить("ИмяПользователяИнформационнойБазы", Соединение.ИмяПользователяИнформационнойБазы);  
	СтруктураСоединение.Вставить("ОбработчикЗакрытияСоединения", Соединение.Обработчики.ОбработчикЗакрытияСоединения); 
	СтруктураСоединение.Вставить("ОбработчикОткрытияСоединения", Соединение.Обработчики.ОбработчикОткрытияСоединения); 
	СтруктураСоединение.Вставить("ОбработчикОшибки", Соединение.Обработчики.ОбработчикОшибки); 
	СтруктураСоединение.Вставить("ОбработчикПолученияСообщения", Соединение.Обработчики.ОбработчикПолученияСообщения); 

	СоединениеJSON = уатМобильноеПриложениеВодителяСерверREST.ЗаписатьДанныеВJSON(,СтруктураСоединение).Результат;
	
	Параметры = Новый Структура;
	Параметры.Вставить("Соединение",СоединениеJSON);
	Возврат Параметры;
	
КонецФункции


#КонецОбласти