
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ИспользоватьВыходы") Тогда
		ИспользоватьВыходы = Параметры.ИспользоватьВыходы;
	КонецЕсли;
	Параметры.Свойство("Маршрут", Маршрут);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Если Не ИспользоватьВыходы Тогда
		ЭлементДляУдаления = ПроверяемыеРеквизиты.Найти("Выход");
		Если ЭлементДляУдаления <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ЭлементДляУдаления);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОсновныеДействияФормыОК(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	РезультатЗакрытия = Новый Структура("Выход, ДнейДоОтправления, ДнейВПути, FTL");
	ЗаполнитьЗначенияСвойств(РезультатЗакрытия, ЭтаФорма);
	Закрыть(РезультатЗакрытия);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимость()
	Элементы.Выход.Видимость = ИспользоватьВыходы;
	Элементы.FTL.Видимость = уатОбщегоНазначенияПовтИсп.ВариантПоставкиКОРП();
КонецПроцедуры

#КонецОбласти
