
#Область ПрограммныйИнтерфейс

Процедура ПриПолученииСообщения(Соединение, Сообщение)
	
	Если СтрНайти(Сообщение, "status 40") <> 0 Тогда // Ошибка
		Параметры = уатМобильноеПриложениеВодителяСерверREST.ПараметрыСоединения(Соединение); 
		уатМобильноеПриложениеВодителяСерверREST.ЗаписатьВЛог("ПриОшибке",Соединение.Ключ,Параметры);
		
		КодОшибки      = Сред(Сообщение, СтрНайти(Сообщение, "400"), 4);
		ОписаниеОшибки = уатМобильноеПриложениеВодителяСерверПовтИсп.ПолучитьОписаниеКодаОшибкиПодключенияWebSocket(КодОшибки);
		Если ОписаниеОшибки = Неопределено Тогда 
			ОписаниеОшибки = Сообщение; // Неопределенная ошибка
		КонецЕсли;
		уатМобильноеПриложениеВодителяСерверREST.СохранитьСообщенияОбОшибках(ОписаниеОшибки);

	Иначе
		МассивПараметров = Новый Массив;
		МассивПараметров.Добавить(Соединение);
		МассивПараметров.Добавить(Сообщение);
		МассивПараметров.Добавить(ТекущаяУниверсальнаяДатаВМиллисекундах());
		ФЗ = ФоновыеЗадания.Выполнить("уатМобильноеПриложениеВодителяСерверREST.ПриПолученииСообщения", МассивПараметров);
	КонецЕсли;

КонецПроцедуры

Процедура ПередПодключением(Клиент)
	
	уатМобильноеПриложениеВодителяСерверREST.СохранитьСообщенияОбОшибках("");

	стрНастроек = уатМобильноеПриложениеВодителяСерверПовтИсп.ПолучитьНастройкиМобильногоПриложения();
	
	Клиент.ИмяПользователяИнформационнойБазы = стрНастроек.ИмяПользователяИнформационнойБазы; 
	Клиент.ПараметрыСоединения.Пользователь = стрНастроек.ЛогинОблачногоСервера;
	Клиент.ПараметрыСоединения.Пароль       = стрНастроек.ПарольОблачногоСервера;
	Клиент.ПараметрыСоединения.Заголовки.Вставить("ApiKey",             уатМобильноеПриложениеВодителяСерверREST.ЗакодироватьЗаголовокПодключения(стрНастроек.ApiKey)); 
	ПараметрыСоединенияЗаголовки = уатМобильноеПриложениеВодителяСерверREST.ЗаполнитьЗаголовкиПодключения(); 
	Клиент.ПараметрыСоединения.Заголовки.Вставить("InfoBaseConnection", ПараметрыСоединенияЗаголовки.InfoBaseConnection);
	Клиент.ПараметрыСоединения.Заголовки.Вставить("InfoBaseID",         ПараметрыСоединенияЗаголовки.InfoBaseID);
	Клиент.ПараметрыСоединения.Заголовки.Вставить("ServerIP",           ПараметрыСоединенияЗаголовки.ServerIP);
	Если стрНастроек.ChangeApiKey Тогда
		Клиент.ПараметрыСоединения.Заголовки.Вставить("Change-Api-Key", Истина);
	КонецЕсли;

	Параметры = уатМобильноеПриложениеВодителяСерверREST.ПараметрыКлиента(Клиент);
	уатМобильноеПриложениеВодителяСерверREST.ЗаписатьВЛог("ПередПодключением",Клиент.Ключ,, Параметры);
	
КонецПроцедуры   

Процедура ПриОткрытииСоединения(Соединение)    
	
	Параметры = уатМобильноеПриложениеВодителяСерверREST.ПараметрыСоединения(Соединение);
	уатМобильноеПриложениеВодителяСерверREST.ЗаписатьВЛог("ПриОткрытииСоединения",Соединение.Ключ,, Параметры);
	
	уатМобильноеПриложениеВодителяСерверREST.ОтправитьСообщение("getUsers");
	
КонецПроцедуры

Процедура ПриОшибке(Соединение, КодОшибки, Описание)
	Параметры = уатМобильноеПриложениеВодителяСерверREST.ПараметрыСоединения(Соединение); 
	Параметры.Вставить("Код",КодОшибки);
	Параметры.Вставить("Описание",Описание);
	уатМобильноеПриложениеВодителяСерверREST.ЗаписатьВЛог("ПриОшибке",Соединение.Ключ,, Параметры); 
	
	СообщенияОбОшибках = ХранилищеОбщихНастроек.Загрузить("уатВодительУАТ", "СообщенияОбОшибках",, "уатВодительУАТ");
	Если НЕ ЗначениеЗаполнено(СообщенияОбОшибках) Тогда  
		уатМобильноеПриложениеВодителяСерверREST.СохранитьСообщенияОбОшибках(КодОшибки + " " + Описание);
	КонецЕсли;
	
КонецПроцедуры 

Процедура ПриЗакрытииСоединения(Соединение, КодЗакрытия)
	Параметры = уатМобильноеПриложениеВодителяСерверREST.ПараметрыСоединения(Соединение); 
	Параметры.Вставить("Код",КодЗакрытия);
	уатМобильноеПриложениеВодителяСерверREST.ЗаписатьВЛог("ПриЗакрытииСоединения",Соединение.Ключ,,Параметры);
КонецПроцедуры   

#КонецОбласти

