
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	уатЗащищенныеФункцииСервер.уатСправочникФормаЭлементаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, Объект, ЭтотОбъект, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	Элементы.ТитулОформлениеВидКоммерческойПеревозки.Видимость = Объект.ВидПеревозкиДляЭПЛ = "КП";
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	уатЗащищенныеФункцииКлиент.уатСправочникФормаЭлементаПриОткрытии(Отказ, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидПеревозкиДляЭПЛПриИзменении(Элемент) 
	Объект.ТипПеревозки = "";
	Элементы.ТитулОформлениеВидКоммерческойПеревозки.Видимость = Объект.ВидПеревозкиДляЭПЛ = "КП";
КонецПроцедуры

#КонецОбласти
