
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	уатЗащищенныеФункцииСервер.уатСправочникФормаСпискаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	Элементы.ФормаЗаполнитьПоКлассификатору.Доступность = ПолучитьФункциональнуюОпцию("уатИспользоватьЖДПеревозки");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	уатЗащищенныеФункцииКлиент.уатСправочникФормаСпискаПриОткрытии(Отказ, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьПоКлассификатору(Команда)
	ЗаполнитьПоКлассификаторуНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПоКлассификаторуНаСервере()
	
	Макет = Справочники.уатКодыЕТСНГ.ПолучитьМакет("КлассификаторыЕТСНГ");
	
	ТабЗначений = Новый ТаблицаЗначений;
	
	ПоследняяСтрока = Макет.ВысотаТаблицы;
	ПоследняяКолонка = Макет.ШиринаТаблицы;
	
	ОбластьЯчеек = Макет.Область(1, 1, ПоследняяСтрока, ПоследняяКолонка); 
	ИсточникДанных = Новый ОписаниеИсточникаДанных(ОбластьЯчеек);  
	ПостроительОтчета = Новый ПостроительОтчета; 
	ПостроительОтчета.ИсточникДанных = ИсточникДанных;
	ПостроительОтчета.Выполнить();
	
	ТабЗначений = ПостроительОтчета.Результат.Выгрузить();
	
	Запрос = Новый Запрос;

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КодыЕТСНГ.Код КАК Код
	|ИЗ
	|	Справочник.уатКодыЕТСНГ КАК КодыЕТСНГ
	|ГДЕ
	|	НЕ КодыЕТСНГ.ПометкаУдаления";
	Выгрузка = Запрос.Выполнить().Выгрузить();
	
	Для каждого Строка Из ТабЗначений Цикл
		Если Выгрузка.Найти(Строка.КодЕТСНГ, "Код") = Неопределено Тогда
			НовыйЕТСНГ = Справочники.уатКодыЕТСНГ.СоздатьЭлемент();
			НовыйЕТСНГ.Заполнить(Неопределено);
			НовыйЕТСНГ.Код = Строка.КодЕТСНГ;
			НовыйЕТСНГ.Наименование = Строка.НаименованиеГрузаПоЕТСНГ;
			НовыйЕТСНГ.ТарифныйКласс = Строка.КлассГруза;
			НовыйЕТСНГ.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти