#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура Записать(ДанныеЗаписи) Экспорт
	
	Запись = СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Запись, ДанныеЗаписи);
	Запись.ДатаОбновления = ТекущаяДатаСеанса();
	Запись.Записать(Истина);
	
КонецПроцедуры

Функция Текущая(Объект) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Объект", Объект);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	GDS_ОбработкаВДокументообороте.Объект КАК Объект,
	|	GDS_ОбработкаВДокументообороте.ТочкаМаршрута КАК ТочкаМаршрута,
	|	GDS_ОбработкаВДокументообороте.Дата КАК Дата,
	|	GDS_ОбработкаВДокументообороте.Выполнено КАК Выполнено,
	|	GDS_ОбработкаВДокументообороте.Комментарий КАК Комментарий,
	|	GDS_ОбработкаВДокументообороте.Исполнитель КАК Исполнитель,
	|	GDS_ОбработкаВДокументообороте.Результат КАК Результат,
	|	GDS_ОбработкаВДокументообороте.Отправлено КАК Отправлено,
	|	GDS_ОбработкаВДокументообороте.Порядок КАК Порядок
	|ИЗ
	|	РегистрСведений.GDS_ОбработкаВДокументообороте КАК GDS_ОбработкаВДокументообороте
	|ГДЕ
	|	GDS_ОбработкаВДокументообороте.Объект = &Объект";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура Очистить(Объект) Экспорт
	
	Записи = СоздатьНаборЗаписей();
	Записи.Отбор.Объект.Установить(Объект);
	Записи.Прочитать();
	Записи.Очистить();
	Записи.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
