
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьМногооборотнуюТару") Тогда
		
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = Новый СписокЗначений();
		Для Каждого ТекЭлемент Из Перечисления.ТипыНоменклатуры Цикл
			Если ТекЭлемент <> Перечисления.ТипыНоменклатуры.МногооборотнаяТара Тогда
				ДанныеВыбора.Добавить(ТекЭлемент);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
