#Область СлужебныйПрограммныйИнтерфейс

// Выполняет заполнение предопределенных элементов справочника
//
Процедура ЗаполнитьПредопределенныеДанные() Экспорт
	Макет = Справочники.уатВидыДокументов.ПолучитьМакет("НастройкиПредопределенныхЭлементов");
	
	ВидДокумента = Справочники.уатВидыДокументов.УдостоверениеВодителя;
	Если НЕ ВидДокумента.УчетКатегорий Тогда
		ВидДокументаОбъект = ВидДокумента.ПолучитьОбъект();
		ВидДокументаОбъект.УчетКатегорий = Истина;
		
		ОбластьНастроек = Макет.ПолучитьОбласть("УдостоверениеВодителя");
		Для НомерСтроки = 1 По ОбластьНастроек.ВысотаТаблицы Цикл
			НаименованиеКатегории = СокрЛП(ОбластьНастроек.Область(НомерСтроки, 1, НомерСтроки, 1).Текст);
			ОписаниеКатегории     = СокрЛП(ОбластьНастроек.Область(НомерСтроки, 2, НомерСтроки, 2).Текст);
			
			Категория = Справочники.уатКатегорииДокументов.НайтиПоНаименованию(НаименованиеКатегории);
			Если НЕ ЗначениеЗаполнено(Категория) Тогда
				НоваяКатегория = Справочники.уатКатегорииДокументов.СоздатьЭлемент();
				НоваяКатегория.Владелец     = ВидДокумента;
				НоваяКатегория.Наименование = НаименованиеКатегории;
				НоваяКатегория.Описание     = ОписаниеКатегории;
				НоваяКатегория.УстановитьНовыйКод();
				НоваяКатегория.Записать();
				Категория = НоваяКатегория.Ссылка;
			КонецЕсли;
			
			НоваяСтрока = ВидДокументаОбъект.Категории.Добавить();
			НоваяСтрока.Категория = Категория;
			
			ВидДокументаОбъект.Записать();
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
