	
#Область Переменные_Формы

&НаКлиенте
Перем СоответвиеКоодинат;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка);
	Группа = "компании";
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ уатОбщегоНазначенияПовтИсп.ВариантПоставкиКОРП() Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("en = 'Недоступно в текущей версии программы.'; ru = 'Недоступно в текущей версии программы.'"), 10);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	СоответвиеКоодинат = Новый Соответствие;
	ОбновитьСписокГеозон(СоответвиеКоодинат);
	Если СписокГеозон.Количество() <> 0 Тогда
		МассивГеозон = СписокГеозон.НайтиСтроки(Новый Структура("Группа", Группа));
		Если МассивГеозон.Количество() <> 0 Тогда
			Элементы.СписокГеозон.ТекущаяСтрока = МассивГеозон[0].ПолучитьИдентификатор();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

&НаКлиенте
Процедура СписокГеозонВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекГеозона = Элементы.СписокГеозон.ТекущиеДанные;
	Если Поле = Элементы.СписокГеозонФлагВыбора Тогда
		ТекГеозона.ФлагВыбора = НЕ ТекГеозона.ФлагВыбора;
	Иначе
		ДанныеГеозоны = Новый Структура("Группа,Идентификатор,Номер,Цвет,Координаты");
		ЗаполнитьЗначенияСвойств(ДанныеГеозоны, ТекГеозона);
		ТекКоординаты = СоответвиеКоодинат.Получить(ДанныеГеозоны.Идентификатор);
		Если ТекКоординаты = Неопределено Тогда
			ТекКоординаты = Новый Массив();
		КонецЕсли;
		ДанныеГеозоны.Координаты = ТекКоординаты;
		
		МассивГеозон = Новый Массив();
		МассивГеозон.Добавить(ДанныеГеозоны);
		
		Закрыть(МассивГеозон);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ГруппаПриИзменении(Элемент)
	Если СписокГеозон.Количество() <> 0 Тогда
		МассивГеозон = СписокГеозон.НайтиСтроки(Новый Структура("Группа", Группа));
		Если МассивГеозон.Количество() <> 0 Тогда
			Элементы.СписокГеозон.ТекущаяСтрока = МассивГеозон[0].ПолучитьИдентификатор();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти 


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Загрузить(Команда)
	
	СтрокиГеозон = СписокГеозон.НайтиСтроки(Новый Структура("ФлагВыбора", 1));
	
	МассивГеозон = Новый Массив();
	Для Каждого ТекГеозона Из СтрокиГеозон Цикл
		ДанныеГеозоны = Новый Структура("Группа,Идентификатор,Номер,Цвет,Координаты");
		ЗаполнитьЗначенияСвойств(ДанныеГеозоны, ТекГеозона);
		ТекКоординаты = СоответвиеКоодинат.Получить(ДанныеГеозоны.Идентификатор);
		Если ТекКоординаты = Неопределено Тогда
			ТекКоординаты = Новый Массив();
		КонецЕсли;
		ДанныеГеозоны.Координаты = ТекКоординаты;
		МассивГеозон.Добавить(ДанныеГеозоны);
	КонецЦикла;
	Закрыть(МассивГеозон);

КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьСписокГеозон(СоответвиеКоодинат);
	Если СписокГеозон.Количество() <> 0 Тогда
		МассивГеозон = СписокГеозон.НайтиСтроки(Новый Структура("Группа", Группа));
		Если МассивГеозон.Количество() <> 0 Тогда
			Элементы.СписокГеозон.ТекущаяСтрока = МассивГеозон[0].ПолучитьИдентификатор();
		КонецЕсли;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда) 
	СтрокиГеозон = СписокГеозон.НайтиСтроки(Новый Структура("Группа", Группа));
	Для Каждого ТекГеозона Из СтрокиГеозон Цикл
		ТекГеозона.ФлагВыбора = 1;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсеОтметки(Команда) 
	Для Каждого ТекГеозона Из СписокГеозон Цикл
		ТекГеозона.ФлагВыбора = 0;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьСписокГеозон(СоответвиеКоодинат)  
	СписокГеозон.Очистить();
	СоответвиеКоодинат = Новый Соответствие();
	
	ТекстОшибки    = "";
	ОМ_уатВнешнийМаршрутизаторСервер_уэ = ОбщегоНазначения.ОбщийМодуль("уатВнешнийМаршрутизаторСервер_уэ");
	МассивГеозон = ОМ_уатВнешнийМаршрутизаторСервер_уэ.ПолучитьСписокГеозон(ТекстОшибки);
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	КонецЕсли;
		
	Для Каждого ТекГеозона Из МассивГеозон Цикл
		НоваяСтрока = СписокГеозон.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекГеозона); 
		НоваяСтрока.Геозона = Справочники.уатГеозоны_уэ.НайтиПоРеквизиту("НомерЯндекс", ТекГеозона.Номер);
		СоответвиеКоодинат.Вставить(НоваяСтрока.Идентификатор, ТекГеозона.Координаты);
	КонецЦикла;
	РаскраситьСписокЗон();
КонецПроцедуры

&НаСервере
Процедура РаскраситьСписокЗон()
	
	СписокУдаляемыхЭлементов = Новый СписокЗначений;
	Для Каждого ЭлементУсловногоОформления Из УсловноеОформление.Элементы Цикл
		Если ЭлементУсловногоОформления.ИдентификаторПользовательскойНастройки = "Предустановленный"
			И ЗначениеЗаполнено(ЭлементУсловногоОформления.ИдентификаторПользовательскойНастройки) Тогда
			СписокУдаляемыхЭлементов.Добавить(ЭлементУсловногоОформления);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Элемент Из СписокУдаляемыхЭлементов Цикл
		УсловноеОформление.Элементы.Удалить(Элемент.Значение);
	КонецЦикла;
	
	Для Каждого ТекСтрока Из СписокГеозон Цикл
		Если ЗначениеЗаполнено(ТекСтрока.Цвет) Тогда
			Красный = ЧислоИзШестнадцатеричнойСтроки("0x" + Сред(ТекСтрока.Цвет, 2, 2)); 	
			Зеленый = ЧислоИзШестнадцатеричнойСтроки("0x" + Сред(ТекСтрока.Цвет, 4, 2));
			Синий   = ЧислоИзШестнадцатеричнойСтроки("0x" + Сред(ТекСтрока.Цвет, 6, 2)); 
		Иначе
			Красный = 0;
			Зеленый = 0;
			Синий = 0;
		КонецЕсли;
	
		ЦветФона = Новый Цвет(Красный, Зеленый, Синий);
		Если ЦветФона = Неопределено
			ИЛИ Не ТипЗнч(ЦветФона) = Тип("Цвет") Тогда 
			Продолжить;
		КонецЕсли;
		
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		
		ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("СписокГеозон.Идентификатор");
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = ТекСтрока.Идентификатор;
		
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветФона);
		ЭлементУсловногоОформления.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		ЭлементУсловногоОформления.ИдентификаторПользовательскойНастройки = "Предустановленный";
		ЭлементУсловногоОформления.Представление = НСтр("en='By zone color';ru='По цвету зоны'");
		
		ПолеОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("СписокГеозонЦвет");
		ПолеОформления.Использование = Истина;
	КонецЦикла;
	
КонецПроцедуры // РаскраситьСписокЗон()

#КонецОбласти