#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция - Получить плановую цену номенклатуры в разрезе Моделей ТС.
//  Если есть действующая цена для конкретной переданной модели ТС, то используется она, иначе используется
//  цена с незаполненной моделью как общая цена для всех моделей.
//
// Параметры:
//  Период		 - Дата - Дата получения цен.
//  Номенклатура - СправочникСсылка.Номенклатура - Запчасть или работа, цену которой требуется получить.
//  МодельТС	 - СправочникСсылка.уатМоделиТС - Модель ТС, для которой требуется получить цены.
// 
// Возвращаемое значение:
//  Число - Цена номенклатуры.
//
Функция ПолучитьПлановуюЦенуНоменклатуры(Период, Номенклатура, МодельТС) Экспорт
	
	Цена = 0;
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	|	уатПлановыеЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
	|	ВЫБОР
	|		КОГДА уатПлановыеЦеныНоменклатурыСрезПоследних.Модель = &МодельТС
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК Приоритет
	|ИЗ
	|	РегистрСведений.уатПлановыеЦеныНоменклатуры.СрезПоследних(
	|			&Период,
	|			Номенклатура = &Номенклатура
	|				И (Модель = &МодельТС
	|					ИЛИ Модель = ЗНАЧЕНИЕ(Справочник.уатМоделиТС.ПустаяССылка))) КАК уатПлановыеЦеныНоменклатурыСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет");
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("МодельТС", МодельТС);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Цена = Выборка.Цена;
	КонецЕсли;
	
	Возврат Цена;
	
КонецФункции

#КонецОбласти

#КонецЕсли