////////////////////////////////////////////////////////////////////////////////
// Подсистема "Управление доступом".
// 
////////////////////////////////////////////////////////////////////////////////


#Область ПрограммныйИнтерфейс

// Заполняет описания поставляемых профилей групп доступа и
// переопределяет параметры обновления профилей и групп доступа.
//
// Для автоматической подготовки содержимого процедуры следует воспользоваться инструментами
// разработчика для подсистемы Управление доступом.
//
// Параметры:
//  ОписанияПрофилей    - Массив - массив структур, в который нужно добавить описания.
//                        Пустая структура должна быть получена при помощи функции.
//                        УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа.
//
//  ПараметрыОбновления - Структура - структура со свойствами:
//   * ОбновлятьИзмененныеПрофили - Булево - начальное значение Истина.
//   * ЗапретитьИзменениеПрофилей - Булево - начальное значение Истина.
//       Если установить Ложь, тогда поставляемые профили можно не только просматривать, но и редактировать.
//   * ОбновлятьГруппыДоступа     - Булево - начальное значение Истина.
//   * ОбновлятьГруппыДоступаСУстаревшимиНастройками - Булево - начальное значение Ложь.
//       Если установить Истина, то настройки значений, выполненные администратором для
//       вида доступа который был удален из профиля, будут также удалены из групп доступа.
//
Процедура ПриЗаполненииПоставляемыхПрофилейГруппДоступа(ОписанияПрофилей, ПараметрыОбновления) Экспорт
	
	// Профили внутренних пользователей по прикладным ролям.
	ЗаполнитьПоставляемыеПрофилиПрикладныхРолей(ОписанияПрофилей, ПараметрыОбновления);
	
	// Профили внутренних пользователей по ролям-функциям.
	ЗаполнитьПоставляемыеПрофилиРолейФункций(ОписанияПрофилей, ПараметрыОбновления);
	
	// Прочие профили внутренних пользователей.
	
	// Профиль "Настройка УАТ".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "168b5af9-eeb5-11e6-99f0-ac220b763c3f";
	ОписаниеПрофиля.Наименование  = НСтр("en='TMS CORP settings';ru='Настройка УАТ'");
	ОписаниеПрофиля.Описание      = НСтр("");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатНастройкаУАТ");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатВыгрузкаДанныхВТиповыеКонфигурации");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатНастройкаОборудования");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатНастройкаМобильногоПриложения");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатНастройкаСпутниковогоМониторинга");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатУстановкаПравИНастроек");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеБазовыхКлассификаторов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатНастройкаНормРасходаГСМ");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатНастройкаФормулРасходаГСМ");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "БазовыеПраваБИД");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи", "ВначалеВсеРазрешены");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	// Профиль "Пользователь мобильного приложения".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "ca33e06b-1b5d-11e6-a03d-ac220b763c3f";
	ОписаниеПрофиля.Наименование  = НСтр("en='The user of the mobile applications';ru='Пользователь мобильного приложения'");
	ОписаниеПрофиля.Описание      = НСтр("");
	ДополнитьОписаниеПрофиляМПОбщимиРолями(ОписаниеПрофиля);
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатПользовательМобильногоПриложения");
	Если уатОбщегоНазначенияПовтИсп.ВариантПоставкиТакси() Тогда
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "такДобавлениеИзменениеЗаказовТакси");  
	КонецЕсли;
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеСертификатовКлючейЭлектроннойПодписиИШифрования");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеЭлектронныхПодписейИШифрование");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ШифрованиеИРасшифровкаДанных");
	
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеДокументовКЭДО"); 
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеНоменклатурыКонтрагентовБЭД");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеНастроекЭлектронногоВзаимодействия");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеМаршрутовПодписания"); 
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеНастроекОбменаСКонтрагентами");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеЭлектронныхДокументов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеДокументовЭПД");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ВыполнениеОбменаСКонтрагентами");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи", "ВначалеВсеРазрешены");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);    
	
	// Профиль "Пользователь обмена с ДО".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "ca33e06b-1b5d-11e6-a03d-ac220b753c4f";
	ОписаниеПрофиля.Наименование  = НСтр("en='Пользователь обмена с ДО';ru='Пользователь обмена с ДО'");
	ОписаниеПрофиля.Описание      = НСтр("");
	ДополнитьОписаниеПрофиляМПОбщимиРолями(ОписаниеПрофиля);
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "БазовыеПраваБИД"); 
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатПользовательОбменаСДО");

	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи", "ВначалеВсеРазрешены");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля); 
	
	// Профиль "Пользователь HTTP сервиса отслеживания
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "b56222e6-2230-4c11-ab6e-1cb68cc7ec48";
	ОписаниеПрофиля.Наименование  = НСтр("en='Tracking HTTP user';ru='Пользователь HTTP-сервиса отслеживания'");
	ОписаниеПрофиля.Описание      = НСтр("");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "БазовыеПраваБСП");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "БазовыеПраваИПП");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатБазовыеПрава");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "слкУправлениеМенеджеромЛицензийСЛК");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатПользовательHTTPСервисаОтслеживания");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены"); 
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи", "ВначалеВсеРазрешены");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	// Профиль "Терминал путевых листов".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "ca33e066-1b5d-11e6-a03d-ac220b763c3f";
	ОписаниеПрофиля.Наименование  = НСтр("en='Waybill terminal';ru='Терминал путевых листов'");
	ОписаниеПрофиля.Описание      = НСтр("");
	ДополнитьОписаниеПрофиляОбщимиРолями(ОписаниеПрофиля);
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатТерминалПутевыхЛистов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеНапоминаний");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеЗаметок");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеГрафиковРаботы");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи", "ВначалеВсеРазрешены");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	// Прочие профили внешних пользователей.
	// Профиль "Внешний пользователь: потребность в перевозке".
	Если уатОбщегоНазначенияПовтИсп.ВариантПоставкиКОРП() Тогда
		ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
		ОписаниеПрофиля.Идентификатор = "56a0a496-62d1-11e6-8b62-ac220b763c3f";
		ОписаниеПрофиля.Наименование  = НСтр("ru = 'Внешний пользователь: потребность в перевозке'; en = 'External user: need for the carriage'");
		ОписаниеПрофиля.Описание      = НСтр("ru = 'Профиль доступа для внешнего пользователя. Предназначен для работы с документом потребность в перевозке'; en = 'Access profile for external users. Designed for working with the transportation requirement document.'");
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ОписаниеПрофиля.Назначение, Метаданные.ОпределяемыеТипы.ВнешнийПользователь.Тип.Типы());
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "БазовыеПраваВнешнихПользователейБСП");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "БазовыеПраваБИД");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЗапускВебКлиента");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "СохранениеДанныхПользователя");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ВыводНаПринтерФайлБуферОбмена");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатБазовыеПраваВнешнихПользователей");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "слкУправлениеМенеджеромЛицензийСЛК");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатВнешнийПользовательПотребностьВПеревозке");
		ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
		ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены"); 
		ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	КонецЕсли;
	
	// Профиль "Внешний пользователь: перевозчик".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "56b0a496-62d1-11e6-8b62-ac220b763c3f";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Внешний пользователь: перевозчик'; en = 'External user: carrier'");
	ОписаниеПрофиля.Описание      = НСтр("ru = 'Профиль доступа для внешнего пользователя. Предназначен для работы с документами перевозчика.'; en = 'Access profile for external users. Designed for working with carrier documents.'");
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ОписаниеПрофиля.Назначение, Метаданные.ОпределяемыеТипы.ВнешнийПользователь.Тип.Типы());
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "БазовыеПраваВнешнихПользователейБСП");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "БазовыеПраваБИД");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЗапускВебКлиента");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "СохранениеДанныхПользователя");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ВыводНаПринтерФайлБуферОбмена");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатБазовыеПраваВнешнихПользователей");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "слкУправлениеМенеджеромЛицензийСЛК");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатВнешнийПользовательПеревозчик");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ИзменениеВыполнениеЗадач");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеАктовОбУничтоженииПерсональныхДанных");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	// Профиль "Внешний пользователь: заказ на ТС".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "56a0a476-62d1-11e6-8b62-ac220b763c3f";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Внешний пользователь: заказ на тс'; en = 'External user: order for vehicle'");
	ОписаниеПрофиля.Описание      = НСтр("ru = 'Профиль доступа для внешнего пользователя. Предназначен для работы с документом заказ на тс.'; en = 'Access profile for external users. Designed for working with the vehicle order document.'");
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ОписаниеПрофиля.Назначение, Метаданные.ОпределяемыеТипы.ВнешнийПользователь.Тип.Типы());
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "БазовыеПраваВнешнихПользователейБСП");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "БазовыеПраваБИД");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЗапускВебКлиента");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "СохранениеДанныхПользователя");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ВыводНаПринтерФайлБуферОбмена");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатБазовыеПраваВнешнихПользователей");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "слкУправлениеМенеджеромЛицензийСЛК");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатВнешнийПользовательЗаказНаТС");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	// Профиль "Внешний пользователь: заказчик".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "56a0a496-62d1-11e6-8b32-ac220b763c3f";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Внешний пользователь: заказчик'; en = 'External user: customer'");
	ОписаниеПрофиля.Описание      = НСтр("ru = 'Профиль доступа для внешнего пользователя. Предназначен для обеспечения просмотра данных заказчика.'; en = 'Access profile for external users. Designed to provide access to customer data.'");
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ОписаниеПрофиля.Назначение, Метаданные.ОпределяемыеТипы.ВнешнийПользователь.Тип.Типы());
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "БазовыеПраваВнешнихПользователейБСП");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "БазовыеПраваБИД");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЗапускВебКлиента");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "СохранениеДанныхПользователя");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ВыводНаПринтерФайлБуферОбмена");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатБазовыеПраваВнешнихПользователей");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "слкУправлениеМенеджеромЛицензийСЛК");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатВнешнийПользовательЗаказчик");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	// Профиль "Внешний пользователь: анкетирование".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "56a0a496-72d1-11e6-8b32-ac220b763c3f";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Внешний пользователь: анкетирование'; en = 'External user: survey'");
	ОписаниеПрофиля.Описание      = НСтр("ru = 'Позволяет обеспечить доступ к прохождению анкетирования для внешнего пользователя.'; en = 'Allows external users to access the survey.'");
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ОписаниеПрофиля.Назначение, Метаданные.ОпределяемыеТипы.ВнешнийПользователь.Тип.Типы());
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "БазовыеПраваВнешнихПользователейБСП");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЗапускВебКлиента");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "СохранениеДанныхПользователя");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатБазовыеПраваВнешнихПользователей");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "слкУправлениеМенеджеромЛицензийСЛК");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеОтветовНаВопросыАнкет");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

// Позволяет указать списки, у которых объекты метаданных содержат описание логики ограничения
// доступа в модулях менеджеров или переопределяемом модуле.
//
// В модулях менеджеров указанных списков должна быть размещена процедура обработчика,
// в которую передаются следующие параметры.
// 
//  Ограничение - Структура - со свойствами:
//    * Текст                             - Строка - ограничение доступа для пользователей.
//                                            Если пустая строка, значит доступ разрешен.
//    * ТекстДляВнешнихПользователей      - Строка - ограничение доступа для внешних пользователей.
//                                            Если пустая строка, значит доступ запрещен.
//    * ПоВладельцуБезЗаписиКлючейДоступа - Неопределено - определить автоматически.
//                                        - Булево - если Ложь, то всегда записывать ключи доступа,
//                                            если Истина, тогда не записывать ключи доступа,
//                                            а использовать ключи доступа владельца (требуется,
//                                            чтобы ограничение было строго по объекту-владельцу).
///   * ПоВладельцуБезЗаписиКлючейДоступаДляВнешнихПользователей - Неопределено, Булево - см.
//                                            описание предыдущего параметра.
//
// Далее пример процедуры для модуля менеджера.
//
//// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
//Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
//	
//	Ограничение.Текст =
//	"РазрешитьЧтениеИзменение
//	|ГДЕ
//	|	ЗначениеРазрешено(Организация)
//	|	И ЗначениеРазрешено(Контрагент)";
//	
//КонецПроцедуры
//
// Параметры:
//  Списки - Соответствие - списки с ограничением доступа:
//             * Ключ     - ОбъектМетаданных - список с ограничением доступа.
//             * Значение - Булево - Истина - текст ограничения в модуле менеджера.
//                                 - Ложь   - текст ограничения в этом переопределяемом
//                модуле в процедуре ПриЗаполненииОграниченияДоступа.
//
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт

	Списки.Вставить(Метаданные.Документы.уатАвансовыйОтчет, Истина);
	Списки.Вставить(Метаданные.Документы.уатАктКС3_стм, Истина);
	Списки.Вставить(Метаданные.Документы.уатАктПриемаПередачиТС, Истина);
	Списки.Вставить(Метаданные.Документы.уатАктСверкиВзаиморасчетов_уэ, Истина);
	Списки.Вставить(Метаданные.Документы.уатБилетныйЛист, Истина);
	Списки.Вставить(Метаданные.Документы.уатВводВЭксплуатациюТСиОборудования, Истина);
	Списки.Вставить(Метаданные.Документы.уатВводНачальныхДанныхПоАгрегатам, Истина);
	Списки.Вставить(Метаданные.Документы.уатВводНачальныхПоказаний, Истина);
	Списки.Вставить(Метаданные.Документы.уатВводОстатков, Истина);
	Списки.Вставить(Метаданные.Документы.уатВводОстатковГСМ, Истина);
	Списки.Вставить(Метаданные.Документы.уатВзаимозачет, Истина);
	Списки.Вставить(Метаданные.Документы.уатВнутреннееПеремещение, Истина);
	Списки.Вставить(Метаданные.Документы.уатВозвратТоваров, Истина);
	Списки.Вставить(Метаданные.Документы.уатВыбытиеТСиОборудования, Истина);
	Списки.Вставить(Метаданные.Документы.уатВыдачаРасходныхМатериалов, Истина);
	Списки.Вставить(Метаданные.Документы.уатВыручкаВодителей, Истина);
	Списки.Вставить(Метаданные.Документы.уатДиспозицияТС, Истина);
	Списки.Вставить(Метаданные.Документы.уатДоверенность, Истина);
	Списки.Вставить(Метаданные.Документы.уатДТП, Истина);
	Списки.Вставить(Метаданные.Документы.уатЖурналМедицинскогоОсмотраВодителей, Истина);
	Списки.Вставить(Метаданные.Документы.уатЖурналПредрейсовогоИПослерейсовогоКонтроляТС, Истина); 
	Списки.Вставить(Метаданные.Документы.уатЖурналУчетаПоказанийОдометра, Истина);
	Списки.Вставить(Метаданные.Документы.уатЗаказГрузоотправителя, Истина);
	Списки.Вставить(Метаданные.Документы.уатЗаказПеревозчику_уэ, Истина);
	Списки.Вставить(Метаданные.Документы.уатЗаказПоставщику, Истина);
	Списки.Вставить(Метаданные.Документы.уатЗакрытиеЗаявокНаРасходованиеСредств, Истина);
	Списки.Вставить(Метаданные.Документы.уатЗакрытиеЗаявокНаРемонты, Истина);
	Списки.Вставить(Метаданные.Документы.уатЗаправкаГСМ, Истина);
	Списки.Вставить(Метаданные.Документы.уатЗаявкаНаРасходованиеДС, Истина);
	Списки.Вставить(Метаданные.Документы.уатЗаявкаНаРемонт, Истина);
	Списки.Вставить(Метаданные.Документы.уатИзменениеCчетчиковТС, Истина);
	Списки.Вставить(Метаданные.Документы.уатИнвентаризацияАгрегатов, Истина);
	Списки.Вставить(Метаданные.Документы.уатИнвентаризацияГСМвТС, Истина);
	Списки.Вставить(Метаданные.Документы.уатИнвентаризацияТоваров, Истина);
	Списки.Вставить(Метаданные.Документы.уатКомандировкиОрганизаций, Истина);
	Списки.Вставить(Метаданные.Документы.уатКорректировкаДолга, Истина);
	Списки.Вставить(Метаданные.Документы.уатКорректировкаИспользованияРаботникамиРабочегоВремени, Истина);
	Списки.Вставить(Метаданные.Документы.уатМаршрутныйЛист, Истина);
	Списки.Вставить(Метаданные.Документы.уатНачислениеЗарплаты, Истина);
	Списки.Вставить(Метаданные.Документы.уатНачислениеПремий, Истина);
	Списки.Вставить(Метаданные.Документы.уатНачислениеУдержаний, Истина);
	Списки.Вставить(Метаданные.Документы.уатОперацииСАгрегатами, Истина);
	Списки.Вставить(Метаданные.Документы.уатОперацииСТехническимиЖидкостями, Истина);
	Списки.Вставить(Метаданные.Документы.уатОприходованиеТоваров, Истина);
	Списки.Вставить(Метаданные.Документы.уатОтклонениеГруза, Истина);
	Списки.Вставить(Метаданные.Документы.уатОтчетПоставщикаПЦ, Истина);
	Списки.Вставить(Метаданные.Документы.уатОтчетСистемыПлатон, Истина);
	Списки.Вставить(Метаданные.Документы.уатОтчетСистемыАвтодор, Истина);
	Списки.Вставить(Метаданные.Документы.уатПакетСопроводительныхДокументов, Истина);
	Списки.Вставить(Метаданные.Документы.уатПарковка, Истина);
	Списки.Вставить(Метаданные.Документы.уатПеремещениеАгрегатов, Истина);
	Списки.Вставить(Метаданные.Документы.уатПеремещениеТоваров, Истина);
	Списки.Вставить(Метаданные.Документы.уатПеремещениеТСиОборудования, Истина);
	Списки.Вставить(Метаданные.Документы.уатПланированиеРаботыТС, Истина);
	Списки.Вставить(Метаданные.Документы.уатПлатежноеПоручениеВходящее, Истина);
	Списки.Вставить(Метаданные.Документы.уатПлатежноеПоручениеИсходящее, Истина);
	Списки.Вставить(Метаданные.Документы.уатПосадочнаяВедомость, Истина);
	Списки.Вставить(Метаданные.Документы.уатПоступлениеАгрегатов, Истина);
	Списки.Вставить(Метаданные.Документы.уатПоступлениеБилетов, Истина);
	Списки.Вставить(Метаданные.Документы.уатПоступлениеТоваровУслуг, Истина);
	Списки.Вставить(Метаданные.Документы.уатПотребностьВПеревозке_уэ, Истина);
	Списки.Вставить(Метаданные.Документы.уатПриходныйКассовыйОрдер, Истина);
	Списки.Вставить(Метаданные.Документы.уатПрочиеДоходыРасходы, Истина);
	Списки.Вставить(Метаданные.Документы.уатПутевойЛист, Истина);
	Списки.Вставить(Метаданные.Документы.уатРазнарядка, Истина);
	Списки.Вставить(Метаданные.Документы.уатРаспределениеДоходовРасходов, Истина);
	Списки.Вставить(Метаданные.Документы.уатРаспределениеРасходовБудущихПериодов, Истина);
	Списки.Вставить(Метаданные.Документы.уатРасходныйКассовыйОрдер, Истина);
	Списки.Вставить(Метаданные.Документы.уатРасчетСводныхПараметровВыработки, Истина);
	Списки.Вставить(Метаданные.Документы.уатРасчетФактическихДанныхПоДолгосрочномуПланированию, Истина);
	Списки.Вставить(Метаданные.Документы.уатРеализацияУслуг, Истина);
	Списки.Вставить(Метаданные.Документы.уатРеестрОплатыШтрафов, Истина);
	Списки.Вставить(Метаданные.Документы.уатРеестрПеревозок, Истина);
	Списки.Вставить(Метаданные.Документы.уатРемонтныйЛист, Истина);
	Списки.Вставить(Метаданные.Документы.уатСливГСМ, Истина);
	Списки.Вставить(Метаданные.Документы.уатСписаниеАгрегатов, Истина);
	Списки.Вставить(Метаданные.Документы.уатСписаниеТоваров, Истина);
	Списки.Вставить(Метаданные.Документы.уатСчетНаОплатуПокупателю, Истина);
	Списки.Вставить(Метаданные.Документы.уатСчетНаОплатуПоставщика, Истина);
	Списки.Вставить(Метаданные.Документы.уатСчетФактураВыданный, Истина);
	Списки.Вставить(Метаданные.Документы.уатТабельУчетаРабочегоВремени, Истина);
	Списки.Вставить(Метаданные.Документы.уатТехнологическийПутевойЛист, Истина);
	Списки.Вставить(Метаданные.Документы.уатТТД, Истина);
	Списки.Вставить(Метаданные.Документы.уатУстановкаПрейскурантовТС, Истина);
	Списки.Вставить(Метаданные.Документы.уатУстановкаСтатусаГруза_уэ, Истина); 
	Списки.Вставить(Метаданные.Документы.уатУстановкаСтатусаПЛ, Истина);
	Списки.Вставить(Метаданные.Документы.уатУстановкаСтатусовСопроводительныхДокументов, Истина);
	Списки.Вставить(Метаданные.Документы.уатУстановкаТарифовЗП, Истина);
	Списки.Вставить(Метаданные.Документы.уатУстановкаТарифовСебестоимости_уэ, Истина);
	Списки.Вставить(Метаданные.Документы.уатШтраф, Истина);
	Списки.Вставить(Метаданные.Документы.ЭкземплярБюджета, Истина);
	
	Списки.Вставить(Метаданные.ЖурналыДокументов.уатДокументыГСМ, Истина);
	Списки.Вставить(Метаданные.ЖурналыДокументов.уатДокументыПоАгрегатам, Истина);
	Списки.Вставить(Метаданные.ЖурналыДокументов.уатДокументыПоРемонтам, Истина);
	Списки.Вставить(Метаданные.ЖурналыДокументов.уатКассовыеИБанковскиеДокументы, Истина);
	Списки.Вставить(Метаданные.ЖурналыДокументов.уатСкладскиеДокументы, Истина);

	Списки.Вставить(Метаданные.РегистрыНакопления.ОборотыБюджетов, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.уатВзаиморасчетыСКонтрагентами, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.уатВыработкаАгрегатов, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.уатВыработкаПоМаршрутнымЛистам_уэ, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.уатВыработкаСотрудников, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.уатВыработкаСотрудниковПоМаршрутнымЛистам, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.уатВыработкаТС, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.уатВыручка, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.уатВыставленныеУслуги, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.уатГрузыКПеревозке_уэ, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.уатДвижениеДС, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.уатДоходы, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.уатЗаказыГрузоотправителей, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.уатЗаказыПоставщикам, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.уатЗаявкиНаРасходованиеДС, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.уатЗаявкиНаРемонт, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.уатИзносАгрегатов, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.уатОборотыПоЗаправкамГСМ, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.уатОборотыПоМаршрутномуЛисту, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.уатОборотыПоОтчетамПоставщиковПЦ, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.уатОборотыТЖнаТС, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.уатОстаткиДС, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.уатОстаткиДСУПодотчетныхЛиц, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.уатПартииТоваровНаСкладах, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.уатПлановыеУслуги_уэ, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.уатПланРаботыТС, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.уатПредоставленныеУслуги, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.уатРабочееВремяСотрудников, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.уатРасходГСМнаТС, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.уатРасчетыПоДокументам, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.уатРасшифровкаРасходаГСМнаТС, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.уатРасходы, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.уатФинансовыеРезультаты, Истина);

	Списки.Вставить(Метаданные.РегистрыРасчета.уатНачисленияФизическимЛицам, Истина);
	Списки.Вставить(Метаданные.РегистрыРасчета.уатОсновныеНачисления, Истина);
	Списки.Вставить(Метаданные.РегистрыРасчета.уатУдержания, Истина);

	Списки.Вставить(Метаданные.РегистрыСведений.ОсновныеДоговорыКонтрагента, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ОтветственныеЛицаОрганизаций, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.уатВодителиНаЛинии, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.уатДополнительныеСведенияПоGPS, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.уатДоступКДокументам, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.уатИсторияКоординатМП, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.уатИсторияЗакрепленияБортовыхУстройств, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.уатКоординатыПоМониторингу, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.уатМестонахождениеТС, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.уатНормыРасходаГСМ, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.уатНумерацияОбъектов, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.уатПараметрыАвторизацииТерминала, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.уатПраваИНастройки, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.уатПробегРасходПоМониторингу, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.уатКадроваяИсторияСотрудников, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.уатТарифыСебестоимости_уэ, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.уатТекущиеКоординатыМП, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.уатУчетнаяПолитика, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.уатЭкипажТС, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ФИОФизическихЛиц, Истина);

	Списки.Вставить(Метаданные.Справочники.БанковскиеСчета, Истина);
	Списки.Вставить(Метаданные.Справочники.ДоговорыКонтрагентов, Истина);
	Списки.Вставить(Метаданные.Справочники.Кассы, Истина);
	Списки.Вставить(Метаданные.Справочники.Организации, Истина);
	Списки.Вставить(Метаданные.Справочники.ПодразделенияОрганизаций, Истина);
	Списки.Вставить(Метаданные.Справочники.Сотрудники, Истина);
	Списки.Вставить(Метаданные.Справочники.уатПланыПримененияЗатрат, Истина);
	Списки.Вставить(Метаданные.Справочники.уатПрейскурантыТС, Истина);
	Списки.Вставить(Метаданные.Справочники.уатТС, Истина);
	Списки.Вставить(Метаданные.Справочники.уатЦеха, Истина);
	Списки.Вставить(Метаданные.Справочники.уатРегистрационныеДокументы, Истина);

	Если уатОбщегоНазначенияПовтИсп.ВариантПоставкиКОРП() Тогда 
		Списки.Вставить(Метаданные.Документы.уатАктСверкиСтраховыхСертификатов_уэ, Истина);
		Списки.Вставить(Метаданные.Документы.уатАктОтгрузки_уэ, Истина);
		Списки.Вставить(Метаданные.Документы.уатАктПриемки_уэ, Истина);
		Списки.Вставить(Метаданные.Документы.уатОперацияСГрузом_уэ, Истина);
		Списки.Вставить(Метаданные.Документы.уатРассылкаЭлектронныхПисем_уэ, Истина);
		Списки.Вставить(Метаданные.Документы.уатРекламация_уэ, Истина);
		Списки.Вставить(Метаданные.Документы.уатТендер_уэ, Истина);
		Списки.Вставить(Метаданные.Документы.уатСтраховойСертификат_уэ, Истина);
		Списки.Вставить(Метаданные.РегистрыНакопления.уатРекламации_уэ, Истина);
	КонецЕсли; 
	
	Если уатОбщегоНазначенияПовтИсп.ВариантПоставкиТАКСИ() Тогда
		Списки.Вставить(Метаданные.Документы.такАгентскийДоговор, Истина);
		Списки.Вставить(Метаданные.Документы.такАрендаТС, Истина);
		Списки.Вставить(Метаданные.Документы.такЗаказТакси, Истина);
	КонецЕсли;

КонецПроцедуры

// Заполняет состав видов доступа, используемых при ограничении прав объектов метаданных.
// Если состав видов доступа не заполнен, отчет "Права доступа" покажет некорректные сведения.
//
// Обязательно требуется заполнить только виды доступа, используемые в шаблонах ограничения доступа
// явно, а виды доступа, используемые в наборах значений доступа могут быть получены из текущего
// состояния регистра сведений НаборыЗначенийДоступа.
//
//  Для автоматической подготовки содержимого процедуры следует воспользоваться инструментами
// разработчика для подсистемы Управление доступом.
//
// Параметры:
//  Описание     - Строка - многострочная строка формата <Таблица>.<Право>.<ВидДоступа>[.Таблица объекта],
//                 например, "Документ.ПриходнаяНакладная.Чтение.Организации",
//                           "Документ.ПриходнаяНакладная.Чтение.Контрагенты",
//                           "Документ.ПриходнаяНакладная.Изменение.Организации",
//                           "Документ.ПриходнаяНакладная.Изменение.Контрагенты",
//                           "Документ.ЭлектронныеПисьма.Чтение.Объект.Документ.ЭлектронныеПисьма",
//                           "Документ.ЭлектронныеПисьма.Изменение.Объект.Документ.ЭлектронныеПисьма",
//                           "Документ.Файлы.Чтение.Объект.Справочник.ПапкиФайлов",
//                           "Документ.Файлы.Чтение.Объект.Документ.ЭлектронноеПисьмо",
//                           "Документ.Файлы.Изменение.Объект.Справочник.ПапкиФайлов",
//                           "Документ.Файлы.Изменение.Объект.Документ.ЭлектронноеПисьмо".
//                 Вид доступа Объект предопределен, как литерал. Этот вид доступа используется в
//                 шаблонах ограничений доступа, как "ссылка" на другой объект, по которому
//                 ограничивается текущий объект таблицы.
//                 Когда вид доступа "Объект" задан, также требуется задать типы таблиц,
//                 которые используются для этого вида доступа. Т.е. перечислить типы,
//                 которые соответствуют полю, использованному в шаблоне ограничения доступа
//                 в паре с видом доступа "Объект". При перечислении типов по виду доступа "Объект"
//                 нужно перечислить только те типы поля, которые есть
//                 у поля РегистрыСведений.НаборыЗначенийДоступа.Объект, остальные типы лишние.
// 
Процедура ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание) Экспорт

	Описание = Описание + "
	|Справочник.БанковскиеСчета.Чтение.Организации
	|Справочник.БанковскиеСчета.Изменение.Организации
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатАвансовыйОтчет
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатАктКС3_стм
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатАктПриемаПередачиТС
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатАктСверкиВзаиморасчетов_уэ
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатБилетныйЛист
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатВводВЭксплуатациюТСиОборудования
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатВводНачальныхДанныхПоАгрегатам
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатВводНачальныхПоказаний
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатВводОстатков
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатВводОстатковГСМ
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатВзаимозачет
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатВнутреннееПеремещение
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатВозвратТоваров
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатВыбытиеТСиОборудования
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатВыдачаРасходныхМатериалов
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатВыручкаВодителей
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатДиспозицияТС
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатДоверенность
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатДТП
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатЗаказГрузоотправителя
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатЗаказПеревозчику_уэ
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатЗаказПоставщику
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатЗакрытиеЗаявокНаРасходованиеСредств
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатЗакрытиеЗаявокНаРемонты
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатЗаправкаГСМ
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатЗаявкаНаРасходованиеДС
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатЗаявкаНаРемонт
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатИнвентаризацияАгрегатов
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатИнвентаризацияГСМвТС
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатИнвентаризацияТоваров
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатКомандировкиОрганизаций
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатКорректировкаДолга
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатКорректировкаЗаписейРегистров
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатКорректировкаИспользованияРаботникамиРабочегоВремени
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатМаршрутныйЛист
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатНачислениеЗарплаты
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатОперацииСАгрегатами
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатОперацииСТехническимиЖидкостями
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатОприходованиеТоваров
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатОтклонениеГруза
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатОтчетПоставщикаПЦ
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатПарковка
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатПеремещениеАгрегатов
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатПеремещениеТоваров
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатПеремещениеТСиОборудования
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатПланированиеРаботыТС
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатПлатежноеПоручениеВходящее
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатПлатежноеПоручениеИсходящее
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатПосадочнаяВедомость
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатПоступлениеАгрегатов
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатПоступлениеБилетов
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатПоступлениеТоваровУслуг
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатПотребностьВПеревозке_уэ
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатПриходныйКассовыйОрдер
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатПрочиеДоходыРасходы
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатПутевойЛист
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатРазнарядка
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатРаспределениеДоходовРасходов
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатРаспределениеРасходовБудущихПериодов
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатРасходныйКассовыйОрдер
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатРеализацияУслуг
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатРеестрПеревозок
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатРемонтныйЛист
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатСливГСМ
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатСписаниеАгрегатов
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатСписаниеТоваров
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатСчетНаОплатуПокупателю
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатСчетНаОплатуПоставщика
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатСчетФактураВыданный
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатТабельУчетаРабочегоВремени
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатТТД
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатУстановкаПрейскурантовТС
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатУстановкаСтатусаГруза_уэ
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатУстановкаСтатусаПЛ
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатУстановкаТарифовЗП
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатУстановкаТарифовСебестоимости_уэ
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатШтраф
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.Банки
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.БанковскиеСчета
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.ВидыНоменклатуры
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.ВнешниеПользователи
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.ДоговорыКонтрагентов
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.КонтактныеЛица
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.Контрагенты
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.Номенклатура
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.НоменклатурныеГруппы
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.Организации
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.ОсновныеСредства
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.Пользователи
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.Склады
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.Сотрудники
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.уатАЗС
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.уатБилеты
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.уатВидыБилетов
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.уатВидыДокументов
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.уатВидыИспользованияРабочегоВремени
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.уатВидыОбслуживанияТС
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.уатВидыПеревозок
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.уатВидыСпецодеждыИИнструментов
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.уатВыходыМаршрутов
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.уатГруппыПользователейДляСогласования
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.уатГруппыДиспетчеров
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.уатЕмкостьАккумуляторов
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.уатКартыДоступа
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.уатКлассификаторВидыТранспортныхСредств
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.уатКолонны
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.уатМакетыТС
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.уатМаршруты
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.уатМестаУстановкиШин
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.уатМобильныеУстройства
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.уатМоделиАгрегатов
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.уатМоделиСпецодеждыИИнструментов
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.уатМоделиТС
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.уатОбъектыСтроительства
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.уатПараметрыВыработки
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.уатПланыПримененияЗатрат
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.уатПластиковыеКарты
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.уатПрейскурантыТС
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.уатПричиныДТП
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.уатПричиныЗакрытияЗаказов
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.уатПричиныСписания
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.уатПунктыНазначения
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.уатРаботыПоРемонту
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.уатРазмерыСпецодежды
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.уатРежимыРаботыТС
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.уатРейсыМаршрутов
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.уатСерииНоменклатуры
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.уатСмены
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.уатСостояниеТС
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.уатСпособыОпределенияМассы
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.уатСпособыПогрузки
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.уатСтавкиПоТранспортномуНалогу
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.уатСценарииПланирования
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.уатТарифныеПланыЗП
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.уатТарифыЗП
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.уатТарифыТС
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.уатТемпературныеКоэффициентыГСМ
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.уатТипыАгрегатов
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.уатТипыТС
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.уатКлассыТС
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.уатТипыТСПоВоенкомату
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.уатТС
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.уатУсловияРаботы
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.уатЦвета
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.уатЦеха
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.уатЧаты
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.уатШаблоныСогласования
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.уатШиныВысота
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.уатШиныПрофиль
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.уатШиныРадиус
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.уатШиныШирина
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.ФизическиеЛица
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатАвансовыйОтчет
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатАктКС3_стм
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатАктПриемаПередачиТС
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатАктСверкиВзаиморасчетов_уэ
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатБилетныйЛист
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатВводВЭксплуатациюТСиОборудования
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатВводНачальныхДанныхПоАгрегатам
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатВводНачальныхПоказаний
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатВводОстатков
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатВводОстатковГСМ
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатВзаимозачет
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатВнутреннееПеремещение
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатВозвратТоваров
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатВыбытиеТСиОборудования
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатВыдачаРасходныхМатериалов
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатВыручкаВодителей
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатДиспозицияТС
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатДоверенность
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатДТП
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатЗаказГрузоотправителя
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатЗаказПеревозчику_уэ 
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатЗаказПоставщику 
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатЗакрытиеЗаявокНаРасходованиеСредств
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатЗакрытиеЗаявокНаРемонты
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатЗаправкаГСМ
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатЗаявкаНаРасходованиеДС
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатЗаявкаНаРемонт
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатИнвентаризацияАгрегатов
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатИнвентаризацияГСМвТС
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатИнвентаризацияТоваров
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатКомандировкиОрганизаций
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатКорректировкаДолга
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатКорректировкаЗаписейРегистров
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатКорректировкаИспользованияРаботникамиРабочегоВремени
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатМаршрутныйЛист
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатНачислениеЗарплаты
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатОперацииСАгрегатами
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатОперацииСТехническимиЖидкостями
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатОприходованиеТоваров
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатОтклонениеГруза
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатОтчетПоставщикаПЦ
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатПарковка
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатПеремещениеАгрегатов
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатПеремещениеТоваров
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатПеремещениеТСиОборудования
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатПланированиеРаботыТС
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатПлатежноеПоручениеВходящее
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатПлатежноеПоручениеИсходящее
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатПосадочнаяВедомость
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатПоступлениеАгрегатов
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатПоступлениеБилетов
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатПоступлениеТоваровУслуг
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатПотребностьВПеревозке_уэ
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатПриходныйКассовыйОрдер
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатПрочиеДоходыРасходы
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатПутевойЛист
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатРазнарядка
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатРаспределениеДоходовРасходов
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатРаспределениеРасходовБудущихПериодов
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатРасходныйКассовыйОрдер
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатРеализацияУслуг
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатРеестрПеревозок
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатРемонтныйЛист
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатСливГСМ
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатСписаниеАгрегатов
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатСписаниеТоваров
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатСчетНаОплатуПокупателю
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатСчетНаОплатуПоставщика
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатСчетФактураВыданный
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатТабельУчетаРабочегоВремени
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатТТД
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатУстановкаПрейскурантовТС
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатУстановкаСтатусаГруза_уэ
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатУстановкаСтатусаПЛ
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатУстановкаТарифовЗП
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатУстановкаТарифовСебестоимости_уэ
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатШтраф
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.Банки
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.БанковскиеСчета
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.ВидыНоменклатуры
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.ВнешниеПользователи
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.ДоговорыКонтрагентов
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.КонтактныеЛица
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.Контрагенты
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.Номенклатура
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.НоменклатурныеГруппы
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.Организации
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.ОсновныеСредства
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.Пользователи
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.Склады
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.Сотрудники
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.уатАЗС
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.уатБилеты
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.уатВидыБилетов
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.уатВидыДокументов
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.уатВидыИспользованияРабочегоВремени
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.уатВидыОбслуживанияТС
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.уатВидыПеревозок
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.уатВидыСпецодеждыИИнструментов
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.уатВыходыМаршрутов
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.уатГруппыПользователейДляСогласования
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.уатГруппыДиспетчеров
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.уатЕмкостьАккумуляторов
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.уатКартыДоступа
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.уатКлассификаторВидыТранспортныхСредств
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.уатКолонны
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.уатМакетыТС
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.уатМаршруты
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.уатМестаУстановкиШин
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.уатМобильныеУстройства
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.уатМоделиАгрегатов
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.уатМоделиСпецодеждыИИнструментов
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.уатМоделиТС
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.уатОбъектыСтроительства
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.уатПараметрыВыработки
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.уатПланыПримененияЗатрат
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.уатПластиковыеКарты
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.уатПрейскурантыТС
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.уатПричиныДТП
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.уатПричиныЗакрытияЗаказов
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.уатПричиныСписания
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.уатПунктыНазначения
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.уатРаботыПоРемонту
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.уатРазмерыСпецодежды
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.уатРежимыРаботыТС
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.уатРейсыМаршрутов
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.уатСерииНоменклатуры
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.уатСмены
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.уатСостояниеТС
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.уатСпособыОпределенияМассы
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.уатСпособыПогрузки
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.уатСтавкиПоТранспортномуНалогу
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.уатСценарииПланирования
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.уатТарифныеПланыЗП
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.уатТарифыЗП
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.уатТарифыТС
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.уатТемпературныеКоэффициентыГСМ
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.уатТипыАгрегатов
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.уатТипыТС
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.уатКлассыТС
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.уатТипыТСПоВоенкомату
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.уатТС
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.уатУсловияРаботы
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.уатЦвета
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.уатЦеха
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.уатЧаты
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.уатШаблоныСогласования
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.уатШиныВысота
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.уатШиныПрофиль
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.уатШиныРадиус
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.уатШиныШирина
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.ФизическиеЛица
	|Справочник.ДоговорыКонтрагентов.Чтение.Организации
	|Справочник.ДоговорыКонтрагентов.Изменение.Организации
	|Справочник.Кассы.Чтение.Организации
	|Справочник.Кассы.Изменение.Организации
	|Справочник.Организации.Чтение.Организации
	|Справочник.Организации.Изменение.Организации
	|Справочник.ПодразделенияОрганизаций.Чтение.Организации
	|Справочник.ПодразделенияОрганизаций.Чтение.Подразделения
	|Справочник.ПодразделенияОрганизаций.Изменение.Организации
	|Справочник.ПодразделенияОрганизаций.Изменение.Подразделения
	|Справочник.Сотрудники.Чтение.Организации
	|Справочник.Сотрудники.Чтение.Подразделения
	|Справочник.Сотрудники.Изменение.Организации
	|Справочник.Сотрудники.Изменение.Подразделения
	|Справочник.уатПланыПримененияЗатрат.Чтение.Организации
	|Справочник.уатПланыПримененияЗатрат.Изменение.Организации
	|Справочник.уатПрейскурантыТС.Чтение.Организации
	|Справочник.уатПрейскурантыТС.Изменение.Организации
	|Справочник.уатТС.Чтение.Организации
	|Справочник.уатТС.Чтение.Подразделения
	|Справочник.уатТС.Изменение.Организации
	|Справочник.уатТС.Изменение.Подразделения
	|Справочник.уатРегистрационныеДокументы.Чтение.Организации
	|Справочник.уатРегистрационныеДокументы.Чтение.Подразделения
	|Справочник.уатРегистрационныеДокументы.Изменение.Организации
	|Справочник.уатРегистрационныеДокументы.Изменение.Подразделения
	|Справочник.уатЦеха.Чтение.Организации
	|Справочник.уатЦеха.Изменение.Организации
	|Справочник.Файлы.Чтение.Объект.Документ.уатАвансовыйОтчет
	|Справочник.Файлы.Чтение.Объект.Документ.уатАктКС3_стм
	|Справочник.Файлы.Чтение.Объект.Документ.уатАктПриемаПередачиТС
	|Справочник.Файлы.Чтение.Объект.Документ.уатАктСверкиВзаиморасчетов_уэ
	|Справочник.Файлы.Чтение.Объект.Документ.уатБилетныйЛист
	|Справочник.Файлы.Чтение.Объект.Документ.уатВводВЭксплуатациюТСиОборудования
	|Справочник.Файлы.Чтение.Объект.Документ.уатВводНачальныхДанныхПоАгрегатам
	|Справочник.Файлы.Чтение.Объект.Документ.уатВводНачальныхПоказаний
	|Справочник.Файлы.Чтение.Объект.Документ.уатВводОстатков
	|Справочник.Файлы.Чтение.Объект.Документ.уатВводОстатковГСМ
	|Справочник.Файлы.Чтение.Объект.Документ.уатВзаимозачет
	|Справочник.Файлы.Чтение.Объект.Документ.уатВозвратТоваров
	|Справочник.Файлы.Чтение.Объект.Документ.уатВыбытиеТСиОборудования
	|Справочник.Файлы.Чтение.Объект.Документ.уатВыдачаРасходныхМатериалов
	|Справочник.Файлы.Чтение.Объект.Документ.уатВыручкаВодителей
	|Справочник.Файлы.Чтение.Объект.Документ.уатДиспозицияТС
	|Справочник.Файлы.Чтение.Объект.Документ.уатДоверенность
	|Справочник.Файлы.Чтение.Объект.Документ.уатДТП
	|Справочник.Файлы.Чтение.Объект.Документ.уатЗаказГрузоотправителя
	|Справочник.Файлы.Чтение.Объект.Документ.уатЗаказПеревозчику_уэ
	|Справочник.Файлы.Чтение.Объект.Документ.уатЗаказПоставщику
	|Справочник.Файлы.Чтение.Объект.Документ.уатЗакрытиеЗаявокНаРасходованиеСредств
	|Справочник.Файлы.Чтение.Объект.Документ.уатЗакрытиеЗаявокНаРемонты
	|Справочник.Файлы.Чтение.Объект.Документ.уатЗаправкаГСМ
	|Справочник.Файлы.Чтение.Объект.Документ.уатЗаявкаНаРасходованиеДС
	|Справочник.Файлы.Чтение.Объект.Документ.уатЗаявкаНаРемонт
	|Справочник.Файлы.Чтение.Объект.Документ.уатИнвентаризацияАгрегатов
	|Справочник.Файлы.Чтение.Объект.Документ.уатИнвентаризацияГСМвТС
	|Справочник.Файлы.Чтение.Объект.Документ.уатИнвентаризацияТоваров
	|Справочник.Файлы.Чтение.Объект.Документ.уатКомандировкиОрганизаций
	|Справочник.Файлы.Чтение.Объект.Документ.уатКорректировкаДолга
	|Справочник.Файлы.Чтение.Объект.Документ.уатКорректировкаЗаписейРегистров
	|Справочник.Файлы.Чтение.Объект.Документ.уатКорректировкаИспользованияРаботникамиРабочегоВремени
	|Справочник.Файлы.Чтение.Объект.Документ.уатМаршрутныйЛист
	|Справочник.Файлы.Чтение.Объект.Документ.уатНачислениеЗарплаты
	|Справочник.Файлы.Чтение.Объект.Документ.уатОперацииСАгрегатами
	|Справочник.Файлы.Чтение.Объект.Документ.уатОперацииСТехническимиЖидкостями
	|Справочник.Файлы.Чтение.Объект.Документ.уатОприходованиеТоваров
	|Справочник.Файлы.Чтение.Объект.Документ.уатОтклонениеГруза
	|Справочник.Файлы.Чтение.Объект.Документ.уатОтчетПоставщикаПЦ
	|Справочник.Файлы.Чтение.Объект.Документ.уатПарковка
	|Справочник.Файлы.Чтение.Объект.Документ.уатПеремещениеАгрегатов
	|Справочник.Файлы.Чтение.Объект.Документ.уатПеремещениеТоваров
	|Справочник.Файлы.Чтение.Объект.Документ.уатПеремещениеТСиОборудования
	|Справочник.Файлы.Чтение.Объект.Документ.уатПланированиеРаботыТС
	|Справочник.Файлы.Чтение.Объект.Документ.уатПлатежноеПоручениеВходящее
	|Справочник.Файлы.Чтение.Объект.Документ.уатПлатежноеПоручениеИсходящее
	|Справочник.Файлы.Чтение.Объект.Документ.уатПосадочнаяВедомость
	|Справочник.Файлы.Чтение.Объект.Документ.уатПоступлениеАгрегатов
	|Справочник.Файлы.Чтение.Объект.Документ.уатПоступлениеБилетов
	|Справочник.Файлы.Чтение.Объект.Документ.уатПоступлениеТоваровУслуг
	|Справочник.Файлы.Чтение.Объект.Документ.уатПотребностьВПеревозке_уэ
	|Справочник.Файлы.Чтение.Объект.Документ.уатПриходныйКассовыйОрдер
	|Справочник.Файлы.Чтение.Объект.Документ.уатПрочиеДоходыРасходы
	|Справочник.Файлы.Чтение.Объект.Документ.уатПутевойЛист
	|Справочник.Файлы.Чтение.Объект.Документ.уатРазнарядка
	|Справочник.Файлы.Чтение.Объект.Документ.уатРаспределениеДоходовРасходов
	|Справочник.Файлы.Чтение.Объект.Документ.уатРаспределениеРасходовБудущихПериодов
	|Справочник.Файлы.Чтение.Объект.Документ.уатРасходныйКассовыйОрдер
	|Справочник.Файлы.Чтение.Объект.Документ.уатРеализацияУслуг
	|Справочник.Файлы.Чтение.Объект.Документ.уатРеестрПеревозок
	|Справочник.Файлы.Чтение.Объект.Документ.уатРемонтныйЛист
	|Справочник.Файлы.Чтение.Объект.Документ.уатСливГСМ
	|Справочник.Файлы.Чтение.Объект.Документ.уатСписаниеАгрегатов
	|Справочник.Файлы.Чтение.Объект.Документ.уатСписаниеТоваров
	|Справочник.Файлы.Чтение.Объект.Документ.уатСчетНаОплатуПокупателю
	|Справочник.Файлы.Чтение.Объект.Документ.уатСчетНаОплатуПоставщика
	|Справочник.Файлы.Чтение.Объект.Документ.уатСчетФактураВыданный
	|Справочник.Файлы.Чтение.Объект.Документ.уатТабельУчетаРабочегоВремени
	|Справочник.Файлы.Чтение.Объект.Документ.уатТТД
	|Справочник.Файлы.Чтение.Объект.Документ.уатУстановкаПрейскурантовТС
	|Справочник.Файлы.Чтение.Объект.Документ.уатУстановкаСтатусаГруза_уэ
	|Справочник.Файлы.Чтение.Объект.Документ.уатУстановкаСтатусаПЛ
	|Справочник.Файлы.Чтение.Объект.Документ.уатУстановкаТарифовЗП
	|Справочник.Файлы.Чтение.Объект.Документ.уатУстановкаТарифовСебестоимости_уэ
	|Справочник.Файлы.Чтение.Объект.Документ.уатШтраф
	|Справочник.Файлы.Чтение.Объект.Справочник.Банки
	|Справочник.Файлы.Чтение.Объект.Справочник.БанковскиеСчета
	|Справочник.Файлы.Чтение.Объект.Справочник.ВидыНоменклатуры
	|Справочник.Файлы.Чтение.Объект.Справочник.ВнешниеПользователи
	|Справочник.Файлы.Чтение.Объект.Справочник.ДоговорыКонтрагентов
	|Справочник.Файлы.Чтение.Объект.Справочник.КонтактныеЛица
	|Справочник.Файлы.Чтение.Объект.Справочник.Контрагенты
	|Справочник.Файлы.Чтение.Объект.Справочник.Номенклатура
	|Справочник.Файлы.Чтение.Объект.Справочник.НоменклатурныеГруппы
	|Справочник.Файлы.Чтение.Объект.Справочник.Организации
	|Справочник.Файлы.Чтение.Объект.Справочник.ОсновныеСредства
	|Справочник.Файлы.Чтение.Объект.Справочник.Пользователи
	|Справочник.Файлы.Чтение.Объект.Справочник.Склады
	|Справочник.Файлы.Чтение.Объект.Справочник.Сотрудники
	|Справочник.Файлы.Чтение.Объект.Справочник.уатАЗС
	|Справочник.Файлы.Чтение.Объект.Справочник.уатБилеты
	|Справочник.Файлы.Чтение.Объект.Справочник.уатВидыБилетов
	|Справочник.Файлы.Чтение.Объект.Справочник.уатВидыДокументов
	|Справочник.Файлы.Чтение.Объект.Справочник.уатВидыИспользованияРабочегоВремени
	|Справочник.Файлы.Чтение.Объект.Справочник.уатВидыОбслуживанияТС
	|Справочник.Файлы.Чтение.Объект.Справочник.уатВидыПеревозок
	|Справочник.Файлы.Чтение.Объект.Справочник.уатВыходыМаршрутов
	|Справочник.Файлы.Чтение.Объект.Справочник.уатГруппыПользователейДляСогласования
	|Справочник.Файлы.Чтение.Объект.Справочник.уатГруппыДиспетчеров
	|Справочник.Файлы.Чтение.Объект.Справочник.уатЕмкостьАккумуляторов
	|Справочник.Файлы.Чтение.Объект.Справочник.уатКартыДоступа
	|Справочник.Файлы.Чтение.Объект.Справочник.уатКлассификаторВидыТранспортныхСредств
	|Справочник.Файлы.Чтение.Объект.Справочник.уатКолонны
	|Справочник.Файлы.Чтение.Объект.Справочник.уатМакетыТС
	|Справочник.Файлы.Чтение.Объект.Справочник.уатМаршруты
	|Справочник.Файлы.Чтение.Объект.Справочник.уатМестаУстановкиШин
	|Справочник.Файлы.Чтение.Объект.Справочник.уатМобильныеУстройства
	|Справочник.Файлы.Чтение.Объект.Справочник.уатМоделиАгрегатов
	|Справочник.Файлы.Чтение.Объект.Справочник.уатМоделиСпецодеждыИИнструментов
	|Справочник.Файлы.Чтение.Объект.Справочник.уатМоделиТС
	|Справочник.Файлы.Чтение.Объект.Справочник.уатОбъектыСтроительства
	|Справочник.Файлы.Чтение.Объект.Справочник.уатПараметрыВыработки
	|Справочник.Файлы.Чтение.Объект.Справочник.уатПланыПримененияЗатрат
	|Справочник.Файлы.Чтение.Объект.Справочник.уатПластиковыеКарты
	|Справочник.Файлы.Чтение.Объект.Справочник.уатПрейскурантыТС
	|Справочник.Файлы.Чтение.Объект.Справочник.уатПричиныДТП
	|Справочник.Файлы.Чтение.Объект.Справочник.уатПричиныЗакрытияЗаказов
	|Справочник.Файлы.Чтение.Объект.Справочник.уатПричиныСписания
	|Справочник.Файлы.Чтение.Объект.Справочник.уатПунктыНазначения
	|Справочник.Файлы.Чтение.Объект.Справочник.уатРаботыПоРемонту
	|Справочник.Файлы.Чтение.Объект.Справочник.уатРежимыРаботыТС
	|Справочник.Файлы.Чтение.Объект.Справочник.уатРейсыМаршрутов
	|Справочник.Файлы.Чтение.Объект.Справочник.уатСерииНоменклатуры
	|Справочник.Файлы.Чтение.Объект.Справочник.уатСмены
	|Справочник.Файлы.Чтение.Объект.Справочник.уатСостояниеТС
	|Справочник.Файлы.Чтение.Объект.Справочник.уатСпособыОпределенияМассы
	|Справочник.Файлы.Чтение.Объект.Справочник.уатСпособыПогрузки
	|Справочник.Файлы.Чтение.Объект.Справочник.уатСтавкиПоТранспортномуНалогу
	|Справочник.Файлы.Чтение.Объект.Справочник.уатСценарииПланирования
	|Справочник.Файлы.Чтение.Объект.Справочник.уатТарифныеПланыЗП
	|Справочник.Файлы.Чтение.Объект.Справочник.уатТарифыЗП
	|Справочник.Файлы.Чтение.Объект.Справочник.уатТарифыТС
	|Справочник.Файлы.Чтение.Объект.Справочник.уатТемпературныеКоэффициентыГСМ
	|Справочник.Файлы.Чтение.Объект.Справочник.уатТипыАгрегатов
	|Справочник.Файлы.Чтение.Объект.Справочник.уатТипыТС 
	|Справочник.Файлы.Чтение.Объект.Справочник.уатКлассыТС
	|Справочник.Файлы.Чтение.Объект.Справочник.уатТипыТСПоВоенкомату
	|Справочник.Файлы.Чтение.Объект.Справочник.уатТС
	|Справочник.Файлы.Чтение.Объект.Справочник.уатУсловияРаботы
	|Справочник.Файлы.Чтение.Объект.Справочник.уатЦвета
	|Справочник.Файлы.Чтение.Объект.Справочник.уатЦеха
	|Справочник.Файлы.Чтение.Объект.Справочник.уатЧаты
	|Справочник.Файлы.Чтение.Объект.Справочник.уатШаблоныСогласования
	|Справочник.Файлы.Чтение.Объект.Справочник.уатШиныВысота
	|Справочник.Файлы.Чтение.Объект.Справочник.уатШиныПрофиль
	|Справочник.Файлы.Чтение.Объект.Справочник.уатШиныРадиус
	|Справочник.Файлы.Чтение.Объект.Справочник.уатШиныШирина
	|Справочник.Файлы.Чтение.Объект.Справочник.ФизическиеЛица
	|Справочник.Файлы.Изменение.Объект.Документ.уатАвансовыйОтчет
	|Справочник.Файлы.Изменение.Объект.Документ.уатАктКС3_стм
	|Справочник.Файлы.Изменение.Объект.Документ.уатАктПриемаПередачиТС
	|Справочник.Файлы.Изменение.Объект.Документ.уатАктСверкиВзаиморасчетов_уэ
	|Справочник.Файлы.Изменение.Объект.Документ.уатБилетныйЛист
	|Справочник.Файлы.Изменение.Объект.Документ.уатВводВЭксплуатациюТСиОборудования
	|Справочник.Файлы.Изменение.Объект.Документ.уатВводНачальныхДанныхПоАгрегатам
	|Справочник.Файлы.Изменение.Объект.Документ.уатВводНачальныхПоказаний
	|Справочник.Файлы.Изменение.Объект.Документ.уатВводОстатков
	|Справочник.Файлы.Изменение.Объект.Документ.уатВводОстатковГСМ
	|Справочник.Файлы.Изменение.Объект.Документ.уатВзаимозачет
	|Справочник.Файлы.Изменение.Объект.Документ.уатВозвратТоваров
	|Справочник.Файлы.Изменение.Объект.Документ.уатВыбытиеТСиОборудования
	|Справочник.Файлы.Изменение.Объект.Документ.уатВыдачаРасходныхМатериалов
	|Справочник.Файлы.Изменение.Объект.Документ.уатВыручкаВодителей
	|Справочник.Файлы.Изменение.Объект.Документ.уатДиспозицияТС
	|Справочник.Файлы.Изменение.Объект.Документ.уатДоверенность
	|Справочник.Файлы.Изменение.Объект.Документ.уатДТП
	|Справочник.Файлы.Изменение.Объект.Документ.уатЗаказГрузоотправителя
	|Справочник.Файлы.Изменение.Объект.Документ.уатЗаказПеревозчику_уэ
	|Справочник.Файлы.Изменение.Объект.Документ.уатЗаказПоставщику
	|Справочник.Файлы.Изменение.Объект.Документ.уатЗакрытиеЗаявокНаРасходованиеСредств
	|Справочник.Файлы.Изменение.Объект.Документ.уатЗакрытиеЗаявокНаРемонты
	|Справочник.Файлы.Изменение.Объект.Документ.уатЗаправкаГСМ
	|Справочник.Файлы.Изменение.Объект.Документ.уатЗаявкаНаРасходованиеДС
	|Справочник.Файлы.Изменение.Объект.Документ.уатЗаявкаНаРемонт
	|Справочник.Файлы.Изменение.Объект.Документ.уатИнвентаризацияАгрегатов
	|Справочник.Файлы.Изменение.Объект.Документ.уатИнвентаризацияГСМвТС
	|Справочник.Файлы.Изменение.Объект.Документ.уатИнвентаризацияТоваров
	|Справочник.Файлы.Изменение.Объект.Документ.уатКомандировкиОрганизаций
	|Справочник.Файлы.Изменение.Объект.Документ.уатКорректировкаДолга
	|Справочник.Файлы.Изменение.Объект.Документ.уатКорректировкаЗаписейРегистров
	|Справочник.Файлы.Изменение.Объект.Документ.уатКорректировкаИспользованияРаботникамиРабочегоВремени
	|Справочник.Файлы.Изменение.Объект.Документ.уатМаршрутныйЛист
	|Справочник.Файлы.Изменение.Объект.Документ.уатНачислениеЗарплаты
	|Справочник.Файлы.Изменение.Объект.Документ.уатНачислениеПремий
	|Справочник.Файлы.Изменение.Объект.Документ.уатНачислениеУдержаний
	|Справочник.Файлы.Изменение.Объект.Документ.уатОперацииСАгрегатами
	|Справочник.Файлы.Изменение.Объект.Документ.уатОперацииСТехническимиЖидкостями
	|Справочник.Файлы.Изменение.Объект.Документ.уатОприходованиеТоваров
	|Справочник.Файлы.Изменение.Объект.Документ.уатОтклонениеГруза
	|Справочник.Файлы.Изменение.Объект.Документ.уатОтчетПоставщикаПЦ
	|Справочник.Файлы.Изменение.Объект.Документ.уатПарковка
	|Справочник.Файлы.Изменение.Объект.Документ.уатПеремещениеАгрегатов
	|Справочник.Файлы.Изменение.Объект.Документ.уатПеремещениеТоваров
	|Справочник.Файлы.Изменение.Объект.Документ.уатПеремещениеТСиОборудования
	|Справочник.Файлы.Изменение.Объект.Документ.уатПланированиеРаботыТС
	|Справочник.Файлы.Изменение.Объект.Документ.уатПлатежноеПоручениеВходящее
	|Справочник.Файлы.Изменение.Объект.Документ.уатПлатежноеПоручениеИсходящее
	|Справочник.Файлы.Изменение.Объект.Документ.уатПосадочнаяВедомость
	|Справочник.Файлы.Изменение.Объект.Документ.уатПоступлениеАгрегатов
	|Справочник.Файлы.Изменение.Объект.Документ.уатПоступлениеБилетов
	|Справочник.Файлы.Изменение.Объект.Документ.уатПоступлениеТоваровУслуг
	|Справочник.Файлы.Изменение.Объект.Документ.уатПотребностьВПеревозке_уэ
	|Справочник.Файлы.Изменение.Объект.Документ.уатПриходныйКассовыйОрдер
	|Справочник.Файлы.Изменение.Объект.Документ.уатПрочиеДоходыРасходы
	|Справочник.Файлы.Изменение.Объект.Документ.уатПутевойЛист
	|Справочник.Файлы.Изменение.Объект.Документ.уатРазнарядка
	|Справочник.Файлы.Изменение.Объект.Документ.уатРаспределениеДоходовРасходов
	|Справочник.Файлы.Изменение.Объект.Документ.уатРаспределениеРасходовБудущихПериодов
	|Справочник.Файлы.Изменение.Объект.Документ.уатРасходныйКассовыйОрдер
	|Справочник.Файлы.Изменение.Объект.Документ.уатРеализацияУслуг
	|Справочник.Файлы.Изменение.Объект.Документ.уатРеестрПеревозок
	|Справочник.Файлы.Изменение.Объект.Документ.уатРемонтныйЛист
	|Справочник.Файлы.Изменение.Объект.Документ.уатСливГСМ
	|Справочник.Файлы.Изменение.Объект.Документ.уатСписаниеАгрегатов
	|Справочник.Файлы.Изменение.Объект.Документ.уатСписаниеТоваров
	|Справочник.Файлы.Изменение.Объект.Документ.уатСчетНаОплатуПокупателю
	|Справочник.Файлы.Изменение.Объект.Документ.уатСчетНаОплатуПоставщика
	|Справочник.Файлы.Изменение.Объект.Документ.уатСчетФактураВыданный
	|Справочник.Файлы.Изменение.Объект.Документ.уатТабельУчетаРабочегоВремени
	|Справочник.Файлы.Изменение.Объект.Документ.уатТТД
	|Справочник.Файлы.Изменение.Объект.Документ.уатУстановкаПрейскурантовТС
	|Справочник.Файлы.Изменение.Объект.Документ.уатУстановкаСтатусаГруза_уэ
	|Справочник.Файлы.Изменение.Объект.Документ.уатУстановкаСтатусаПЛ
	|Справочник.Файлы.Изменение.Объект.Документ.уатУстановкаТарифовЗП
	|Справочник.Файлы.Изменение.Объект.Документ.уатУстановкаТарифовСебестоимости_уэ
	|Справочник.Файлы.Изменение.Объект.Документ.уатШтраф
	|Справочник.Файлы.Изменение.Объект.Справочник.Банки
	|Справочник.Файлы.Изменение.Объект.Справочник.БанковскиеСчета
	|Справочник.Файлы.Изменение.Объект.Справочник.ВидыНоменклатуры
	|Справочник.Файлы.Изменение.Объект.Справочник.ВнешниеПользователи
	|Справочник.Файлы.Изменение.Объект.Справочник.ДоговорыКонтрагентов
	|Справочник.Файлы.Изменение.Объект.Справочник.КонтактныеЛица
	|Справочник.Файлы.Изменение.Объект.Справочник.Контрагенты
	|Справочник.Файлы.Изменение.Объект.Справочник.Номенклатура
	|Справочник.Файлы.Изменение.Объект.Справочник.НоменклатурныеГруппы
	|Справочник.Файлы.Изменение.Объект.Справочник.Организации
	|Справочник.Файлы.Изменение.Объект.Справочник.ОсновныеСредства
	|Справочник.Файлы.Изменение.Объект.Справочник.Пользователи
	|Справочник.Файлы.Изменение.Объект.Справочник.Склады
	|Справочник.Файлы.Изменение.Объект.Справочник.Сотрудники
	|Справочник.Файлы.Изменение.Объект.Справочник.уатАЗС
	|Справочник.Файлы.Изменение.Объект.Справочник.уатБилеты
	|Справочник.Файлы.Изменение.Объект.Справочник.уатВидыБилетов
	|Справочник.Файлы.Изменение.Объект.Справочник.уатВидыДокументов
	|Справочник.Файлы.Изменение.Объект.Справочник.уатВидыИспользованияРабочегоВремени
	|Справочник.Файлы.Изменение.Объект.Справочник.уатВидыОбслуживанияТС
	|Справочник.Файлы.Изменение.Объект.Справочник.уатВидыПеревозок
	|Справочник.Файлы.Изменение.Объект.Справочник.уатВыходыМаршрутов
	|Справочник.Файлы.Изменение.Объект.Справочник.уатГруппыПользователейДляСогласования
	|Справочник.Файлы.Изменение.Объект.Справочник.уатГруппыДиспетчеров
	|Справочник.Файлы.Изменение.Объект.Справочник.уатЕмкостьАккумуляторов
	|Справочник.Файлы.Изменение.Объект.Справочник.уатКартыДоступа
	|Справочник.Файлы.Изменение.Объект.Справочник.уатКлассификаторВидыТранспортныхСредств
	|Справочник.Файлы.Изменение.Объект.Справочник.уатКолонны
	|Справочник.Файлы.Изменение.Объект.Справочник.уатМакетыТС
	|Справочник.Файлы.Изменение.Объект.Справочник.уатМаршруты
	|Справочник.Файлы.Изменение.Объект.Справочник.уатМестаУстановкиШин
	|Справочник.Файлы.Изменение.Объект.Справочник.уатМобильныеУстройства
	|Справочник.Файлы.Изменение.Объект.Справочник.уатМоделиАгрегатов
	|Справочник.Файлы.Изменение.Объект.Справочник.уатМоделиСпецодеждыИИнструментов
	|Справочник.Файлы.Изменение.Объект.Справочник.уатМоделиТС
	|Справочник.Файлы.Изменение.Объект.Справочник.уатОбъектыСтроительства
	|Справочник.Файлы.Изменение.Объект.Справочник.уатПараметрыВыработки
	|Справочник.Файлы.Изменение.Объект.Справочник.уатПланыПримененияЗатрат
	|Справочник.Файлы.Изменение.Объект.Справочник.уатПластиковыеКарты
	|Справочник.Файлы.Изменение.Объект.Справочник.уатПрейскурантыТС
	|Справочник.Файлы.Изменение.Объект.Справочник.уатПричиныДТП
	|Справочник.Файлы.Изменение.Объект.Справочник.уатПричиныЗакрытияЗаказов
	|Справочник.Файлы.Изменение.Объект.Справочник.уатПричиныСписания
	|Справочник.Файлы.Изменение.Объект.Справочник.уатПунктыНазначения
	|Справочник.Файлы.Изменение.Объект.Справочник.уатРаботыПоРемонту
	|Справочник.Файлы.Изменение.Объект.Справочник.уатРежимыРаботыТС
	|Справочник.Файлы.Изменение.Объект.Справочник.уатРейсыМаршрутов
	|Справочник.Файлы.Изменение.Объект.Справочник.уатСерииНоменклатуры
	|Справочник.Файлы.Изменение.Объект.Справочник.уатСмены
	|Справочник.Файлы.Изменение.Объект.Справочник.уатСостояниеТС
	|Справочник.Файлы.Изменение.Объект.Справочник.уатСпособыОпределенияМассы
	|Справочник.Файлы.Изменение.Объект.Справочник.уатСпособыПогрузки
	|Справочник.Файлы.Изменение.Объект.Справочник.уатСтавкиПоТранспортномуНалогу
	|Справочник.Файлы.Изменение.Объект.Справочник.уатСценарииПланирования
	|Справочник.Файлы.Изменение.Объект.Справочник.уатТарифныеПланыЗП
	|Справочник.Файлы.Изменение.Объект.Справочник.уатТарифыЗП
	|Справочник.Файлы.Изменение.Объект.Справочник.уатТарифыТС
	|Справочник.Файлы.Изменение.Объект.Справочник.уатТемпературныеКоэффициентыГСМ
	|Справочник.Файлы.Изменение.Объект.Справочник.уатТипыАгрегатов
	|Справочник.Файлы.Изменение.Объект.Справочник.уатТипыТС
	|Справочник.Файлы.Изменение.Объект.Справочник.уатКлассыТС
	|Справочник.Файлы.Изменение.Объект.Справочник.уатТипыТСПоВоенкомату
	|Справочник.Файлы.Изменение.Объект.Справочник.уатТС
	|Справочник.Файлы.Изменение.Объект.Справочник.уатУсловияРаботы
	|Справочник.Файлы.Изменение.Объект.Справочник.уатЦвета
	|Справочник.Файлы.Изменение.Объект.Справочник.уатЦеха
	|Справочник.Файлы.Изменение.Объект.Справочник.уатЧаты
	|Справочник.Файлы.Изменение.Объект.Справочник.уатШаблоныСогласования
	|Справочник.Файлы.Изменение.Объект.Справочник.уатШиныВысота
	|Справочник.Файлы.Изменение.Объект.Справочник.уатШиныПрофиль
	|Справочник.Файлы.Изменение.Объект.Справочник.уатШиныРадиус
	|Справочник.Файлы.Изменение.Объект.Справочник.уатШиныШирина
	|Справочник.Файлы.Изменение.Объект.Справочник.ФизическиеЛица
	|Документ.уатАвансовыйОтчет.Чтение.Организации
	|Документ.уатАвансовыйОтчет.Чтение.Подразделения
	|Документ.уатАвансовыйОтчет.Изменение.Организации
	|Документ.уатАвансовыйОтчет.Изменение.Подразделения
	|Документ.уатАктКС3_стм.Чтение.Организации
	|Документ.уатАктКС3_стм.Изменение.Организации
	|Документ.уатАктПриемаПередачиТС.Чтение.Организации
	|Документ.уатАктПриемаПередачиТС.Чтение.Подразделения
	|Документ.уатАктПриемаПередачиТС.Изменение.Организации
	|Документ.уатАктПриемаПередачиТС.Изменение.Подразделения
	|Документ.уатАктСверкиВзаиморасчетов_уэ.Чтение.Организации
	|Документ.уатАктСверкиВзаиморасчетов_уэ.Изменение.Организации
	|Документ.уатБилетныйЛист.Чтение.Организации
	|Документ.уатБилетныйЛист.Изменение.Организации
	|Документ.уатВводВЭксплуатациюТСиОборудования.Чтение.Организации
	|Документ.уатВводВЭксплуатациюТСиОборудования.Чтение.Подразделения
	|Документ.уатВводВЭксплуатациюТСиОборудования.Изменение.Организации
	|Документ.уатВводВЭксплуатациюТСиОборудования.Изменение.Подразделения
	|Документ.уатВводНачальныхДанныхПоАгрегатам.Чтение.Организации
	|Документ.уатВводНачальныхДанныхПоАгрегатам.Чтение.Подразделения
	|Документ.уатВводНачальныхДанныхПоАгрегатам.Изменение.Организации
	|Документ.уатВводНачальныхДанныхПоАгрегатам.Изменение.Подразделения
	|Документ.уатВводНачальныхПоказаний.Чтение.Организации
	|Документ.уатВводНачальныхПоказаний.Чтение.Подразделения
	|Документ.уатВводНачальныхПоказаний.Изменение.Организации
	|Документ.уатВводНачальныхПоказаний.Изменение.Подразделения
	|Документ.уатВводОстатков.Чтение.Организации
	|Документ.уатВводОстатков.Чтение.Подразделения
	|Документ.уатВводОстатков.Изменение.Организации
	|Документ.уатВводОстатков.Изменение.Подразделения
	|Документ.уатВводОстатковГСМ.Чтение.Организации
	|Документ.уатВводОстатковГСМ.Изменение.Организации
	|Документ.уатВзаимозачет.Чтение.Организации
	|Документ.уатВзаимозачет.Чтение.Подразделения
	|Документ.уатВзаимозачет.Изменение.Организации
	|Документ.уатВзаимозачет.Изменение.Подразделения
	|Документ.уатВнутреннееПеремещение.Чтение.Организации
	|Документ.уатВнутреннееПеремещение.Чтение.Подразделения
	|Документ.уатВнутреннееПеремещение.Изменение.Организации
	|Документ.уатВнутреннееПеремещение.Изменение.Подразделения
	|Документ.уатВозвратТоваров.Чтение.Организации
	|Документ.уатВозвратТоваров.Чтение.Подразделения
	|Документ.уатВозвратТоваров.Изменение.Организации
	|Документ.уатВозвратТоваров.Изменение.Подразделения
	|Документ.уатВыбытиеТСиОборудования.Чтение.Организации
	|Документ.уатВыбытиеТСиОборудования.Чтение.Подразделения
	|Документ.уатВыбытиеТСиОборудования.Изменение.Организации
	|Документ.уатВыбытиеТСиОборудования.Изменение.Подразделения
	|Документ.уатВыдачаРасходныхМатериалов.Чтение.Организации
	|Документ.уатВыдачаРасходныхМатериалов.Чтение.Подразделения
	|Документ.уатВыдачаРасходныхМатериалов.Изменение.Организации
	|Документ.уатВыдачаРасходныхМатериалов.Изменение.Подразделения
	|Документ.уатВыручкаВодителей.Чтение.Организации
	|Документ.уатВыручкаВодителей.Изменение.Организации
	|Документ.уатДиспозицияТС.Чтение.Организации
	|Документ.уатДиспозицияТС.Изменение.Организации
	|Документ.уатДоверенность.Чтение.Организации
	|Документ.уатДоверенность.Изменение.Организации
	|Документ.уатДТП.Чтение.Организации
	|Документ.уатДТП.Чтение.Подразделения
	|Документ.уатДТП.Изменение.Организации
	|Документ.уатДТП.Изменение.Подразделения
	|Документ.уатЖурналМедицинскогоОсмотраВодителей.Чтение.Организации
	|Документ.уатЖурналМедицинскогоОсмотраВодителей.Чтение.Подразделения
	|Документ.уатЖурналМедицинскогоОсмотраВодителей.Изменение.Организации
	|Документ.уатЖурналМедицинскогоОсмотраВодителей.Изменение.Подразделения
	|Документ.уатЖурналПредрейсовогоИПослерейсовогоКонтроляТС.Чтение.Организации
	|Документ.уатЖурналПредрейсовогоИПослерейсовогоКонтроляТС.Чтение.Подразделения
	|Документ.уатЖурналПредрейсовогоИПослерейсовогоКонтроляТС.Изменение.Организации
	|Документ.уатЖурналПредрейсовогоИПослерейсовогоКонтроляТС.Изменение.Подразделения
	|Документ.уатЖурналУчетаПоказанийОдометра.Чтение.Организации
	|Документ.уатЖурналУчетаПоказанийОдометра.Чтение.Подразделения
	|Документ.уатЖурналУчетаПоказанийОдометра.Изменение.Организации
	|Документ.уатЖурналУчетаПоказанийОдометра.Изменение.Подразделения
	|Документ.уатЗаказГрузоотправителя.Чтение.Организации
	|Документ.уатЗаказГрузоотправителя.Чтение.Подразделения
	|Документ.уатЗаказГрузоотправителя.Чтение.Пользователи
	|Документ.уатЗаказГрузоотправителя.Изменение.Организации
	|Документ.уатЗаказГрузоотправителя.Изменение.Подразделения
	|Документ.уатЗаказГрузоотправителя.Изменение.Пользователи
	|Документ.уатЗаказПеревозчику_уэ.Чтение.Организации  
	|Документ.уатЗаказПеревозчику_уэ.Чтение.Пользователи
	|Документ.уатЗаказПеревозчику_уэ.Изменение.Организации
	|Документ.уатЗаказПеревозчику_уэ.Изменение.Пользователи
	|Документ.уатЗаказПоставщику.Чтение.Организации
	|Документ.уатЗаказПоставщику.Чтение.Подразделения
	|Документ.уатЗаказПоставщику.Изменение.Организации
	|Документ.уатЗаказПоставщику.Изменение.Подразделения
	|Документ.уатЗакрытиеЗаявокНаРасходованиеСредств.Чтение.Подразделения
	|Документ.уатЗакрытиеЗаявокНаРасходованиеСредств.Изменение.Подразделения
	|Документ.уатЗакрытиеЗаявокНаРемонты.Чтение.Организации
	|Документ.уатЗакрытиеЗаявокНаРемонты.Чтение.Подразделения
	|Документ.уатЗакрытиеЗаявокНаРемонты.Изменение.Организации
	|Документ.уатЗакрытиеЗаявокНаРемонты.Изменение.Подразделения
	|Документ.уатЗаправкаГСМ.Чтение.Организации
	|Документ.уатЗаправкаГСМ.Чтение.Подразделения
	|Документ.уатЗаправкаГСМ.Изменение.Организации
	|Документ.уатЗаправкаГСМ.Изменение.Подразделения
	|Документ.уатЗаявкаНаРасходованиеДС.Чтение.Организации
	|Документ.уатЗаявкаНаРасходованиеДС.Чтение.Подразделения
	|Документ.уатЗаявкаНаРасходованиеДС.Изменение.Организации
	|Документ.уатЗаявкаНаРасходованиеДС.Изменение.Подразделения
	|Документ.уатЗаявкаНаРемонт.Чтение.Организации
	|Документ.уатЗаявкаНаРемонт.Чтение.Подразделения
	|Документ.уатЗаявкаНаРемонт.Изменение.Организации
	|Документ.уатЗаявкаНаРемонт.Изменение.Подразделения
	|Документ.уатИзменениеCчетчиковТС.Чтение.Организации
	|Документ.уатИзменениеCчетчиковТС.Чтение.Подразделения
	|Документ.уатИзменениеCчетчиковТС.Изменение.Организации
	|Документ.уатИзменениеCчетчиковТС.Изменение.Подразделения
	|Документ.уатИнвентаризацияАгрегатов.Чтение.Организации
	|Документ.уатИнвентаризацияАгрегатов.Чтение.Подразделения
	|Документ.уатИнвентаризацияАгрегатов.Изменение.Организации
	|Документ.уатИнвентаризацияАгрегатов.Изменение.Подразделения
	|Документ.уатИнвентаризацияГСМвТС.Чтение.Организации
	|Документ.уатИнвентаризацияГСМвТС.Чтение.Подразделения
	|Документ.уатИнвентаризацияГСМвТС.Изменение.Организации
	|Документ.уатИнвентаризацияГСМвТС.Изменение.Подразделения
	|Документ.уатИнвентаризацияТоваров.Чтение.Организации
	|Документ.уатИнвентаризацияТоваров.Чтение.Подразделения
	|Документ.уатИнвентаризацияТоваров.Изменение.Организации
	|Документ.уатИнвентаризацияТоваров.Изменение.Подразделения
	|Документ.уатКомандировкиОрганизаций.Чтение.Организации
	|Документ.уатКомандировкиОрганизаций.Изменение.Организации
	|Документ.уатКорректировкаДолга.Чтение.Организации
	|Документ.уатКорректировкаДолга.Чтение.Подразделения
	|Документ.уатКорректировкаДолга.Изменение.Организации
	|Документ.уатКорректировкаДолга.Изменение.Подразделения
	|Документ.уатКорректировкаИспользованияРаботникамиРабочегоВремени.Чтение.Организации
	|Документ.уатКорректировкаИспользованияРаботникамиРабочегоВремени.Изменение.Организации
	|Документ.уатМаршрутныйЛист.Чтение.Организации
	|Документ.уатМаршрутныйЛист.Чтение.Подразделения
	|Документ.уатМаршрутныйЛист.Чтение.Пользователи
	|Документ.уатМаршрутныйЛист.Изменение.Организации
	|Документ.уатМаршрутныйЛист.Изменение.Подразделения
	|Документ.уатМаршрутныйЛист.Изменение.Пользователи
	|Документ.уатНачислениеЗарплаты.Чтение.Организации
	|Документ.уатНачислениеЗарплаты.Чтение.Подразделения
	|Документ.уатНачислениеЗарплаты.Изменение.Организации
	|Документ.уатНачислениеЗарплаты.Изменение.Подразделения
	|Документ.уатНачислениеПремий.Чтение.Организации
	|Документ.уатНачислениеПремий.Чтение.Подразделения
	|Документ.уатНачислениеПремий.Изменение.Организации
	|Документ.уатНачислениеПремий.Изменение.Подразделения
	|Документ.уатНачислениеУдержаний.Чтение.Организации
	|Документ.уатНачислениеУдержаний.Чтение.Подразделения
	|Документ.уатНачислениеУдержаний.Изменение.Организации
	|Документ.уатНачислениеУдержаний.Изменение.Подразделения
	|Документ.уатОперацииСАгрегатами.Чтение.Организации
	|Документ.уатОперацииСАгрегатами.Чтение.Подразделения
	|Документ.уатОперацииСАгрегатами.Изменение.Организации
	|Документ.уатОперацииСАгрегатами.Изменение.Подразделения
	|Документ.уатОперацииСТехническимиЖидкостями.Чтение.Организации
	|Документ.уатОперацииСТехническимиЖидкостями.Чтение.Подразделения
	|Документ.уатОперацииСТехническимиЖидкостями.Изменение.Организации
	|Документ.уатОперацииСТехническимиЖидкостями.Изменение.Подразделения
	|Документ.уатОприходованиеТоваров.Чтение.Организации
	|Документ.уатОприходованиеТоваров.Чтение.Подразделения
	|Документ.уатОприходованиеТоваров.Изменение.Организации
	|Документ.уатОприходованиеТоваров.Изменение.Подразделения
	|Документ.уатОтклонениеГруза.Чтение.Организации
	|Документ.уатОтклонениеГруза.Чтение.Подразделения
	|Документ.уатОтклонениеГруза.Изменение.Организации
	|Документ.уатОтклонениеГруза.Изменение.Подразделения
	|Документ.уатОтчетПоставщикаПЦ.Чтение.Организации
	|Документ.уатОтчетПоставщикаПЦ.Чтение.Подразделения
	|Документ.уатОтчетПоставщикаПЦ.Изменение.Организации
	|Документ.уатОтчетПоставщикаПЦ.Изменение.Подразделения
	|Документ.уатПарковка.Чтение.Организации
	|Документ.уатПарковка.Изменение.Организации
	|Документ.уатОтчетСистемыПлатон.Чтение.Организации
	|Документ.уатОтчетСистемыПлатон.Изменение.Организации
	|Документ.уатОтчетСистемыАвтодор.Чтение.Организации
	|Документ.уатОтчетСистемыАвтодор.Изменение.Организации
	|Документ.уатПакетСопроводительныхДокументов.Чтение.Организации
	|Документ.уатПакетСопроводительныхДокументов.Изменение.Организации
	|Документ.уатПеремещениеАгрегатов.Чтение.Организации
	|Документ.уатПеремещениеАгрегатов.Чтение.Подразделения
	|Документ.уатПеремещениеАгрегатов.Изменение.Организации
	|Документ.уатПеремещениеАгрегатов.Изменение.Подразделения
	|Документ.уатПеремещениеТоваров.Чтение.Организации
	|Документ.уатПеремещениеТоваров.Чтение.Подразделения
	|Документ.уатПеремещениеТоваров.Изменение.Организации
	|Документ.уатПеремещениеТоваров.Изменение.Подразделения
	|Документ.уатПеремещениеТСиОборудования.Чтение.Организации
	|Документ.уатПеремещениеТСиОборудования.Чтение.Подразделения
	|Документ.уатПеремещениеТСиОборудования.Изменение.Организации
	|Документ.уатПеремещениеТСиОборудования.Изменение.Подразделения
	|Документ.уатПланированиеРаботыТС.Чтение.Организации
	|Документ.уатПланированиеРаботыТС.Чтение.Подразделения
	|Документ.уатПланированиеРаботыТС.Изменение.Организации
	|Документ.уатПланированиеРаботыТС.Изменение.Подразделения
	|Документ.уатПлатежноеПоручениеВходящее.Чтение.Организации
	|Документ.уатПлатежноеПоручениеВходящее.Чтение.Подразделения
	|Документ.уатПлатежноеПоручениеВходящее.Изменение.Организации
	|Документ.уатПлатежноеПоручениеВходящее.Изменение.Подразделения
	|Документ.уатПлатежноеПоручениеИсходящее.Чтение.Организации
	|Документ.уатПлатежноеПоручениеИсходящее.Чтение.Подразделения
	|Документ.уатПлатежноеПоручениеИсходящее.Изменение.Организации
	|Документ.уатПлатежноеПоручениеИсходящее.Изменение.Подразделения
	|Документ.уатПосадочнаяВедомость.Чтение.Организации
	|Документ.уатПосадочнаяВедомость.Изменение.Организации
	|Документ.уатПоступлениеАгрегатов.Чтение.Организации
	|Документ.уатПоступлениеАгрегатов.Чтение.Подразделения
	|Документ.уатПоступлениеАгрегатов.Изменение.Организации
	|Документ.уатПоступлениеАгрегатов.Изменение.Подразделения
	|Документ.уатПоступлениеБилетов.Чтение.Организации
	|Документ.уатПоступлениеБилетов.Изменение.Организации
	|Документ.уатПоступлениеТоваровУслуг.Чтение.Организации
	|Документ.уатПоступлениеТоваровУслуг.Чтение.Подразделения
	|Документ.уатПоступлениеТоваровУслуг.Чтение.Пользователи
	|Документ.уатПоступлениеТоваровУслуг.Изменение.Организации
	|Документ.уатПоступлениеТоваровУслуг.Изменение.Подразделения
	|Документ.уатПоступлениеТоваровУслуг.Изменение.Пользователи
	|Документ.уатПотребностьВПеревозке_уэ.Чтение.Организации
	|Документ.уатПотребностьВПеревозке_уэ.Чтение.Подразделения
	|Документ.уатПотребностьВПеревозке_уэ.Чтение.Пользователи
	|Документ.уатПотребностьВПеревозке_уэ.Изменение.Организации
	|Документ.уатПотребностьВПеревозке_уэ.Изменение.Подразделения 
	|Документ.уатПотребностьВПеревозке_уэ.Изменение.Пользователи
	|Документ.уатПриходныйКассовыйОрдер.Чтение.Организации
	|Документ.уатПриходныйКассовыйОрдер.Чтение.Подразделения
	|Документ.уатПриходныйКассовыйОрдер.Изменение.Организации
	|Документ.уатПриходныйКассовыйОрдер.Изменение.Подразделения
	|Документ.уатПрочиеДоходыРасходы.Чтение.Организации
	|Документ.уатПрочиеДоходыРасходы.Чтение.Подразделения
	|Документ.уатПрочиеДоходыРасходы.Изменение.Организации
	|Документ.уатПрочиеДоходыРасходы.Изменение.Подразделения
	|Документ.уатПутевойЛист.Чтение.Организации
	|Документ.уатПутевойЛист.Чтение.Подразделения
	|Документ.уатПутевойЛист.Изменение.Организации
	|Документ.уатПутевойЛист.Изменение.Подразделения
	|Документ.уатРазнарядка.Чтение.Организации
	|Документ.уатРазнарядка.Чтение.Подразделения
	|Документ.уатРазнарядка.Изменение.Организации
	|Документ.уатРазнарядка.Изменение.Подразделения
	|Документ.уатРаспределениеДоходовРасходов.Чтение.Организации
	|Документ.уатРаспределениеДоходовРасходов.Изменение.Организации
	|Документ.уатРаспределениеРасходовБудущихПериодов.Чтение.Организации
	|Документ.уатРаспределениеРасходовБудущихПериодов.Чтение.Подразделения
	|Документ.уатРаспределениеРасходовБудущихПериодов.Изменение.Организации
	|Документ.уатРаспределениеРасходовБудущихПериодов.Изменение.Подразделения
	|Документ.уатРасходныйКассовыйОрдер.Чтение.Организации
	|Документ.уатРасходныйКассовыйОрдер.Чтение.Подразделения
	|Документ.уатРасходныйКассовыйОрдер.Изменение.Организации
	|Документ.уатРасходныйКассовыйОрдер.Изменение.Подразделения
	|Документ.уатРеализацияУслуг.Чтение.Организации
	|Документ.уатРеализацияУслуг.Чтение.Подразделения 
	|Документ.уатРеализацияУслуг.Чтение.Пользователи
	|Документ.уатРеализацияУслуг.Изменение.Организации
	|Документ.уатРеализацияУслуг.Изменение.Подразделения
	|Документ.уатРеализацияУслуг.Изменение.Пользователи
	|Документ.уатРасчетСводныхПараметровВыработки.Чтение.Организации
	|Документ.уатРасчетСводныхПараметровВыработки.Изменение.Организации
	|Документ.уатРасчетФактическихДанныхПоДолгосрочномуПланированию.Чтение.Организации
	|Документ.уатРасчетФактическихДанныхПоДолгосрочномуПланированию.Изменение.Организации
	|Документ.уатРеестрОплатыШтрафов.Чтение.Организации
	|Документ.уатРеестрОплатыШтрафов.Изменение.Организации
	|Документ.уатРеестрПеревозок.Чтение.Организации
	|Документ.уатРеестрПеревозок.Чтение.Подразделения
	|Документ.уатРеестрПеревозок.Изменение.Организации
	|Документ.уатРеестрПеревозок.Изменение.Подразделения
	|Документ.уатРемонтныйЛист.Чтение.Организации
	|Документ.уатРемонтныйЛист.Чтение.Подразделения
	|Документ.уатРемонтныйЛист.Изменение.Организации
	|Документ.уатРемонтныйЛист.Изменение.Подразделения
	|Документ.уатСливГСМ.Чтение.Организации
	|Документ.уатСливГСМ.Чтение.Подразделения
	|Документ.уатСливГСМ.Изменение.Организации
	|Документ.уатСливГСМ.Изменение.Подразделения
	|Документ.уатСписаниеАгрегатов.Чтение.Организации
	|Документ.уатСписаниеАгрегатов.Чтение.Подразделения
	|Документ.уатСписаниеАгрегатов.Изменение.Организации
	|Документ.уатСписаниеАгрегатов.Изменение.Подразделения
	|Документ.уатСписаниеТоваров.Чтение.Организации
	|Документ.уатСписаниеТоваров.Чтение.Подразделения
	|Документ.уатСписаниеТоваров.Изменение.Организации
	|Документ.уатСписаниеТоваров.Изменение.Подразделения
	|Документ.уатСчетНаОплатуПокупателю.Чтение.Организации
	|Документ.уатСчетНаОплатуПокупателю.Чтение.Пользователи
	|Документ.уатСчетНаОплатуПокупателю.Изменение.Организации
	|Документ.уатСчетНаОплатуПокупателю.Изменение.Пользователи
	|Документ.уатСчетНаОплатуПоставщика.Чтение.Организации
	|Документ.уатСчетНаОплатуПоставщика.Чтение.Пользователи
	|Документ.уатСчетНаОплатуПоставщика.Изменение.Организации 
	|Документ.уатСчетНаОплатуПоставщика.Изменение.Пользователи
	|Документ.уатСчетФактураВыданный.Чтение.Организации
	|Документ.уатСчетФактураВыданный.Чтение.Подразделения
	|Документ.уатСчетФактураВыданный.Чтение.Пользователи
	|Документ.уатСчетФактураВыданный.Изменение.Организации
	|Документ.уатСчетФактураВыданный.Изменение.Подразделения
	|Документ.уатСчетФактураВыданный.Изменение.Пользователи
	|Документ.уатТабельУчетаРабочегоВремени.Чтение.Организации
	|Документ.уатТабельУчетаРабочегоВремени.Чтение.Подразделения
	|Документ.уатТабельУчетаРабочегоВремени.Изменение.Организации
	|Документ.уатТабельУчетаРабочегоВремени.Изменение.Подразделения
	|Документ.уатТехнологическийПутевойЛист.Чтение.Организации
	|Документ.уатТехнологическийПутевойЛист.Чтение.Подразделения
	|Документ.уатТехнологическийПутевойЛист.Изменение.Организации
	|Документ.уатТехнологическийПутевойЛист.Изменение.Подразделения
	|Документ.уатТТД.Чтение.Организации
	|Документ.уатТТД.Чтение.Подразделения
	|Документ.уатТТД.Изменение.Организации
	|Документ.уатТТД.Изменение.Подразделения
	|Документ.уатУстановкаПрейскурантовТС.Чтение.Организации
	|Документ.уатУстановкаПрейскурантовТС.Изменение.Организации
	|Документ.уатУстановкаСтатусаГруза_уэ.Чтение.Организации
	|Документ.уатУстановкаСтатусаГруза_уэ.Изменение.Организации 
	|Документ.уатУстановкаСтатусаПЛ.Чтение.Организации
	|Документ.уатУстановкаСтатусаПЛ.Изменение.Организации
	|Документ.уатУстановкаСтатусовСопроводительныхДокументов.Чтение.Организации
	|Документ.уатУстановкаСтатусовСопроводительныхДокументов.Изменение.Организации
	|Документ.уатУстановкаТарифовЗП.Чтение.Организации
	|Документ.уатУстановкаТарифовЗП.Изменение.Организации
	|Документ.уатУстановкаТарифовСебестоимости_уэ.Чтение.Организации
	|Документ.уатУстановкаТарифовСебестоимости_уэ.Изменение.Организации
	|Документ.уатШтраф.Чтение.Организации
	|Документ.уатШтраф.Чтение.Подразделения
	|Документ.уатШтраф.Изменение.Организации
	|Документ.уатШтраф.Изменение.Подразделения
	|Документ.ЭкземплярБюджета.Чтение.Организации
	|Документ.ЭкземплярБюджета.Изменение.Организации
	|ЖурналДокументов.уатДокументыГСМ.Чтение.Организации
	|ЖурналДокументов.уатДокументыПоАгрегатам.Чтение.Организации
	|ЖурналДокументов.уатДокументыПоРемонтам.Чтение.Организации
	|ЖурналДокументов.уатКассовыеИБанковскиеДокументы.Чтение.Организации
	|ЖурналДокументов.уатСкладскиеДокументы.Чтение.Организации
	|РегистрСведений.ДанныеБизнесПроцессов.Чтение.Объект.БизнесПроцесс.уатСогласование
	|РегистрСведений.ОсновныеДоговорыКонтрагента.Чтение.Организации
	|РегистрСведений.ОсновныеДоговорыКонтрагента.Изменение.Организации
	|РегистрСведений.ОтветственныеЛицаОрганизаций.Чтение.Организации
	|РегистрСведений.ОтветственныеЛицаОрганизаций.Изменение.Организации
	|РегистрСведений.уатВодителиНаЛинии.Чтение.Организации
	|РегистрСведений.уатВодителиНаЛинии.Чтение.Подразделения
	|РегистрСведений.уатВодителиНаЛинии.Изменение.Организации
	|РегистрСведений.уатВодителиНаЛинии.Изменение.Подразделения
	|РегистрСведений.уатДополнительныеСведенияПоGPS.Чтение.Организации
	|РегистрСведений.уатДополнительныеСведенияПоGPS.Чтение.Подразделения
	|РегистрСведений.уатДополнительныеСведенияПоGPS.Изменение.Организации
	|РегистрСведений.уатДополнительныеСведенияПоGPS.Изменение.Подразделения
	|РегистрСведений.уатДоступКДокументам.Чтение.Организации
	|РегистрСведений.уатДоступКДокументам.Изменение.Организации
	|РегистрСведений.уатИсторияКоординатМП.Чтение.Организации
	|РегистрСведений.уатИсторияКоординатМП.Чтение.Подразделения
	|РегистрСведений.уатИсторияКоординатМП.Изменение.Организации
	|РегистрСведений.уатИсторияКоординатМП.Изменение.Подразделения
	|РегистрСведений.уатКоординатыПоМониторингу.Чтение.Организации
	|РегистрСведений.уатКоординатыПоМониторингу.Чтение.Подразделения
	|РегистрСведений.уатКоординатыПоМониторингу.Изменение.Организации
	|РегистрСведений.уатКоординатыПоМониторингу.Изменение.Подразделения
	|РегистрСведений.уатМестонахождениеТС.Чтение.Организации
	|РегистрСведений.уатМестонахождениеТС.Чтение.Подразделения
	|РегистрСведений.уатМестонахождениеТС.Изменение.Организации
	|РегистрСведений.уатМестонахождениеТС.Изменение.Подразделения
	|РегистрСведений.уатНормыРасходаГСМ.Чтение.Организации
	|РегистрСведений.уатНормыРасходаГСМ.Изменение.Организации
	|РегистрСведений.уатНумерацияОбъектов.Чтение.Организации
	|РегистрСведений.уатНумерацияОбъектов.Изменение.Организации
	|РегистрСведений.уатПараметрыАвторизацииТерминала.Чтение.Организации
	|РегистрСведений.уатПараметрыАвторизацииТерминала.Изменение.Организации
	|РегистрСведений.уатПраваИНастройки.Чтение.Организации
	|РегистрСведений.уатПраваИНастройки.Чтение.Подразделения
	|РегистрСведений.уатПраваИНастройки.Изменение.Организации
	|РегистрСведений.уатПраваИНастройки.Изменение.Подразделения
	|РегистрСведений.уатПробегРасходПоМониторингу.Чтение.Организации
	|РегистрСведений.уатПробегРасходПоМониторингу.Чтение.Подразделения
	|РегистрСведений.уатПробегРасходПоМониторингу.Изменение.Организации
	|РегистрСведений.уатПробегРасходПоМониторингу.Изменение.Подразделения
	|РегистрСведений.уатКадроваяИсторияСотрудников.Чтение.Организации
	|РегистрСведений.уатКадроваяИсторияСотрудников.Изменение.Организации
	|РегистрСведений.уатТарифыСебестоимости_уэ.Чтение.Организации
	|РегистрСведений.уатТарифыСебестоимости_уэ.Изменение.Организации
	|РегистрСведений.уатТекущиеКоординатыМП.Чтение.Организации
	|РегистрСведений.уатТекущиеКоординатыМП.Чтение.Подразделения
	|РегистрСведений.уатТекущиеКоординатыМП.Изменение.Организации
	|РегистрСведений.уатТекущиеКоординатыМП.Изменение.Подразделения
	|РегистрСведений.уатУчетнаяПолитика.Чтение.Организации
	|РегистрСведений.уатУчетнаяПолитика.Изменение.Организации
	|РегистрСведений.уатЭкипажТС.Чтение.Организации
	|РегистрСведений.уатЭкипажТС.Чтение.Подразделения
	|РегистрСведений.уатЭкипажТС.Изменение.Организации
	|РегистрСведений.уатЭкипажТС.Изменение.Подразделения
	|РегистрСведений.ФИОФизическихЛиц.Чтение.Организации
	|РегистрСведений.ФИОФизическихЛиц.Изменение.Организации
	|РегистрНакопления.ОборотыБюджетов.Чтение.Организации
	|РегистрНакопления.ОборотыБюджетов.Чтение.Подразделения
	|РегистрНакопления.ОборотыБюджетов.Изменение.Организации
	|РегистрНакопления.ОборотыБюджетов.Изменение.Подразделения
	|РегистрНакопления.уатВзаиморасчетыСКонтрагентами.Чтение.Организации
	|РегистрНакопления.уатВзаиморасчетыСКонтрагентами.Изменение.Организации
	|РегистрНакопления.уатВыработкаАгрегатов.Чтение.Организации
	|РегистрНакопления.уатВыработкаАгрегатов.Изменение.Организации
	|РегистрНакопления.уатВыработкаПоМаршрутнымЛистам_уэ.Чтение.Организации
	|РегистрНакопления.уатВыработкаПоМаршрутнымЛистам_уэ.Чтение.Подразделения
	|РегистрНакопления.уатВыработкаПоМаршрутнымЛистам_уэ.Изменение.Организации
	|РегистрНакопления.уатВыработкаПоМаршрутнымЛистам_уэ.Изменение.Подразделения
	|РегистрНакопления.уатВыработкаСотрудников.Чтение.Организации
	|РегистрНакопления.уатВыработкаСотрудников.Чтение.Подразделения
	|РегистрНакопления.уатВыработкаСотрудников.Изменение.Организации
	|РегистрНакопления.уатВыработкаСотрудников.Изменение.Подразделения
	|РегистрНакопления.уатВыработкаСотрудниковПоМаршрутнымЛистам.Чтение.Организации
	|РегистрНакопления.уатВыработкаСотрудниковПоМаршрутнымЛистам.Чтение.Подразделения
	|РегистрНакопления.уатВыработкаСотрудниковПоМаршрутнымЛистам.Изменение.Организации
	|РегистрНакопления.уатВыработкаСотрудниковПоМаршрутнымЛистам.Изменение.Подразделения
	|РегистрНакопления.уатВыработкаТС.Чтение.Организации
	|РегистрНакопления.уатВыработкаТС.Чтение.Подразделения
	|РегистрНакопления.уатВыработкаТС.Изменение.Организации
	|РегистрНакопления.уатВыработкаТС.Изменение.Подразделения
	|РегистрНакопления.уатВыручка.Чтение.Организации
	|РегистрНакопления.уатВыручка.Изменение.Организации
	|РегистрНакопления.уатВыставленныеУслуги.Чтение.Организации
	|РегистрНакопления.уатВыставленныеУслуги.Изменение.Организации
	|РегистрНакопления.уатГрузыКПеревозке_уэ.Чтение.Подразделения
	|РегистрНакопления.уатГрузыКПеревозке_уэ.Изменение.Подразделения
	|РегистрНакопления.уатДвижениеДС.Чтение.Организации
	|РегистрНакопления.уатДвижениеДС.Изменение.Организации
	|РегистрНакопления.уатДоходы.Чтение.Организации
	|РегистрНакопления.уатДоходы.Чтение.Подразделения
	|РегистрНакопления.уатДоходы.Изменение.Организации
	|РегистрНакопления.уатДоходы.Изменение.Подразделения
	|РегистрНакопления.уатЗаказыГрузоотправителей.Чтение.Подразделения
	|РегистрНакопления.уатЗаказыГрузоотправителей.Изменение.Подразделения
	|РегистрНакопления.уатЗаказыПоставщикам.Чтение.Организации
	|РегистрНакопления.уатЗаказыПоставщикам.Чтение.Подразделения
	|РегистрНакопления.уатЗаказыПоставщикам.Изменение.Организации
	|РегистрНакопления.уатЗаказыПоставщикам.Изменение.Подразделения
	|РегистрНакопления.уатЗаявкиНаРасходованиеДС.Чтение.Организации
	|РегистрНакопления.уатЗаявкиНаРасходованиеДС.Изменение.Организации
	|РегистрНакопления.уатЗаявкиНаРемонт.Чтение.Организации
	|РегистрНакопления.уатЗаявкиНаРемонт.Изменение.Организации
	|РегистрНакопления.уатИзносАгрегатов.Чтение.Организации
	|РегистрНакопления.уатИзносАгрегатов.Изменение.Организации
	|РегистрНакопления.уатОборотыПоЗаправкамГСМ.Чтение.Организации
	|РегистрНакопления.уатОборотыПоЗаправкамГСМ.Чтение.Подразделения
	|РегистрНакопления.уатОборотыПоЗаправкамГСМ.Изменение.Организации
	|РегистрНакопления.уатОборотыПоЗаправкамГСМ.Изменение.Подразделения
	|РегистрНакопления.уатОборотыПоМаршрутномуЛисту.Чтение.Организации
	|РегистрНакопления.уатОборотыПоМаршрутномуЛисту.Изменение.Организации
	|РегистрНакопления.уатОборотыПоОтчетамПоставщиковПЦ.Чтение.Организации
	|РегистрНакопления.уатОборотыПоОтчетамПоставщиковПЦ.Изменение.Организации
	|РегистрНакопления.уатОстаткиДС.Чтение.Организации
	|РегистрНакопления.уатОстаткиДС.Изменение.Организации
	|РегистрНакопления.уатОстаткиДСУПодотчетныхЛиц.Чтение.Организации
	|РегистрНакопления.уатОстаткиДСУПодотчетныхЛиц.Изменение.Организации
	|РегистрНакопления.уатПартииТоваровНаСкладах.Чтение.Организации
	|РегистрНакопления.уатПартииТоваровНаСкладах.Изменение.Организации
	|РегистрНакопления.уатПлановыеУслуги_уэ.Чтение.Организации
	|РегистрНакопления.уатПлановыеУслуги_уэ.Изменение.Организации
	|РегистрНакопления.уатПланРаботыТС.Чтение.Подразделения
	|РегистрНакопления.уатПланРаботыТС.Изменение.Подразделения
	|РегистрНакопления.уатРасчетыПоДокументам.Чтение.Организации
	|РегистрНакопления.уатРасчетыПоДокументам.Изменение.Организации
	|РегистрНакопления.уатПредоставленныеУслуги.Чтение.Организации
	|РегистрНакопления.уатПредоставленныеУслуги.Изменение.Организации
	|РегистрНакопления.уатРабочееВремяСотрудников.Чтение.Организации
	|РегистрНакопления.уатРабочееВремяСотрудников.Изменение.Организации
	|РегистрНакопления.уатРасходГСМнаТС.Чтение.Организации
	|РегистрНакопления.уатРасходГСМнаТС.Изменение.Организации
	|РегистрНакопления.уатРасшифровкаРасходаГСМнаТС.Чтение.Организации
	|РегистрНакопления.уатРасшифровкаРасходаГСМнаТС.Изменение.Организации
	|РегистрНакопления.уатОборотыТЖнаТС.Чтение.Организации
	|РегистрНакопления.уатОборотыТЖнаТС.Изменение.Организации
	|РегистрНакопления.уатРасходы.Чтение.Организации
	|РегистрНакопления.уатРасходы.Чтение.Подразделения
	|РегистрНакопления.уатРасходы.Изменение.Организации
	|РегистрНакопления.уатРасходы.Изменение.Подразделения
	|РегистрНакопления.уатФинансовыеРезультаты.Чтение.Организации
	|РегистрНакопления.уатФинансовыеРезультаты.Чтение.Подразделения
	|РегистрНакопления.уатФинансовыеРезультаты.Изменение.Организации
	|РегистрНакопления.уатФинансовыеРезультаты.Изменение.Подразделения
	|Задача.ЗадачаИсполнителя.Чтение.Объект.БизнесПроцесс.уатСогласование
	|РегистрРасчета.уатОсновныеНачисления.Чтение.Организации
	|РегистрРасчета.уатОсновныеНачисления.Изменение.Организации
	|РегистрРасчета.уатНачисленияФизическимЛицам.Чтение.Организации
	|РегистрРасчета.уатНачисленияФизическимЛицам.Изменение.Организации
	|РегистрРасчета.уатУдержания.Чтение.Организации
	|РегистрРасчета.уатУдержания.Изменение.Организации
	|"; 
	
	Если уатОбщегоНазначенияПовтИсп.ВариантПоставкиКОРП() Тогда 
		Описание = Описание + "
		|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.уатТипыСобытий_уэ
		|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатАктОтгрузки_уэ
		|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатАктПриемки_уэ
		|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатОперацияСГрузом_уэ
		|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатРассылкаЭлектронныхПисем_уэ
		|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатРекламация_уэ
		|Справочник.ВерсииФайлов.Чтение.Объект.Документ.уатТендер_уэ
		|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.уатТипыСобытий_уэ
		|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатАктОтгрузки_уэ
		|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатАктПриемки_уэ
		|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатОперацияСГрузом_уэ
		|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатРассылкаЭлектронныхПисем_уэ
		|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатРекламация_уэ
		|Справочник.ВерсииФайлов.Изменение.Объект.Документ.уатТендер_уэ
		|Справочник.Файлы.Чтение.Объект.Справочник.уатТипыСобытий_уэ
		|Справочник.Файлы.Чтение.Объект.Документ.уатАктОтгрузки_уэ
		|Справочник.Файлы.Чтение.Объект.Документ.уатАктПриемки_уэ
		|Справочник.Файлы.Чтение.Объект.Документ.уатОперацияСГрузом_уэ
		|Справочник.Файлы.Чтение.Объект.Документ.уатРассылкаЭлектронныхПисем_уэ
		|Справочник.Файлы.Чтение.Объект.Документ.уатРекламация_уэ
		|Справочник.Файлы.Чтение.Объект.Документ.уатТендер_уэ
		|Справочник.Файлы.Изменение.Объект.Справочник.уатТипыСобытий_уэ
		|Справочник.Файлы.Изменение.Объект.Документ.уатАктОтгрузки_уэ
		|Справочник.Файлы.Изменение.Объект.Документ.уатАктПриемки_уэ
		|Справочник.Файлы.Изменение.Объект.Документ.уатОперацияСГрузом_уэ
		|Справочник.Файлы.Изменение.Объект.Документ.уатРассылкаЭлектронныхПисем_уэ
		|Справочник.Файлы.Изменение.Объект.Документ.уатРекламация_уэ
		|Справочник.Файлы.Изменение.Объект.Документ.уатТендер_уэ
		|Документ.уатАктОтгрузки_уэ.Чтение.Организации
		|Документ.уатАктОтгрузки_уэ.Изменение.Организации
		|Документ.уатАктПриемки_уэ.Чтение.Организации
		|Документ.уатАктПриемки_уэ.Изменение.Организации
		|Документ.уатАктСверкиСтраховыхСертификатов_уэ.Чтение.Организации
		|Документ.уатАктСверкиСтраховыхСертификатов_уэ.Чтение.Подразделения
		|Документ.уатАктСверкиСтраховыхСертификатов_уэ.Изменение.Организации
		|Документ.уатАктСверкиСтраховыхСертификатов_уэ.Изменение.Подразделения
		|Документ.уатОперацияСГрузом_уэ.Чтение.Организации
		|Документ.уатОперацияСГрузом_уэ.Изменение.Организации
		|Документ.уатРассылкаЭлектронныхПисем_уэ.Чтение.Организации
		|Документ.уатРассылкаЭлектронныхПисем_уэ.Чтение.Подразделения
		|Документ.уатРассылкаЭлектронныхПисем_уэ.Изменение.Организации
		|Документ.уатРассылкаЭлектронныхПисем_уэ.Изменение.Подразделения
		|Документ.уатРекламация_уэ.Чтение.Организации
		|Документ.уатРекламация_уэ.Чтение.Подразделения
		|Документ.уатРекламация_уэ.Изменение.Организации
		|Документ.уатРекламация_уэ.Изменение.Подразделения
		|Документ.уатСтраховойСертификат_уэ.Чтение.Организации
		|Документ.уатСтраховойСертификат_уэ.Чтение.Подразделения
		|Документ.уатСтраховойСертификат_уэ.Чтение.Пользователи
		|Документ.уатСтраховойСертификат_уэ.Изменение.Организации
		|Документ.уатСтраховойСертификат_уэ.Изменение.Подразделения 
		|Документ.уатСтраховойСертификат_уэ.Изменение.Пользователи
		|Документ.уатТендер_уэ.Чтение.Организации
		|Документ.уатТендер_уэ.Чтение.Подразделения
		|Документ.уатТендер_уэ.Изменение.Организации
		|Документ.уатТендер_уэ.Изменение.Подразделения
		|РегистрНакопления.уатРекламации_уэ.Чтение.Организации
		|РегистрНакопления.уатРекламации_уэ.Изменение.Организации
		|";
	КонецЕсли;
	
	Если уатОбщегоНазначенияПовтИсп.ВариантПоставкиТАКСИ() Тогда
		Описание = Описание + "
		|Справочник.ВерсииФайлов.Чтение.Объект.Документ.такАгентскийДоговор
		|Справочник.ВерсииФайлов.Изменение.Объект.Документ.такАгентскийДоговор
		|Справочник.ВерсииФайлов.Чтение.Объект.Документ.такАрендаТС
		|Справочник.ВерсииФайлов.Изменение.Объект.Документ.такАрендаТС
		|Справочник.ВерсииФайлов.Чтение.Объект.Документ.такЗаказТакси
		|Справочник.ВерсииФайлов.Изменение.Объект.Документ.такЗаказТакси
		|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.такПричиныЗанесенияВЧерныйСписок 
		|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.такПричиныЗанесенияВЧерныйСписок
		|Справочник.Файлы.Чтение.Объект.Документ.такАгентскийДоговор
		|Справочник.Файлы.Изменение.Объект.Документ.такАгентскийДоговор
		|Справочник.Файлы.Чтение.Объект.Документ.такАрендаТС
		|Справочник.Файлы.Изменение.Объект.Документ.такАрендаТС
		|Справочник.Файлы.Чтение.Объект.Документ.такЗаказТакси
		|Справочник.Файлы.Изменение.Объект.Документ.такЗаказТакси 
		|Справочник.Файлы.Чтение.Объект.Справочник.такПричиныЗанесенияВЧерныйСписок
		|Справочник.Файлы.Изменение.Объект.Справочник.такПричиныЗанесенияВЧерныйСписок
		|Документ.такАгентскийДоговор.Чтение.Организации
		|Документ.такАгентскийДоговор.Чтение.Подразделения
		|Документ.такАгентскийДоговор.Изменение.Организации
		|Документ.такАгентскийДоговор.Изменение.Подразделения
		|Документ.такАрендаТС.Чтение.Организации
		|Документ.такАрендаТС.Чтение.Подразделения
		|Документ.такАрендаТС.Изменение.Организации
		|Документ.такАрендаТС.Изменение.Подразделения
		|Документ.такЗаказТакси.Чтение.Организации
		|Документ.такЗаказТакси.Чтение.Подразделения
		|Документ.такЗаказТакси.Изменение.Организации
		|Документ.такЗаказТакси.Изменение.Подразделения
		|";
	КонецЕсли;
	
	уатРаспознаваниеДокументов.ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание);
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции


#Область ПроцедурыЗаполненияПрофилей_ПрикладныеРоли

Процедура ЗаполнитьПоставляемыеПрофилиПрикладныхРолей(ОписанияПрофилей, ПараметрыОбновления)
	
	ДополнятьРолямиОрганайзера = Истина;
	
	// Профиль "ГСМ".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "e068c0e6-168a-11e6-a9fc-ac220b763c3f";
	ОписаниеПрофиля.Наименование  = НСтр("en='Fuels (application roles)';ru='ГСМ (прикладные роли)'");
	ОписаниеПрофиля.Описание      = НСтр("");
	ДополнитьОписаниеПрофиляОбщимиРолями(ОписаниеПрофиля, ДополнятьРолямиОрганайзера);
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "сфпУправлениеМаршрутизацией");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатПрикладнаяРольГСМ"); 
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатПрименениеЛимитовТопливныхКарт");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеГрафиковРаботы");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеСостоянийОригиналовПервичныхДокументов");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи", "ВначалеВсеРазрешены");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	// Профиль "Диспетчер".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "e068c0e7-168a-11e6-a9fc-ac220b763c3f";
	ОписаниеПрофиля.Наименование  = НСтр("en='Dispatch operator (applied roles)';ru='Диспетчер (прикладные роли)'");
	ОписаниеПрофиля.Описание      = НСтр("");
	ДополнитьОписаниеПрофиляОбщимиРолями(ОписаниеПрофиля, ДополнятьРолямиОрганайзера, Истина);
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "сфпУправлениеМаршрутизацией");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатПрикладнаяРольДиспетчер");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатПрикладнаяРольИнженерБДД");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ПросмотрЖурналаРегистрации");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатНастройкаМобильногоПриложения");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЗагрузкаПарковок");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеГрафиковРаботы");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ИзменениеСостоянийОригиналовПервичныхДокументов");   
	
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеСертификатовКлючейЭлектроннойПодписиИШифрования");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеЭлектронныхПодписейИШифрование");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ШифрованиеИРасшифровкаДанных");
	
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеДокументовКЭДО"); 
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеМЧДЭДО");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ИспользованиеУведомленийЭДО");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеНоменклатурыКонтрагентовБЭД");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеНастроекЭлектронногоВзаимодействия");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеМаршрутовПодписания"); 
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеНастроекОбменаСКонтрагентами");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеЭлектронныхДокументов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеНастроекОбменаСКонтрагентами");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеДокументовЭПД");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ВыполнениеОбменаСКонтрагентами");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("УчетныеЗаписиЭлектроннойПочты", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи", "ВначалеВсеРазрешены");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	// Профиль "Кадровик".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "e068c0e8-168a-11e6-a9fc-ac220b763c3f";
	ОписаниеПрофиля.Наименование  = НСтр("en='Personnel officer (application roles)';ru='Кадровик (прикладные роли)'");
	ОписаниеПрофиля.Описание      = НСтр("");
	ДополнитьОписаниеПрофиляОбщимиРолями(ОписаниеПрофиля, ДополнятьРолямиОрганайзера, Истина);
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "сфпУправлениеМаршрутизацией");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатПрикладнаяРольКадровик");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеГрафиковРаботы");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеКалендарныхГрафиков");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеОтветовНаВопросыАнкет");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеШаблоновАнкет");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеОпросов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеСогласийНаОбработкуПерсональныхДанных");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеСостоянийОригиналовПервичныхДокументов");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("УчетныеЗаписиЭлектроннойПочты", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи", "ВначалеВсеРазрешены");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	// Профиль "Кладовщик".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "e068c0e9-168a-11e6-a9fc-ac220b763c3f";
	ОписаниеПрофиля.Наименование  = НСтр("en='Storekeeper (application roles)';ru='Кладовщик (прикладные роли)'");
	ОписаниеПрофиля.Описание      = НСтр("");
	ДополнитьОписаниеПрофиляОбщимиРолями(ОписаниеПрофиля, ДополнятьРолямиОрганайзера);
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "сфпУправлениеМаршрутизацией");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатПрикладнаяРольКладовщик");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеГрафиковРаботы");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ИзменениеСостоянийОригиналовПервичныхДокументов");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи", "ВначалеВсеРазрешены");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	// Профиль "Механик".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "e068c0eb-168a-11e6-a9fc-ac220b763c3f";
	ОписаниеПрофиля.Наименование  = НСтр("en='Mechanic (application roles)';ru='Механик (прикладные роли)'");
	ОписаниеПрофиля.Описание      = НСтр("");
	ДополнитьОписаниеПрофиляОбщимиРолями(ОписаниеПрофиля, ДополнятьРолямиОрганайзера);
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "сфпУправлениеМаршрутизацией");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатПрикладнаяРольМеханик");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатПрикладнаяРольИнженерБДД");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеКонтрагентов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеГрафиковРаботы");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ИзменениеСостоянийОригиналовПервичныхДокументов");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи", "ВначалеВсеРазрешены");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	// Профиль "Инженер БДД".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "e068c0ea-168a-11e6-a9fc-ac220b763c3f";
	ОписаниеПрофиля.Наименование  = НСтр("en='Trafic engineer (application roles)';ru='Инженер БДД (прикладные роли)'");
	ОписаниеПрофиля.Описание      = НСтр("");
	ДополнитьОписаниеПрофиляОбщимиРолями(ОписаниеПрофиля, ДополнятьРолямиОрганайзера);
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатПрикладнаяРольИнженерБДД");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеКонтрагентов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеГрафиковРаботы");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ИзменениеСостоянийОригиналовПервичныхДокументов");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи", "ВначалеВсеРазрешены");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	// Профиль "Экономист".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "e068c0ec-168a-11e6-a9fc-ac220b763c3f";
	ОписаниеПрофиля.Наименование  = НСтр("en='Economist (application roles)';ru='Экономист (прикладные роли)'");
	ОписаниеПрофиля.Описание      = НСтр("");
	ДополнитьОписаниеПрофиляОбщимиРолями(ОписаниеПрофиля, ДополнятьРолямиОрганайзера, Истина);
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "сфпУправлениеМаршрутизацией");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатПрикладнаяРольЭкономист");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЗакрытиеМесяца");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеГрафиковРаботы");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеКалендарныхГрафиков");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеКурсовВалют");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеБанков");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеРассылокОтчетов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеСостоянийОригиналовПервичныхДокументов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ИзменениеСостоянийОригиналовПервичныхДокументов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ПолучениеОбновленийКлассификаторов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеСогласийНаОбработкуПерсональныхДанных");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеАктовОбУничтоженииПерсональныхДанных");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЗагрузкаОтчетовСистемВзиманияПлаты");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "РаспознаваниеДокументов");
	ДополнитьОписаниеПрофиляРолямиСПАРКРиски(ОписаниеПрофиля);
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("УчетныеЗаписиЭлектроннойПочты", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи", "ВначалеВсеРазрешены");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	// Профиль "Логист".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "f64c31f9-1c73-11e6-a03d-ac220b763c3f";
	ОписаниеПрофиля.Наименование  = НСтр("en='Logistician (application roles)';ru='Логист (прикладные роли)'");
	ОписаниеПрофиля.Описание      = НСтр("");
	ДополнитьОписаниеПрофиляОбщимиРолями(ОписаниеПрофиля, ДополнятьРолямиОрганайзера, Истина);
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "сфпУправлениеМаршрутизацией");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеРассылокОтчетов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ИзменениеСостоянийОригиналовПервичныхДокументов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатПрикладнаяРольЛогист_уэ");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатПрикладнаяРольДиспетчер");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ПросмотрЖурналаРегистрации");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("УчетныеЗаписиЭлектроннойПочты", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи", "ВначалеВсеРазрешены");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	// Профиль "Водитель".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "e068c0ed-168a-11e6-a9fc-ac220b763c3f";
	ОписаниеПрофиля.Наименование  = НСтр("en='Driver (application roles)';ru='Водитель (прикладные роли)'");
	ОписаниеПрофиля.Описание      = НСтр("");
	ДополнитьОписаниеПрофиляОбщимиРолями(ОписаниеПрофиля, ДополнятьРолямиОрганайзера);
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатПрикладнаяРольВодитель");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеГрафиковРаботы");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеСостоянийОригиналовПервичныхДокументов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеЭлектронныхПодписейИШифрование");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи", "ВначалеВсеРазрешены");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	// Профиль "Медработник".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "e068c0ee-168a-11e6-a9fc-ac220b763c3f";
	ОписаниеПрофиля.Наименование  = НСтр("en='Medic (application roles)';ru='Медицинский работник (прикладные роли)'");
	ОписаниеПрофиля.Описание      = НСтр("");
	ДополнитьОписаниеПрофиляОбщимиРолями(ОписаниеПрофиля, ДополнятьРолямиОрганайзера);
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатПрикладнаяРольМедицинскийРаботник");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеГрафиковРаботы");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеСостоянийОригиналовПервичныхДокументов");
	
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеСертификатовКлючейЭлектроннойПодписиИШифрования");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеЭлектронныхПодписейИШифрование");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ШифрованиеИРасшифровкаДанных");
	
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеДокументовКЭДО");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеМЧДЭДО");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ИспользованиеУведомленийЭДО");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеНоменклатурыКонтрагентовБЭД");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеНастроекЭлектронногоВзаимодействия");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеМаршрутовПодписания"); 
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеНастроекОбменаСКонтрагентами");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеЭлектронныхДокументов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеДокументовЭПД");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ВыполнениеОбменаСКонтрагентами");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи", "ВначалеВсеРазрешены");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	// Профиль "Контролер ТС".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "e068c0ef-168a-11e6-a9fc-ac220b763c3f";
	ОписаниеПрофиля.Наименование  = НСтр("en='Technical condition controler (application roles)';ru='Контролер технического состояния ТС (прикладные роли)'");
	ОписаниеПрофиля.Описание      = НСтр("");
	ДополнитьОписаниеПрофиляОбщимиРолями(ОписаниеПрофиля, ДополнятьРолямиОрганайзера);
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатПрикладнаяРольКонтролерТехническогоСостоянияТС");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеГрафиковРаботы");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеСостоянийОригиналовПервичныхДокументов");
	
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеСертификатовКлючейЭлектроннойПодписиИШифрования");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеЭлектронныхПодписейИШифрование");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ШифрованиеИРасшифровкаДанных");
	
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеДокументовКЭДО");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеМЧДЭДО");   
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ИспользованиеУведомленийЭДО");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеНоменклатурыКонтрагентовБЭД");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеНастроекЭлектронногоВзаимодействия");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеМаршрутовПодписания"); 
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеНастроекОбменаСКонтрагентами");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеЭлектронныхДокументов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеДокументовЭПД");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ВыполнениеОбменаСКонтрагентами");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи", "ВначалеВсеРазрешены");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля); 
	
	// Профиль "Уполномоченный на проставление одометра".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "dc120db2-ef0d-11ed-8911-38d547b3d773";
	ОписаниеПрофиля.Наименование  = НСтр("en='Authorized to affix the odometer (application roles)';ru='Уполномоченный на проставление одометра (прикладные роли)'");
	ОписаниеПрофиля.Описание      = НСтр("");
	ДополнитьОписаниеПрофиляОбщимиРолями(ОписаниеПрофиля, ДополнятьРолямиОрганайзера);
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатПрикладнаяРольУполномоченныйНаПроставлениеОдометра");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеГрафиковРаботы");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеСостоянийОригиналовПервичныхДокументов");
	
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеСертификатовКлючейЭлектроннойПодписиИШифрования");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеЭлектронныхПодписейИШифрование");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ШифрованиеИРасшифровкаДанных");
	
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеДокументовКЭДО"); 
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеМЧДЭДО"); 
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ИспользованиеУведомленийЭДО");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеНоменклатурыКонтрагентовБЭД");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеНастроекЭлектронногоВзаимодействия");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеМаршрутовПодписания"); 
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеНастроекОбменаСКонтрагентами");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеЭлектронныхДокументов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеДокументовЭПД");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ВыполнениеОбменаСКонтрагентами");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи", "ВначалеВсеРазрешены");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	Если уатОбщегоНазначенияПовтИсп.ВариантПоставкиТакси() Тогда
		// Профиль "Диспетчер такси".
		ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
		ОписаниеПрофиля.Идентификатор = "e069c0e7-168a-11e6-a9fc-ac220b763c3f";
		ОписаниеПрофиля.Наименование  = НСтр("en='Dispatch operator taxi (applied roles)';ru='Диспетчер такси (прикладные роли)'");
		ОписаниеПрофиля.Описание      = НСтр("");
		ДополнитьОписаниеПрофиляОбщимиРолями(ОписаниеПрофиля, ДополнятьРолямиОрганайзера, Истина);
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "сфпУправлениеМаршрутизацией");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "такПрикладнаяРольДиспетчерТакси");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ПросмотрЖурналаРегистрации");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатНастройкаМобильногоПриложения");  
		
		ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
		ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
		ОписаниеПрофиля.ВидыДоступа.Добавить("УчетныеЗаписиЭлектроннойПочты", "ВначалеВсеРазрешены");
		ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи", "ВначалеВсеРазрешены");
		ОписанияПрофилей.Добавить(ОписаниеПрофиля);  
		
		// Профиль "Диспетчер аренды".
		ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
		ОписаниеПрофиля.Идентификатор = "e069c0e7-168a-11e6-a9fc-ac220b763c4f";
		ОписаниеПрофиля.Наименование  = НСтр("en='Dispatch operator rental (applied roles)';ru='Диспетчер аренды (прикладные роли)'");
		ОписаниеПрофиля.Описание      = НСтр("");
		ДополнитьОписаниеПрофиляОбщимиРолями(ОписаниеПрофиля, ДополнятьРолямиОрганайзера, Истина);
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "сфпУправлениеМаршрутизацией");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "такПрикладнаяРольДиспетчерАренды");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ПросмотрЖурналаРегистрации"); 
		
		ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
		ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
		ОписаниеПрофиля.ВидыДоступа.Добавить("УчетныеЗаписиЭлектроннойПочты", "ВначалеВсеРазрешены");
		ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи", "ВначалеВсеРазрешены");
		ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДополнитьОписаниеПрофиляОбщимиРолями(ОписаниеПрофиля, ДополнятьРолямиОрганайзера = Ложь, ДополнятьРолямиВзаимодействий = Ложь)
	
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "БазовыеПраваБСП");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "БазовыеПраваЭД");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "БазовыеПраваКЭДО");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "БазовыеПраваИПП");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "БазовыеПраваБПО");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "БазовыеПраваБИД");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеДанныхСПАРКРиски");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЗапускТонкогоКлиента");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЗапускВебКлиента");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЗапускТолстогоКлиента");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "РежимВсеФункции");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ВыводНаПринтерФайлБуферОбмена");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "РедактированиеПечатныхФорм");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ПросмотрСвязанныеДокументы");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеЗаданий");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ИзменениеВыполнениеЗадач");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ИзменениеДополнительныхСведений");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеДополнительныхСведений");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеДополнительныхОтчетовИОбработок");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "РаботаСПапкамиФайлов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеОтветовНаВопросыАнкет");
	
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "СохранениеДанныхПользователя");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеДополнительныхРеквизитовИСведений");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеЛичныхВариантовОтчетов");
	
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "слкУправлениеМенеджеромЛицензийСЛК");
	
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатБазовыеПрава");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатУстановкаПравИНастроек");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатИспользованиеПанелиФункций");
	
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеНовостей");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "РедактированиеНовостей");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ИспользованиеОбработкиТекущиеДела");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ПросмотрОтчетаДвиженияДокумента");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеВариантовОтчетов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеНастроекОбменаСКонтрагентами");

	
	Если ДополнятьРолямиОрганайзера Тогда
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеНапоминаний");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеЗаметок");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеПапокИФайлов");
	КонецЕсли;
	
	Если ДополнятьРолямиВзаимодействий Тогда
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеВзаимодействий");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеЛичныхШаблоновСообщений");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеШаблоновСообщений");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ОтправкаSMS");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеУчетныхЗаписейЭлектроннойПочты");
	КонецЕсли;
	
КонецПроцедуры

Процедура ДополнитьОписаниеПрофиляМПОбщимиРолями(ОписаниеПрофиля)
	
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "БазовыеПраваБСП");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "БазовыеПраваКЭДО");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "БазовыеПраваЭД");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "БазовыеПраваИПП");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатБазовыеПрава");
	
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "слкУправлениеМенеджеромЛицензийСЛК");
	
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "РаботаСПапкамиФайлов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеПапокИФайлов");
	
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеЗаданий");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ИзменениеВыполнениеЗадач");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеВзаимодействий");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеЛичныхШаблоновСообщений");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеШаблоновСообщений");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ОтправкаSMS");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеУчетныхЗаписейЭлектроннойПочты");
	
КонецПроцедуры

#КонецОбласти


#Область ПроцедурыЗаполненияПрофилей_РолиФункции

Процедура ЗаполнитьПоставляемыеПрофилиРолейФункций(ОписанияПрофилей, ПараметрыОбновления) 
	
	ДополнятьРолямиОрганайзера = Истина;
	
	// Профиль "ГСМ (роли-функции)".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "168b5af3-eeb5-11e6-99f0-ac220b763c3f";
	ОписаниеПрофиля.Наименование  = НСтр("en='Fuels (role-function)';ru='ГСМ (роли-функции)'");
	ОписаниеПрофиля.Описание      = НСтр("");
	ДополнитьОписаниеПрофиляОбщимиРолямиФункциями(ОписаниеПрофиля, ДополнятьРолямиОрганайзера);
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "сфпУправлениеМаршрутизацией");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеДанныхГСМ");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеОперацийСТЖ");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеНСИГСМ");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЗагрузкаДанныхПЦ");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеВыдачиРасходныхМатериалов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеДанныхГСМ");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеОперацийСТЖ");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеЗаказовНаТС");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеМаршрутныхЛистов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеНСИГСМ");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеНСИПерсонала");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеНСИДоходыИРасходы");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеНСИТранспорта");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеПоступленийМатериаловИУслуг");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеПутевыхЛистов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеСчетовНаОплатуПоставщика");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатПрименениеЛимитовТопливныхКарт");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ПросмотрОтчетаДосьеКонтрагента");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеГрафиковРаботы");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеСостоянийОригиналовПервичныхДокументов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатИспользованиеОбработкиЖурналУчетаПервичныхДокументов");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи", "ВначалеВсеРазрешены");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	// Профиль "Диспетчер (роли-функции)".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "168b5af2-eeb5-11e6-99f0-ac220b763c3f";
	ОписаниеПрофиля.Наименование  = НСтр("en='Dispatch operator (role-function)';ru='Диспетчер (роли-функции)'");
	ОписаниеПрофиля.Описание      = НСтр("");
	ДополнитьОписаниеПрофиляОбщимиРолямиФункциями(ОписаниеПрофиля, ДополнятьРолямиОрганайзера, Истина);
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "сфпУправлениеМаршрутизацией");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЗагрузкаПарковок");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатВосстановлениеПоследовательностейПЛ");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеДанныхБилетовИВыручки");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеДанныхГСМ");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеОперацийСТЖ");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеДанныхУслуг");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеДанныхПоДТП");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеДиспозиций");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеЖурналовТранспортныхДокументов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеЗаказовНаТС");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеКомандировок");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеМаршрутныхЛистов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеНСИГСМ");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеНСИМаршрутов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеНСИПерсонала");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеНСИДоходыИРасходы");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеОрганизаций");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеНСИТарифов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеНСИТранспорта");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеПланированияРаботыТС");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеПотребностейВПеревозке");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеПрочихДоходовИРасходов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеПутевыхЛистов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеРазнарядокНаВыпускТС");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеДанныхДоходовРасходов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеРемонтныхЛистов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеСогласований");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЗагрузкаДанныхПЦ");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатИспользованиеSMS");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатИспользованиеWMS");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатИспользованиеАРМТранспорта");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатИспользованиеЭлектронныхКарт");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатНастройкаМобильногоПриложения");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатНастройкаОборудования");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатНастройкаУведомлений");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатОбменСообщениямиСМобильнымПриложением");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатРучнаяЗагрузкаДанныхСпутниковогоМониторинга");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатТехнологическийПутевойЛист");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатФормированиеОтчетовПоМониторингу");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеДанныхБилетовИВыручки");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеДанныхГСМ");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеОперацийСТЖ");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеДанныхУслуг");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеДиспозиций");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеЖурналовТранспортныхДокументов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеЗаказовНаТС");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеКомандировок");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеМаршрутныхЛистов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеНСИАгрегатов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеНСИГСМ");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеНСИМаршрутов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеНСИПерсонала");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеНСИДоходыИРасходы");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеНСИТарифов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеНСИТранспорта");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеПотребностейВПеревозке");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеПрочихДоходовИРасходов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеПутевыхЛистов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеРазнарядокНаВыпускТС");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеРасчетовСводныхПараметров");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеДанныхДоходовРасходов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеТабелейУчетаРабочегоВремени");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеТарифовЗарплаты");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеДанныхДокументооборота");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатИспользованиеОбработкиОбращениеВТехническуюПоддержку");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатИспользованиеОбработкиЖурналУчетаПервичныхДокументов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ПросмотрЖурналаРегистрации");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ПросмотрОтчетаДосьеКонтрагента");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеГрафиковРаботы");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ИзменениеСостоянийОригиналовПервичныхДокументов"); 
	
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеСертификатовКлючейЭлектроннойПодписиИШифрования");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеЭлектронныхПодписейИШифрование");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ШифрованиеИРасшифровкаДанных");
	
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеДокументовКЭДО");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеМЧДЭДО");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ИспользованиеУведомленийЭДО");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеНоменклатурыКонтрагентовБЭД");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеНастроекЭлектронногоВзаимодействия");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеМаршрутовПодписания"); 
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеНастроекОбменаСКонтрагентами");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеЭлектронныхДокументов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеДокументовЭПД");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ВыполнениеОбменаСКонтрагентами");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеНастроекОбменаСКонтрагентами"); 

	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("УчетныеЗаписиЭлектроннойПочты", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи", "ВначалеВсеРазрешены");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	// Профиль "Логист ЖД перевозок (роли-функции)".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "141f5c88-9af8-4467-8485-0166d0c0bb75";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Логист ЖД перевозок (роли-функции)'; en = 'Railroad Logistics Specialist (roles and functions)'");
	ОписаниеПрофиля.Описание      = НСтр("");
	ДополнитьОписаниеПрофиляОбщимиРолямиФункциями(ОписаниеПрофиля, ДополнятьРолямиОрганайзера, Истина);
	
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеДиспозиций");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеЖурналовТранспортныхДокументов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеЗаказовНаТС");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеНСИТранспорта");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеПланированияРаботыТС");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеПотребностейВПеревозке");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеМаршрутныхЛистов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеДанныхГСМ");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеНСИАгрегатов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеНСИГСМ");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеДиспозиций");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеНСИТранспорта");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеПотребностейВПеревозке");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеДокументовОперацииСВагонами");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеДокументовЭТРАН");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеНСИЖДПеревозок");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	// Профиль "Кладовщик (роли-функции)".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "168b5af6-eeb5-11e6-99f0-ac220b763c3f";
	ОписаниеПрофиля.Наименование  = НСтр("en='Storekeeper (role-function)';ru='Кладовщик (роли-функции)'");
	ОписаниеПрофиля.Описание      = НСтр("");
	ДополнитьОписаниеПрофиляОбщимиРолямиФункциями(ОписаниеПрофиля, ДополнятьРолямиОрганайзера);
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "сфпУправлениеМаршрутизацией");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеДанныхСклада");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеДоверенностей");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеДанныхСкладаКомплектации");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеСоставаКонтейнеров");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеВыдачиРасходныхМатериалов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеНСИАгрегатов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеДанныхПоАгрегатам");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеНоменклатуры");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеПоступленийМатериаловИУслуг");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеСчетовНаОплатуПоставщика");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеЗаказовПоставщику");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатИзменениеРемонтныхЛистов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатНастройкаОборудования");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеЗаказовНаТС");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеМаршрутныхЛистов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеНСИМаршрутов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеДанныхСклада");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеДоверенностей");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеНСИПерсонала");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеНСИТранспорта");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеПоступленийМатериаловИУслуг");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеРеализацийУслуг");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеДанныхСкладаКомплектации");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеСоставаКонтейнеров");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеВыдачиРасходныхМатериалов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеНСИАгрегатов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеДанныхПоАгрегатам");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ПросмотрОтчетаДосьеКонтрагента");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеГрафиковРаботы");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ИзменениеСостоянийОригиналовПервичныхДокументов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатИспользованиеОбработкиЖурналУчетаПервичныхДокументов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеНСИРемонтов");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи", "ВначалеВсеРазрешены");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	// Профиль "Логист (роли-функции)".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "168b5aef-eeb5-11e6-99f0-ac220b763c3f";
	ОписаниеПрофиля.Наименование  = НСтр("en='Logistician (role-function)';ru='Логист (роли-функции)'");
	ОписаниеПрофиля.Описание      = НСтр("");
	ДополнитьОписаниеПрофиляОбщимиРолямиФункциями(ОписаниеПрофиля, ДополнятьРолямиОрганайзера, Истина);
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "сфпУправлениеМаршрутизацией");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеДиспозиций");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеДоверенностей");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеЗаказовНаТС");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеМаршрутныхЛистов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеНСИМаршрутов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеНСИПерсонала");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеНСИТранспорта");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеПотребностейВПеревозке");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеРекламаций");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеСогласований");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеДанныхПоДТП");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатИспользованиеМонитораРуководителя");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатИспользованиеАРМЛогиста");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатИспользованиеАРМТранспорта");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатИспользованиеЭлектронныхКарт");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатОбменСообщениямиСМобильнымПриложением");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ИзменениеМакетовПечатныхФорм");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатИспользованиеSMS");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатИспользованиеWMS");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатНастройкаУведомлений");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеДиспозиций");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеДанныхПоДТП");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеДанныхПоАгрегатам");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеЗаказовНаТС");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеМаршрутныхЛистов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеНСИАгрегатов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеНСИГСМ");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеНСИМаршрутов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеНСИПерсонала");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеНСИДоходыИРасходы");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеНСИТарифов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеНСИТранспорта");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеРазнарядокНаВыпускТС");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеРемонтныхЛистов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеПотребностейВПеревозке");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеРекламаций");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеСчетовНаОплатуПокупателя");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеСчетовНаОплатуПоставщика");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеДанныхСкладаКомплектации");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеСоставаКонтейнеров");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеДанныхСкладаКомплектации");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеСоставаКонтейнеров");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ПросмотрОтчетаДосьеКонтрагента");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеГрафиковРаботы");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеТабелейУчетаРабочегоВремени");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеСтраховыхСертификатов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеСтраховыхСертификатов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеДанныхДокументооборота");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеДанныхДокументооборота");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеРассылокОтчетов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ИзменениеСостоянийОригиналовПервичныхДокументов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатИспользованиеОбработкиОбращениеВТехническуюПоддержку");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатИспользованиеОбработкиЖурналУчетаПервичныхДокументов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатИспользованиеОбработкиСозданиеПеревозки");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("УчетныеЗаписиЭлектроннойПочты", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи", "ВначалеВсеРазрешены");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	// Профиль "Механик (роли-функции)".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "168b5af4-eeb5-11e6-99f0-ac220b763c3f";
	ОписаниеПрофиля.Наименование  = НСтр("en='Mechanic (role-function)';ru='Механик (роли-функции)'");
	ОписаниеПрофиля.Описание      = НСтр("");
	ДополнитьОписаниеПрофиляОбщимиРолямиФункциями(ОписаниеПрофиля, ДополнятьРолямиОрганайзера);
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "сфпУправлениеМаршрутизацией");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеАктовПриемаПередачиТС");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеВыдачиРасходныхМатериалов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеДанныхПоАгрегатам");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеДанныхПоДТП");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеКонтрагентов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеНоменклатуры");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеЗаказовПоставщику");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеЗаявокНаРемонт");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеНСИАгрегатов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеНСИГСМ");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеНСИМаршрутов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеНСИРемонтов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеНСИТранспорта");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеНСИДоходыИРасходы");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеРемонтныхЛистов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеПоступленийМатериаловИУслуг");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеСогласований");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеОперацийСТЖ");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатИзменениеПоступленийМатериаловИУслуг");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатИспользованиеАРМРемонтов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатИспользованиеЭлектронныхКарт");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатНастройкаОборудования");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеАктовПриемаПередачиТС");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеВыдачиРасходныхМатериалов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеТарифовЗарплаты");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеДанныхПоАгрегатам");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеДанныхПоДТП");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеЗаказовНаТС");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеЗаявокНаРемонт");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеНСИ");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеНСИАгрегатов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеНСИГСМ");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеНСИМаршрутов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеНСИПерсонала");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеНСИДоходыИРасходы");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеНСИРемонтов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеНСИТранспорта");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеПоступленийМатериаловИУслуг");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеРемонтныхЛистов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеОперацийСТЖ");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеОперацийСТЖ");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ПросмотрОтчетаДосьеКонтрагента");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеГрафиковРаботы");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ИзменениеСостоянийОригиналовПервичныхДокументов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатИспользованиеОбработкиЖурналУчетаПервичныхДокументов");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи", "ВначалеВсеРазрешены");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);     
	
	// Профиль "Инженер БДД (роли-функции)".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "168b5abf-eeb5-11e6-99f0-ac220b763c3f";
	ОписаниеПрофиля.Наименование  = НСтр("en='Trafic engineer (role-function)';ru='Инженер БДД (роли-функции)'");
	ОписаниеПрофиля.Описание      = НСтр("");
	ДополнитьОписаниеПрофиляОбщимиРолямиФункциями(ОписаниеПрофиля, ДополнятьРолямиОрганайзера);
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеДанныхПоДТП");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеКонтрагентов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеНСИТранспорта");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеАктовПриемаПередачиТС");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеТарифовЗарплаты");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеДанныхПоАгрегатам");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеДанныхПоДТП");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеЗаказовНаТС");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеЗаявокНаРемонт");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеНСИ");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеНСИАгрегатов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеНСИГСМ");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеНСИПерсонала");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеНСИРемонтов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеНСИТранспорта");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеРемонтныхЛистов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеОперацийСТЖ");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеОперацийСТЖ");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ПросмотрОтчетаДосьеКонтрагента");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеГрафиковРаботы");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ИзменениеСостоянийОригиналовПервичныхДокументов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатИспользованиеОбработкиЖурналУчетаПервичныхДокументов");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи", "ВначалеВсеРазрешены");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	// Профиль "Оператор заказов (роли-функции)".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "168b5af0-eeb5-11e6-99f0-ac220b763c3f";
	ОписаниеПрофиля.Наименование  = НСтр("en='Operator orders (role-function)';ru='Оператор заказов (роли-функции)'");
	ОписаниеПрофиля.Описание      = НСтр("");
	ДополнитьОписаниеПрофиляОбщимиРолямиФункциями(ОписаниеПрофиля, ДополнятьРолямиОрганайзера, Истина);
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "сфпУправлениеМаршрутизацией");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеЗаказовНаТС");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеПотребностейВПеревозке");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеСчетовНаОплатуПокупателя");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатИспользованиеЭлектронныхКарт");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатНастройкаУведомлений");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеЗаказовНаТС");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеНСИМаршрутов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеНСИДоходыИРасходы");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеНСИТарифов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеНСИТранспорта");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеПотребностейВПеревозке");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеСчетовНаОплатуПокупателя");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ПросмотрОтчетаДосьеКонтрагента");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеСостоянийОригиналовПервичныхДокументов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатИспользованиеОбработкиЖурналУчетаПервичныхДокументов");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("УчетныеЗаписиЭлектроннойПочты", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи", "ВначалеВсеРазрешены");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	// Профиль "Кадровик (роли-функции)".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "168b5af7-eeb5-11e6-99f0-ac220b763c3f";
	ОписаниеПрофиля.Наименование  = НСтр("en='HR manager (role-function)';ru='Кадровик (роли-функции)'");
	ОписаниеПрофиля.Описание      = НСтр("");
	ДополнитьОписаниеПрофиляОбщимиРолямиФункциями(ОписаниеПрофиля, ДополнятьРолямиОрганайзера, Истина);
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "сфпУправлениеМаршрутизацией");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеАктовОбУничтоженииПерсональныхДанных");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеКомандировок");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеНачислениеЗарплаты");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеНСИПерсонала");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеСогласований");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеТарифовЗарплаты");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеТабелейУчетаРабочегоВремени");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеСогласийНаОбработкуПерсональныхДанных");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатФормированиеОтчетовПоCRM");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеДанныхПоДТП");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеКомандировок");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеНачислениеЗарплаты");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеНСИДоходыИРасходы");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеНСИМаршрутов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеНСИПерсонала");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеНСИТранспорта");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеПутевыхЛистов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеТарифовЗарплаты");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеТабелейУчетаРабочегоВремени");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ИспользованиеОбработкиУничтожениеПерсональныхДанных");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеВидовКонтактнойИнформации");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеГрафиковРаботы");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеКалендарныхГрафиков");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеОтветовНаВопросыАнкет");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеШаблоновАнкет");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеОпросов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеСостоянийОригиналовПервичныхДокументов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатИспользованиеОбработкиЖурналУчетаПервичныхДокументов");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("УчетныеЗаписиЭлектроннойПочты", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи", "ВначалеВсеРазрешены");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	// Профиль "Экономист (роли-функции)".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "168b5af5-eeb5-11e6-99f0-ac220b763c3f";
	ОписаниеПрофиля.Наименование  = НСтр("en='Economist (role-function)';ru='Экономист (роли-функции)'");
	ОписаниеПрофиля.Описание      = НСтр("");
	ДополнитьОписаниеПрофиляОбщимиРолямиФункциями(ОписаниеПрофиля, ДополнятьРолямиОрганайзера, Истина);
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "сфпУправлениеМаршрутизацией");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеДанныхБилетовИВыручки");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеДанныхДенежныхСредств");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеЗаявокНаРасходованиеДС");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеНСИДоходыИРасходы");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЗакрытиеМесяца");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеОрганизаций");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеКонтрагентов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеНоменклатуры");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеНСИТарифов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеНСИМаршрутов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеПланированияРаботыТС");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеПоступленийМатериаловИУслуг");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеПрочихДоходовИРасходов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеДанныхДоходовРасходов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеРасчетовСводныхПараметров");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеРеализацийУслуг");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеРеестровПеревозок");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеСчетовНаОплатуПокупателя");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеСчетовНаОплатуПоставщика");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеДанныхУслуг");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеСогласований");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеСогласийНаОбработкуПерсональныхДанных");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеАктовОбУничтоженииПерсональныхДанных");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеТарифовЗарплаты");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеНСИПерсонала");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатНастройкаУведомлений");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатНастройкаУчетнойПолитики");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеДанныхБилетовИВыручки");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеДанныхДенежныхСредств");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеЖурналовТранспортныхДокументов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеЗаказовНаТС");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеЗаявокНаРасходованиеДС");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеМаршрутныхЛистов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеНСИМаршрутов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеНСИДоходыИРасходы");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеНСИТарифов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеНСИТранспорта");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеНСИПерсонала");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеНСИРемонтов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеРемонтныхЛистов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеПланированияРаботыТС");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеПоступленийМатериаловИУслуг");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеПрочихДоходовИРасходов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеПутевыхЛистов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеДанныхДоходовРасходов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеДанныхУслуг");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеРеализацийУслуг");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеСчетовНаОплатуПокупателя");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеСчетовНаОплатуПоставщика");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеТарифовЗарплаты");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеБазовыхКлассификаторов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеКурсовВалют");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеВидовКонтактнойИнформации");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеБазовыхКлассификаторов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ПросмотрОтчетаДосьеКонтрагента");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеГрафиковРаботы");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеКалендарныхГрафиков");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеБанков");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеРассылокОтчетов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеСостоянийОригиналовПервичныхДокументов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ИзменениеСостоянийОригиналовПервичныхДокументов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатИспользованиеОбработкиОбращениеВТехническуюПоддержку");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатИспользованиеОбработкиЖурналУчетаПервичныхДокументов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ПолучениеОбновленийКлассификаторов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатВыгрузкаДанныхВТиповыеКонфигурации");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЗагрузкаОтчетовСистемВзиманияПлаты"); 
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "РаспознаваниеДокументов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеЗаказовПоставщику");
	ДополнитьОписаниеПрофиляРолямиСПАРКРиски(ОписаниеПрофиля);
	
	//бюджетирование
	//ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеДанныхПоБюджетированию");
	//ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеНСИПоБюджетированию");
	//ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеДанныхПоБюджетированию");
	//ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеНСИПоБюджетированию");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзмененениеВыполнениеБюджетныхЗадач");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеНастроекБюджетирования");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеЭкземпляровБюджетов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "РазделБюджетирование");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "УправлениеБюджетнымПроцессом");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеДанныхБюджетирования");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеНастроекБюджетирования");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеДанныхДокументооборота");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеДанныхДокументооборота");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("УчетныеЗаписиЭлектроннойПочты", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи", "ВначалеВсеРазрешены");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	ДополнятьРолямиОрганайзера = Ложь;
	
	// Профиль "Использование ЦСМ".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "9cb9299c-577e-11e9-8abb-38d547b3d773";
	ОписаниеПрофиля.Наименование  = НСтр("en='Use of CMS';ru='Использование ЦСМ'");
	ОписаниеПрофиля.Описание      = НСтр("");
	ДополнитьОписаниеПрофиляОбщимиРолямиФункциями(ОписаниеПрофиля, ДополнятьРолямиОрганайзера);
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ItobCsmSvc");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ItobАдминистраторМониторинга");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ItobБазовыеПрава");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ItobДиспетчер");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ItobДобавлениеИзменениеВариантовОтображенияТрека");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ItobДобавлениеИзменениеМобильныхУстройств");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ItobОтчетыПоТопливу");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ItobЧтениеВариантовДинамическогоОформления");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ItobЧтениеВариантовОтображенияТрека");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ItobЧтениеСерверовСбораДанных");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи", "ВначалеВсеРазрешены");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	// Профиль "Использование БЭД".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "9cb9299c-577e-11e9-8abb-38d547b3d774";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Использование БЭД'; en = 'Use of BED'");
	ОписаниеПрофиля.Описание      = НСтр("");
	ДополнитьОписаниеПрофиляОбщимиРолямиФункциями(ОписаниеПрофиля, ДополнятьРолямиОрганайзера);
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеСертификатовКлючейЭлектроннойПодписиИШифрования");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеЭлектронныхПодписейИШифрование");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ШифрованиеИРасшифровкаДанных");
	
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеДокументовКЭДО");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеМЧДЭДО"); 
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ИспользованиеУведомленийЭДО");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеНоменклатурыКонтрагентовБЭД");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеНастроекЭлектронногоВзаимодействия");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеМаршрутовПодписания"); 
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеНастроекОбменаСКонтрагентами");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеЭлектронныхДокументов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеДокументовЭПД");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ВыполнениеОбменаСКонтрагентами");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи", "ВначалеВсеРазрешены");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	// Профиль "Диспетчер (роли-функции)".   
	Если уатОбщегоНазначенияПовтИсп.ВариантПоставкиТакси() Тогда    

		ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
		ОписаниеПрофиля.Идентификатор = "e069c0e7-168a-11e6-a9fc-ac220b763c5f";
		ОписаниеПрофиля.Наименование  = НСтр("en='Dispatch operator taxi (role-function)';ru='Диспетчер такси (роли-функции)'");
		ОписаниеПрофиля.Описание      = НСтр("");
		ДополнитьОписаниеПрофиляОбщимиРолямиФункциями(ОписаниеПрофиля, ДополнятьРолямиОрганайзера, Истина);
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "сфпУправлениеМаршрутизацией"); 
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "такДобавлениеИзменениеЗаказовТакси");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеДанныхУслуг");
		
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеНСИПерсонала");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеНСИДоходыИРасходы");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеОрганизаций");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеНСИТарифов");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеНСИТранспорта");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеПланированияРаботыТС");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеПотребностейВПеревозке");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеПрочихДоходовИРасходов");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеПутевыхЛистов");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеРазнарядокНаВыпускТС");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеДанныхДоходовРасходов");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеРемонтныхЛистов");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеСогласований");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатИспользованиеSMS");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатИспользованиеЭлектронныхКарт");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатНастройкаМобильногоПриложения");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатНастройкаОборудования");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатНастройкаУведомлений");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатОбменСообщениямиСМобильнымПриложением");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатРучнаяЗагрузкаДанныхСпутниковогоМониторинга");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатФормированиеОтчетовПоМониторингу");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеДанныхУслуг");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеДиспозиций");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеНСИГСМ");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеНСИМаршрутов");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеНСИПерсонала");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеНСИДоходыИРасходы");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеНСИТарифов");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеНСИТранспорта");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеПрочихДоходовИРасходов");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеРасчетовСводныхПараметров");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеДанныхДоходовРасходов");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеТабелейУчетаРабочегоВремени");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеТарифовЗарплаты");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеДанныхДокументооборота");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатИспользованиеОбработкиОбращениеВТехническуюПоддержку");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатИспользованиеОбработкиЖурналУчетаПервичныхДокументов");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ПросмотрЖурналаРегистрации");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ПросмотрОтчетаДосьеКонтрагента");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеГрафиковРаботы");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ИзменениеСостоянийОригиналовПервичныхДокументов"); 
		
		ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
		ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
		ОписаниеПрофиля.ВидыДоступа.Добавить("УчетныеЗаписиЭлектроннойПочты", "ВначалеВсеРазрешены");
		ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи", "ВначалеВсеРазрешены");
		ОписанияПрофилей.Добавить(ОписаниеПрофиля); 
		
		ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
		ОписаниеПрофиля.Идентификатор = "e069c0e7-168a-11e6-a9fc-ac220b763c6f";
		ОписаниеПрофиля.Наименование  = НСтр("en='Dispatch operator taxi (role-function)';ru='Диспетчер аренды (роли-функции)'");
		ОписаниеПрофиля.Описание      = НСтр("");
		ДополнитьОписаниеПрофиляОбщимиРолямиФункциями(ОписаниеПрофиля, ДополнятьРолямиОрганайзера, Истина);
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "сфпУправлениеМаршрутизацией"); 
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "такДобавлениеИзменениеДокументовАрендаТС");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеПланированияРаботыТС");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеОрганизаций");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатДобавлениеИзменениеНСИТранспорта");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатИспользованиеSMS");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатИспользованиеЭлектронныхКарт");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатНастройкаУведомлений");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатРучнаяЗагрузкаДанныхСпутниковогоМониторинга");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатФормированиеОтчетовПоМониторингу");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеДиспозиций");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеНСИТарифов");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеНСИТранспорта");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеДанныхДокументооборота");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатИспользованиеОбработкиОбращениеВТехническуюПоддержку");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатИспользованиеОбработкиЖурналУчетаПервичныхДокументов");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ПросмотрЖурналаРегистрации");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ПросмотрОтчетаДосьеКонтрагента");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеГрафиковРаботы");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ИзменениеСостоянийОригиналовПервичныхДокументов"); 
		
		ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
		ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
		ОписаниеПрофиля.ВидыДоступа.Добавить("УчетныеЗаписиЭлектроннойПочты", "ВначалеВсеРазрешены");
		ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи", "ВначалеВсеРазрешены");
		ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	КонецЕсли;


КонецПроцедуры

Процедура ДополнитьОписаниеПрофиляОбщимиРолямиФункциями(ОписаниеПрофиля, ДополнятьРолямиОрганайзера = Ложь, ДополнятьРолямиВзаимодействий = Ложь)
	
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "БазовыеПраваБСП");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "БазовыеПраваЭД");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "БазовыеПраваКЭДО");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "БазовыеПраваИПП");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "БазовыеПраваБПО"); 
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "БазовыеПраваБИД");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеДанныхСПАРКРиски");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "СохранениеДанныхПользователя");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатБазовыеПрава");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеНСИ");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЗапускТонкогоКлиента");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЗапускТолстогоКлиента");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЗапускВебКлиента");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ВыводНаПринтерФайлБуферОбмена");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "РедактированиеПечатныхФорм");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "РежимВсеФункции");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ПросмотрСвязанныеДокументы");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатЧтениеСогласований");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеЗаданий");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ИзменениеВыполнениеЗадач");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеДополнительныхРеквизитовИСведений");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ИзменениеДополнительныхСведений");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеДополнительныхСведений");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "РаботаСПапкамиФайлов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеКурсовВалют");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеДополнительныхОтчетовИОбработок");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "уатУстановкаПравИНастроек");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеОтветовНаВопросыАнкет");
	
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "слкУправлениеМенеджеромЛицензийСЛК");
	
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеНовостей");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "РедактированиеНовостей");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ИспользованиеОбработкиТекущиеДела");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ПросмотрОтчетаДвиженияДокумента");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеВариантовОтчетов");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеЛичныхВариантовОтчетов");
	
	Если ДополнятьРолямиОрганайзера Тогда
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеНапоминаний");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеЗаметок");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеПапокИФайлов");
	КонецЕсли;
	
	Если ДополнятьРолямиВзаимодействий Тогда
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеВзаимодействий");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеЛичныхШаблоновСообщений");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ДобавлениеИзменениеШаблоновСообщений");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ОтправкаSMS");
		ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЧтениеУчетныхЗаписейЭлектроннойПочты");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбщегоНазначения

Процедура ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, ИмяРоли)
	
	Если Метаданные.Роли.Найти(ИмяРоли) = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ОписаниеПрофиля.Роли.Добавить(ИмяРоли);
	
КонецПроцедуры

Процедура ДополнитьОписаниеПрофиляРолямиСПАРКРиски(ОписаниеПрофиля)
	
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "АналитическиеОтчетыСПАРКРиски");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ЗапросНовойСправкиСПАРКРиски");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ПереходВВебВерсиюСПАРК");
	ДобавитьРольВОписаниеПрофиля(ОписаниеПрофиля, "ПостановкаКонтрагентовНаМониторингСПАРКРиски");
	
КонецПроцедуры

#КонецОбласти


#КонецОбласти
