
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьСтатьиБюджетов(Команда)
	
	ОткрытьФорму("Справочник.СтатьиБюджетов.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАналитикиСтатейБюджетов(Команда)
	
	ОткрытьФорму("ПланВидовХарактеристик.АналитикиСтатейБюджетов.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСценарии(Команда)
	
	ОткрытьФорму("Справочник.Сценарии.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВидыБюджетов(Команда)
	
	ОткрытьФорму("Справочник.ВидыБюджетов.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПоказателиБюджетов(Команда)
	
	ОткрытьФорму("Справочник.ПоказателиБюджетов.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСвязиПоказателейБюджетов(Команда)
	
	ОткрытьФорму("РегистрСведений.СвязиПоказателейБюджетов.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьШагиБюджетногоПроцесса(Команда)
	
	ОткрытьФорму("Справочник.ШагиБюджетныхПроцессов.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти
