
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("РежимГрупповогоОтображения") Тогда
		РежимГрупповогоОтображения = Параметры.РежимГрупповогоОтображения;	
	Иначе
		РежимГрупповогоОтображения = "ПоУмолчанию";
	КонецЕсли; 
	Если Параметры.Свойство("КонкретныйВариантОтображения") Тогда
		КонкретныйВариантОтображения = Параметры.КонкретныйВариантОтображения;	
	КонецЕсли;
	
	УстановитьВидимость();
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РежимГрупповогоОтображенияПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьНастройкиИЗакрыть(Команда)
	
	ВозвращаемыйРежимГрупповогоОтображения = ?(РежимГрупповогоОтображения = "ИспользоватьВыбранныйВариантОтображенияТрекаУВсех",
											   КонкретныйВариантОтображения,
											   РежимГрупповогоОтображения);
	
	Закрыть(Новый Структура("РежимГрупповогоОтображения",
							ВозвращаемыйРежимГрупповогоОтображения));
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимость()
	
	Элементы.ГруппаКонкретныйВариантОтображения.Видимость = (РежимГрупповогоОтображения = "ИспользоватьВыбранныйВариантОтображенияТрекаУВсех");
	
КонецПроцедуры

#КонецОбласти 


