#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

	
#Область ПрограммныйИнтерфейс

// Задает настройки размещения вариантов отчетов в панели отчетов.
// См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//
// Параметры:
//   Настройки - Коллекция - Используется для описания настроек отчетов и вариантов
//       см. описание к ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//   НастройкиОтчета - СтрокаДереваЗначений - Настройки размещения всех вариантов отчета.
//       См. ""Реквизиты для изменения"" функции ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "Сравнение пробега и расхода по путевым листами и по данным мониторинга");
	НастройкиВарианта.Описание = НСтр("en='Report provides comparative information on fuels consumption and vehicle mileage according to routing lists and monitoring data.';ru='Отчет позволяет получить сравнительную информацию о расходе ГСМ и пробеге ТС по данным путевых листов и данным мониторинга.'");
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьПробегGPS(ТС, ДатаВыезда, ДатаВозвращения) Экспорт 
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ТС",              ТС);
	Запрос.УстановитьПараметр("ДатаВыезда",      ДатаВыезда);
	Запрос.УстановитьПараметр("ДатаВозвращения", КонецМинуты(ДатаВозвращения));
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(СУММА(уатПробегРасходПоМониторингу.Пробег), 0) КАК Пробег
	|ИЗ
	|	РегистрСведений.уатПробегРасходПоМониторингу КАК уатПробегРасходПоМониторингу
	|ГДЕ
	|	уатПробегРасходПоМониторингу.ТС = &ТС
	|	И уатПробегРасходПоМониторингу.Период МЕЖДУ &ДатаВыезда И &ДатаВозвращения";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Пробег;
	Иначе 
		Возврат 0;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьМоточасыGPS(ТС, ДатаВыезда, ДатаВозвращения) Экспорт 
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ТС",              ТС);
	Запрос.УстановитьПараметр("ДатаВыезда",      ДатаВыезда);
	Запрос.УстановитьПараметр("ДатаВозвращения", КонецМинуты(ДатаВозвращения));
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(СУММА(уатПробегРасходПоМониторингу.ВремяРаботыДвигателя), 0) КАК ВремяРаботыДвигателя
	|ИЗ
	|	РегистрСведений.уатПробегРасходПоМониторингу КАК уатПробегРасходПоМониторингу
	|ГДЕ
	|	уатПробегРасходПоМониторингу.ТС = &ТС
	|	И уатПробегРасходПоМониторингу.Период МЕЖДУ &ДатаВыезда И &ДатаВозвращения";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.ВремяРаботыДвигателя;
	Иначе 
		Возврат 0;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьРасходGPS(ТС, ДатаВыезда, ДатаВозвращения) Экспорт 
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ТС",              ТС);
	Запрос.УстановитьПараметр("ДатаВыезда",      ДатаВыезда);
	Запрос.УстановитьПараметр("ДатаВозвращения", КонецМинуты(ДатаВозвращения));
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(СУММА(уатПробегРасходПоМониторингу.РасходТоплива), 0) КАК РасходТоплива
	|ИЗ
	|	РегистрСведений.уатПробегРасходПоМониторингу КАК уатПробегРасходПоМониторингу
	|ГДЕ
	|	уатПробегРасходПоМониторингу.ТС = &ТС
	|	И уатПробегРасходПоМониторингу.Период МЕЖДУ &ДатаВыезда И &ДатаВозвращения";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.РасходТоплива;
	Иначе 
		Возврат 0;
	КонецЕсли;
	
КонецФункции

#КонецОбласти


#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	уатЗащищенныеФункцииСервер.уатОтчетОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти


#КонецЕсли