
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если (НЕ ЭтоГруппа) И СпособРаспределенияМеждуАналитиками = Перечисления.уатСпособыРаспределенияДоходовРасходовМеждуАналитиками.РаспределятьПоЗаказам
		И НЕ ПараметрВыработкиРаспределенияМеждуАналитиками.ИспользоватьДляМаршрутныхЛистов Тогда
		ТекстНСТР = НСтр("en='Specify output parameter divided between analysts that is not used while service calculating at itenerary list';ru='Указан параметр выработки распределения между аналитиками, не использующийся при расчете услуг в маршрутных листах'");
		уатОбщегоНазначенияСервер.СообщитьОбОшибке(ЭтотОбъект, ТекстНСТР,,, "ПараметрВыработкиРаспределенияМеждуАналитиками", Отказ);
	КонецЕсли;
	
	Если Не ЭтоГруппа И РаспределениеДоходовПоСцепкам И Не ЗначениеЗаполнено(СпособРаспределенияВнутриСцепки) Тогда 
		ТекстНСТР = НСтр("en='It is necessary to specify allocation method of income within coupling.';ru='Необходимо указать способ распределения доходов внутри сцепки.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР, ЭтотОбъект, "СпособРаспределенияВнутриСцепки",, Отказ);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти