#Если Не ВебКлиент Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

// Данные выгружаются в файлы для дальнейшего использования в маршрутизации внешними программами
//Процедура ВыгрузитьДанные(СтруктураНастроек, мсвДанныеТСДляВыгрузки, мсвЗаказов, МассивОшибок) Экспорт
Процедура ВыгрузитьДанные(СтруктураJSON, КаталогОтладки, ТекстОшибки) Экспорт
	
	ИмяФайлаСообщенияДляRarusVRP = "settings.txt";
	Если Не ЗначениеЗаполнено(КаталогОтладки) Тогда
		ТекстОшибки = НСтр("ru = 'Для локального использования выбранного алгоритма необходимо заполнить константу ""Каталог отладки маршрутизации Rarus VRP""'; en = 'To use the selected algorithm locally, you must fill in the ""Rarus VRP Routing Debug Directory"" constant.'");
		Возврат;
	КонецЕсли;
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, "  ");
	ЗаписьJSON.ОткрытьФайл(КаталогОтладки + "\" + ИмяФайлаСообщенияДляRarusVRP, "UTF-8",, ПараметрыЗаписиJSON);
	ЗаписатьJSON(ЗаписьJSON, СтруктураJSON);
	ЗаписьJSON.Закрыть();
	
КонецПроцедуры

Процедура ЗапуститьМаршрутизацию(АдресВрХранилища, КаталогОтладки, ТекстОшибки) Экспорт 
	
	флRarusVRP = Истина;
	Если Не ЗначениеЗаполнено(КаталогОтладки) Тогда
		ТекстОшибки = НСтр("ru = 'Для локального использования выбранного алгоритма необходимо заполнить константу ""Каталог отладки маршрутизации Rarus VRP""'; en = 'To use the selected algorithm locally, you must fill in the ""Rarus VRP Routing Debug Directory"" constant.'");
		Возврат;
	КонецЕсли;
	ИмяИсполняемогоФайлаRarusVRP = "x64\Debug\RarusVRP.exe";
	ИмяФайлаОтветаRarusVRP = "answer.txt";
	
	ЗапуститьПриложение(КаталогОтладки + "\" + ИмяИсполняемогоФайлаRarusVRP, КаталогОтладки, Истина);
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.ОткрытьФайл(КаталогОтладки + "\" + ИмяФайлаОтветаRarusVRP, "UTF-8");
	
	СтруктураОтвета = ПрочитатьJSON(ЧтениеJSON);
	Если Не ТипЗнч(СтруктураОтвета) = Тип("Структура") Тогда
		ТекстОшибки = НСтр("ru = 'Получен некорректный ответ от сервиса Rarus VRP'; en = 'An incorrect response was received from the Rarus VRP service.'");
		Возврат;
	КонецЕсли;
	
	Если СтруктураОтвета.status <> 1 Тогда
		ТекстОшибки = НСтр("ru = 'Сервис Rarus VRP сообщает об ошибке маршрутизации'; en = 'The Rarus VRP service reports a routing error.'");
		Возврат;
	КонецЕсли;
	
	уатВнешнийМаршрутизаторСервер_уэ.Маршрутизация_ПоместитьРезультатВоВременноеХранилище(СтруктураОтвета, АдресВрХранилища,, флRarusVRP);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли