
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ЭтапМаршрутизации") Тогда
		ЭтапМаршрутизации = Параметры.ЭтапМаршрутизации;
		ТС = Параметры.ТС;
		МЛ = Параметры.МЛ;
		ВыбратьМетрикиСервер(ЭтапМаршрутизации,ТС, МЛ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВыбратьМетрикиСервер(ЭтапМаршрутизации, ТС, МЛ)
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Этап", ЭтапМаршрутизации);
	Запрос.УстановитьПараметр("ТС", ТС);
	Запрос.УстановитьПараметр("МЛ", МЛ);
	Запрос.Текст = "ВЫБРАТЬ
	               |	уатЭтапыМаршрутизацииМетрики.Свойство КАК Свойство,
	               |	уатЭтапыМаршрутизацииМетрики.Значение КАК Значение
	               |ИЗ
	               |	Справочник.уатЭтапыМаршрутизации.Метрики КАК уатЭтапыМаршрутизацииМетрики
	               |ГДЕ
	               |	уатЭтапыМаршрутизацииМетрики.Ссылка = &Этап
	               |	И уатЭтапыМаршрутизацииМетрики.ТС = &ТС
	               |	И уатЭтапыМаршрутизацииМетрики.МаршрутныйЛист = &МЛ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Свойство";
	Метрики.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

#КонецОбласти
