///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Определяет список модулей библиотек и конфигурации, которые предоставляют
// основные сведения о себе: имя, версия, список обработчиков обновления
// а также зависимости от других библиотек.
//
// Состав обязательных процедур такого модуля см. в общем модуле ОбновлениеИнформационнойБазыБСП
// (область ПрограммныйИнтерфейс).
// При этом сам модуль Библиотеки стандартных подсистем ОбновлениеИнформационнойБазыБСП
// не требуется явно добавлять в массив МодулиПодсистем.
//
// Параметры:
//  МодулиПодсистем - Массив - имена серверных общих модулей библиотек и конфигурации.
//                             Например: "ОбновлениеИнформационнойБазыБРО" - библиотека,
//                                       "ОбновлениеИнформационнойБазыБП"  - конфигурация.
//                    
Процедура ПриДобавленииПодсистем(МодулиПодсистем) Экспорт
	
	// {УАТ}
	МодулиПодсистем.Добавить("уатОбновлениеИнформационнойБазы");
	МодулиПодсистем.Добавить("ЛицензированиеСлужебный");   
	
	Если (уатОбщегоНазначенияПовтИсп.ВариантПоставкиКОРП()
		ИЛИ уатОбщегоНазначенияПовтИсп.ВариантПоставкиПРОФ()
		ИЛИ уатОбщегоНазначенияПовтИсп.ВариантПоставкиТакси())
		И ТекущийЯзык() = Метаданные.Языки.Русский Тогда
		// БПО и Itob не поддерживают другие языки, кроме русского.
		// Здесь проверяется ТекущийЯзык(), так как это именно тот язык, для которого происходит
		// получение текста НСтр() без указания языка и из макетов.
		// Получение текста на другом языке приводит к ошибке обработчиков первоначального заполнения информационной базы.
		МодулиПодсистем.Добавить("ItobОбновлениеИнформационнойБазыЦСМ");
		МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыБПО");
	КонецЕсли;
	
	Если уатОбщегоНазначенияПовтИсп.ВариантПоставкиКОРП() Тогда
		МодулиПодсистем.Добавить("уатОбновлениеИнформационнойБазы_уэ");
	ИначеЕсли уатОбщегоНазначенияПовтИсп.ВариантПоставкиТакси() Тогда 
		Если Метаданные.ОбщиеМакеты.Найти("уатХранилищеЗащищеннойОбработкиКОРП_уэ") <> Неопределено Тогда
			МодулиПодсистем.Добавить("уатОбновлениеИнформационнойБазы_уэ"); 
		КонецЕсли;
		МодулиПодсистем.Добавить("такОбновлениеИнформационнойБазы");
	КонецЕсли;
	
	// ЭлектронноеВзаимодействие
	МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыБЭД");
	// Конец ЭлектронноеВзаимодействие
		
	// {СЛК}
	МодулиПодсистем.Добавить("слкОбновлениеИнформационнойБазы");
	// {/СЛК}
	
	Если (уатОбщегоНазначенияПовтИсп.ВариантПоставкиКОРП()
		ИЛИ уатОбщегоНазначенияПовтИсп.ВариантПоставкиПРОФ()
		ИЛИ уатОбщегоНазначенияПовтИсп.ВариантПоставкиТакси()) Тогда 
		// РаспознаваниеДокументов
		МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыБРД");
		// Конец РаспознаваниеДокументов
		
		// ИнтеграцияС1СДокументооборотом
		МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыБИД");
		// Конец ИнтеграцияС1СДокументооборотом
	КонецЕсли;
	
	// ПоддержкаОтраслевыхРешений
	МодулиПодсистем.Добавить("пр_ОбновлениеИнформационнойБазы");
	// Конец ПоддержкаОтраслевыхРешений
	// {/УАТ}
	
КонецПроцедуры

#КонецОбласти
