////////////////////////////////////////////////////////////////////////////////
// Работа с географическими сервисами (сервер)
// Для версии платформы выше 8.3.8.
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Выполняет подключение внешней обработки по указанному пути.
//  Возвращает имя подключенной внешней обработки.
//
// Параметры:
//  Путь			 - Строка	 - Ссылка на реквизит объекта конфигурации, который содержит данные внешней обработки.
//  	Ссылка может быть получена методом ПолучитьНавигационнуюСсылку.
//  Имя				 - Строка	 - Имя внешней обработки, с которым она будет зарегистрирована в системе.
//  	Наличие одинаковых имен в процессе работы сеанса не допускается.
//  БезопасныйРежим	 - Булево	 - Признак подключения внешней обработки в безопасном режиме.
//  	Если параметр не указан, подключение будет осуществлено в не безопасном режиме.
// 
// Возвращаемое значение:
//  Строка - Имя внешней обработки.
//
Функция ПодключитьВнешнююОбработку(Путь, Имя, БезопасныйРежим = Ложь) Экспорт

	ОписаниеЗащитыОтОпасныхДействий = Новый ОписаниеЗащитыОтОпасныхДействий();
	ОписаниеЗащитыОтОпасныхДействий.ПредупреждатьОбОпасныхДействиях = Ложь;
	Возврат ВнешниеОбработки.Подключить(Путь, Имя, БезопасныйРежим, ОписаниеЗащитыОтОпасныхДействий);

КонецФункции

#КонецОбласти

