
#Область ПрограммныйИнтерфейс

#Область ОбработчикиСобытий

// Процедура обработчик события подписки на событие записи транспортного средства.
//
// Параметры:
//  Источник - СправочникСсылка.ItobМаркиТранспорта	 - Исходный элемент справочника.
//  Отказ	 - Булево	- Признак отказа от записи.
//						  Если в теле процедуры-обработчика установить данному параметру значение Истина,
//						  то запись выполнена не будет.
//	ИспользоватьОбработчикЦСМ - Булево - флаг использования обработчика ЦСМ. 
//
Процедура ЗаписьТС(Источник, Отказ, ИспользоватьОбработчикЦСМ) Экспорт
	
	ИспользоватьОбработчикЦСМ = Истина;
	Если НЕ ItobЦентрСпутниковогоМониторинга.ЭтоКонфигурацияЦСМ() Тогда
		ItobЦентрСпутниковогоМониторингаПереопределяемый.ЗаписьТС(Источник, Отказ, ИспользоватьОбработчикЦСМ);	
	КонецЕсли; 
	
	Если ИспользоватьОбработчикЦСМ Тогда	
		Если ItobОбщегоНазначения.ЭтоЗаписьОбъектаПриЗагрузкеВМоделиСервиса(Источник) Тогда
			Возврат;
		КонецЕсли;
		
		Запись = ItobОбщегоНазначения.ПолучитьЗаписьРегистраСведений("ItobСвойстваТранспортныхСредств", "ТранспортноеСредство", Источник.Ссылка);	
		Запись.МодельТС	= Источник.Марка;		
		Запись.Организация = Источник.Организация;
		Запись.ГосНомер = Источник.ГосНомер;
		Запись.Тип = Источник.ВидТранспорта;
		Запись.ГаражныйНомер  = Источник.ГаражныйНомер;	
		Запись.Записать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#КонецОбласти 