
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если Основная Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	уатПластиковыеКарты.Основная,
		|	уатПластиковыеКарты.КомуВыдана,
		|	уатПластиковыеКарты.КемВыдана,
		|	уатПластиковыеКарты.Ссылка
		|ИЗ
		|	Справочник.уатПластиковыеКарты КАК уатПластиковыеКарты
		|ГДЕ
		|	уатПластиковыеКарты.КомуВыдана = &КомуВыдана
		|	И уатПластиковыеКарты.Основная = ИСТИНА
		|	И уатПластиковыеКарты.Ссылка <> &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("КомуВыдана", КомуВыдана);
		
		ТЗ = Запрос.Выполнить().Выгрузить();
		Если ТЗ.Количество() > 0 Тогда
				СпрОбъект = ТЗ[0].Ссылка.ПолучитьОбъект();
				СпрОбъект.Основная = Ложь;
				СпрОбъект.Записать();
				ТекстНСТР = НСтр("en='Installed new main fuel card for ""%1"" (old main card: ""%2"")';ru='Установлена новая основная топливная карта для ""%1"" (старая основная карта: ""%2"")'");
				ТекстНСТР = СтрШаблон(ТекстНСТР, КомуВыдана, ТЗ[0].Ссылка);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ЗначениеЗаполнено(ДатаВыдачи)
		ИЛИ ЗначениеЗаполнено(КомуВыдана) Тогда 
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("Карта",      Ссылка);
		Запрос.УстановитьПараметр("Период",     ДатаВыдачи); 
		Запрос.УстановитьПараметр("КомуВыдана", КомуВыдана);
		Запрос.Текст = "ВЫБРАТЬ
		               |	уатИсторияПеремещенияТопливныхКарт.Период КАК Период,
		               |	уатИсторияПеремещенияТопливныхКарт.Карта КАК Карта,
		               |	уатИсторияПеремещенияТопливныхКарт.КомуВыдана КАК КомуВыдана
		               |ИЗ
		               |	РегистрСведений.уатИсторияПеремещенияТопливныхКарт КАК уатИсторияПеремещенияТопливныхКарт
		               |ГДЕ
		               |	уатИсторияПеремещенияТопливныхКарт.Карта = &Карта
		               |	И уатИсторияПеремещенияТопливныхКарт.КомуВыдана = &КомуВыдана
		               |	И уатИсторияПеремещенияТопливныхКарт.Период = &Период";
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда 
			НаборЗаписей = РегистрыСведений.уатИсторияПеремещенияТопливныхКарт.СоздатьНаборЗаписей();
			НаборЗаписей.Заполнить(Неопределено);  
			НаборЗаписей.Отбор.Карта.Установить(Ссылка); 
			НаборЗаписей.Отбор.Период.Установить(ДатаВыдачи);
			НаборЗаписей.Прочитать();
			Если НаборЗаписей.Количество() <> 0 Тогда
				НаборЗаписей.Очистить();
			КОнецЕсли; 
			
			Запись = НаборЗаписей.Добавить();
			Запись.Период		 = ?(ЗначениеЗаполнено(ДатаВыдачи), ДатаВыдачи, ТекущаяДатаСеанса());
			Запись.Карта		 = Ссылка;
			Запись.КомуВыдана	 = КомуВыдана;
			Попытка
				НаборЗаписей.Записать();
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

