#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	Если Параметры.Свойство("ТаблицаОконСклада") Тогда
		Для Каждого ТекСтрока Из Параметры.ТаблицаОконСклада Цикл 
			НоваяСтрока = ОкнаСклада.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		КонецЦикла; 
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ОкнаСклада

&НаКлиенте
Процедура ОкнаСкладаПриИзменении(Элемент) 
	ТекущиеДанные = Элементы.ОкнаСклада.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	Если ТекущиеДанные.ТипОкна = "" Тогда
		ТекущиеДанные.ТипОкна = "Окно загрузки";
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	
	ТаблицаОконСклада = Новый Массив();
	Для Каждого ТекСтрока Из ОкнаСклада Цикл
		ДанныеОкна = Новый Структура("ТипОкна,ОкноС,ОкноПо");
		ЗаполнитьЗначенияСвойств(ДанныеОкна, ТекСтрока);
		ТаблицаОконСклада.Добавить(ДанныеОкна);
	КонецЦикла;
	
	Закрыть(Новый Структура("ТаблицаОконСклада", ТаблицаОконСклада));
	
КонецПроцедуры

#КонецОбласти
