///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Предназначена для внесения изменений в форму Обслуживание обработки
// ПанельАдминистрированияБСП без снятия формы с поддержки.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - для внесения изменений.
//
Процедура ОбслуживаниеПриСозданииНаСервере(Форма) Экспорт
	
	// {УАТ}
	УстановитьПривилегированныйРежим(Истина);
	Если НЕ Константы.уатКонфигурацияДляРФ.Получить() Тогда 
		// Необходимо скрыть элементы формы.
		Если Не Форма.Элементы.Найти("ГруппаРезервноеКопированиеИВосстановление") = Неопределено Тогда 
			Форма.Элементы.ГруппаРезервноеКопированиеИВосстановление.Видимость = Ложь;
		КонецЕсли;
		Если Не Форма.Элементы.Найти("УстановкаОбновлений") = Неопределено Тогда 
			Форма.Элементы.УстановкаОбновлений.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
		
	#Область ОтключениеРегламентныхЗаданий
	
	// Добавление группы элементов
	ТекГруппаЭлементов = Форма.Элементы.Добавить("Группа" + "ОтключитьРегламентныеЗадания", Тип("ГруппаФормы"), Форма.Элементы.ГруппаРегламентныеЗадания);
	ТекГруппаЭлементов.Вид                        = ВидГруппыФормы.ОбычнаяГруппа;
	ТекГруппаЭлементов.Группировка                = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ТекГруппаЭлементов.ШиринаПодчиненныхЭлементов = ШиринаПодчиненныхЭлементовФормы.Одинаковая;
	ТекГруппаЭлементов.Отображение                = ОтображениеОбычнойГруппы.Нет;
	ТекГруппаЭлементов.ОтображатьЗаголовок        = Ложь;
	ТекГруппаЭлементов.Ширина                     = 43;
	ТекГруппаЭлементов.РастягиватьПоГоризонтали   = Ложь;
		
	// Добавление кнопки-гиперссылки
	ТекГиперссылка 			 = Форма.Элементы.Добавить("ОтключитьРегламентныеЗадания", Тип("ДекорацияФормы"), ТекГруппаЭлементов);
	ТекГиперссылка.Заголовок = Новый ФорматированнаяСтрока(НСтр("ru = 'Отключить регламентные задания'; en = 'Disable scheduled tasks'"),,,, "e1cib/command/ОбщаяКоманда.уатОтключитьРегламентныеЗадания");
	
	// Текстовая подсказка
	ТекПодсказка 			= Форма.Элементы.Добавить("ОтключитьРегламентныеЗадания" + "Подсказка", Тип("ДекорацияФормы"), ТекГруппаЭлементов);
	ТекПодсказка.Заголовок  = "Все регламентные задания будут отключены.";
	ТекПодсказка.ЦветТекста = ЦветаСтиля.ПоясняющийТекст;
	
	#КонецОбласти
	
	// {/УАТ}
	
КонецПроцедуры

// Предназначена для внесения изменений в форму ОбщиеНастройки обработки
// ПанельАдминистрированияБСП без снятия формы с поддержки.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - для внесения изменений.
//
Процедура ОбщиеНастройкиПриСозданииНаСервере(Форма) Экспорт
	
	// {УАТ}
	УстановитьПривилегированныйРежим(Истина);
	Если НЕ Константы.уатКонфигурацияДляРФ.Получить() Тогда 
		// Необходимо скрыть элементы формы.
		Если Не Форма.Элементы.Найти("ГруппаЭлектроннаяПодписьИШифрование") = Неопределено Тогда 
			Форма.Элементы.ГруппаЭлектроннаяПодписьИШифрование.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
	// {/УАТ}
	
	// {УАТ}
	// Добавление на форму команды "Перенос дополнительных реквизитов при вводе на основании"
	
	// Добавление группы элементов
	ГруппаВладелец = Форма.Элементы.Найти("ГруппаДополнительныеРеквизиты");
	Если ГруппаВладелец <> Неопределено Тогда
		ТекГруппа = Форма.Элементы.Добавить("ГруппаПереносДополнительныхРеквизитов", Тип("ГруппаФормы"), ГруппаВладелец);
	Иначе
		ТекГруппа = Форма.Элементы.Добавить("ГруппаПереносДополнительныхРеквизитов", Тип("ГруппаФормы"));
	КонецЕсли;
	ТекГруппа.Вид                        = ВидГруппыФормы.ОбычнаяГруппа;
	ТекГруппа.Группировка                = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
	ТекГруппа.Отображение                = ОтображениеОбычнойГруппы.Нет;
	ТекГруппа.ОтображатьЗаголовок        = Ложь;
	ТекГруппа.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
	ТекГруппа.Подсказка = НСтр("ru = 'Настройки переноса дополнительных реквизитов при вводе на основании для документов.';
		|en = 'Settings for filling of additional attributes for input on basis of documents.'");
	
	// Добавление гиперссылки команды "Перенос дополнительных реквизитов при вводе на основании"
	ТекГиперссылка           = Форма.Элементы.Добавить("ПереносДополнительныхРеквизитов", Тип("ДекорацияФормы"), ТекГруппа);
	ТекГиперссылка.Заголовок = Новый ФорматированнаяСтрока(НСтр("ru = 'Перенос дополнительных реквизитов при вводе на основании'; en = 'Transfer of additional details when entering based on'"),,,,
		"e1cib/command/РегистрСведений.уатПереносДополнительныхРеквизитов.Команда.НастройкиПереносаДополнительныхРеквизитов");
	
	// {/УАТ}
	
КонецПроцедуры

// Предназначена для внесения изменений в форму Обслуживание обработки
// ПанельАдминистрированияБСП без снятия формы с поддержки.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - для внесения изменений.
//
Процедура НастройкиПользователейИПравПриСозданииНаСервере(Форма) Экспорт
	
	// {УАТ}
	ТекстПодсказкиПерсДанные = "Причиной скрытия данных может быть истечение срока действия согласия субъекта или его отсутствие."; 
	Форма.Элементы.ГруппаДнейДоУничтожения.Подсказка = ТекстПодсказкиПерсДанные;
	// {/УАТ}
	
КонецПроцедуры

// Предназначена для внесения изменений в форму ИнтернетПоддержкаИСервисы обработки
// ПанельАдминистрированияБСП без снятия формы с поддержки.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - для внесения изменений.
//
Процедура ИнтернетПоддержкаИСервисыПриСозданииНаСервере(Форма) Экспорт
	
	// {УАТ}
	УстановитьПривилегированныйРежим(Истина);
	Если НЕ уатОбщегоНазначения.КонфигурацияДляРФ() Тогда 
		// Необходимо скрыть элементы формы.
		Если Не Форма.Элементы.Найти("ГруппаОбновлениеПрограммы") = Неопределено Тогда 
			Форма.Элементы.ГруппаОбновлениеПрограммы.Видимость = Ложь;
		КонецЕсли;
		Если Не Форма.Элементы.Найти("ГруппаНовости") = Неопределено Тогда 
			Форма.Элементы.ГруппаНовости.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	//уатОбщегоНазначения.ИзменитьПолучателяСтатисики(Форма, "ЦентрМониторингаРазрешитьОтправлятьДанные", Ложь, Истина);
	
	// ПоддержкаОтраслевыхРешений
	пр_ПоддержкаОтраслевыхРешенийСлужебный.ПриСозданииНаСервере(Форма, Неопределено, Неопределено);
	// Конец ПоддержкаОтраслевыхРешений
	// {/УАТ}
	
КонецПроцедуры

// Предназначена для внесения изменений в форму Органайзер обработки
// ПанельАдминистрированияБСП без снятия формы с поддержки.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - для внесения изменений.
//
Процедура ОрганайзерПриСозданииНаСервере(Форма) Экспорт
	
КонецПроцедуры

// Предназначена для внесения изменений в форму СинхронизацияДанных обработки
// ПанельАдминистрированияБСП без снятия формы с поддержки.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - для внесения изменений.
//
Процедура СинхронизацияДанныхПриСозданииНаСервере(Форма) Экспорт
	
КонецПроцедуры

// Предназначена для внесения изменений в форму НастройкиРаботыСФайлами обработки
// ПанельАдминистрированияБСП без снятия формы с поддержки.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - для внесения изменений.
//
Процедура НастройкиРаботыСФайламиПриСозданииНаСервере(Форма) Экспорт
	
КонецПроцедуры

// Предназначена для внесения изменений в форму ПечатныеФормыОтчетыИОбработки обработки
// ПанельАдминистрированияБСП без снятия формы с поддержки.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - для внесения изменений.
//
Процедура ПечатныеФормыОтчетыИОбработкиПриСозданииНаСервере(Форма) Экспорт
	
КонецПроцедуры

#КонецОбласти