
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Фильтр = Параметры.ЗаполнитьПо;
	Если ТС.Пустая() Тогда
		Элементы.Список.Видимость = Ложь;
		Если Фильтр = "НатурныйЛист" Тогда
			Элементы.СписокНатурныхЛистов.Видимость = Истина;
			Элементы.СписокДислокаций.Видимость = Ложь;
		ИначеЕсли Фильтр = "Дислокация" Тогда
			Элементы.СписокДислокаций.Видимость = Истина;
			Элементы.СписокНатурныхЛистов.Видимость = Ложь;
		КонецЕсли;
	Иначе
		Элементы.Список.Видимость = Истина;
		Элементы.СписокНатурныхЛистов.Видимость = Ложь;
		Элементы.СписокДислокаций.Видимость = Ложь;
	КонецЕсли;
	Если Фильтр = "НатурныйЛист" Тогда
		Список.Параметры.УстановитьЗначениеПараметра("ТипДокумента", ТипЗнч(Документы.уатНатурныйЛист.ПустаяСсылка()));
		ТекстЗаголовкаФормы = НСтр("ru='Список Натурных листов'");
	ИначеЕсли Фильтр = "Дислокация" Тогда
		Список.Параметры.УстановитьЗначениеПараметра("ТипДокумента", ТипЗнч(Документы.уатДислокацияВагонов.ПустаяСсылка()));
		ТекстЗаголовкаФормы = НСтр("ru='Список Дислокаций'");
	КонецЕсли;
	Если ТекстЗаголовкаФормы = Неопределено Тогда
		ТекстЗаголовкаФормы = НСтр("ru='Список Натурных листов и Дислокаций'");
	КонецЕсли;
	ЭтаФорма.Заголовок = ТекстЗаголовкаФормы;
	Список.Параметры.УстановитьЗначениеПараметра("Значение", ТС);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТСПриИзменении(Элемент)
	Если ТС.Пустая() Тогда
		Элементы.Список.Видимость = Ложь;
		Если Фильтр = "НатурныйЛист" Тогда
			Элементы.СписокНатурныхЛистов.Видимость = Истина;
			Элементы.СписокДислокаций.Видимость = Ложь;
		ИначеЕсли Фильтр = "Дислокация" Тогда
			Элементы.СписокДислокаций.Видимость = Истина;
			Элементы.СписокНатурныхЛистов.Видимость = Ложь;
		КонецЕсли;
	Иначе
		Элементы.Список.Видимость = Истина;
		Элементы.СписокНатурныхЛистов.Видимость = Ложь;
		Элементы.СписокДислокаций.Видимость = Ложь;
	КонецЕсли;
	Список.Параметры.УстановитьЗначениеПараметра("Значение", ТС);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Список

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ВыбратьДокумент(ВыбраннаяСтрока);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_СписокНатурныхЛистов

&НаКлиенте
Процедура СписокНатурныхЛистовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ВыбратьДокумент(Элемент.ТекущиеДанные.Ссылка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_СписокНатурныхЛистов

&НаКлиенте
Процедура СписокДислокацийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ВыбратьДокумент(Элемент.ТекущиеДанные.Ссылка);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыбратьДокумент(Документ)
	Закрыть(Документ);
КонецПроцедуры

#КонецОбласти