
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьДействуетВесьДень();
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	УстановитьДействуетВесьДень();
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьДействуетВесьДень();
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	#Если Клиент Тогда
		Оповестить("СредняяСкоростьДвижения_Запись", Параметры.Ключ, ЭтотОбъект);
	#КонецЕсли
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НачалоПериодаПриИзменении(Элемент)
	
	УстановитьДействуетВесьДень();
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаПриИзменении(Элемент)
	
	УстановитьДействуетВесьДень();
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура флДействуетВесьДеньПриИзменении(Элемент)
	
	Если флДействуетВесьДень Тогда 
		Запись.НачалоПериода = '00010101000000';
		Запись.КонецПериода  = '00010101235900';
		
	Иначе 
		Запись.НачалоПериода = '00010101000000';
		Запись.КонецПериода  = '00010101000000';
	КонецЕсли;
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьДействуетВесьДень()
	
	Если Запись.НачалоПериода = '00010101000000' И Запись.КонецПериода = '00010101235900' Тогда 
		флДействуетВесьДень = Истина;
	Иначе 
		флДействуетВесьДень = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступность()
	
	Если флДействуетВесьДень Тогда 
		Элементы.НачалоПериода.Видимость = Ложь;
		Элементы.КонецПериода.Видимость  = Ложь;
		
	Иначе 
		Элементы.НачалоПериода.Видимость = Истина;
		Элементы.КонецПериода.Видимость  = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
