
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТЧ_Номенклатуры = ПолучитьИзВременногоХранилища(Параметры.ТЧ_СписокНоменклатуры);
	РемонтныйЛист = Параметры.РемЛист;
	
	Если ТЧ_Номенклатуры.Количество() <> 0 Тогда
		СписокНоменклатуры.Загрузить(ТЧ_Номенклатуры);
	КонецЕсли;
	
	СписокНоменклатуры.Сортировать("Номенклатура");
	
	ПриОткрытииНаСервере(Параметры.ID_Склад);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_СписокНоменклатуры

&НаКлиенте
Процедура СписокНоменклатурыНоменклатураПриИзменении(Элемент)

	Элементы.СписокНоменклатуры.ТекущиеДанные.ЕдиницаИзмерения = ВернутьЕдИзме(Элементы.СписокНоменклатуры.ТекущиеДанные.Номенклатура);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ТЧ_СписокНоменклатуры", ПоместитьВоВременноеХранилщеСписокНоменклатуры());
	СтруктураВозврата.Вставить("ТЧ_НоваяСтрока", Элементы.СписокНоменклатуры.ТекущиеДанные); 
	
	ОповеститьОВыборе(СтруктураВозврата);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПоместитьВоВременноеХранилщеСписокНоменклатуры()
	
	Возврат ПоместитьВоВременноеХранилище(СписокНоменклатуры.Выгрузить());
	
КонецФункции 

&НаСервере
Функция ВернутьЕдИзме(ТекНоменклатура)
	
	Возврат ТекНоменклатура.ЕдиницаХраненияОстатков;
	
КонецФункции

&НаСервере
функция ПолучитьДанныеОWS()Экспорт
	
	Возврат GDS_ФункцииОбмена.ПолучитьДанныеОWS_БП();
	
конецФункции

&НаСервере
Процедура ПриОткрытииНаСервере(Склад)
	
	Если СписокНоменклатуры.Количество() <> 0 Тогда
		Возврат;
	КонецЕсли;
	
	СоединениеWS = ПолучитьДанныеОWS();
	
	Данные = СоединениеWS.ВернутьДанныеПоЗапросу("ЗапросОстатковНаСкладе",Строка(Склад.Ссылка.УникальныйИдентификатор()));
	
	XML_Строка             = Данные.Получить();
	СписокПолученныхДанных = GDS_ФункцииОбмена.РазобратьПолученныеДанные(XML_Строка);
	СписокНоменклатур      = СписокПолученныхДанных[0].Значение;
	
	Если СписокНоменклатур = "" Тогда
		Возврат;
	КонецЕсли;
	
	Если СписокНоменклатур.Номенклатура = "" Тогда
		Сообщить("На данном складе нет остатков!!!");	
		Возврат;
	КонецЕсли;
	
	Для каждого Запись из СписокНоменклатур.Номенклатура Цикл
		
		ЗначениеЗаписи = Запись.Значение;
		
		Cтрока = СписокНоменклатуры.Добавить();
		
		Cтрока.Номенклатура     = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(ЗначениеЗаписи.Номенклатура));
		Cтрока.ЕдиницаИзмерения = Cтрока.Номенклатура.ЕдиницаХраненияОстатков;
		Cтрока.Количество       = ЗначениеЗаписи.Количество;
		
	КонецЦикла;
	
	Номенклатура = СписокНоменклатуры.Выгрузить().ВыгрузитьКолонку("Номенклатура");
	НоменклатураРемЛистов = GDS_РемонтныеЛисты.НоменклатураИспользуемаяВНесогласованныхРемЛистах(Объект.Ссылка, Номенклатура, Склад);
	Для Каждого СтрокаНоменклатура Из НоменклатураРемЛистов Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура", СтрокаНоменклатура.Номенклатура);
		СтрокиСписка = СписокНоменклатуры.НайтиСтроки(Отбор);
		Для Каждого СтрокаСписка Из СтрокиСписка Цикл
			СтрокаСписка.КоличествоВРемЛистах = СтрокаНоменклатура.Количество;
		КонецЦикла;
	КонецЦикла;
	
	СписокНоменклатуры.Сортировать("Номенклатура");
	
КонецПроцедуры

#КонецОбласти

