////////////////////////////////////////////////////////////////////////////////
// Заполнение путевых листов (вызов сервера)
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс 

// Возвращает данные по ТС.
//
// Параметры:
//  Параметры	 - Структура- Параметры транспортного средства. 
//  ТекстОшибки	 - 	Строка -  Текст ошибки.
// 
// Возвращаемое значение:
//  Структура - Данные по ТС.
//
Функция ПолучитьДанныеПоТС(Параметры, ТекстОшибки) Экспорт
	
	Возврат ItobЗаполнениеПоДаннымТрекеров.ПолучитьДанныеПоТС(Параметры, ТекстОшибки);	
	
КонецФункции

// Возвращает данные по ТС локально.
//
// Параметры:
//  Параметры				 - Структура - Параметры транспортного средства.
//  ТекстОшибки				 - Строка	 - Текст ошибки.
//  ПараметрыЗаполнения		 - Структура - Параметры заполнения путевых листов.
// 
// Возвращаемое значение:
//  Структура - Данные по ТС.
//
Функция ПолучитьДанныеПоТС_Локально(Параметры, ТекстОшибки, ПараметрыЗаполнения = Неопределено) Экспорт
	
	Возврат ItobЗаполнениеПоДаннымТрекеров.ПолучитьДанныеПоТС(Параметры, ТекстОшибки, ПараметрыЗаполнения);

КонецФункции

// Вычисляет изменение значения датчика.
//
// Параметры:
//  НачДата				 - Дата										 - Начало периода.
//  КонДата				 - Дата										 - Конец периода.
//  Терминал			 - СправочникСсылка.ItobТерминалы			 - Ссылка на терминал.
//  Датчик				 - СправочникСсылка.ItobДатчики				 - Ссылка на датчик.
//  КалибровочныйГрафик	 - СправочникСсылка.ItobКалибровочныеГрафики - Ссылка на калибровочный график.
//  НазначениеДатчика	 - СправочникСсылка.ItobНазначенияДатчиков	 - Ссылка на назначение датчика.
// 
// Возвращаемое значение:
//  Число - Значение параметра.
//
Функция ВычислитьИзменениеЗначенияДатчика(НачДата, КонДата, Терминал, Датчик, КалибровочныйГрафик, НазначениеДатчика) Экспорт
	
	Возврат ItobЗаполнениеПоДаннымТрекеров.ПолучитьДанныеПоТС(НачДата, КонДата, Терминал, Датчик, КалибровочныйГрафик, НазначениеДатчика);

КонецФункции // ВычислитьИзменениеЗначенияДатчика()

// Возвращает структуру части параметров путевых листов.
//
// Параметры:
//  ДатаВыезда			 - Дата										 - Дата выезда.
//  ДатаВозвращения		 - Дата										 - Дата возвращения.
//  ТранспортноеСредство - СправочникСсылка.ItobТранспортныеСредства - Указатель на транспортное средство.
//  Организация			 - СправочникСсылка.ItobОрганизации			 - Указатель на организацию.
// 
// Возвращаемое значение:
//  Структура - Параметры по ТС.
//
Функция ПолучитьШаблонПараметровПоТС(ДатаВыезда = '00010101', ДатаВозвращения = '00010101', ТранспортноеСредство = Неопределено, Организация = Неопределено) Экспорт
	
	Возврат ItobЗаполнениеПоДаннымТрекеров.ПолучитьДанныеПоТС(ДатаВыезда, ДатаВозвращения, ТранспортноеСредство, Организация);
	
КонецФункции // ПолучитьШаблонПараметровПоТС()

// Возвращает шаблон данных по ТС.
// 
// Возвращаемое значение:
//  Структура - Данные по ТС.
//
Функция ПолучитьШаблонДанныеПоТС() Экспорт
	
	Возврат ItobЗаполнениеПоДаннымТрекеров.ПолучитьШаблонДанныеПоТС();
	
КонецФункции // ПолучитьШаблонДанныеПоТС()

// Функция возвращает структуру части параметров путевых листов
//
// Параметры:
//  ДатаВыезда			 - Дата	 - Дата выезда.
//  ДатаВозвращения		 - Дата	 - дата возвращения.
//  ТранспортноеСредство - СправочникСсылка.ItobТранспортныеСредства - Ссылка на транспортное средство.
//  Организация			 - СправочникСсылка.ItobОрганизации - организация.
// 
// Возвращаемое значение:
//	Структура 
//
Функция ПолучитьПараметрыДляПутевыхЛистов(ДатаВыезда, ДатаВозвращения, ТранспортноеСредство = Неопределено, Организация = Неопределено) Экспорт
	
	Возврат ItobЗаполнениеПоДаннымТрекеров.ПолучитьПараметрыДляПутевыхЛистов(ДатаВыезда, ДатаВозвращения, ТранспортноеСредство, Организация);
	
КонецФункции // ПолучитьПараметрыДляПутевыхЛистов()

#КонецОбласти