
&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	уатПутевойЛистЗадание.Маршрут КАК ПУ,
		|	уатПутевойЛистЗадание.Ссылка.ТранспортноеСредство.ТипТС КАК ТипТС,
		|	уатПутевойЛистЗадание.Ссылка.ТранспортноеСредство.Подразделение КАК Подразделение,
		|	уатПутевойЛистПрицепы.ТС.ТипТС КАК ТипПрицепа,
		|	уатПутевойЛистЗадание.Ссылка.ТранспортноеСредство.Колонна КАК Колонна
		|ИЗ
		|	Документ.уатПутевойЛист.Задание КАК уатПутевойЛистЗадание
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уатПутевойЛист.Прицепы КАК уатПутевойЛистПрицепы
		|		ПО уатПутевойЛистЗадание.Ссылка = уатПутевойЛистПрицепы.Ссылка
		|			И (уатПутевойЛистПрицепы.ТС.ВидМоделиТС = ЗНАЧЕНИЕ(Перечисление.уатВидыМоделейТС.Прицеп))
		|ГДЕ
		|	уатПутевойЛистЗадание.Ссылка.Дата МЕЖДУ &ДатаН И &ДатаК
		|	И уатПутевойЛистЗадание.Ссылка.Проведен
		|	И уатПутевойЛистЗадание.Ссылка.Рассчитан
		|	И уатПутевойЛистЗадание.Маршрут <> &Маршрут
		|	И уатПутевойЛистЗадание.Ссылка.ТранспортноеСредство.ТипТС <> &ТипТС
		|	И уатПутевойЛистЗадание.Ссылка.ТранспортноеСредство.Колонна <> &Колонна
		|	И уатПутевойЛистЗадание.Маршрут = уатПутевойЛистЗадание.Ссылка.ТранспортноеСредство.Подразделение.Родитель.МеКаМи_ПроизводственныйУчасток
		|	И уатПутевойЛистЗадание.Ссылка.ТранспортноеСредство.Подразделение.Родитель.МеКаМи_ПроизводственныйУчасток <> &Маршрут
		|
		|СГРУППИРОВАТЬ ПО
		|	уатПутевойЛистЗадание.Маршрут,
		|	уатПутевойЛистЗадание.Ссылка.ТранспортноеСредство.ТипТС,
		|	уатПутевойЛистЗадание.Ссылка.ТранспортноеСредство.Подразделение,
		|	уатПутевойЛистПрицепы.ТС.ТипТС,
		|	уатПутевойЛистЗадание.Ссылка.ТранспортноеСредство.Колонна";
	
	Запрос.УстановитьПараметр("ДатаН", Дата(2025,1,1));
	Запрос.УстановитьПараметр("ДатаК",  Дата(2025,12,31));
	Запрос.УстановитьПараметр("Колонна",  Справочники.уатКолонны.ПустаяСсылка());
	Запрос.УстановитьПараметр("Маршрут",  Справочники.уатМаршруты.ПустаяСсылка());
	Запрос.УстановитьПараметр("ТипТС",  Справочники.уатТипыТС.ПустаяСсылка());

	тзСоответствий = Запрос.Выполнить().Выгрузить();
	
	НаборЗаписей = РегистрыСведений.GDS_СоответствиеТСиПУПодразделению.СоздатьНаборЗаписей(); 
	НаборЗаписей.Загрузить(тзСоответствий); 
	НаборЗаписей.Записать();  
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры
