#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

	
#Область ПрограммныйИнтерфейс

// Задает настройки размещения вариантов отчетов в панели отчетов.
// См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//
// Параметры:
//   Настройки - Коллекция - Используется для описания настроек отчетов и вариантов
//       см. описание к ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//   НастройкиОтчета - СтрокаДереваЗначений - Настройки размещения всех вариантов отчета.
//       См. ""Реквизиты для изменения"" функции ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "Задания путевых листов с группировкой по этапам");
	НастройкиВарианта.Описание = НСтр("en='Report provides information about waybills tasks grouped by stages.';ru='Отчет позволяет получить информацию о заданиях путевых листов с группировкой по этапам.'");
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

Функция РасхождениеОбщегоПробега(ПутевойЛист) Экспорт
	ПробегВсего = 0;
	Для Каждого ТекСтрока Из ПутевойЛист.Задание Цикл
		ПробегВсего = ПробегВсего + ТекСтрока.КоличествоКмГруз * ТекСтрока.КоличествоЕздок + ТекСтрока.КоличествоКмПорожний * ТекСтрока.КоличествоЕздок;
	КонецЦикла;
	
	Рез = уатОбщегоНазначения.уатРазностьПоказанийСчетчика(ПутевойЛист.СпидометрВыезда, ПутевойЛист.СпидометрВозвращения) - ПробегВсего;
	
	Возврат Рез;
КонецФункции

#КонецОбласти


#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	уатЗащищенныеФункцииСервер.уатОтчетОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти


#КонецЕсли