
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	уатЗащищенныеФункцииСервер.уатДокументФормаСпискаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;

	флАдресноеХранение = ПолучитьФункциональнуюОпцию("уатАдресноеХранение") = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	уатЗащищенныеФункцииКлиент.уатДокументФормаСпискаПриОткрытии(Отказ, ЭтотОбъект, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьНаОснованииВнутреннееПеремещениеИзвлечение(Команда)
	ТекСтрока = Элементы.Список.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Основание, ВидОперации", ТекСтрока.Ссылка,
		ПредопределенноеЗначение("Перечисление.уатВидыОперацийВнутреннееПеремещение.ИзвлечениеИзЯчейки"));
	ОткрытьФорму("Документ.уатВнутреннееПеремещение.ФормаОбъекта", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНаОснованииВнутреннееПеремещениеРазмещение(Команда)
	ТекСтрока = Элементы.Список.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Основание, ВидОперации", ТекСтрока.Ссылка,
		ПредопределенноеЗначение("Перечисление.уатВидыОперацийВнутреннееПеремещение.РазмещениеВЯчейке"));
	ОткрытьФорму("Документ.уатВнутреннееПеремещение.ФормаОбъекта", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура ПакетноеСписание(Команда)
	ТекСтрока = Элементы.Список.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СоздатьНаОснованииВнутреннееПеремещениеИзвлечение(Неопределено);
	
	ПараметрыФормы = Новый Структура("Основание", ТекСтрока.Ссылка);
	ОткрытьФорму("Документ.уатСписаниеТоваров.ФормаОбъекта", ПараметрыФормы);
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормы_Список

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	УстановитьВидимость();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимость()

	флВидимостьОперацииСЯчеистымСкладом = Ложь;
	
	ТекСтрока = Элементы.Список.ТекущиеДанные;
	Если ТекСтрока <> Неопределено И флАдресноеХранение 
		И уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(ТекСтрока.Склад, "АдресноеХранение") Тогда
		флВидимостьОперацииСЯчеистымСкладом = Истина;
	КонецЕсли;
	
	Элементы.ФормаСоздатьНаОснованииВнутреннееПеремещениеИзвлечение.Видимость = флВидимостьОперацииСЯчеистымСкладом;
	Элементы.ФормаСоздатьНаОснованииВнутреннееПеремещениеРазмещение.Видимость = флВидимостьОперацииСЯчеистымСкладом;
	Элементы.ФормаПакетноеСписание.Видимость = флВидимостьОперацииСЯчеистымСкладом;
		
КонецПроцедуры

#КонецОбласти
