#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
 	// Инициализация дополнительных свойств для проведения документа.
	уатПроведение.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа.
	Документы.уатОперацияСВагонами.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей.
	уатПроведение.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета.
	уатПроведение.ОтразитьСостояниеТС(ДополнительныеСвойства, Движения, Отказ);
	уатПроведение_уэ.ОтразитьСтатусыГрузов(ДополнительныеСвойства, Движения, Отказ);
	
	уатПроведение.ОтразитьЗаказыГрузоотправителей(ДополнительныеСвойства, Движения, Отказ);
	уатПроведение_уэ.ОтразитьГрузыКПеревозке(ДополнительныеСвойства, Движения, Отказ);
	
	Если Операция.ЭтоПрибытие Или Операция.ЭтоУбытие Тогда
		уатПроведение.ОтразитьОборотыВагоновПоСтанцииОстатки(ДополнительныеСвойства, Движения, Отказ);
		уатПроведение.ОтразитьОборотыВагоновПоСтанции(ДополнительныеСвойства, Движения, Отказ);
	КонецЕсли;
	
	// Запись наборов записей.
	уатПроведение.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	// Контроль возникновения отрицательного остатка.
	Документы.уатОперацияСВагонами.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ);
	
	//ПовторноеПроведениеЗаказов(ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗаказовГрузоотправителя);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.уатНатурныйЛист") Тогда
		Организация = ДанныеЗаполнения.Организация;
		Подразделение = ДанныеЗаполнения.Подразделение;
		НатурныйЛист = ДанныеЗаполнения.Ссылка;
		Для Каждого ТекСтрокаВагоны Из ДанныеЗаполнения.Вагоны Цикл
			НоваяСтрока = Вагоны.Добавить();
			НоваяСтрока.Вагон = ТекСтрокаВагоны.НомерВагона;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти