#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.уатПровеска";
	КомандаПечати.Идентификатор = "АктПеревески";
	КомандаПечати.Представление = НСтр("ru = 'Акт перевески'; en = 'Reweighing Act'");
	КомандаПечати.Порядок = 1;
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной
//                                                            параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной
//                                            параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если НЕ уатОбщегоНазначенияСервер.РазрешениеПечатиНепроведенногоДокумента(МассивОбъектов) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктПеревески") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "АктПеревески",
			"Акт перевески", ПечатьАктПеревески(МассивОбъектов, ОбъектыПечати, ПараметрыПечати));
	КонецЕсли;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	мЗапрос = Новый Запрос;
	мЗапрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатПровеска.ДатаПровески КАК Период,
	|	уатПровеска.ДатаОкончанияПровески КАК ДатаОкончания,
	|	уатПровескаВагоны.Вагон КАК ТС,
	|	МИНИМУМ(ЗНАЧЕНИЕ(Справочник.уатСостояниеТС.Провешен)) КАК Состояние,
	|	уатПровескаВагоны.Заказ КАК Заказ
	|ИЗ
	|	Документ.уатПровеска КАК уатПровеска
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уатПровеска.Вагоны КАК уатПровескаВагоны
	|		ПО уатПровеска.Ссылка = уатПровескаВагоны.Ссылка
	|ГДЕ
	|	уатПровеска.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	уатПровеска.ДатаПровески,
	|	уатПровеска.ДатаОкончанияПровески,
	|	уатПровескаВагоны.Вагон,
	|	уатПровескаВагоны.Заказ";
	мЗапрос.УстановитьПараметр("Ссылка",ДокументСсылка);
	
	ТаблицаДокумента = мЗапрос.Выполнить().Выгрузить();

	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСостоянийТС", ТаблицаДокумента);
КонецПроцедуры

Процедура ВыполнитьКонтроль(ДокументСсылка, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
	
	
КонецПроцедуры

#Область Печать

Функция ПечатьАктПеревески(МассивОбъектов, ОбъектыПечати, ПараметрыПечати=Неопределено)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_АктПеревески";
	ТабличныйДокумент.ОриентацияСтраницы   = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	
	СсылкаНаОбъект = МассивОбъектов[0].Ссылка;
	
	ПровескаСсылка     = Документы.уатПровеска.ПустаяСсылка();
	НатурныйЛистСсылка = Документы.уатНатурныйЛист.ПустаяСсылка();
	
	Если ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.уатНатурныйЛист") Тогда
		НатурныйЛистСсылка = СсылкаНаОбъект;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	уатПровеска.Ссылка КАК ПровескаСсылка
		|ИЗ
		|	Документ.уатПровеска КАК уатПровеска
		|ГДЕ
		|	уатПровеска.НатурныйЛист = &НатурныйЛист
		|
		|УПОРЯДОЧИТЬ ПО
		|	уатПровеска.Дата УБЫВ";
		Запрос.УстановитьПараметр("НатурныйЛист", НатурныйЛистСсылка);
		
		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			Если Выборка.Количество() > 1 Тогда
				ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'С данным натурным листом связаны несколько провесок, взята старшая по дате'; en = 'Several hangers are associated with this natural sheet, the oldest one by date is taken'"));
			КонецЕсли;
			Выборка.Следующий();
			ПерваяСтрока = Выборка;
			ПровескаСсылка = ПерваяСтрока.ПровескаСсылка;
		КонецЕсли;
	Иначе
		ПровескаСсылка = СсылкаНаОбъект;
		Если ЗначениеЗаполнено(ПровескаСсылка.НатурныйЛист) Тогда
			НатурныйЛистСсылка = ПровескаСсылка.НатурныйЛист;
		КонецЕсли;
	КонецЕсли;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.уатПровеска.АктПеревески");
		
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	
	Заголовок = НСтр("ru = 'Акт перевески №%1 от %2'; en = 'Reweighing Act No.%1 from %2'");
	Заголовок = СтрЗаменить(Заголовок, "%1", ПровескаСсылка.Номер);
	Заголовок = СтрЗаменить(Заголовок, "%2", Формат(ПровескаСсылка.Дата,"ДФ='dd MMMM yyyy ""г.""'"));
	
	Период = ПровескаСсылка.Дата;
	
	ОбластьМакета.Параметры.ТекстЗаголовка = Заголовок;
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Станции");
	
	ОбластьМакета.Параметры.СтанцияОтправления = НатурныйЛистСсылка.СтанцияОтправления;
	ОбластьМакета.Параметры.СтанцияНазначения = НатурныйЛистСсылка.СтанцияНазначения;
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Отправитель");
	
	НаименованиеОрагнизации = уатОбщегоНазначенияТиповыеСервер.ОписаниеОрганизации(
		уатОбщегоНазначенияСервер.СведенияОЮрФизЛице(ПровескаСсылка.Организация),
		"НаименованиеДляПечатныхФорм");
	ОбластьМакета.Параметры.Отправитель = НаименованиеОрагнизации;
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Накладная");
	
	ОбластьМакета.Параметры.Накладная = ПровескаСсылка.Накладная;
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	Если ЗначениеЗаполнено(НатурныйЛистСсылка) Тогда
		
		ОбластьМакета = Макет.ПолучитьОбласть("НатурныйЛист");
		
		ОбластьМакета.Параметры.НатурныйЛист = НатурныйЛистСсылка;
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
	КонецЕсли;
	
	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(уатПровескаВагоны.Вагон, уатНатурныйЛистВагоны.НомерВагона) КАК Вагон,
	|	ЕСТЬNULL(уатПровескаВагоны.Вагон.Грузоподъемность, уатНатурныйЛистВагоны.НомерВагона.Грузоподъемность) КАК Грузоподъемность,
	|	уатПровескаВагоны.Груз КАК Груз,
	|	ЕСТЬNULL(уатПровескаВагоны.Брутто, 0) КАК БруттоПоПеревеске,
	|	ЕСТЬNULL(уатПровескаВагоны.Нетто, 0) КАК НеттоПоПеревеске,
	|	ЕСТЬNULL(уатПровескаВагоны.Тара, 0) КАК ТараПоПеревеске,
	|	ЕСТЬNULL(уатНатурныйЛистВагоны.МассаГруза, 0) КАК БруттоПоДокументам,
	|	ЕСТЬNULL(уатНатурныйЛистВагоны.МассаГруза, 0) - ЕСТЬNULL(уатНатурныйЛистВагоны.ТараВагона, 0) КАК НеттоПоДокументам,
	|	ЕСТЬNULL(уатНатурныйЛистВагоны.ТараВагона, 0) КАК ТараПоДокументам,
	|	уатНатурныйЛистВагоны.КодПолучателя КАК Получатель
	|ИЗ
	|	Документ.уатПровеска.Вагоны КАК уатПровескаВагоны
	|		ПОЛНОЕ СОЕДИНЕНИЕ Документ.уатНатурныйЛист.Вагоны КАК уатНатурныйЛистВагоны
	|		ПО уатПровескаВагоны.Вагон = уатНатурныйЛистВагоны.НомерВагона
	|			И уатПровескаВагоны.КодГруза = уатНатурныйЛистВагоны.КодГруза
	|ГДЕ
	|	уатНатурныйЛистВагоны.Ссылка = &НатурныйЛистСсылка
	|	И уатПровескаВагоны.Ссылка = &ПровескаСсылка";
	
	Запрос.УстановитьПараметр("НатурныйЛистСсылка", НатурныйЛистСсылка);
	Запрос.УстановитьПараметр("ПровескаСсылка", ПровескаСсылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТаблицы");
		
		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Выборка);
		
		РазницаНетто = Выборка.НеттоПоПеревеске - Выборка.НеттоПоДокументам;
		ЗнакЧисла = "";
		Если РазницаНетто > 0 Тогда
			ЗнакЧисла = "+";
		КонецЕсли;
		РазницаНетто = ЗнакЧисла + Строка(РазницаНетто);
		
		ОбластьМакета.Параметры.РазницаНетто = РазницаНетто;
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
	КонецЦикла;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	
	ОбластьМакета.Параметры.ФИОПриемосдатчика = ПровескаСсылка.Приемосдатчик;
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли