///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022-2026, ООО 1С-Рарус
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
//////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ОбновлениеВерсииИБ

// Заполняет основные сведения о библиотеке или основной конфигурации.
// Библиотека, имя которой имя совпадает с именем конфигурации в метаданных, определяется как основная конфигурация.
// 
// Параметры:
//  Описание - Структура:
//
//   * Имя                 - Строка - имя библиотеки, например, "СтандартныеПодсистемы".
//   * Версия              - Строка - версия в формате из 4-х цифр, например, "2.1.3.1".
//
//   * ИдентификаторИнтернетПоддержки - Строка - уникальное имя программы в сервисах Интернет-поддержки.
//   * ТребуемыеПодсистемы - Массив из Строка - имена других библиотек (Строка), от которых зависит данная библиотека.
//                                    Обработчики обновления таких библиотек должны быть вызваны ранее
//                                    обработчиков обновления данной библиотеки.
//                                    При циклических зависимостях или, напротив, отсутствии каких-либо зависимостей,
//                                    порядок вызова обработчиков обновления определяется порядком добавления модулей
//                                    в процедуре ПриДобавленииПодсистем общего модуля
//                                    ПодсистемыКонфигурацииПереопределяемый.
//   * РежимВыполненияОтложенныхОбработчиков - Строка - "Последовательно" - отложенные обработчики обновления выполняются
//                                    последовательно в интервале от номера версии информационной базы до номера
//                                    версии конфигурации включительно или "Параллельно" - отложенный обработчик после
//                                    обработки первой порции данных передает управление следующему обработчику, а после
//                                    выполнения последнего обработчика цикл повторяется заново.
//
Процедура ПриДобавленииПодсистемы(Описание) Экспорт
	
	// Основнные сведения о подсистеме
	Описание.Имя    = "ПоддержкаОтраслевыхРешений";
	Описание.Версия = пр_ПоддержкаОтраслевыхРешений.ВерсияПодсистемы();
	
	// Зависимости от прочих подсистем
	Описание.ТребуемыеПодсистемы.Добавить("СтандартныеПодсистемы");
	
КонецПроцедуры

// Добавляет в список процедуры-обработчики обновления данных ИБ
// для всех поддерживаемых версий библиотеки или конфигурации.
// Вызывается перед началом обновления данных ИБ для построения плана обновления.
//
// Параметры:
//  Обработчики - см. ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления
//
// Пример:
//  Для добавления своей процедуры-обработчика в список:
//  Обработчик = Обработчики.Добавить();
//  Обработчик.Версия              = "1.1.0.0";
//  Обработчик.Процедура           = "ОбновлениеИБ.ПерейтиНаВерсию_1_1_0_0";
//  Обработчик.РежимВыполнения     = "Оперативно";
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	// Обновление на очередной релиз.
	Обработчик = Обработчики.Добавить();
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Версия              = "*";
	Обработчик.ОбщиеДанные         = Истина;
	Обработчик.Процедура           = "пр_ПоддержкаОтраслевыхРешенийСлужебный.ПриОбновленииИнформационнойБазы";
	Обработчик.РежимВыполнения     = "Оперативно";
	
	// Производим обновление используемых в базе данных профилей доступа.
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.1.1.1";
	Обработчик.Процедура           = "пр_ОбновлениеИнформационнойБазы.ДобавитьРольБазовыеПраваВПрофилиСБазовымиПравамиБСП";
	Обработчик.РежимВыполнения     = "Оперативно";
	
	// Перенос настроек подсистемы.
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.1.1.1";
	Обработчик.Процедура           = "пр_ОбновлениеИнформационнойБазы.ПереносПараметровПоддержкиИзЦентраМониторинга";
	Обработчик.РежимВыполнения     = "Оперативно";
	
	// Очистка Центра мониторинга от не актуальных параметров.
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.1.1.2";
	Обработчик.Процедура           = "пр_ОбновлениеИнформационнойБазы.ИсключитьПараметрыПоддержкиИзЦентраМониторинга";
	Обработчик.РежимВыполнения     = "Оперативно";
	
	// Очистка устаревших замеров в регистре Операции статистики.
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.1.2.5";
	Обработчик.Процедура           = "пр_ОбновлениеИнформационнойБазы.ОчиститьУстаревшиеЗамерыОперацииСтатистики";
	Обработчик.РежимВыполнения     = "Оперативно";
	
КонецПроцедуры

// См. ОбновлениеИнформационнойБазыПереопределяемый.ПередОбновлениемИнформационнойБазы
//
Процедура ПередОбновлениемИнформационнойБазы() Экспорт
	
КонецПроцедуры

// См. ОбновлениеИнформационнойБазыПереопределяемый.ПослеОбновленияИнформационнойБазы
//
Процедура ПослеОбновленияИнформационнойБазы(Знач ПредыдущаяВерсия, Знач ТекущаяВерсия,
		Знач ВыполненныеОбработчики, ВыводитьОписаниеОбновлений, МонопольныйРежим) Экспорт
	
КонецПроцедуры

// См. ОбновлениеИнформационнойБазыПереопределяемый.ПриПодготовкеМакетаОписанияОбновлений
//
Процедура ПриПодготовкеМакетаОписанияОбновлений(Знач Макет) Экспорт
	
КонецПроцедуры

// Позволяет переопределить режим обновления данных информационной базы.
// Для использования в редких (нештатных) случаях перехода, не предусмотренных в
// стандартной процедуре определения режима обновления.
//
// Параметры:
//   РежимОбновленияДанных - Строка - в обработчике можно присвоить одно из значений:
//              "НачальноеЗаполнение"     - если это первый запуск пустой базы (области данных);
//              "ОбновлениеВерсии"        - если выполняется первый запуск после обновление конфигурации базы данных;
//              "ПереходСДругойПрограммы" - если выполняется первый запуск после обновление конфигурации базы данных, 
//                                          в которой изменилось имя основной конфигурации.
//
//   СтандартнаяОбработка  - Булево - если присвоить Ложь, то стандартная процедура
//                                    определения режима обновления не выполняется, 
//                                    а используется значение РежимОбновленияДанных.
//
//
Процедура ПриОпределенииРежимаОбновленияДанных(РежимОбновленияДанных, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Добавляет в список процедуры-обработчики перехода с другой программы (с другим именем конфигурации).
// Например, для перехода между разными, но родственными конфигурациями: базовая -> проф -> корп.
// Вызывается перед началом обновления данных ИБ.
//
// Параметры:
//  Обработчики - ТаблицаЗначений:
//    * ПредыдущееИмяКонфигурации - Строка - имя конфигурации, с которой выполняется переход;
//                                           или "*", если нужно выполнять при переходе с любой конфигурации.
//    * Процедура                 - Строка - полное имя процедуры-обработчика перехода с программы
//                                           ПредыдущееИмяКонфигурации.
//                                  Например, "ОбновлениеИнформационнойБазыУПП.ЗаполнитьУчетнуюПолитику"
//                                  Обязательно должна быть экспортной.
//
// Пример:
//  Обработчик = Обработчики.Добавить();
//  Обработчик.ПредыдущееИмяКонфигурации  = "УправлениеТорговлей";
//  Обработчик.Процедура                  = "ОбновлениеИнформационнойБазыУПП.ЗаполнитьУчетнуюПолитику";
//
//
Процедура ПриДобавленииОбработчиковПереходаСДругойПрограммы(Обработчики) Экспорт
	
КонецПроцедуры

// Вызывается после выполнения всех процедур-обработчиков перехода с другой программы (с другим именем конфигурации),
// и до начала выполнения обновления данных ИБ.
//
// Параметры:
//  ПредыдущееИмяКонфигурации    - Строка - имя конфигурации до перехода.
//  ПредыдущаяВерсияКонфигурации - Строка - имя предыдущей конфигурации (до перехода).
//  Параметры                    - Структура:
//    * ВыполнитьОбновлениеСВерсии   - Булево - по умолчанию Истина. Если установить Ложь, 
//        то будут выполнена только обязательные обработчики обновления (с версией "*").
//    * ВерсияКонфигурации           - Строка - номер версии после перехода. 
//        По умолчанию, равен значению версии конфигурации в свойствах метаданных.
//        Для того чтобы выполнить, например, все обработчики обновления с версии ПредыдущаяВерсияКонфигурации, 
//        следует установить значение параметра в ПредыдущаяВерсияКонфигурации.
//        Для того чтобы выполнить вообще все обработчики обновления, установить значение "0.0.0.1".
//    * ОчиститьСведенияОПредыдущейКонфигурации - Булево - по умолчанию Истина. 
//        Для случаев когда предыдущая конфигурация совпадает по имени с подсистемой текущей конфигурации, следует
//        указать Ложь.
//
//
Процедура ПриЗавершенииПереходаСДругойПрограммы(Знач ПредыдущееИмяКонфигурации,
												Знач ПредыдущаяВерсияКонфигурации,
												Параметры) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ОбновлениеВерсииИБ

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ДобавитьРольБазовыеПраваВПрофилиСБазовымиПравамиБСП() Экспорт
	
	Если НЕ ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		Возврат;
	КонецЕсли;
	
	БазовыеПрава = Метаданные.Роли.Найти("пр_БазовыеПрава");
	Если БазовыеПрава=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НовыеРоли = Новый Массив;
	НовыеРоли.Добавить(Метаданные.Роли.БазовыеПраваБСП.Имя);
	НовыеРоли.Добавить(БазовыеПрава.Имя);
	
	ЗаменяемыеРоли = Новый Соответствие;
	ЗаменяемыеРоли.Вставить(Метаданные.Роли.БазовыеПраваБСП.Имя, НовыеРоли);
	
	МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
	МодульУправлениеДоступом.ЗаменитьРолиВПрофилях(ЗаменяемыеРоли);
	
КонецПроцедуры // ДобавитьРольБазовыеПраваВПрофилиСБазовымиПравамиБСП()

Процедура ПереносПараметровПоддержкиИзЦентраМониторинга() Экспорт
	
	РегистрацияПродуктаТекущая = пр_ПоддержкаОтраслевыхРешений.ПрочитатьРегистрациюПродукта();
	Если НЕ ПустаяСтрока(РегистрацияПродуктаТекущая.РегНомер) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЦентраМониторинга = ЦентрМониторингаСлужебный.ПолучитьПараметрыЦентраМониторингаВнешнийВызов();
	Если НЕ ПараметрыЦентраМониторинга.Свойство("РегистрацияПродуктаРегНомер") Тогда
		Возврат;
	КонецЕсли;
	
	РегистрацияПродукта = Новый Структура();
	РегистрацияПродукта.Вставить("РегНомер",         ПараметрыЦентраМониторинга.РегистрацияПродуктаРегНомер);
	РегистрацияПродукта.Вставить("ИНН",              ПараметрыЦентраМониторинга.РегистрацияПродуктаИНН);
	РегистрацияПродукта.Вставить("КПП",              ПараметрыЦентраМониторинга.РегистрацияПродуктаКПП);
	РегистрацияПродукта.Вставить("ИТС",              ПараметрыЦентраМониторинга.РегистрацияПродуктаИТС);
	РегистрацияПродукта.Вставить("Аккаунт",          ПараметрыЦентраМониторинга.РегистрацияПродуктаАккаунт);
	РегистрацияПродукта.Вставить("КонтактноеЛицо",   ПараметрыЦентраМониторинга.РегистрацияПродуктаКонтактноеЛицо);
	РегистрацияПродукта.Вставить("ЭлектроннаяПочта", ПараметрыЦентраМониторинга.РегистрацияПродуктаЭлектроннаяПочта);
	РегистрацияПродукта.Вставить("НомерТелефона",    ПараметрыЦентраМониторинга.РегистрацияПродуктаНомерТелефона);
	РегистрацияПродукта.Вставить("Партнер",          ПараметрыЦентраМониторинга.РегистрацияПродуктаПартнер);
	РегистрацияПродукта.Вставить("ДатаПриобретения", ПараметрыЦентраМониторинга.РегистрацияПродуктаДатаПриобретения);
	РегистрацияПродукта.Вставить("СогласиеДано",     ПараметрыЦентраМониторинга.ЗапросКонтактнойИнформации=1);
	РегистрацияПродукта.Вставить("Автор",            ПараметрыЦентраМониторинга.РегистрацияПродуктаАвтор);
	РегистрацияПродукта.Вставить("ДатаИзменения",    ПараметрыЦентраМониторинга.РегистрацияПродуктаДатаИзменения);
	ЗаполнитьЗначенияСвойств(РегистрацияПродуктаТекущая, РегистрацияПродукта);
	
	ПараметрыОтраслевойПоддержки = Новый Структура();
	ПараметрыОтраслевойПоддержки.Вставить("РегистрацияПродукта", РегистрацияПродуктаТекущая);
	ПараметрыОтраслевойПоддержки.Вставить("НаименованиеБазы",    ПараметрыЦентраМониторинга.РегистрацияПродуктаНаименованиеБазы);
	
	ПараметрыОтраслевойПоддержки.Вставить("НачалоВеденияУчетаСледующееФормирование",        ПараметрыЦентраМониторинга.НачалоВеденияУчетаСледующееФормирование);
	ПараметрыОтраслевойПоддержки.Вставить("НачалоВеденияУчетаПериодФормирования",           ПараметрыЦентраМониторинга.НачалоВеденияУчетаПериодФормирования);
	ПараметрыОтраслевойПоддержки.Вставить("НачалоВеденияУчета",                             ПараметрыЦентраМониторинга.НачалоВеденияУчета);
	ПараметрыОтраслевойПоддержки.Вставить("РазмерДанныхТаблицСледующееФормирование",        ПараметрыЦентраМониторинга.РазмерДанныхТаблицСледующееФормирование);
	ПараметрыОтраслевойПоддержки.Вставить("РазмерДанныхТаблицПериодФормирования",           ПараметрыЦентраМониторинга.РазмерДанныхТаблицПериодФормирования);
	
	пр_ПоддержкаОтраслевыхРешений.УстановитьПараметрыОтраслевойПоддержки(ПараметрыОтраслевойПоддержки);
	
КонецПроцедуры // ПереносПараметровПоддержкиИзЦентраМониторинга()

Процедура ИсключитьПараметрыПоддержкиИзЦентраМониторинга() Экспорт
	
	Блокировка = Новый БлокировкаДанных;
	Блокировка.Добавить("Константа.ПараметрыЦентраМониторинга");
	
	НачатьТранзакцию();
	
	Попытка
		Блокировка.Заблокировать();
		
		ПараметрыЦентраМониторинга = ЦентрМониторингаСлужебный.ПолучитьПараметрыЦентраМониторингаВнешнийВызов();
		ПараметрыПоУмолчанию       = ЦентрМониторингаСлужебный.ПолучитьПараметрыПоУмолчаниюВнешнийВызов();
		ЗаполнитьЗначенияСвойств(ПараметрыПоУмолчанию, ПараметрыЦентраМониторинга);
		
		Хранилище = Новый ХранилищеЗначения(ПараметрыПоУмолчанию, Новый СжатиеДанных(9));
		Константы.ПараметрыЦентраМониторинга.Установить(Хранилище);
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		пр_ПоддержкаОтраслевыхРешений.ОбработатьОшибку(ИнформацияОбОшибке(), "ОбновлениеИнформационнойБазы");
	КонецПопытки;
	
КонецПроцедуры // ИсключитьПараметрыПоддержкиИзЦентраМониторинга()

Процедура ОчиститьУстаревшиеЗамерыОперацииСтатистики() Экспорт
	
	ИдентификаторЗамеров = Новый УникальныйИдентификатор("0a0a0a0a-0a0a-0a0a-0a0a-0a0a0a0a0a0a");
	
	НаборЗаписей = РегистрыСведений.ОперацииСтатистики.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИдентификаторОперации.Установить(ИдентификаторЗамеров, ИСТИНА);
	НаборЗаписей.Записать(ИСТИНА);
	
КонецПроцедуры // ОчиститьУстаревшиеЗамерыОперацииСтатистики()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
