
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ПараметрыЗаполнения = БюджетнаяОтчетностьКлиентСервер.ПараметрыОткрытияФормыНастройкиПериодичностиПланирования(Параметры);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ПараметрыЗаполнения);
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		Закрыть(БюджетнаяОтчетностьКлиентСервер.ПараметрыОткрытияФормыНастройкиПериодичностиПланирования(ЭтотОбъект));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Непроверяемые = Новый Массив;
	Если СпособПланирования = Перечисления.СпособыСоставленияБюджетов.НаФиксированныйПериод Тогда
		Непроверяемые.Добавить("КоличествоПериодовСкользящегоБюджета");
	КонецЕсли;
	
	Если ВариантРасположенияГраницыФактическихДанных <> Перечисления.ВариантыРасположенияГраницыФактическиДанных.ДоНачалаСоставленияБюджета Тогда
		Непроверяемые.Добавить("СмещениеГраницыФакта");
		Непроверяемые.Добавить("ПериодичностьГраницыФакта");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, Непроверяемые);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СпособПланированияПриИзменении(Элемент)
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ГраницаФактическихДанныхПриИзменении(Элемент)
	
	УправлениеФормой();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеФормой()
	
	Если СпособПланирования = Перечисления.СпособыСоставленияБюджетов.НаФиксированныйПериод Тогда
		Элементы.СтраницыПериодичность.ТекущаяСтраница = Элементы.ФиксированныйПериод;
	Иначе
		Элементы.СтраницыПериодичность.ТекущаяСтраница = Элементы.СкользящееПланирование;
	КонецЕсли;
	
	ПередБюджетом = ВариантРасположенияГраницыФактическихДанных = Перечисления.ВариантыРасположенияГраницыФактическиДанных.ДоНачалаСоставленияБюджета;
	Элементы.СмещениеГраницыФакта.Доступность 						= ПередБюджетом;
	Элементы.ПериодичностьГраницыФакта.Доступность 					= ПередБюджетом;
	Элементы.ПостфиксПодписиПериодов.Доступность 					= ПередБюджетом;
	
КонецПроцедуры

#КонецОбласти