
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Автотест = Истина;
		Возврат;
	КонецЕсли;

	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов
	
	// Ограничение списка выбора поля "Вид договора"
	Если Параметры.Свойство("ВидДоговораДоступныеЗначения") Тогда
		Элементы.ВидДоговора.РежимВыбораИзСписка = Истина;
		Элементы.ВидДоговора.СписокВыбора.ЗагрузитьЗначения(Параметры.ВидДоговораДоступныеЗначения); 
		Объект.ВидДоговора = Параметры.ВидДоговораДоступныеЗначения[0];
	КонецЕсли;
	
	ВариантПоставкиТакси = уатОбщегоНазначенияПовтИсп.ВариантПоставкиТакси(); 
	Элементы.ПредметДоговора.СписокВыбора.Очистить(); 
	Элементы.ПредметДоговора.СписокВыбора.Добавить(Перечисления.уатПредметыДоговоровКонтрагентов.Перевозка);
	Если ВариантПоставкиТакси Тогда
		такИспользоватьЗаказыТакси = ПолучитьФункциональнуюОпцию("такИспользоватьЗаказыТакси"); 
		такИспользоватьАрендуТС    = ПолучитьФункциональнуюОпцию("такИспользоватьАрендуТС");
		Если такИспользоватьЗаказыТакси Тогда
			Элементы.ПредметДоговора.СписокВыбора.Добавить(Перечисления.уатПредметыДоговоровКонтрагентов.Такси);
		КонецЕсли;
		Если такИспользоватьАрендуТС Тогда
			Элементы.ПредметДоговора.СписокВыбора.Добавить(Перечисления.уатПредметыДоговоровКонтрагентов.Аренда);
		КонецЕсли; 
		ВариантПоставкиТакси = такИспользоватьЗаказыТакси ИЛИ такИспользоватьАрендуТС;
	КонецЕсли; 
	Элементы.ПредметДоговора.СписокВыбора.Добавить(Перечисления.уатПредметыДоговоровКонтрагентов.ПрочиеУслуги);
	
	Если Объект.Ссылка.Пустая() Тогда
		Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
			Если Параметры.Свойство("Организация") Тогда
				Объект.Организация = Параметры.Организация;
			Иначе
				Объект.Организация = уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(
					ПользователиКлиентСервер.ТекущийПользователь(), "ОсновнаяОрганизация"); 
			КонецЕсли;
		КонецЕсли;
			
		Если Не ЗначениеЗаполнено(Объект.Владелец) Тогда
			Если Параметры.Свойство("Владелец") И ЗначениеЗаполнено(Параметры.Владелец) Тогда
				Объект.Владелец = Параметры.Владелец;
			КонецЕсли;
		КонецЕсли;
		
		Если Не Параметры.Свойство("ФормаВызова") Тогда
			ФормаВызова = "0";
		Иначе
			ФормаВызова = Параметры.ФормаВызова;
		КонецЕсли;
		
		ЗаполнитьПоШаблону(ФормаВызова);
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.ТипДокументаЗаказЗаявка) Тогда 
		Объект.ТипДокументаЗаказЗаявка = "1";
	КонецЕсли;
	
	ВалютаРегламентированногоУчета = уатОбщегоНазначенияТиповые.ВалютаРегламентированногоУчета(Объект.Организация);
	
	НаименованиеПоШаблону = СформироватьНаименованиеСервер();
	
	флИспользоватьДокументооборот    = ПолучитьФункциональнуюОпцию("уатИспользоватьДокументооборот");
	флИспользоватьПлатежныйКалендарь = ПолучитьФункциональнуюОпцию("уатИспользоватьПлатежныйКалендарь");
	флИспользоватьЗакреплениеМЛЗаПеревозчиками = ПолучитьФункциональнуюОпцию("уатИспользоватьЗакреплениеМаршрутныхЛистовЗаПеревозчиками_уэ");
	Элементы.ГруппаСопроводительныеДокументы.Видимость = флИспользоватьДокументооборот;
	
	ОбновитьСпособРасчетаДнейПредставление();
	
	Если Объект.ГрафикОплаты.Количество() = 0 Тогда
		СпособРедактированияГрафикаОплаты = 0;
	ИначеЕсли Объект.ГрафикОплаты.Количество() = 1 Тогда
		СпособРедактированияГрафикаОплаты = 1;
	Иначе
		СпособРедактированияГрафикаОплаты = 2;
	КонецЕсли;
	СпособРедактированияГрафикаОплатыСтарый = СпособРедактированияГрафикаОплаты;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Автотест Тогда
		Возврат;
	КонецЕсли;

	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	УстановитьОтборЭтаповОплаты();
	ЗаполнитьРеквизитыСтрокиПоТЧГрафикОплаты();
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.уатШаблоныДокументов_уэ") Тогда
		ЗаполнитьДокументыПоШаблонуЗавершение(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Наименование) Тогда
		Объект.Наименование = СформироватьНаименованиеСервер();
	КонецЕсли;
	
	// условие того, что наименование ранее при записи элемента заполнялось по шаблону
	СтароеНаименование = уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Объект.Ссылка, "Наименование");
	Если ЗначениеЗаполнено(СтароеНаименование)
		И СтароеНаименование = НаименованиеПоШаблону
		И НЕ флОтключитьКонтрольНаименованияПоШаблону Тогда
		
		НовоеНаименованиеПоШаблону = СформироватьНаименованиеСервер();
		Если ЗначениеЗаполнено(НовоеНаименованиеПоШаблону) И Объект.Наименование <> НовоеНаименованиеПоШаблону Тогда
			Отказ = Истина;
			Оповещ = Новый ОписаниеОповещения("ПередЗаписьюЗавершение", ЭтотОбъект, НовоеНаименованиеПоШаблону);
			ПоказатьВопрос(Оповещ, "Измененить наименование на новое по шаблону?", РежимДиалогаВопрос.ДаНетОтмена);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписьюЗавершение(Результат, НовоеНаименованиеПоШаблону) Экспорт
	
	флОтключитьКонтрольНаименованияПоШаблону = Ложь;
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.Наименование = НовоеНаименованиеПоШаблону;
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		флОтключитьКонтрольНаименованияПоШаблону = Истина;
	Иначе
		флЗакрыватьПриЗаписи = Ложь;
		Возврат;
	КонецЕсли;
	
	Если Записать() И флЗакрыватьПриЗаписи И Открыта() Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	ОбновитьСпособРасчетаДнейПредставление();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	Если флЗакрыватьПриЗаписи И Открыта() Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)

	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	флЗакрыватьПриЗаписи = Истина;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)

	Если НЕ ЗначениеЗаполнено(Объект.ВидДоговора)
			ИЛИ (Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.Прочее")) Тогда
		Объект.ТипЦен = Неопределено;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Объект.ВидДоговора)
			ИЛИ (Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.Прочее"))
			ИЛИ (Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СКомитентом")) Тогда
		//Объект.РасчетыВУсловныхЕдиницах = Ложь;
	КонецЕсли;

	ЭтоДоговорПриобретения = 
		(Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком"))
		ИЛИ (Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СКомитентом"));

	УстановитьВидимостьДоступность();

КонецПроцедуры

&НаКлиенте
Процедура ВалютаВзаиморасчетовПриИзменении(Элемент)

	Если Объект.ВалютаВзаиморасчетов = ВалютаРегламентированногоУчета Тогда
		//Объект.РасчетыВУсловныхЕдиницах = Ложь;
	КонецЕсли;

	УстановитьВидимостьДоступность();

КонецПроцедуры

&НаКлиенте
Процедура РасчетыВУсловныхЕдиницахПриИзменении(Элемент)

	УстановитьВидимостьДоступность();

КонецПроцедуры

&НаКлиенте
Процедура ВедениеВзаиморасчетовПриИзменении(Элемент)
	
	Если флИспользоватьПлатежныйКалендарь И (Объект.ВедениеВзаиморасчетов.Пустая() ИЛИ Объект.ВедениеВзаиморасчетов
		= ПредопределенноеЗначение("Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом")) Тогда
		Объект.ГрафикОплаты.Очистить();
		ЗаполнитьРеквизитыСтрокиПоТЧГрафикОплаты();
	КонецЕсли;
	
	Если Объект.ВедениеВзаиморасчетов <> ПредопределенноеЗначение("Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоНакладным")
		И Объект.ВедениеВзаиморасчетов <> ПредопределенноеЗначение("Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам") Тогда
		Объект.ОплатаПоКурсуНаДатуСчета = Ложь;
	КонецЕсли;
		
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтролироватьСуммуЗадолженностиПриИзменении(Элемент)
	УстановитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура СпособРедактированияГрафикаОплатыПриИзменении(Элемент)
	
	Если СпособРедактированияГрафикаОплаты = 1 И Объект.ГрафикОплаты.Количество() > 1 Тогда
		ТекстНСТР = НСтр("en='All lines of payment schedule except the first will be deleted."
			"Do you want to continue?';ru='Все строки графика оплаты, кроме первой, будут удалены."
			"Продолжить?'");
		
		ПоказатьВопрос(Новый ОписаниеОповещения("СпособРедактированияПриИзмененииЗавершение", ЭтотОбъект),
			ТекстНСТР, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да,);
        Возврат;
	ИначеЕсли СпособРедактированияГрафикаОплаты = 0 И Объект.ГрафикОплаты.Количество() > 0 Тогда
		ТекстНСТР = НСтр("en='Payment schedule data will be deleted."
			"Do you want to continue?';ru='Данные графика оплаты будут удалены."
			"Продолжить?'");
		
		ПоказатьВопрос(Новый ОписаниеОповещения("СпособРедактированияПриИзмененииЗавершение", ЭтотОбъект),
			ТекстНСТР, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да,);
        Возврат;
	КонецЕсли;
	
	СпособРедактированияПриИзмененииФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура СпособРедактированияПриИзмененииЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    Если Результат <> КодВозвратаДиалога.Да Тогда
        СпособРедактированияГрафикаОплаты = СпособРедактированияГрафикаОплатыСтарый;
        Возврат;
    КонецЕсли;

	Если СпособРедактированияГрафикаОплаты = 1 Тогда
		Пока Объект.ГрафикОплаты.Количество() > 1 Цикл
	        СтрокаУдаления = Объект.ГрафикОплаты[1];
	        Объект.ГрафикОплаты.Удалить(СтрокаУдаления);
			Модифицированность = Истина;
		КонецЦикла;
	ИначеЕсли СпособРедактированияГрафикаОплаты = 0 Тогда
		Объект.ГрафикОплаты.Очистить();
		Модифицированность = Истина;
	КонецЕсли;
	    
    СпособРедактированияПриИзмененииФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура СпособРедактированияПриИзмененииФрагмент()
	
	СпособРедактированияГрафикаОплатыСтарый = СпособРедактированияГрафикаОплаты;
	ЗаполнитьРеквизитыСтрокиПоТЧГрафикОплаты();
	УстановитьВидимостьДоступность();
    
КонецПроцедуры

&НаКлиенте
Процедура ГрафикОплаты_ЭтапОплатыПриИзменении(Элемент)
	ГрафикОплаты_ВидДней = ?(ЗначениеЗаполнено(уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(
		ГрафикОплаты_ЭтапОплаты, "ПроизводственныйКалендарь")), 1, 0);
	ЗаполнитьТЧГрафикОплатыПоРеквизитамСтроки();
	УстановитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ПредметДоговораПриИзменении(Элемент)
	
	Если Объект.ПредметДоговора = ПредопределенноеЗначение("Перечисление.уатПредметыДоговоровКонтрагентов.Аренда") Тогда
		Объект.ВедениеВзаиморасчетов = ПредопределенноеЗначение("Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоДокументуАрендаТС");
	ИначеЕсли Объект.ПредметДоговора = ПредопределенноеЗначение("Перечисление.уатПредметыДоговоровКонтрагентов.Такси") Тогда 
		Объект.ВедениеВзаиморасчетов = ПредопределенноеЗначение("Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом");
		Объект.ТребуетсяДепозит = Ложь;
	Иначе 
		Если Объект.ВедениеВзаиморасчетов = ПредопределенноеЗначение("Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоДокументуАрендаТС") Тогда
			Объект.ВедениеВзаиморасчетов = ПредопределенноеЗначение("Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказамНаТС"); 
		КонецЕсли;
		Объект.ТребуетсяДепозит = Ложь;
	КонецЕсли;
	
	УстановитьОтборЭтаповОплаты();
	УстановитьВидимостьДоступность(); 
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыГрафикОплаты

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыСД

&НаКлиенте
Процедура ВидыСопроводительныхДокументовПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ОбновитьСпособРасчетаДнейПредставление();
КонецПроцедуры

&НаКлиенте
Процедура ВидыСопроводительныхДокументовСпособРасчетаДнейПредставлениеПриИзменении(Элемент)
	ТекСтрока = Элементы.ВидыСопроводительныхДокументов.ТекущиеДанные;
	Если ТекСтрока.СпособРасчетаДнейПредставление = "Рабочие" Тогда
		ТекСтрока.СпособРасчетаДней = 1;
	Иначе
		ТекСтрока.СпособРасчетаДней = 0;
		ТекСтрока.ПроизводственныйКалендарь = Неопределено;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов
&НаКлиенте
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовОбъекта(Команда)
	Оповещ = Новый ОписаниеОповещения("РазрешитьРедактированиеРеквизитовОбъектаЗавершение", ЭтотОбъект);
	ЗапретРедактированияРеквизитовОбъектовКлиент.РазрешитьРедактированиеРеквизитовОбъекта(ЭтотОбъект, Оповещ);
КонецПроцедуры

&НаКлиенте
Процедура РазрешитьРедактированиеРеквизитовОбъектаЗавершение(Результат, ДопПараметры) Экспорт
	УстановитьВидимостьДоступность();
КонецПроцедуры
// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов

&НаКлиенте
Процедура НастроитьШаблон(Команда)
	
	ПараметрыФормы = Новый Структура("ОбъектНастройки", "Справочник_ДоговорыКонтрагентов");
	ОткрытьФорму("ОбщаяФорма.уатНастройкаШаблона", ПараметрыФормы, ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьНаименование(Команда)
	
	Объект.Наименование   = СформироватьНаименованиеСервер();
	НаименованиеПоШаблону = Объект.Наименование;
	Модифицированность  = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВидыДокументовПоШаблону(Команда)
	Если Объект.Ссылка.Пустая() Тогда
		Оповещ = Новый ОписаниеОповещения("ЗаполнитьДокументыПоШаблонуОтвет", ЭтотОбъект);
		ПоказатьВопрос(Оповещ, "Перед выполнением операции документ будет записан. Продолжить?",
			РежимДиалогаВопрос.ОКОтмена);
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Справочник.уатШаблоныДокументов_уэ.ФормаВыбора",, ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДокументыПоШаблонуОтвет(Результат, ДопПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.ОК Тогда
		Рез = Записать();
		Если Рез Тогда
			ОткрытьФорму("Справочник.уатШаблоныДокументов_уэ.ФормаВыбора",, ЭтотОбъект);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокументыПоШаблонуЗавершение(Шаблон)
	Для Каждого ТекВидДокумента Из Шаблон.ВидыДокументов Цикл
		Если НЕ ЗначениеЗаполнено(ТекВидДокумента.ВидДокумента) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Объект.ВидыСопроводительныхДокументов.Добавить();
		НоваяСтрока.ВидДокумента = ТекВидДокумента.ВидДокумента;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Объект_ЗаписатьИЗакрыть(Команда)
	
	флЗакрыватьПриЗаписи = Истина;
	Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура Объект_Записать(Команда)
	
	флЗакрыватьПриЗаписи = Ложь;
	Записать();
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура УстановитьВидимостьДоступность()

	ЭтоДоговорКомиссии     = 
		(Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СКомиссионером"))
		ИЛИ (Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СКомитентом"));
	ЭтоДоговорПриобретения = 
		(Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком"))
		ИЛИ (Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СКомитентом"));
	ЭтоДоговорРеализации   = 
		(Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПокупателем"))
		ИЛИ (Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СКомиссионером"));

	//Группа "Ведение взаиморасчетов"
	//Элементы.РасчетыВУсловныхЕдиницах.Доступность =
	//	(ЭтоДоговорРеализации 
	//	ИЛИ Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком"))
	//	И (Объект.ВалютаВзаиморасчетов <> ВалютаРегламентированногоУчета);
	
	Элементы.ДопустимаяСуммаЗадолженности.Доступность = Объект.КонтролироватьСуммуЗадолженности;
	Элементы.ЗапрещатьПроведениеПриЗадолженности.Доступность = Объект.КонтролироватьСуммуЗадолженности;
	
	Элементы.ГруппаГрафикОплаты.Видимость = флИспользоватьПлатежныйКалендарь
		И (Объект.ВедениеВзаиморасчетов
			= ПредопределенноеЗначение("Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказамНаТС")
		ИЛИ Объект.ВедениеВзаиморасчетов
			= ПредопределенноеЗначение("Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоНакладным")
		ИЛИ Объект.ВедениеВзаиморасчетов
			= ПредопределенноеЗначение("Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам"));
				
	Если СпособРедактированияГрафикаОплаты = 0 Тогда
		Элементы.ГруппаГрафикОплатыОдинЭтап.Видимость = Ложь;
		Элементы.ГруппаГрафикОплатыНесколькоЭтапов.Видимость = Ложь;
	ИначеЕсли СпособРедактированияГрафикаОплаты = 1 Тогда
		Элементы.ГруппаГрафикОплатыОдинЭтап.Видимость = Истина;
		Элементы.ГруппаГрафикОплатыНесколькоЭтапов.Видимость = Ложь;
	Иначе
		Элементы.ГруппаГрафикОплатыОдинЭтап.Видимость = Ложь;
		Элементы.ГруппаГрафикОплатыНесколькоЭтапов.Видимость = Истина;
	КонецЕсли;
	Если Объект.ПредметДоговора = ПредопределенноеЗначение("Перечисление.уатПредметыДоговоровКонтрагентов.ПрочиеУслуги")
		И Объект.ВедениеВзаиморасчетов <> ПредопределенноеЗначение("Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоНакладным")
		И Объект.ВедениеВзаиморасчетов <> ПредопределенноеЗначение("Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам") Тогда
		Элементы.ГруппаГрафикОплатыОдинЭтап.Видимость = Ложь;
		Элементы.ГруппаГрафикОплатыНесколькоЭтапов.Видимость = Ложь;
		Элементы.ГруппаИспользование.Видимость = Ложь;
	Иначе
		Элементы.ГруппаИспользование.Видимость = Истина;
	КонецЕсли;
	Элементы.ГруппаГрафикОплаты.ТолькоПросмотр = (Элементы.ГрафикОплаты.ТолькоПросмотр ИЛИ НЕ Элементы.ГрафикОплаты.Доступность);
	Элементы.ГруппаПодсказкаГрафик.Видимость = ВГрафикеОплатыЕстьЭтапСВариантомОтсчетаДоОтправленияПоЗаказу();
	
	Элементы.ПланированиеОбъемовПеревозок.Видимость = флИспользоватьЗакреплениеМЛЗаПеревозчиками И ЭтоДоговорПриобретения;
			
	Если ВариантПоставкиТакси Тогда
		Элементы.ТребуетсяДепозит.Видимость = Ложь;
		Элементы.ВедениеВзаиморасчетов.СписокВыбора.Очистить();
		Если Объект.ПредметДоговора = ПредопределенноеЗначение("Перечисление.уатПредметыДоговоровКонтрагентов.Аренда") Тогда
			Элементы.ВедениеВзаиморасчетов.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоДокументуАрендаТС"));
			
			Элементы.ТребуетсяДепозит.Видимость = Истина;
		ИначеЕсли Объект.ПредметДоговора = ПредопределенноеЗначение("Перечисление.уатПредметыДоговоровКонтрагентов.Такси") Тогда 
			Элементы.ВедениеВзаиморасчетов.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом"));
		Иначе
			Элементы.ВедениеВзаиморасчетов.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом"));
			Элементы.ВедениеВзаиморасчетов.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам")); 
			Элементы.ВедениеВзаиморасчетов.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоНакладным"));
			Элементы.ВедениеВзаиморасчетов.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказамНаТС"));
		КонецЕсли;
		Элементы.ТребуетсяДепозит.Видимость = Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПокупателем");
	Иначе
		Элементы.ТребуетсяДепозит.Видимость = Ложь;
	КонецЕсли;
	
	// добавлено условие для пользователей с ограниченными провами
	Если ПравоДоступаПросмотруатЭтапыОплаты() Тогда
		Если СпособРедактированияГрафикаОплаты = 1 И Объект.ГрафикОплаты.Количество() > 0 Тогда
			ТекЭтапОплаты = Объект.ГрафикОплаты[0].ЭтапОплаты;
			Если ЗначениеЗаполнено(ТекЭтапОплаты) Тогда
				ЭтапОплатыРеквизиты = уатОбщегоНазначенияТиповые.ПолучитьЗначенияРеквизитов(ТекЭтапОплаты,
					"ВариантОтсчета, ОтображатьНаПлатежномКалендареДоДоставкиГруза");
				
				Элементы.ГруппаСрокОплаты.Видимость = (ЭтапОплатыРеквизиты.ВариантОтсчета
					<> ПредопределенноеЗначение("Перечисление.уатВариантыОтсчетаДатыПлатежа.ПроизвольнаяДата"));
					
				Если Элементы.Найти("ГрафикОплаты_ПроизводственныйКалендарь") <> Неопределено Тогда
					Элементы.ГрафикОплаты_ПроизводственныйКалендарь.Доступность = (ГрафикОплаты_ВидДней = 1);
				КонецЕсли;
				Если Элементы.Найти("ГрафикОплаты_ВидСопроводительногоДокумента") <> Неопределено Тогда
					Элементы.ГрафикОплаты_ВидСопроводительногоДокумента.Видимость = (ЭтапОплатыРеквизиты.ВариантОтсчета
						= ПредопределенноеЗначение("Перечисление.уатВариантыОтсчетаДатыПлатежа.ПослеПолученияСопроводительныхДокументов"));
				КонецЕсли;
					
				Элементы.ГруппаПредварительноеОтображениеНаПК.Видимость = ЭтапОплатыРеквизиты.ВариантОтсчета
					= ПредопределенноеЗначение("Перечисление.уатВариантыОтсчетаДатыПлатежа.ПослеДоставкиГруза")
					ИЛИ ЭтапОплатыРеквизиты.ВариантОтсчета
					= ПредопределенноеЗначение("Перечисление.уатВариантыОтсчетаДатыПлатежа.ПослеОтправкиКомплектаСопроводительныхДокументов")
					ИЛИ ЭтапОплатыРеквизиты.ВариантОтсчета
					= ПредопределенноеЗначение("Перечисление.уатВариантыОтсчетаДатыПлатежа.ПослеПолученияСопроводительныхДокументов");
			Иначе
				Элементы.ГруппаГрафикОплатыОдинЭтап.Доступность = Ложь;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Элементы.ГруппаГрафикОплаты.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.ОплатаПоКурсуНаДатуСчета.Видимость =
		Объект.ВедениеВзаиморасчетов = ПредопределенноеЗначение("Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоНакладным")
		ИЛИ Объект.ВедениеВзаиморасчетов = ПредопределенноеЗначение("Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПравоДоступаПросмотруатЭтапыОплаты()
	Возврат ПравоДоступа("Просмотр", Метаданные.Справочники.уатЭтапыОплаты);
КонецФункции

&НаСервере
Функция ВГрафикеОплатыЕстьЭтапСВариантомОтсчетаДоОтправленияПоЗаказу()
	Рез = Ложь;
	Для Каждого ТекСтрока Из Объект.ГрафикОплаты Цикл
		Если ТекСтрока.ЭтапОплаты.ВариантОтсчета = Перечисления.уатВариантыОтсчетаДатыПлатежа.ДоОтправленияПоЗаказу Тогда
			Рез = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Рез;	
КонецФункции

&НаСервере
Функция СформироватьНаименованиеСервер()
	
	СпрОб = РеквизитФормыВЗначение("Объект");
	Рез = уатНастройкиШаблонов.СформироватьНаименованиеПоШаблону("Справочник_ДоговорыКонтрагентов", СпрОб);
	Возврат Рез;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПоШаблону(ФормаВызова="0")
	
	СпрОб = РеквизитФормыВЗначение("Объект");
	Пустышка = уатНастройкиШаблонов.СоздатьДоговорКонтрагентаПоШаблону(СпрОб, ФормаВызова);
	ЗначениеВРеквизитФормы(СпрОб, "Объект");
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСпособРасчетаДнейПредставление()
	Для Каждого ТекВидСД Из Объект.ВидыСопроводительныхДокументов Цикл
		Если ТекВидСД.СпособРасчетаДней = 1 Тогда
			ТекВидСД.СпособРасчетаДнейПредставление = "Рабочие";
		Иначе
			ТекВидСД.СпособРасчетаДнейПредставление = "Календарные";
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТЧГрафикОплатыПоРеквизитамСтроки()
	Если Объект.ГрафикОплаты.Количество() = 0 Тогда
		Объект.ГрафикОплаты.Добавить();
	КонецЕсли;
	
	Объект.ГрафикОплаты[0].ЭтапОплаты                    = ГрафикОплаты_ЭтапОплаты;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыСтрокиПоТЧГрафикОплаты()
	
	Если Объект.ГрафикОплаты.Количество() = 0 Тогда
		ГрафикОплаты_ЭтапОплаты = Неопределено;
		ГрафикОплаты_ВидДней = 0;
	Иначе
		ГрафикОплаты_ЭтапОплаты = Объект.ГрафикОплаты[0].ЭтапОплаты;
		ГрафикОплаты_ВидДней = ?(ЗначениеЗаполнено(ГрафикОплаты_ЭтапОплаты.ПроизводственныйКалендарь), 1, 0);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборЭтаповОплаты()
	
	мсвВариантыОтсчета = Новый Массив;
	Если Объект.ПредметДоговора = ПредопределенноеЗначение("Перечисление.уатПредметыДоговоровКонтрагентов.Перевозка") Тогда
		мсвВариантыОтсчета.Добавить(ПредопределенноеЗначение("Перечисление.уатВариантыОтсчетаДатыПлатежа.ДоОтправленияПоЗаказу"));
		мсвВариантыОтсчета.Добавить(ПредопределенноеЗначение("Перечисление.уатВариантыОтсчетаДатыПлатежа.ПослеОтправленияПоЗаказу"));
		мсвВариантыОтсчета.Добавить(ПредопределенноеЗначение("Перечисление.уатВариантыОтсчетаДатыПлатежа.ДоПрибытияПоЗаказу"));
		мсвВариантыОтсчета.Добавить(ПредопределенноеЗначение("Перечисление.уатВариантыОтсчетаДатыПлатежа.ПослеПрибытияПоЗаказу"));
		мсвВариантыОтсчета.Добавить(ПредопределенноеЗначение("Перечисление.уатВариантыОтсчетаДатыПлатежа.ПослеДоставкиГруза"));
		мсвВариантыОтсчета.Добавить(ПредопределенноеЗначение("Перечисление.уатВариантыОтсчетаДатыПлатежа.ПослеОтправкиКомплектаСопроводительныхДокументов"));
		мсвВариантыОтсчета.Добавить(ПредопределенноеЗначение("Перечисление.уатВариантыОтсчетаДатыПлатежа.ПослеПолученияСопроводительныхДокументов"));
	ИначеЕсли Объект.ПредметДоговора = ПредопределенноеЗначение("Перечисление.уатПредметыДоговоровКонтрагентов.ПрочиеУслуги") Тогда
		мсвВариантыОтсчета.Добавить(ПредопределенноеЗначение("Перечисление.уатВариантыОтсчетаДатыПлатежа.ПослеДатыДокумента"));
		мсвВариантыОтсчета.Добавить(ПредопределенноеЗначение("Перечисление.уатВариантыОтсчетаДатыПлатежа.ПослеДатыОказанияУслуги"));
		мсвВариантыОтсчета.Добавить(ПредопределенноеЗначение("Перечисление.уатВариантыОтсчетаДатыПлатежа.ПослеВыполненияРемонта"));
	КонецЕсли;
	мсвВариантыОтсчета.Добавить(ПредопределенноеЗначение("Перечисление.уатВариантыОтсчетаДатыПлатежа.ПроизвольнаяДата"));
	
	мсвПараметрыВыбора = Новый Массив;
	мсвПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.ВариантОтсчета", мсвВариантыОтсчета));
	Элементы.ГрафикПлатежейЭтапОплаты.ПараметрыВыбора = Новый ФиксированныйМассив(мсвПараметрыВыбора);
	Элементы.ГрафикОплаты_ЭтапОплаты.ПараметрыВыбора = Новый ФиксированныйМассив(мсвПараметрыВыбора);
			
КонецПроцедуры

#КонецОбласти
