
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	уатЗащищенныеФункцииСервер.уатСправочникФормаЭлементаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, Объект, ЭтотОбъект, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьИконкуМетодаРасчета();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	уатЗащищенныеФункцииКлиент.уатСправочникФормаЭлементаПриОткрытии(Отказ, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ОбновитьИконкуМетодаРасчета();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТарифыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		ТекСтрока = Элементы.Тарифы.ТекущиеДанные;
		ТекСтрока.ИконкаМетодРасчета = 4;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТарифыТарифПриИзменении(Элемент)
	ОбновитьИконкуМетодаРасчета();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьИконкуМетодаРасчета()
	Для Каждого ТекСтрока Из Объект.Тарифы Цикл
		Если ТекСтрока.Тариф.ВидНачисления.СпособРасчетаОплатыТруда = Перечисления.уатСпособыРасчетаОплатыТруда.СдельныйЗаработок Тогда
		    ТекСтрока.ИконкаМетодРасчета = 0;
		ИначеЕсли ТекСтрока.Тариф.ВидНачисления.СпособРасчетаОплатыТруда = Перечисления.уатСпособыРасчетаОплатыТруда.ФиксированнойСуммой Тогда
		    ТекСтрока.ИконкаМетодРасчета = 1;
		ИначеЕсли ТекСтрока.Тариф.ВидНачисления.СпособРасчетаОплатыТруда = Перечисления.уатСпособыРасчетаОплатыТруда.ПроцентомОтВыручки
			ИЛИ ТекСтрока.Тариф.ВидНачисления.СпособРасчетаОплатыТруда = Перечисления.уатСпособыРасчетаОплатыТруда.ПроцентомОтВидовНачислений Тогда
		    ТекСтрока.ИконкаМетодРасчета = 2;
		ИначеЕсли ТекСтрока.Тариф.ВидНачисления.СпособРасчетаОплатыТруда = Перечисления.уатСпособыРасчетаОплатыТруда.ДоплатаЗаНочныеЧасы
			ИЛИ ТекСтрока.Тариф.ВидНачисления.СпособРасчетаОплатыТруда = Перечисления.уатСпособыРасчетаОплатыТруда.ДоплатаЗаПраздничныеИВыходные Тогда
		    ТекСтрока.ИконкаМетодРасчета = 3;
		Иначе
			ТекСтрока.ИконкаМетодРасчета = 4;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
