#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	уатОбщегоНазначенияСервер.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.уатСтраховойСертификат_уэ") ИЛИ 
				ТипЗнч(ДанныеЗаполнения) = Тип("ДокументОбъект.уатСтраховойСертификат_уэ") Тогда
				
				Организация             = ДанныеЗаполнения.Организация;
				Ответственный           = уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(
				ПользователиКлиентСервер.АвторизованныйПользователь(), "ОсновнойОтветственный");
				Контрагент              = ДанныеЗаполнения.Контрагент;
				ДоговорКонтрагента      = ДанныеЗаполнения.ДоговорКонтрагента;
				ДокументОснование       = ДанныеЗаполнения;
				
				НоваяСтрока = Сверка.Добавить();
				НоваяСтрока.СтраховойСертификат = ДанныеЗаполнения;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Заголовок = уатОбщегоНазначенияТиповые.уатПредставлениеДокументаПриПроведении(ЭтотОбъект);
	уатОбщегоНазначения.ПроверкаЗаполненияПодразделения(Организация, Подразделение, Отказ, Заголовок);
	
КонецПроцедуры

#КонецОбласти
