
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ДобавляемыеДекорации")
		 И Параметры.Свойство("ИдентификаторЛегенды") Тогда
		
		КлючСохраненияПоложенияОкна = Параметры.ИдентификаторЛегенды;
		
		Для каждого Декорация Из Параметры.ДобавляемыеДекорации Цикл
			Группа = Элементы.Добавить("Группа" + СтрЗаменить(Декорация.Заголовок, " ", ""), Тип("ГруппаФормы"), Элементы.ОсновнаяГруппа);
			Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			Группа.ОтображатьЗаголовок = Ложь;
			Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда; 
			Группа.Объединенная = Ложь;
			
			ДекорацияЦвет = Элементы.Добавить("Цвет" + СтрЗаменить(Декорация.Заголовок, " ", ""), Тип("ДекорацияФормы"), Группа);
			ДекорацияЦвет.Ширина = 2;
			ДекорацияЦвет.ЦветФона = Декорация.Цвет;
			
			ДекорацияЗаголовок = Элементы.Добавить(СтрЗаменить(Декорация.Заголовок, " ", ""), Тип("ДекорацияФормы"), Группа);
			ДекорацияЗаголовок.Вид = ВидДекорацииФормы.Надпись;
			ДекорацияЗаголовок.Заголовок = Декорация.Заголовок;
		КонецЦикла;
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти 
