#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.Свойство("Массив") Тогда
		Отказ = Истина;
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекСтрока Из Параметры.Массив Цикл
		НоваяСтрока = ВыработкаАгрегатов.Добавить();
		НоваяСтрока.ТС = ТекСтрока.ТС;
		НоваяСтрока.Агрегат = ТекСтрока.Агрегат;
		НоваяСтрока.ПараметрВыработки = ТекСтрока.ПараметрВыработки;
		НоваяСтрока.Количество = ТекСтрока.Количество;
	КонецЦикла;
	Если ВыработкаАгрегатов.Количество() = 0 Тогда
		Элементы.ГруппаПредупреждение.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти