///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Функция ТемаОбращенияВПоддержку(Знач ТехническаяИнформация) Экспорт
	
	ОсновнаяПричина = СтрЗаменить(ТехническаяИнформация, Символы.ПС, " ");
	
	ОграничениеДлины = 500;
	ОсновнаяПричина = Лев(ОсновнаяПричина, ОграничениеДлины);
	
	Шаблон = НСтр("ru = 'Настройка почтового ящика: %1';
					|en = 'Configure email: %1'");
	Результат = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон, ОсновнаяПричина);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстОбращенияВПоддержку(Знач АдресЭлектроннойПочты, Знач ТехническаяИнформация) Экспорт
	
	ОсновнаяПричина = СтрЗаменить(ТехническаяИнформация, Символы.ПС, " ");
	
	Шаблон = НСтр("ru = 'Проблема при настройке почтового ящика %1: %2.
		|
		|<Опишите возникшую проблему и приложите скриншоты ошибки.>';
		|en = 'Issue when configuring email %1: %2.
		|
		|<Describe the issue and attach screenshots>'");
	
	Результат = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		Шаблон,
		АдресЭлектроннойПочты,
		ОсновнаяПричина);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
