
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТекстОшибки = "";
	СоздатьШаблонПоУмолчанию(ТекстОшибки);
	
	Если ТекстОшибки = "" Тогда 
		ПоказатьПредупреждение(, "Шаблон создан успешно.");
		
		Если ТипЗнч(ПараметрыВыполненияКоманды.Источник) = Тип("УправляемаяФорма") 
				И ПараметрыВыполненияКоманды.Источник.ИмяФормы = "Справочник.ШаблоныСообщений.Форма.ФормаСписка"
				И Не ПараметрыВыполненияКоманды.Источник.Элементы.Найти("Список") = Неопределено Тогда 
			ПараметрыВыполненияКоманды.Источник.Элементы.Список.Обновить();
		КонецЕсли;
	Иначе 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СоздатьШаблонПоУмолчанию(ТекстОшибки)
	
	ШаблонДляСДМЛ = Справочники.ШаблоныСообщений.СоздатьЭлемент();
	ШаблонДляСДМЛ.Наименование                           = "Шаблон уведомления перевозчику по Маршрутному листу";
	ШаблонДляСДМЛ.Назначение                             = "Маршрутный лист";
	ШаблонДляСДМЛ.ПолноеИмяТипаПараметраВводаНаОсновании = "Документ.уатМаршрутныйЛист";
	ШаблонДляСДМЛ.ПредназначенДляВводаНаОсновании        = Истина;
	ШаблонДляСДМЛ.ПредназначенДляЭлектронныхПисем        = Истина;
	ШаблонДляСДМЛ.ТемаПисьма                             = "Необходимо прислать сопроводительные документы по Маршрутному листу № [уатМаршрутныйЛист.Номер] от [уатМаршрутныйЛист.Дата]";
	ШаблонДляСДМЛ.ТипТекстаПисьма                        = Перечисления.СпособыРедактированияЭлектронныхПисем.HTML;
	
	ШаблонДляСДМЛ.ТекстШаблонаПисьма = 
	"Добрый день!
	|
	|Проверены поступившие документы по перевозке.
	|Маршрутный лист № [уатМаршрутныйЛист.Номер] от [уатМаршрутныйЛист.Дата]
	|Перевозчик: [уатМаршрутныйЛист.Контрагент]
	|Водитель: [уатМаршрутныйЛист.Водитель1.ФИО]
	|Маршрут: [уатМаршрутныйЛист.Маршрут.Наименование]
	|
	|Необходимо срочно прислать отсутствующие и исправленные документы, в ином случае счет оплате не подлежит!
	|
	|Требуемые документы:
	|[уатМаршрутныйЛист.НеобработанныеДокументыПеревозчика]
	|С уважением, [уатСтраховойСертификат_уэ.Организация.Наименование]";
	
	ШаблонДляСДМЛ.ТекстШаблонаПисьмаHTML = 
	"<html>
	|<head>
	|<meta http-equiv=""Content-Type"" content=""text/html; charset=utf-8"" />
	|<meta http-equiv=""X-UA-Compatible"" content=""IE=Edge"" />
	|<meta name=""format-detection"" content=""telephone=no"" />
	|<style type=""text/css"">
	|body{margin:0;padding:8px;}
	|p{line-height:1.15;margin:0;white-space:pre-wrap;}
	|ol,ul{margin-top:0;margin-bottom:0;}
	|img{border:none;}
	|li>p{display:inline;}
	|</style>
	|</head>
	|<body>
	|<p>Добрый день!</p>
	|<p><br></p>
	|<p>Проверены поступившие документы по перевозке.</p>
	|<p>Маршрутный лист № [уатМаршрутныйЛист.Номер] от [уатМаршрутныйЛист.Дата]</p>
	|<p>Перевозчик: [уатМаршрутныйЛист.Контрагент]</p>
	|<p>Водитель: [уатМаршрутныйЛист.Водитель1.ФИО]</p>
	|<p>Маршрут: [уатМаршрутныйЛист.Маршрут.Наименование]</p>
	|<p><br></p>
	|<p>Необходимо срочно прислать отсутствующие и исправленные документы, в ином случае счет оплате не подлежит!</p>
	|<p><br></p>
	|<p>Требуемые документы:</p>
	|[уатМаршрутныйЛист.НеобработанныеДокументыПеревозчика]
	|<p><br></p>
	|<p>С уважением, [уатМаршрутныйЛист.Организация.Наименование]</p>
	|</body>
	|</html>";
	
	ТекстHTML = ШаблонДляСДМЛ.ТекстШаблонаПисьмаHTML;
	
	Попытка
		ШаблонДляСДМЛ.Записать();
	Исключение
		ТекстОшибки = ИнформацияОбОшибке().Описание;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти
