#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	уатЗащищенныеФункцииСервер.уатОтчетОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Настройки размещения в панели отчетов.
//
// Параметры:
//   Настройки – Коллекция – Используется для описания настроек отчетов и вариантов
//       см. описание к ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//   НастройкиОтчета – СтрокаДереваЗначений – Настройки размещения всех вариантов отчета.
//       См. "Реквизиты для изменения" функции ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//
// Описание:
//   См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//
// Вспомогательные методы:
//   НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "<ИмяВарианта>");
//   ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, НастройкиОтчета, Истина/Ложь); // Отчет
//   поддерживает только этот режим.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "");
	
	НастройкиВарианта.Описание = 
		НСтр("en='Report is intended to form set of equipment for assignment to military enlistment office at place of registration of legal entity.';ru='Отчет предназначен для формирования свода техники для предоставления в военкомат по месту регистрации юридического лица.'");
	
	НастройкиВарианта.НастройкиДляПоиска.НаименованияПолей = ""
		+ НСтр("en='ОсновноеСредство';ru='ОсновноеСредство'") + Символы.ПС
		+ НСтр("en='Vehicle department';ru='Колонна'") + Символы.ПС
		+ НСтр("en='Company';ru='Организация'");
	
	НастройкиВарианта.НастройкиДляПоиска.НаименованияПараметровИОтборов = ""
		+ НСтр("en='Period';ru='Период'") + Символы.ПС
		+ НСтр("en='Company';ru='Организация'");
	
	НастройкиВарианта.НастройкиДляПоиска.КлючевыеСлова = ""
		+ НСтр("en='code';ru='свод'") + Символы.ПС
		+ НСтр("en='technique';ru='техника'") + Символы.ПС
		+ НСтр("en='military registration and enlistment office';ru='военкомат'");
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли