
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Статус         = Перечисления.мкСтатусыРегистрацииМобильныхУстройств.Новый;	
		Объект.ОписаниеОшибки = "";
		Если Не ЗначениеЗаполнено(Объект.Дата) Тогда
			Объект.Дата = ТекущаяДатаСеанса();
		КонецЕсли;
	КонецЕсли;
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьДоступность()
	
	Если Не ПустаяСтрока(Объект.ОписаниеОшибки) Тогда
		Элементы.ОписаниеОшибки.Видимость = Истина;
	Иначе
		Элементы.ОписаниеОшибки.Видимость = Ложь;
	КонецЕсли;
	
	РедактированиеДанныхТерминала = Объект.Статус = Перечисления.мкСтатусыРегистрацииМобильныхУстройств.Новый;
	Элементы.Терминал.ТолькоПросмотр = Не РедактированиеДанныхТерминала;
	
КонецПроцедуры

#КонецОбласти