
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	уатЗащищенныеФункцииСервер.уатРегистрФормаСпискаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	уатЗащищенныеФункцииКлиент.уатРегистрФормаСпискаПриОткрытии(Отказ, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	Если уатОбщегоНазначенияПовтИсп.ВариантПоставкиТакси() Тогда
		Элементы.Заказ.Подсказка = НСтр("en = 'Vehicle order, Taxi order or Vehicle rental.'; ru = 'Заказ на ТС, Заказ такси или Аренда ТС.'");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
