#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АдресСервиса") Тогда
		АдресСервиса = Параметры.АдресСервиса;
		Попытка
			ТекстСтраницы = Новый ЧтениеТекста;
			ТекстСтраницы.Открыть(Параметры.АдресСервиса, "utf-8");
			СодержимоеСтраницы = ТекстСтраницы.Прочитать();
			
			HTML = СтрШаблон(Нстр("ru = '<!DOCTYPE html>"
"<html>"
"<head>"
"    <meta charset=""utf-8"">"
"</head>"
"<body>"
"%1"
"</body>"
"</html>'; en = '<!DOCTYPE html>"
"<html>"
"<head>"
"    <meta charset=""utf-8"">"
"</head>"
"<body>"
"%1"
"</body>"
"</html>'"), СодержимоеСтраницы);
		Исключение
			HTML = Параметры.АдресСервиса;
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьВБраузере(Команда)
	
	СтандартнаяОбработка = Ложь;  
	Оповещение = Новый ОписаниеОповещения("ЗапускПриложения", ЭтотОбъект);
	НачатьЗапускПриложения(Оповещение, АдресСервиса);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗапускПриложения(КодВозврата, ДополнительныйПараметр) Экспорт
	// Заглушка 
	Заглушка = Истина;
КонецПроцедуры

#КонецОбласти 

