
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("Вес") Тогда
		Возврат;
	КонецЕсли;
	
	КоличествоИзЗаказаНаТС = Параметры.Количество;
	ВесИзЗаказаНаТС = Параметры.Вес;
	ОбъемИзЗаказаНаТС = Параметры.Объем;
	
	КоличествоПоместитьВВагон = Параметры.Количество;
	КоличествоПоместитьВВагонПредыдущее = Параметры.Количество;
	ВесПоместитьВВагон = Параметры.Вес;
	ОбъемПоместитьВВагон = Параметры.Объем;
	
	ВесСвободный = Параметры.СвободныйВес;
	ОбъемСвободный = Параметры.СвободныйОбъем;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КоличествоПоместитьВВагонПриИзменении(Элемент)
	
	ОбновитьВГХ();
	
КонецПроцедуры

&НаКлиенте
Процедура ВесПоместитьВВагонПриИзменении(Элемент)
	
	ОбновитьВГХ();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъемПоместитьВВагонПриИзменении(Элемент)
	
	ОбновитьВГХ();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтменаЗаполненияВагона(Команда)
	
	Закрыть(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьЗаполнениеВагона(Команда)
	
	СтруктураВГХ = Новый Структура;
	СтруктураВГХ.Вставить("Количество", КоличествоПоместитьВВагон);
	СтруктураВГХ.Вставить("Вес", ВесПоместитьВВагон);
	СтруктураВГХ.Вставить("Объем", ОбъемПоместитьВВагон);
	
	Закрыть(СтруктураВГХ)
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьВГХ()
	
	ВесПоместитьВВагон   = ВесПоместитьВВагон * ?(КоличествоПоместитьВВагон = 0, 0, (КоличествоПоместитьВВагон / КоличествоПоместитьВВагонПредыдущее));
	ОбъемПоместитьВВагон = ОбъемПоместитьВВагон * ?(КоличествоПоместитьВВагон = 0, 0, (КоличествоПоместитьВВагон / КоличествоПоместитьВВагонПредыдущее));
	
	КоличествоПоместитьВВагонПредыдущее = КоличествоПоместитьВВагон;
	
КонецПроцедуры

#КонецОбласти
