
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Шаблон = ЗаказГрузоотправителяЭтоШаблон(Запись.ЗаказГрузоотправителя);
	УстановитьВидимость();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЗаказГрузоотправителяПриИзменении(Элемент)
	Шаблон = ЗаказГрузоотправителяЭтоШаблон(Запись.ЗаказГрузоотправителя);
	УстановитьВидимость();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимость()
	
	Элементы.ГруппаРеквизитыШаблона.Видимость = Шаблон;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаказГрузоотправителяЭтоШаблон(ЗаказГрузоотправителя)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаказГрузоотправителя, "ЭтоШаблонПеревозки");
	
КонецФункции

#КонецОбласти