#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
	Настройки.ПриПолученииСлужебныхРеквизитов = Ложь;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	// необходима для подключения внешних ПФ
	Заглушка = Истина;
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

// СтандартныеПодсистемы.УправлениеДоступом

// Позволяет переопределить ограничение, указанное в модуле менеджера объекта метаданных.
//
// Параметры:
//  Ограничение - Структура:
//    * Текст                             - Строка - ограничение доступа для пользователей.
//                                          Если пустая строка, значит, доступ разрешен.
//    * ТекстДляВнешнихПользователей      - Строка - ограничение доступа для внешних пользователей.
//                                          Если пустая строка, значит, доступ запрещен.
//    * ПоВладельцуБезЗаписиКлючейДоступа - Неопределено - определить автоматически.
//                                        - Булево - если Ложь, то всегда записывать ключи доступа,
//                                          если Истина, тогда не записывать ключи доступа,
//                                          а использовать ключи доступа владельца (требуется,
//                                          чтобы ограничение было строго по объекту-владельцу).
//   * ПоВладельцуБезЗаписиКлючейДоступаДляВнешнихПользователей - Неопределено, Булево - также
//                                          как у параметра ПоВладельцуБезЗаписиКлючейДоступа.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(Подразделение)";
	
	Ограничение.ТекстДляВнешнихПользователей = Ограничение.Текст;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// СтандартныеПодсистемы.ВариантыОтчетов

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

#КонецОбласти

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт

	СформироватьТаблицаДоходыРасходы(ДокументСсылка, СтруктураДополнительныеСвойства);
	СформироватьТаблицаИзносАгрегатов(ДокументСсылка, СтруктураДополнительныеСвойства);
	СформироватьТаблицаСпецодеждаСотрудников(ДокументСсылка, СтруктураДополнительныеСвойства);
		
КонецПроцедуры // ИнициализироватьДанныеДокумента()

Процедура ВыполнитьКонтроль(ДокументСсылка, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
	
	Заголовок = уатОбщегоНазначенияТиповые.уатПредставлениеДокументаПриПроведении(ДокументСсылка);
	
	Для Каждого ТекСтрокаРасходы Из ДокументСсылка.Расходы Цикл
		//агрегат
		Если ЗначениеЗаполнено(ТекСтрокаРасходы.Агрегат) Тогда
			Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	уатИзносАгрегатовОбороты.СерияНоменклатуры.ПервоначальнаяСтоимость - ЕСТЬNULL(уатИзносАгрегатовОбороты.ИзносОборот, 0) КАК ОстаточнаяСтоимость
			|ИЗ
			|	РегистрНакопления.уатИзносАгрегатов.Обороты(, &Период, , СерияНоменклатуры = &Агрегат) КАК уатИзносАгрегатовОбороты
			|	ГДЕ уатИзносАгрегатовОбороты.СерияНоменклатуры.ПервоначальнаяСтоимость - ЕСТЬNULL(уатИзносАгрегатовОбороты.ИзносОборот, 0) < 0");
			Запрос.УстановитьПараметр("Период",  Новый Граница(ТекСтрокаРасходы.ДатаОтражения, ВидГраницы.Включая));
			Запрос.УстановитьПараметр("Агрегат", ТекСтрокаРасходы.Агрегат);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Если ТекСтрокаРасходы.Сумма + Выборка.ОстаточнаяСтоимость <= 0 Тогда
					ТекстНСТР = СтрШаблон(
						"Амортизация агрегата ""%1"" не требуется, его остаточная стоимость равна 0.",
						ТекСтрокаРасходы.Агрегат);	
				Иначе
					ТекстНСТР = СтрШаблон(
						"Обнаружена отрицательная остаточная стоимость агрегата ""%1"": %2. Сумма амортизации не должна превышать %3.",
						ТекСтрокаРасходы.Агрегат, Выборка.ОстаточнаяСтоимость, ТекСтрокаРасходы.Сумма + Выборка.ОстаточнаяСтоимость);	
				КонецЕсли;
				уатОбщегоНазначенияТиповые.СообщитьОбОшибке(ТекстНСТР, Отказ, Заголовок);
			КонецЕсли;
					
		//спецодежда
		ИначеЕсли ТекСтрокаРасходы.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.СпецодеждаИИнструменты Тогда
			Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	уатСпецодеждаИИнструментыСотрудниковОстатки.СтоимостьОстаток - уатСпецодеждаИИнструментыСотрудниковОстатки.СуммаИзносаОстаток КАК СтоимостьОстаток
			|ИЗ
			|	РегистрНакопления.уатСпецодеждаИИнструментыСотрудников.Остатки(
			|			&Период,
			|			Сотрудник = &Сотрудник
			|				И Номенклатура = &Номенклатура) КАК уатСпецодеждаИИнструментыСотрудниковОстатки
			|ГДЕ
			|	уатСпецодеждаИИнструментыСотрудниковОстатки.СтоимостьОстаток - уатСпецодеждаИИнструментыСотрудниковОстатки.СуммаИзносаОстаток < 0");
			Запрос.УстановитьПараметр("Период",       Новый Граница(ТекСтрокаРасходы.ДатаОтражения, ВидГраницы.Включая));
			Запрос.УстановитьПараметр("Сотрудник",    ТекСтрокаРасходы.Сотрудник);
			Запрос.УстановитьПараметр("Номенклатура", ТекСтрокаРасходы.Номенклатура);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				ТекстНСТР = СтрШаблон(
					"Обнаружена отрицательная остаточная стоимость спецодежды ""%1"" сотрудника ""%2"": %3. Сумма амортизации не должна превышать %4.",
					ТекСтрокаРасходы.Номенклатура, ТекСтрокаРасходы.Сотрудник, Выборка.СтоимостьОстаток,
					ТекСтрокаРасходы.Сумма + Выборка.СтоимостьОстаток);
				уатОбщегоНазначенияТиповые.СообщитьОбОшибке(ТекстНСТР, Отказ, Заголовок);
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаДоходыРасходы(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	мЗапрос = Новый Запрос;
	Если ДокументСсылка.ВидОперации = Перечисления.уатВидыОперацийПрочиеДоходыРасходы.Доходы Тогда
		мЗапрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	уатПрочиеДоходыРасходы.ДатаОтражения КАК Период,
		|	уатПрочиеДоходыРасходы.Ссылка КАК Регистратор,
		|	уатПрочиеДоходыРасходы.Ссылка.Организация КАК Организация,
		|	уатПрочиеДоходыРасходы.Ссылка.Подразделение КАК Подразделение,
		|	уатПрочиеДоходыРасходы.Ссылка.Колонна КАК Колонна,
		|	уатПрочиеДоходыРасходы.ТС КАК ТС,
		|	уатПрочиеДоходыРасходы.СтатьяДоходов КАК СтатьяДоходов,
		|	уатПрочиеДоходыРасходы.Сумма КАК Сумма,
		|	уатПрочиеДоходыРасходы.Сумма КАК СуммаРегл,
		|	уатПрочиеДоходыРасходы.Сумма КАК СуммаУпр,
		|	ВЫБОР
		|		КОГДА уатПрочиеДоходыРасходы.Ссылка.УчитыватьНДС
		|			ТОГДА уатПрочиеДоходыРасходы.СуммаНДС
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаНДС,
		|	ВЫБОР
		|		КОГДА уатПрочиеДоходыРасходы.Ссылка.УчитыватьНДС
		|			ТОГДА уатПрочиеДоходыРасходы.СуммаНДС
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаНДСУпр,
		|	уатПрочиеДоходыРасходы.Заказ КАК Заказ,
		|	уатПрочиеДоходыРасходы.Заказ.Ответственный КАК Менеджер,
		|	уатПрочиеДоходыРасходы.Контрагент КАК Контрагент,
		|	уатПрочиеДоходыРасходы.ОбъектСтроительства КАК ОбъектСтроительства,
		|	уатПрочиеДоходыРасходы.Маршрут КАК Маршрут,
		|	уатПрочиеДоходыРасходы.ВидПеревозки КАК ВидПеревозки,
		|	уатПрочиеДоходыРасходы.НаправлениеПеревозки КАК НаправлениеПеревозки
		|ИЗ
		|	Документ.уатПрочиеДоходыРасходы.Доходы КАК уатПрочиеДоходыРасходы
		|ГДЕ
		|	уатПрочиеДоходыРасходы.Ссылка = &Ссылка";
	Иначе
		мЗапрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	уатПрочиеДоходыРасходы.ДатаОтражения КАК Период,
		|	уатПрочиеДоходыРасходы.Ссылка КАК Регистратор,
		|	уатПрочиеДоходыРасходы.Ссылка.Организация КАК Организация,
		|	уатПрочиеДоходыРасходы.Ссылка.Подразделение КАК Подразделение,
		|	уатПрочиеДоходыРасходы.Ссылка.Колонна КАК Колонна,
		|	уатПрочиеДоходыРасходы.ТС КАК ТС,
		|	уатПрочиеДоходыРасходы.СтатьяРасходов,
		|	уатПрочиеДоходыРасходы.Сумма КАК Сумма,
		|	уатПрочиеДоходыРасходы.Сумма КАК СуммаРегл,
		|	уатПрочиеДоходыРасходы.Сумма КАК СуммаУпр,
		|	ВЫБОР
		|		КОГДА уатПрочиеДоходыРасходы.Ссылка.УчитыватьНДС
		|			ТОГДА уатПрочиеДоходыРасходы.СуммаНДС
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаНДС,
		|	ВЫБОР
		|		КОГДА уатПрочиеДоходыРасходы.Ссылка.УчитыватьНДС
		|			ТОГДА уатПрочиеДоходыРасходы.СуммаНДС
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаНДСУпр,
		|	уатПрочиеДоходыРасходы.Заказ,
		|	уатПрочиеДоходыРасходы.Заказ.Ответственный КАК Менеджер,
		|	уатПрочиеДоходыРасходы.Контрагент КАК Контрагент,
		|	уатПрочиеДоходыРасходы.ОбъектСтроительства КАК ОбъектСтроительства,
		|	уатПрочиеДоходыРасходы.Маршрут КАК Маршрут,
		|	уатПрочиеДоходыРасходы.ВидПеревозки КАК ВидПеревозки,
		|	уатПрочиеДоходыРасходы.НаправлениеПеревозки КАК НаправлениеПеревозки
		|ИЗ
		|	Документ.уатПрочиеДоходыРасходы.Расходы КАК уатПрочиеДоходыРасходы
		|ГДЕ
		|	уатПрочиеДоходыРасходы.Ссылка = &Ссылка";
	КонецЕсли;
	
	мЗапрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	ТаблицаДокумента = мЗапрос.Выполнить().Выгрузить();
	
	Для Каждого ТекСтрока Из ТаблицаДокумента Цикл
		СуммаВсего = ТекСтрока.Сумма + ?(ДокументСсылка.УчитыватьНДС И НЕ ДокументСсылка.СуммаВключаетНДС, ТекСтрока.СуммаНДС, 0);		
		
		ТекСтрока.СуммаРегл   = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(СуммаВсего,
			ДокументСсылка.ВалютаДокумента,                     СтруктураДополнительныеСвойства.ВалютаРеглУчета,
			СтруктураДополнительныеСвойства.КурсДокумента,      СтруктураДополнительныеСвойства.КурсРегл,
			СтруктураДополнительныеСвойства.КратностьДокумента, СтруктураДополнительныеСвойства.КратностьРегл,,
			ДокументСсылка);
		ТекСтрока.СуммаУпр    = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(СуммаВсего,
			ДокументСсылка.ВалютаДокумента,                     СтруктураДополнительныеСвойства.ВалютаУпрУчета,
			СтруктураДополнительныеСвойства.КурсДокумента,      СтруктураДополнительныеСвойства.КурсУпр,
			СтруктураДополнительныеСвойства.КратностьДокумента, СтруктураДополнительныеСвойства.КратностьУпр,,
			ДокументСсылка);
		ТекСтрока.СуммаНДС    = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.СуммаНДС,
			ДокументСсылка.ВалютаДокумента,                     СтруктураДополнительныеСвойства.ВалютаРеглУчета,
			СтруктураДополнительныеСвойства.КурсДокумента,      СтруктураДополнительныеСвойства.КурсРегл,
			СтруктураДополнительныеСвойства.КратностьДокумента, СтруктураДополнительныеСвойства.КратностьРегл,,
			ДокументСсылка);
		ТекСтрока.СуммаНДСУпр = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.СуммаНДСУпр,
			ДокументСсылка.ВалютаДокумента,                     СтруктураДополнительныеСвойства.ВалютаУпрУчета,
			СтруктураДополнительныеСвойства.КурсДокумента,      СтруктураДополнительныеСвойства.КурсУпр,
			СтруктураДополнительныеСвойства.КратностьДокумента, СтруктураДополнительныеСвойства.КратностьУпр,,
			ДокументСсылка);
	КонецЦикла;
	
	уатРасчетыПоТарифам_уэ.РаспределитьДоходыРасходыМеждуЗаказами(ТаблицаДокумента);
	
	Если ДокументСсылка.ВидОперации = Перечисления.уатВидыОперацийПрочиеДоходыРасходы.Доходы Тогда
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДоходы", ТаблицаДокумента);
	Иначе
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасходы", ТаблицаДокумента);
	КонецЕсли;
	
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаИзносАгрегатов(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	Расходы.ДатаОтражения КАК Период,
	|	Расходы.Ссылка.Организация КАК Организация,
	|	Расходы.Агрегат КАК СерияНоменклатуры,
	|	Расходы.ТС КАК ТС,
	|	Расходы.Сумма КАК Износ
	|ИЗ
	|	Документ.уатПрочиеДоходыРасходы.Расходы КАК Расходы
	|ГДЕ
	|	Расходы.Ссылка = &Ссылка
	|	И Расходы.Агрегат <> ЗНАЧЕНИЕ(Справочник.уатСерииНоменклатуры.ПустаяСсылка)");
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	мТаблицаИзносаАгрегатов = Запрос.Выполнить().Выгрузить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаИзносаАгрегатов", мТаблицаИзносаАгрегатов);
	
КонецПроцедуры // СформироватьТаблицаИзносАгрегатов()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаСпецодеждаСотрудников(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	Если ДокументСсылка.Расходы.Количество() = 0 Тогда
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСпецодеждаСотрудников", Новый ТаблицаЗначений);
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекСтрокаДокумента Из ДокументСсылка.Расходы Цикл
		мЗапрос = Новый Запрос;
		мЗапрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НЕОПРЕДЕЛЕНО КАК Период,
		|	&Ссылка КАК Регистратор,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	уатСпецодеждаИИнструментыСотрудниковОстатки.Сотрудник КАК Сотрудник,
		|	уатСпецодеждаИИнструментыСотрудниковОстатки.Должность КАК Должность,
		|	уатСпецодеждаИИнструментыСотрудниковОстатки.Номенклатура КАК Номенклатура,
		|	уатСпецодеждаИИнструментыСотрудниковОстатки.ДатаВыдачи КАК ДатаВыдачи,
		|	уатСпецодеждаИИнструментыСотрудниковОстатки.СтоимостьОстаток КАК ПервоначальнаяСтоимость,
		|	уатСпецодеждаИИнструментыСотрудниковОстатки.СуммаИзносаОстаток КАК СуммаИзносаОстаток,
		|	уатСпецодеждаИИнструментыСотрудниковОстатки.СтоимостьОстаток - уатСпецодеждаИИнструментыСотрудниковОстатки.СуммаИзносаОстаток КАК СтоимостьОстаток,
		|	0 КАК СуммаИзноса
		|ИЗ
		|	РегистрНакопления.уатСпецодеждаИИнструментыСотрудников.Остатки(
		|			&МоментВремени,
		|			Сотрудник В (&мсвСотрудники)
		|				И Номенклатура В (&мсвНоменклатура)) КАК уатСпецодеждаИИнструментыСотрудниковОстатки
		|ГДЕ
		|	уатСпецодеждаИИнструментыСотрудниковОстатки.СтоимостьОстаток > 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаВыдачи";
		мЗапрос.УстановитьПараметр("мсвСотрудники",   ДокументСсылка.Расходы.Выгрузить().ВыгрузитьКолонку("Сотрудник"));
		мЗапрос.УстановитьПараметр("мсвНоменклатура", ДокументСсылка.Расходы.Выгрузить().ВыгрузитьКолонку("Номенклатура"));
		мЗапрос.УстановитьПараметр("МоментВремени",   Новый Граница(ТекСтрокаДокумента.ДатаОтражения, ВидГраницы.Исключая));
		мЗапрос.УстановитьПараметр("Ссылка",          ДокументСсылка);
		
		тблИзносСпецодежды = мЗапрос.Выполнить().Выгрузить();
		
		Если НЕ ЗначениеЗаполнено(ТекСтрокаДокумента.Номенклатура)
			ИЛИ ТекСтрокаДокумента.Номенклатура.ВидНоменклатуры <> Справочники.ВидыНоменклатуры.СпецодеждаИИнструменты Тогда
			Продолжить;
		КонецЕсли;
		
		ТекСтрокаСуммаУпр = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрокаДокумента.Сумма,
			ДокументСсылка.ВалютаДокумента, СтруктураДополнительныеСвойства.ВалютаУпрУчета,
			ДокументСсылка.Дата, ДокументСсылка.Дата,,,,
			ДокументСсылка);	
		
		// расчет итоговой первоначальной стоимости для распределения износа по партиям
		ИтоговаяПервоначальнаяСтоимость = 0;
		Для Каждого ТекСтрокаРегистра Из тблИзносСпецодежды Цикл
			Если ТекСтрокаРегистра.Номенклатура <> ТекСтрокаДокумента.Номенклатура Тогда
				Продолжить;
			КонецЕсли;
			
			ИтоговаяПервоначальнаяСтоимость = ИтоговаяПервоначальнаяСтоимость + ТекСтрокаРегистра.ПервоначальнаяСтоимость;
		КонецЦикла;
		
		Если ИтоговаяПервоначальнаяСтоимость = 0 Тогда
			Продолжить;
		КонецЕсли;
					
		// Первый проход - подсчет дополнительной суммы износа, которая остается от разницы расчетного износа
		// и остаточной стоимости, если остаточная стоимость меньше расчетного износа. 
		СуммаИзносаДоп = 0;
		Для Каждого ТекСтрокаРегистра Из тблИзносСпецодежды Цикл
			Если ТекСтрокаРегистра.Номенклатура <> ТекСтрокаДокумента.Номенклатура Тогда
				Продолжить;
			КонецЕсли;
			
			ТекСуммаИзноса = ТекСтрокаСуммаУпр * ТекСтрокаРегистра.ПервоначальнаяСтоимость / ИтоговаяПервоначальнаяСтоимость;
			
			Если ТекСтрокаРегистра.СтоимостьОстаток < ТекСуммаИзноса Тогда
				ТекСтрокаРегистра.СуммаИзноса = ТекСтрокаРегистра.СтоимостьОстаток;
				СуммаИзносаДоп = СуммаИзносаДоп + (ТекСуммаИзноса - ТекСтрокаРегистра.СтоимостьОстаток);
			Иначе
				ТекСтрокаРегистра.СуммаИзноса = ТекСуммаИзноса;
			КонецЕсли;
			
			ТекСтрокаРегистра.Период = ТекСтрокаДокумента.ДатаОтражения;
		КонецЦикла;
		
		// Распределение сумма доп. износа на другие партии СО, у которых остаточная стоимость больше расчетного износа.
		Если СуммаИзносаДоп <> 0 Тогда
			Для Каждого ТекСтрокаРегистра Из тблИзносСпецодежды Цикл
				Если ТекСтрокаРегистра.Номенклатура <> ТекСтрокаДокумента.Номенклатура
					ИЛИ ТекСтрокаРегистра.СуммаИзноса = ТекСтрокаРегистра.СтоимостьОстаток Тогда
					Продолжить;
				КонецЕсли;
				
				ТекСуммаДопИзноса = Мин(СуммаИзносаДоп, ТекСтрокаРегистра.СтоимостьОстаток - ТекСтрокаРегистра.СуммаИзноса);
				ТекСтрокаРегистра.СуммаИзноса = ТекСтрокаРегистра.СуммаИзноса + ТекСуммаДопИзноса;
				
				СуммаИзносаДоп = СуммаИзносаДоп - ТекСуммаДопИзноса;
			КонецЦикла;
		КонецЕсли;
		
		// Сумма доп. износа не распределена полностью. Это значит, что общая сумма износа в строке ТЧ
		// превышает общее остаточную стоимость СО у сотрудника. Пишем в любую партию (например, последнюю),
		// всё равно контроль остатков увидит нехватку и отменит проведение
		Если СуммаИзносаДоп > 0 Тогда
			тблИзносСпецодежды[тблИзносСпецодежды.Количество()-1].СуммаИзноса =
				тблИзносСпецодежды[тблИзносСпецодежды.Количество()-1].СуммаИзноса + СуммаИзносаДоп;
		КонецЕсли;
			
		// Учет последней копейки, связанной с округлением до сотых при распределении суммы износа по партиям.
		КоличествоПартий = тблИзносСпецодежды.НайтиСтроки(Новый Структура("Номенклатура", ТекСтрокаДокумента.Номенклатура)).Количество();
		СчПартий = 0;
		СуммаИзносаПартийВсего = 0;
		Для Каждого ТекСтрокаРегистра Из тблИзносСпецодежды Цикл
			Если ТекСтрокаРегистра.Номенклатура <> ТекСтрокаДокумента.Номенклатура Тогда
				Продолжить;
			КонецЕсли;
			
			СчПартий = СчПартий + 1;
			СуммаИзносаПартийВсего = СуммаИзносаПартийВсего + ТекСтрокаРегистра.СуммаИзноса;
			
			Если СчПартий = КоличествоПартий И ТекСтрокаДокумента.Сумма <> СуммаИзносаПартийВсего Тогда
				ТекСтрокаРегистра.СуммаИзноса = ТекСтрокаРегистра.СуммаИзноса + (ТекСтрокаДокумента.Сумма - СуммаИзносаПартийВсего);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Если тблИзносСпецодежды.Количество() > 0 Тогда
		Сч = тблИзносСпецодежды.Количество()-1;
		Пока Сч >= 0 Цикл
			Если тблИзносСпецодежды[Сч].СуммаИзноса = 0 Тогда
				тблИзносСпецодежды.Удалить(Сч);
			КонецЕсли;
			Сч = Сч - 1;
		КонецЦикла;
	КонецЕсли;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСпецодеждаСотрудников", тблИзносСпецодежды);
	
КонецПроцедуры // СформироватьТаблицаСпецодеждаСотрудников()

#КонецОбласти
			 

#КонецЕсли