
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Заголовок = "";
	Если Параметры.Свойство("ТекстДиалога") Тогда
		ТекстДиалога = Параметры.ТекстДиалога;
	КонецЕсли;
	Если Параметры.Свойство("ПечатьПЛ") Тогда
		ПечатьПЛ = Параметры.ПечатьПЛ;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ПечатьПЛ Тогда
		Элементы.СтраницаКнопки.ТекущаяСтраница = Элементы.ГруппаКнопкиПечать;
		ПодключитьОбработчикОжидания("ЗакрытьПечатьПЛ", 20, Истина);
	Иначе
		Элементы.СтраницаКнопки.ТекущаяСтраница = Элементы.ГруппаКнопки;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	Закрыть(Истина);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть(Ложь);
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗакрытьПечатьПЛ()
	Закрыть();
КонецПроцедуры

#КонецОбласти
