#Область ПрограммныйИнтерфейс

#Область ПолучениеИЗакрытиеБаннеров

// Процедура закрывает баннер на форме.
// Параметры:
//		Форма - ФормаКлиентскогоПриложения - Форма на которой нужно закрыть баннер.
//		Организация - СправочникСсылка.Организации - Организация, по которой ищем баннер.
//
Процедура ЗакрытьБаннер(Форма, Организация) Экспорт
	
	// Закроем баннер на форме.
	Баннер = Форма.Баннер;
	Форма.Баннер = Неопределено;
	Форма.Элементы.Баннер.Видимость = Ложь;
	Баннер.ОбстоятельстваЗакрытия.ДатаЗакрытия = ТекущаяДатаСеанса();
	
	ОбработатьЗакрытиеБаннера(Баннер, Организация);
	
КонецПроцедуры


// Получает баннер, в случае если есть что показать. Если баннер не найден, в хранилище помещается Неопределено.
// Параметры:
//	СтруктураПараметров - Струкутура - Структура параметров:
//		Организация - СправочникСсылка.Организации - Организация, по которой ищем баннер.
//		Размещение - Строка - Идентификатор формы по которой нужно показать баннер. см. функции ИмяРазмещения...().
//		ПоказатьПредыдущий - Булево - Признак показа предыдущего в очереди баннера. Если Ложь - показывается следующий баннер.
//	АдресХранилища - Строка -Адрес хранилища, по которому будет помещен баннер.
//
Процедура ПолучитьБаннер(СтруктураПараметров, АдресХранилища) Экспорт
	
	Организация = СтруктураПараметров.Организация;
	Размещение = СтруктураПараметров.Размещение;
	ПоказатьПредыдущий = СтруктураПараметров.ПоказатьПредыдущий;
	
	// Получаем баннеры в ротации у текущего пользователя в указанном размещении.
	БаннерыВРотации = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"ПерсонализированныеПредложенияСервисов_НаборБаннеровВРотации",
		Размещение, Новый Массив);
	
	Если ТипЗнч(БаннерыВРотации) <> Тип("Массив") Тогда
		БаннерыВРотации = Новый Массив;
	КонецЕсли;
	
	// Ротируем пользовательский список баннеров.
	Если БаннерыВРотации.Количество() > 1 Тогда
		Если ПоказатьПредыдущий Тогда
			ПоследнийБаннер = БаннерыВРотации[БаннерыВРотации.ВГраница()];
			БаннерыВРотации.Удалить(БаннерыВРотации.ВГраница());
			БаннерыВРотации.Вставить(0, ПоследнийБаннер);
		Иначе
			ПервыйБаннер = БаннерыВРотации[0];
			БаннерыВРотации.Удалить(0);
			БаннерыВРотации.Добавить(ПервыйБаннер);
		КонецЕсли;
	КонецЕсли;
	
	ТекущаяДата = НачалоДня(ТекущаяДатаСеанса());
	
	// Получим список баннеров для пользователя по организации и размещению.
	// Баннеры, привязанные к организации, не показываем, если организация не заполнена.
	// Баннеры, непривязанные к организации, показываем всегда.
	СписокБаннеров = БаннерыПользователя(Организация, Размещение, ТекущаяДата);
	Если СписокБаннеров.Количество() = 0 Тогда
		ПоместитьВоВременноеХранилище(Неопределено, АдресХранилища);
		Возврат;
	КонецЕсли;
	
	// Получим данные для баннеров.
	ДанныеБаннеров = ДанныеБаннеров(СписокБаннеров, СтруктураПараметров, ТекущаяДата);
	
	ТекущаяГруппа = Неопределено;
	
	// Собираем идентификаторы всех доступных баннеров.
	ИдентификаторыДоступныхБаннеров = Новый Массив;
	Для Каждого СтрокаСписка Из СписокБаннеров Цикл
		
		Если ТекущаяГруппа = Неопределено Тогда
			ТекущаяГруппа = СтрокаСписка.Баннер.Группа;
		КонецЕсли;
		Если ТекущаяГруппа <> СтрокаСписка.Баннер.Группа Тогда
			Продолжить; // Пропускаем баннеры, которые не входят в текущую группу.
		КонецЕсли;
		
		ИдентификаторыДоступныхБаннеров.Вставить(0, СтрокаСписка.Баннер.Идентификатор);
		// Если исключительный баннер не входит в группу, показывается только он.
		Если СтрокаСписка.Баннер.Исключительный И СтрокаСписка.Баннер.Группа = Неопределено Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	ИдентификаторыНовогоНабораБаннеровВРотации = Новый Массив;
	
	// Оставляем в ротации только доступные баннеры.
	Для каждого БаннерВРотации Из БаннерыВРотации Цикл
		Если ИдентификаторыДоступныхБаннеров.Найти(БаннерВРотации.Идентификатор) <> Неопределено Тогда
			ИдентификаторыНовогоНабораБаннеровВРотации.Добавить(БаннерВРотации.Идентификатор);
		КонецЕсли;
	КонецЦикла;
	
	// Новые доступные баннеры добавляем в начало очереди.
	Для каждого ИдентификаторДоступногоБаннера Из ИдентификаторыДоступныхБаннеров Цикл
		Позиция = ?(ПоказатьПредыдущий И ИдентификаторыНовогоНабораБаннеровВРотации.Количество() > 0, 1, 0);
		Если ИдентификаторыНовогоНабораБаннеровВРотации.Найти(ИдентификаторДоступногоБаннера) = Неопределено Тогда
			ИдентификаторыНовогоНабораБаннеровВРотации.Вставить(Позиция, ИдентификаторДоступногоБаннера);
		КонецЕсли;
	КонецЦикла;
	
	// Заменяем набор баннеров в ротации на новый
	БаннерыВРотации = Новый Массив;
	Для каждого ИдентификаторНовогоБаннераВРотации Из ИдентификаторыНовогоНабораБаннеровВРотации Цикл
		НовыйБаннер = СписокБаннеров.Найти(ИдентификаторНовогоБаннераВРотации, "ИдентификаторБаннера").Баннер;
		ЗаполнитьДанныеБаннера(НовыйБаннер, ДанныеБаннеров);
		БаннерыВРотации.Добавить(НовыйБаннер);
	КонецЦикла;
	
	// Сохраняем баннеры в ротации у текущего пользователя в указанном размещении.
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
		"ПерсонализированныеПредложенияСервисов_НаборБаннеровВРотации",
		Размещение, БаннерыВРотации);
	
	Баннер = Неопределено;
	
	Если БаннерыВРотации.Количество() > 0 Тогда
		Баннер = БаннерыВРотации[0];
		Баннер.Вставить("Единственный", БаннерыВРотации.Количество() = 1);
	КонецЕсли;
	
	Если Баннер <> Неопределено Тогда
		
		ЗаписьЖурналаРегистрации(
		НСтр("ru = 'Персонализированные предложения сервисов. Показан баннер'"),
			УровеньЖурналаРегистрации.Информация,
			,
			,
			Баннер.Идентификатор);
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(Баннер, АдресХранилища);
	
КонецПроцедуры

// Процедура отображает баннер на форме.
// Параметры:
//		Форма - Форма - Форма, на которой отображается баннер.
//		АдресРезультата - Строка - Адрес временного хранилища, в которое помещен баннер.
//
Процедура УстановитьБаннерНаФорме(Форма, АдресРезультата) Экспорт
	
	Элементы = Форма.Элементы;
	
	Баннер = ПолучитьИзВременногоХранилища(АдресРезультата);
	Если Баннер = Неопределено Тогда
		Элементы.Баннер.Видимость = Ложь;
	Иначе
		Форма.Баннер = Баннер;
		Элементы.ТекстБаннера.Видимость         = Истина;
		Элементы.КартинкаБаннера.Видимость      = Истина;
		Элементы.Баннер.Видимость               = Истина;
		Элементы.БаннерСФоном.ЦветФона          = ЦветаСтиля[Баннер.ЦветФонаБаннер];
		Если ЗначениеЗаполнено(Баннер.ИмяКартинкаЛоготипа) Тогда
			Элементы.КартинкаБаннера.Видимость  = Истина;
			Элементы.КартинкаБаннера.Картинка   = БиблиотекаКартинок[Баннер.ИмяКартинкаЛоготипа];
		Иначе
			Элементы.КартинкаБаннера.Видимость  = Ложь;
		КонецЕсли;
		Если ЗначениеЗаполнено(Баннер.ИмяКартинкаПодключить) Тогда
			Элементы.КартинкаБаннераПодключить.Видимость  = Истина;
			Элементы.КартинкаБаннераПодключить.Картинка   = БиблиотекаКартинок[Баннер.ИмяКартинкаПодключить];
		Иначе
			Элементы.КартинкаБаннераПодключить.Видимость  = Ложь;
		КонецЕсли;
		Форма.ТекстБаннера = Форма.Баннер.ТекстБаннера;
		
		Элементы.КартинкаЗакрытьБаннер.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьЗакрытиеБаннера(Баннер, Организация) Экспорт
	
	СохранитьОбстоятельстваЗакрытияБаннера(Баннер, Организация);
	
	СписокБаннеров = НовыйТаблицаСписокБаннеров();
	ДобавитьБаннерВТаблицу(СписокБаннеров, Баннер);
	
	ЗаписьЖурналаРегистрации(
		НСтр("ru = 'Персонализированные предложения сервисов. Закрыт баннер'"),
		УровеньЖурналаРегистрации.Информация,
		,
		,
		Баннер.Идентификатор);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область Конструкторы

Функция НовыйЗакрытыеПользователемБаннеры() Экспорт
	
	ЗакрытыеПользователемБаннеры = Новый Структура;
	ЗакрытыеПользователемБаннеры.Вставить("БаннерыБезОрганизации", Новый Структура);
	ЗакрытыеПользователемБаннеры.Вставить("БаннерыПоОрганизации",  Новый Соответствие);
	
	Возврат ЗакрытыеПользователемБаннеры;
	
КонецФункции

Функция НовыйБаннерДляСписка() Экспорт
	
	Баннер = Новый Структура;
	Баннер.Вставить("ИмяСервиса",              "");
	Баннер.Вставить("Идентификатор",           "");
	Баннер.Вставить("НавигационнаяСсылка",     "");
	Баннер.Вставить("ТекстБаннера",            Новый ФорматированнаяСтрока(""));
	Баннер.Вставить("ИмяКартинкаЛоготипа",     "");
	Баннер.Вставить("ИмяКартинкаПодключить",   "");
	Баннер.Вставить("ЦветФонаБаннер",         "ЦветФонаБаннер");
	Баннер.Вставить("ЗависитОтОрганизации",   Истина);
	Баннер.Вставить("Исключительный",         Ложь);
	Баннер.Вставить("Группа",                 Неопределено);
	Баннер.Вставить("ДоступенПоПравам",       Ложь);
	Баннер.Вставить("ДанныеБаннера",          Новый Структура);
	Баннер.Вставить("ОбстоятельстваЗакрытия", Новый Структура);
	Баннер.ОбстоятельстваЗакрытия.Вставить("ДатаЗакрытия", '00010101');
	Баннер.ОбстоятельстваЗакрытия.Вставить("Периодичность", Перечисления.Периодичность.Квартал);
	
	Возврат Баннер;
	
КонецФункции

Функция НовыйЗаголовок(ТекстЗаголовка, НавигационнаяСсылка = "", Шрифт = Неопределено) Экспорт
	
	ШрифтЗаголовка = ?(Шрифт = Неопределено, ШрифтыСтиля.ШрифтЗаголовкаМониторПортала, Шрифт);
	
	Если ЗначениеЗаполнено(НавигационнаяСсылка) Тогда
		Возврат Новый ФорматированнаяСтрока(ТекстЗаголовка, ШрифтЗаголовка, , , НавигационнаяСсылка);
	Иначе
		Возврат Новый ФорматированнаяСтрока(ТекстЗаголовка, ШрифтЗаголовка);
	КонецЕсли;
	
	Возврат Новый ФорматированнаяСтрока(ТекстЗаголовка, ШрифтыСтиля.ШрифтЗаголовкаБаннера);
	
КонецФункции

Функция НовыйСтрокаБаннера(ТекстСтроки, НавигационнаяСсылка = "", Шрифт = Неопределено) Экспорт
	
	ШрифтСтроки = ?(Шрифт = Неопределено, ШрифтыСтиля.ШрифтТекстаБаннераБРД, Шрифт);
	
	Если ЗначениеЗаполнено(НавигационнаяСсылка) Тогда
		Возврат Новый ФорматированнаяСтрока(ТекстСтроки, ШрифтСтроки, , , НавигационнаяСсылка);
	Иначе
		Возврат Новый ФорматированнаяСтрока(ТекстСтроки, ШрифтСтроки);
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область РаботаСБаннерами

Функция ДанныеБаннеров(СписокБаннеров, СтруктураПараметров, ТекущаяДата)
	
	// Для получения данных удобнее использовать структуру вместо таблицы.
	// Перенесем данные из списка в структуру.
	СтруктураБаннеров = Новый Структура;
	Для Каждого СтрокаСписка Из СписокБаннеров Цикл
		СтруктураБаннеров.Вставить(СтрокаСписка.Баннер.Идентификатор, СтрокаСписка.Баннер);
	КонецЦикла;
	
	ДанныеБаннеров = Новый Структура;
	ДанныеБаннеров.Вставить("ТекущаяДата", ТекущаяДата);
	ДанныеБаннеров.Вставить("Организация", СтруктураПараметров.Организация);
	ДанныеБаннеров.Вставить("Размещение", СтруктураПараметров.Размещение);
	
	// Подготавливаем информацию баннеров по полученным данным.
	ПолучитьДанныеБаннеров(СтруктураБаннеров, ДанныеБаннеров);
	
	Возврат ДанныеБаннеров;
	
КонецФункции

Процедура ПолучитьДанныеБаннеров(СтруктураБаннеров, ДанныеБаннеров)
	
	Для Каждого ПодготавливаемыйБаннер Из СтруктураБаннеров Цикл
		
		// Баннеры, использующие для получения данных дополнительные параметры, возвращенные функцией НовыйБаннер...() .
		Если ПодготавливаемыйБаннер.Ключ = "ЭлектронныеПутевыеЛисты" Тогда
			ПолучитьДанныеБаннераЭПЛ(ДанныеБаннеров);
		ИначеЕсли ПодготавливаемыйБаннер.Ключ = "ЭлектронныеТранспортныеНакладные" Тогда
			ПолучитьДанныеБаннераЭТрН(ДанныеБаннеров);
		ИначеЕсли ПодготавливаемыйБаннер.Ключ = "МобильноеПриложение" Тогда
			ПолучитьДанныеБаннераМобильноеПриложение(ДанныеБаннеров);
		ИначеЕсли ПодготавливаемыйБаннер.Ключ = "Маршрутизация" Тогда
			ПолучитьДанныеБаннераМаршрутизация(ДанныеБаннеров);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДанныеБаннера(Баннер, ДанныеБаннеров)
	
	Идентификатор = Баннер.Идентификатор;
	ДанныеБаннера = ДанныеБаннеров[Идентификатор];
	ТекущаяДата   = ДанныеБаннеров.ТекущаяДата;
	
	ЭтоИдентификаторПереопределяемогоБаннера = Ложь;
	
	//Если ЭтоИдентификаторПереопределяемогоБаннера Тогда
	//	ПерсонализированныеПредложенияСервисовПереопределяемый.ЗаполнитьДанныеБаннера(ДанныеБаннера, Баннер);
	//
	Если Идентификатор = "ЭлектронныеПутевыеЛисты" Тогда
		ЗаполнитьДанныеБаннераЭПЛ(Баннер, ДанныеБаннера);
	ИначеЕсли Идентификатор = "ЭлектронныеТранспортныеНакладные" Тогда
		ЗаполнитьДанныеБаннераЭТрН(Баннер, ДанныеБаннера);
	ИначеЕсли Идентификатор = "МобильноеПриложение" Тогда
		ЗаполнитьДанныеБаннераМобильноеПриложение(Баннер, ДанныеБаннера);
	ИначеЕсли Идентификатор = "Маршрутизация" Тогда
		ЗаполнитьДанныеБаннераМаршрутизация(Баннер, ДанныеБаннера);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область РаботаСоСпискомБаннеров

Функция ОбщийСписокБаннеров(Размещение)
	
	СписокБаннеров = НовыйТаблицаСписокБаннеров();
	
	Если Размещение = "ПутевыеЛисты" Тогда
		
		ДобавитьБаннерВТаблицу(СписокБаннеров, НовыйБаннерЭПЛ());
		
	ИначеЕсли Размещение = "МаршрутныйЛист" Тогда
		
		ДобавитьБаннерВТаблицу(СписокБаннеров, НовыйБаннерМобильноеПриложение());
		ДобавитьБаннерВТаблицу(СписокБаннеров, НовыйБаннерМаршрутизация());
		
	ИначеЕсли Размещение = "ЗаказНаТС" Или Размещение = "ТТД" Тогда
		
		ДобавитьБаннерВТаблицу(СписокБаннеров, НовыйБаннерЭТрН());
		
	ИначеЕсли Размещение = "ЗаявкаНаРемонт" Тогда
		
		ДобавитьБаннерВТаблицу(СписокБаннеров, НовыйБаннерМобильноеПриложение());
		
	КонецЕсли;
	
	Возврат СписокБаннеров;
	
КонецФункции

Функция БаннерыПользователя(Организация, Размещение, ТекущаяДата)
	
	СписокБаннеров             = ОбщийСписокБаннеров(Размещение);
	СписокБаннеровПользователя = НовыйТаблицаСписокБаннеров();
	
	// Дополним список баннеров обстоятельствами закрытия баннера.
	ДополнитьБаннерыОбстоятельствамиЗакрытия(СписокБаннеров);
	
	Для Каждого СтрокаСписка Из СписокБаннеров Цикл
		
		ОбстоятельстваЗакрытия = СтрокаСписка.Баннер.ОбстоятельстваЗакрытия;
		
		// Пропускаем баннеры, которые уже показывали в этом периоде.
		Если ОбстоятельстваЗакрытия.Периодичность = Перечисления.Периодичность.День Тогда
			Если НачалоДня(ОбстоятельстваЗакрытия.ДатаЗакрытия) = НачалоДня(ТекущаяДата) Тогда
				Продолжить;
			КонецЕсли;
		ИначеЕсли ОбстоятельстваЗакрытия.Периодичность = Перечисления.Периодичность.Месяц Тогда
			Если НачалоМесяца(ОбстоятельстваЗакрытия.ДатаЗакрытия) = НачалоМесяца(ТекущаяДата) Тогда
				Продолжить;
			КонецЕсли;
		ИначеЕсли ОбстоятельстваЗакрытия.Периодичность = Перечисления.Периодичность.Квартал Тогда
			Если НачалоКвартала(ОбстоятельстваЗакрытия.ДатаЗакрытия) = НачалоКвартала(ТекущаяДата) Тогда
				Продолжить;
			КонецЕсли;
		ИначеЕсли ОбстоятельстваЗакрытия.Свойство("ИсключитьБаннер") И ОбстоятельстваЗакрытия.ИсключитьБаннер Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаСпискаПользователя = СписокБаннеровПользователя.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаСпискаПользователя, СтрокаСписка);
		
	КонецЦикла;
	
	// Отсортируем баннеры по приоритету.
	СписокБаннеровПользователя.Сортировать("Порядок", Новый СравнениеЗначений);
	
	Возврат СписокБаннеровПользователя;
	
КонецФункции

Процедура ДополнитьБаннерыОбстоятельствамиЗакрытия(СписокБаннеров)
	
	ЗакрытыеПользователемБаннеры = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
	ИмяНастройкиПерсонализированныеПредложенияСервисов(),
	ИмяКлючНастройкиЗакрытыеПользователемБаннеры(),
	НовыйЗакрытыеПользователемБаннеры());
	
	Для Каждого КлючИЗначение Из ЗакрытыеПользователемБаннеры.БаннерыБезОрганизации Цикл
		Для Каждого СтрокаСписка Из СписокБаннеров.НайтиСтроки(Новый Структура("ИдентификаторБаннера", КлючИЗначение.Ключ)) Цикл
			ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(
			СтрокаСписка.Баннер.ОбстоятельстваЗакрытия,
			КлючИЗначение.Значение,
			Истина);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СохранитьОбстоятельстваЗакрытияБаннера(Баннер, Организация)
	
	ЗакрытыеБаннеры = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
	"ПерсонализированныеПредложенияСервисов",
	ИмяКлючНастройкиЗакрытыеПользователемБаннеры(),
	НовыйЗакрытыеПользователемБаннеры());
	
	Если НЕ Баннер.ЗависитОтОрганизации Тогда
		ЗакрытыеБаннеры.БаннерыБезОрганизации.Вставить(Баннер.Идентификатор, Баннер.ОбстоятельстваЗакрытия);
	Иначе
		ЗакрытыеБаннерыПоОрганизации = ЗакрытыеБаннеры.БаннерыПоОрганизации[Организация];
		Если ЗакрытыеБаннерыПоОрганизации = Неопределено Тогда
			ЗакрытыеБаннерыПоОрганизации = Новый Структура;
		КонецЕсли;
		ЗакрытыеБаннерыПоОрганизации.Вставить(Баннер.Идентификатор, Баннер.ОбстоятельстваЗакрытия);
		ЗакрытыеБаннеры.БаннерыПоОрганизации.Вставить(Организация, ЗакрытыеБаннерыПоОрганизации);
	КонецЕсли;
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
		ИмяНастройкиПерсонализированныеПредложенияСервисов(),
		ИмяКлючНастройкиЗакрытыеПользователемБаннеры(),
		ЗакрытыеБаннеры);
	
КонецПроцедуры

Процедура ДобавитьБаннерВТаблицу(СписокБаннеров, Баннер) Экспорт
	
	Если НЕ Баннер.ДоступенПоПравам Тогда
		Возврат;
	КонецЕсли;
	
	НоваяСтрока                      = СписокБаннеров.Добавить();
	НоваяСтрока.Порядок              = СписокБаннеров.Количество();
	НоваяСтрока.Баннер               = Баннер;
	НоваяСтрока.ИдентификаторБаннера = Баннер.Идентификатор;
	НоваяСтрока.ИмяСервиса           = Баннер.ИмяСервиса;
	
КонецПроцедуры

#Область Конструкторы

Функция НовыйТаблицаСписокБаннеров()
	
	ТаблицаСпискаБаннеров = Новый ТаблицаЗначений;
	// Колонки
	ТаблицаСпискаБаннеров.Колонки.Добавить("Баннер"); // см. НовыйБаннерДляСписка()
	ТаблицаСпискаБаннеров.Колонки.Добавить("ИдентификаторБаннера", ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ТаблицаСпискаБаннеров.Колонки.Добавить("Порядок",              ОбщегоНазначения.ОписаниеТипаЧисло(5));
	ТаблицаСпискаБаннеров.Колонки.Добавить("ИмяСервиса",           ОбщегоНазначения.ОписаниеТипаСтрока(50));
	
	// Индексы
	ТаблицаСпискаБаннеров.Индексы.Добавить("ИдентификаторБаннера");
	
	Возврат ТаблицаСпискаБаннеров;
	
КонецФункции

#КонецОбласти

#Область Имена

// Ключи хранилища общих настроек

Функция ИмяНастройкиПерсонализированныеПредложенияСервисов() Экспорт
	
	Возврат "ПерсонализированныеПредложенияСервисов";
	
КонецФункции

Функция ИмяКлючНастройкиЗакрытыеПользователемБаннеры() Экспорт
	
	Возврат "ЗакрытыеПользователемБаннеры";
	
КонецФункции

#КонецОбласти

#Область ОписанияБаннеров

#Область Маршрутизация

Функция НовыйБаннерМаршрутизация()
	
	// Ограничение просмотра для внешнего пользователя
	ДоступенПоПравам = Истина;
	АвторизованВнешнийПользователь = Истина;
	АвторизованныйКонтрагент = уатЗащищенныеФункцииСервер_проф.АвторизованныйКонтрагент(АвторизованВнешнийПользователь);
	Если АвторизованВнешнийПользователь Тогда
		ДоступенПоПравам = Ложь;
	КонецЕсли;
	Если уатОбщегоНазначенияПовтИсп.ВариантПоставкиСТД() Тогда
		ДоступенПоПравам = Ложь;
	КонецЕсли;
	Баннер                      = НовыйБаннерДляСписка();
	Баннер.ИмяСервиса           = "Маршрутизация";
	Баннер.Идентификатор        = "Маршрутизация";
	Баннер.ИмяКартинкаЛоготипа  = "уатБаннерМаршрутизацияКартинка";
	Баннер.ИмяКартинкаПодключить = "уатБаннерПодключить";
	Баннер.ЦветФонаБаннер       = "уатЦветФонаБаннера";
	Баннер.НавигационнаяСсылка  = "Маршрутизация";
	Баннер.ЗависитОтОрганизации = Ложь;
	Баннер.ДоступенПоПравам     = ДоступенПоПравам;
	Баннер.ОбстоятельстваЗакрытия.Периодичность = Перечисления.Периодичность.Квартал;
	
	Возврат Баннер;
	
КонецФункции

Процедура ЗаполнитьДанныеБаннераМаршрутизация(Баннер, ДанныеБаннера)
	
	Баннер.ТекстБаннера = ТекстБаннераМаршрутизация(Баннер.НавигационнаяСсылка, ДанныеБаннера);
	
	// После закрытия баннер нельзя исключать из списка баннеров.
	Баннер.ОбстоятельстваЗакрытия.Вставить("ИсключитьБаннер", Ложь);
	
КонецПроцедуры

Функция ТекстБаннераМаршрутизация(НавигационнаяСсылка, ДанныеБаннера)
	
	Возврат Новый ФорматированнаяСтрока(
		НовыйЗаголовок(НСтр("ru='Подключить сервис маршрутизации ""Rarus VRP""'")),
		Символы.ПС,
		НовыйСтрокаБаннера(НСтр("ru='Алгоритм ""Rarus VRP"": оптимальные маршруты доставки с учетом окон, веса, объема и других ограничений.'")));
	
КонецФункции
	
Процедура ПолучитьДанныеБаннераМаршрутизация(ДанныеБаннеров)
	
	ДанныеБаннера = Новый Структура;
	ДанныеБаннера.Вставить("Организация",      Неопределено);
	ДанныеБаннера.Вставить("ПоказыватьБаннер", Истина);
	
	ДанныеБаннеров.Вставить("Маршрутизация", ДанныеБаннера);
	
КонецПроцедуры

#КонецОбласти

#Область МобильноеПриложение

Функция НовыйБаннерМобильноеПриложение()
	
	// Ограничение просмотра для внешнего пользователя
	ДоступенПоПравам = Истина;
	АвторизованВнешнийПользователь = Истина;
	АвторизованныйКонтрагент = уатЗащищенныеФункцииСервер_проф.АвторизованныйКонтрагент(АвторизованВнешнийПользователь);
	Если АвторизованВнешнийПользователь Тогда
		ДоступенПоПравам = Ложь;
	КонецЕсли;
	Если уатОбщегоНазначенияПовтИсп.ВариантПоставкиСТД() Тогда
		ДоступенПоПравам = Ложь;
	КонецЕсли;
	Баннер                      = НовыйБаннерДляСписка();
	Баннер.ИмяСервиса           = "МобильноеПриложение";
	Баннер.Идентификатор        = "МобильноеПриложение";
	Баннер.ИмяКартинкаЛоготипа  = "уатБаннерМобильноеПриложениеКартинка";
	Баннер.ИмяКартинкаПодключить = "уатБаннерПодключить";
	Баннер.ЦветФонаБаннер       = "уатЦветФонаБаннера";
	Баннер.НавигационнаяСсылка  = "МобильноеПриложение";
	Баннер.ЗависитОтОрганизации = Ложь;
	Баннер.ДоступенПоПравам     = ДоступенПоПравам;
	Баннер.ОбстоятельстваЗакрытия.Периодичность = Перечисления.Периодичность.Квартал;
	
	Возврат Баннер;
	
КонецФункции

Процедура ЗаполнитьДанныеБаннераМобильноеПриложение(Баннер, ДанныеБаннера)
	
	Баннер.ТекстБаннера = ТекстБаннераМобильноеПриложение(Баннер.НавигационнаяСсылка, ДанныеБаннера);
	
	// После закрытия баннер нельзя исключать из списка баннеров.
	Баннер.ОбстоятельстваЗакрытия.Вставить("ИсключитьБаннер", Ложь);
	
КонецПроцедуры

Функция ТекстБаннераМобильноеПриложение(НавигационнаяСсылка, ДанныеБаннера)
	
	Возврат Новый ФорматированнаяСтрока(
		НовыйЗаголовок(НСтр("ru='Подключить «1С-Рарус:Мобильное приложение Водитель УАТ»'")),
		Символы.ПС,
		НовыйСтрокаБаннера(НСтр("ru='Удобный инструмент для работы водителей, экспедиторов.'")));
	
КонецФункции
	
Процедура ПолучитьДанныеБаннераМобильноеПриложение(ДанныеБаннеров)
	
	ДанныеБаннера = Новый Структура;
	ДанныеБаннера.Вставить("Организация",      Неопределено);
	ДанныеБаннера.Вставить("ПоказыватьБаннер", Истина);
	
	ДанныеБаннеров.Вставить("МобильноеПриложение", ДанныеБаннера);
	
КонецПроцедуры

#КонецОбласти

#Область ЭПЛ

Функция НовыйБаннерЭПЛ()
	
	// Ограничение просмотра для внешнего пользователя
	ДоступенПоПравам = Истина;
	АвторизованВнешнийПользователь = Истина;
	АвторизованныйКонтрагент = уатЗащищенныеФункцииСервер_проф.АвторизованныйКонтрагент(АвторизованВнешнийПользователь);
	Если АвторизованВнешнийПользователь Тогда
		ДоступенПоПравам = Ложь;
	КонецЕсли;
	
	Баннер                      = НовыйБаннерДляСписка();
	Баннер.ИмяСервиса           = "ЭлектронныеПутевыеЛисты";
	Баннер.Идентификатор        = "ЭлектронныеПутевыеЛисты";
	Баннер.ИмяКартинкаЛоготипа  = "уатБаннерЭПЛКартинка";
	Баннер.ИмяКартинкаПодключить = "уатБаннерПодключить";
	Баннер.ЦветФонаБаннер       = "уатЦветФонаБаннера";
	Баннер.НавигационнаяСсылка  = "ЭлектронныеПутевыеЛисты";
	Баннер.ЗависитОтОрганизации = Ложь;
	Баннер.ДоступенПоПравам     = ДоступенПоПравам;
	Баннер.ОбстоятельстваЗакрытия.Периодичность = Перечисления.Периодичность.Квартал;
	
	Возврат Баннер;
	
КонецФункции

Процедура ЗаполнитьДанныеБаннераЭПЛ(Баннер, ДанныеБаннера)
	
	Баннер.ТекстБаннера = ТекстБаннераЭПЛ(Баннер.НавигационнаяСсылка, ДанныеБаннера);
	
	// После закрытия баннер нельзя исключать из списка баннеров.
	Баннер.ОбстоятельстваЗакрытия.Вставить("ИсключитьБаннер", Ложь);
	
КонецПроцедуры

Функция ТекстБаннераЭПЛ(НавигационнаяСсылка, ДанныеБаннера)
	
	Возврат Новый ФорматированнаяСтрока(
		НовыйЗаголовок(НСтр("ru='Подключить электронные путевые листы'")),
		Символы.ПС,
		НовыйСтрокаБаннера(НСтр("ru='Оптимизируйте бизнес-процессы заранее, чтобы избежать рисков и штрафов.'")),
		Символы.ПС,
		НовыйСтрокаБаннера(НСтр("ru='Переходите на ЭПД сейчас!'")));
	
КонецФункции
	
Процедура ПолучитьДанныеБаннераЭПЛ(ДанныеБаннеров)
	
	ДанныеБаннера = Новый Структура;
	ДанныеБаннера.Вставить("Организация",      Неопределено);
	ДанныеБаннера.Вставить("ПоказыватьБаннер", Истина);
	
	ДанныеБаннеров.Вставить("ЭлектронныеПутевыеЛисты", ДанныеБаннера);
	
КонецПроцедуры

#КонецОбласти

#Область ЭТрН

Функция НовыйБаннерЭТрН()
	
	// Ограничение просмотра для внешнего пользователя
	ДоступенПоПравам = Истина;
	АвторизованВнешнийПользователь = Истина;
	АвторизованныйКонтрагент = уатЗащищенныеФункцииСервер_проф.АвторизованныйКонтрагент(АвторизованВнешнийПользователь);
	Если АвторизованВнешнийПользователь Тогда
		ДоступенПоПравам = Ложь;
	КонецЕсли;
	
	Баннер                      = НовыйБаннерДляСписка();
	Баннер.ИмяСервиса           = "ЭлектронныеТранспортныеНакладные";
	Баннер.Идентификатор        = "ЭлектронныеТранспортныеНакладные";
	Баннер.ИмяКартинкаЛоготипа  = "уатБаннерЭТрНКартинка";
	Баннер.ИмяКартинкаПодключить = "уатБаннерПодключить";
	Баннер.ЦветФонаБаннер       = "уатЦветФонаБаннера";
	Баннер.НавигационнаяСсылка  = "ЭлектронныеТранспортныеНакладные";
	Баннер.ЗависитОтОрганизации = Ложь;
	Баннер.ДоступенПоПравам     = ДоступенПоПравам;
	Баннер.ОбстоятельстваЗакрытия.Периодичность = Перечисления.Периодичность.Квартал;
	
	Возврат Баннер;
	
КонецФункции

Процедура ЗаполнитьДанныеБаннераЭТрН(Баннер, ДанныеБаннера)
	
	Баннер.ТекстБаннера = ТекстБаннераЭТрН(Баннер.НавигационнаяСсылка, ДанныеБаннера);
	
	// После закрытия баннер нельзя исключать из списка баннеров.
	Баннер.ОбстоятельстваЗакрытия.Вставить("ИсключитьБаннер", Ложь);
	
КонецПроцедуры

Функция ТекстБаннераЭТрН(НавигационнаяСсылка, ДанныеБаннера)
	
	Возврат Новый ФорматированнаяСтрока(
		НовыйЗаголовок(НСтр("ru='Подключить электронные транспортные накладные'")),
		Символы.ПС,
		НовыйСтрокаБаннера(НСтр("ru='Оптимизируйте бизнес-процессы заранее, чтобы избежать рисков и штрафов.'")),
		Символы.ПС,
		НовыйСтрокаБаннера(НСтр("ru='Переходите на ЭПД сейчас!'")));
	
КонецФункции
	
Процедура ПолучитьДанныеБаннераЭТрН(ДанныеБаннеров)
	
	ДанныеБаннера = Новый Структура;
	ДанныеБаннера.Вставить("Организация",      Неопределено);
	ДанныеБаннера.Вставить("ПоказыватьБаннер", Истина);
	
	ДанныеБаннеров.Вставить("ЭлектронныеТранспортныеНакладные", ДанныеБаннера);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти
