

#Область ПеременныеФормы

&НаКлиенте
Перем НеобходимоЗаписать;

#КонецОбласти


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если уатЖурналыТранспортныхДокументов.ЗапретОткрытияФормыОбъекта(Отказ, СтандартнаяОбработка,
		Метаданные.Справочники.уатТС) Тогда
		Возврат;
	КонецЕсли;
	
	уатЗащищенныеФункцииСервер.уатСправочникФормаЭлементаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, Объект, ЭтотОбъект, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов
	
	уатСобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	Если Не ПравоДоступа("Редактирование", Метаданные.Справочники.уатТС) Тогда 
		Элементы.ВводВЭксплуатацию.Доступность               		 = Ложь;
		Элементы.ПеремещениеТС.Доступность                  		 = Ложь;
		Элементы.ВыбытиеТС.Доступность                      		 = Ложь;
		Элементы.ФормаЗаполнитьПоМоделиТС.Доступность       		 = Ложь;
		Элементы.ИзменитьТранспортныйНалог.Доступность      		 = Ложь;
		Элементы.АмортизацияЗаполнитьАмортизацию.Доступность		 = Ложь;
		Элементы.СформироватьНаименование.Доступность        		 = Ложь;
		Элементы.ИзменитьНомерБортовогоУстройстваАвтодор.Доступность = Ложь;
		Элементы.ИзменитьНомерБортовогоУстройстваПлатон.Доступность  = Ложь;
		Элементы.ИсторияЗакрепленияБортовыхУстройств.Доступность	 = Ложь;
	КонецЕсли;     
	Элементы.ИсточникПолученияДанныхПробегаАвтограф.СписокВыбора.Очистить();
	Если НЕ ЗначениеЗаполнено(Объект.ИсточникПолученияДанныхПробегаАвтограф) Тогда 
		Объект.ИсточникПолученияДанныхПробегаАвтограф = "Motion"; 
		Элементы.ИсточникПолученияДанныхПробегаАвтограф.СписокВыбора.Добавить(Объект.ИсточникПолученияДанныхПробегаАвтограф, "Motion (Движение)");
	Иначе 
		Элементы.ИсточникПолученияДанныхПробегаАвтограф.СписокВыбора.Добавить(Объект.ИсточникПолученияДанныхПробегаАвтограф);
	КонецЕсли;
	
	Элементы.ДатчикОдометр.СписокВыбора.Очистить();
	Если ЗначениеЗаполнено(Объект.ДатчикОдометр) Тогда 
		Элементы.ДатчикОдометр.СписокВыбора.Добавить(Объект.ДатчикОдометр);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.КалибровочноеЗначение) Тогда
		Объект.КалибровочноеЗначение = 1;
	КонецЕсли;   
	
	Элементы.ЛицензионнаяКарточка.СписокВыбора.Очистить();
	Элементы.ЛицензионнаяКарточка.СписокВыбора.Добавить(Нстр("en = 'Standard'; ru = 'Стандартная'"), Нстр("en = 'Standard'; ru = 'Стандартная'"));
	Элементы.ЛицензионнаяКарточка.СписокВыбора.Добавить(Нстр("en = 'Limited'; ru = 'Ограниченная'"), Нстр("en = 'Limited'; ru = 'Ограниченная'"));
	
	уатИспользоватьСервисШтрафовНет      = Константы.уатИспользоватьСервисШтрафовНет.Получить();
	уатИспользоватьИнтеграциюПаркоматика = Константы.уатИспользоватьИнтеграциюПаркоматика.Получить();
	уатИспользоватьСервисMultiGo         = Константы.уатИспользоватьСервисMultiGo.Получить();
	
	Если уатИспользоватьСервисШтрафовНет Тогда
		ЗаполнитьЗначенияШтрафов();
	КонецЕсли;
	
	Элементы.ПринадлежностьТС.Видимость = Ложь;
	
	ИспользоватьОпоздания = ПолучитьФункциональнуюОпцию("уатПрогнозированиеОпозданийПоМаршрутнымЛистам");
	Элементы.ФормироватьУведомленияОбОпозданияхВРейсе.Видимость = ИспользоватьОпоздания
		И ПолучитьФункциональнуюОпцию("уатИспользоватьУведомления_уэ");
	
	флЗаписьНовогоТС = Объект.Ссылка.Пустая();
	
	Если флЗаписьНовогоТС Тогда
		Элементы.Организация.ТолькоПросмотр	 = Истина;
		Элементы.Подразделение.ТолькоПросмотр	 = Истина;
		Элементы.Колонна.ТолькоПросмотр	 = Истина;
		Элементы.ДатаВводаВЭксплуатацию.ТолькоПросмотр	 = Истина;
		Элементы.ДатаВыбытия.ТолькоПросмотр				 = Истина;
		Объект.ФормироватьУведомленияОбОпозданияхВРейсе = ИспользоватьОпоздания;
	Иначе
		СтруктураИсторииПлатон	 = ОбновитьДанныеОНомереУстройства(Объект.Ссылка, Справочники.уатВнешниеСистемы.Платон);
		Если Объект.Ссылка.НомерБортовогоУстройстваПлатон <> СтруктураИсторииПлатон.НомерБортовогоУстройства Тогда
			Объект.НомерБортовогоУстройстваПлатон = СтруктураИсторииПлатон.НомерБортовогоУстройства;
			Модифицированность = Истина;
		КонецЕсли;
		
		СтруктураИсторииАвтодор  = ОбновитьДанныеОНомереУстройства(Объект.Ссылка, Справочники.уатВнешниеСистемы.Автодор);
		Если Объект.Ссылка.НомерБортовогоУстройстваАвтодор <> СтруктураИсторииАвтодор.НомерБортовогоУстройства Тогда	
			Объект.НомерБортовогоУстройстваАвтодор = СтруктураИсторииАвтодор.НомерБортовогоУстройства;	
			Модифицированность = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		ТекОрг = Объект.Организация;
	Иначе
		ТекОрг = уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(
		ПользователиКлиентСервер.АвторизованныйПользователь(), "ОсновнаяОрганизация");
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ТопливныеКарты, "ТекущаяДата", НачалоДня(ТекущаяДата()));
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ТопливныеКарты, "ДатаОкончания", ТекущаяДата());
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ТопливныеКарты, "ДниДоОкончанияДействияТопливныхКарт",
		уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(ТекОрг, ПредопределенноеЗначение(
		"ПланВидовХарактеристик.уатПраваИНастройки.ДниДоОкончанияДействияТопливныхКарт")));
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Маршруты, "Ссылка", Объект.Ссылка);
	
	// установка параметров для отображения флага просроч. документов ТС
	мВремяДоОкончанияДействияДокументовТС = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(ТекОрг,
		ПредопределенноеЗначение("ПланВидовХарактеристик.уатПраваИНастройки.ДниДоОкончанияДействияДокументовТС"));
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДокументыТС, "ДниДоОкончанияДействияДокументовТС", мВремяДоОкончанияДействияДокументовТС);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДокументыТС, "ТекущаяДата", НачалоДня(ТекущаяДата()));
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(НормыРасходаГСМ, "ДатаСреза", ТекущаяДата());
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(НормыРасходаТЖ, "ДатаСреза", ТекущаяДата());
		
	ОбновитьСвязанныеДанныеПоТС();
		
	уатОбщегоНазначенияСервер.НастроитьПолеПодразделение(Элементы.Подразделение, "Объект.Организация");
	
	ПрочитатьТранспортныйНалог();
	
	УстановитьВидимостьИсточникФактическихДанныхДляКартографии();
	
	ИспользоватьАвтоматическуюМаршрутизацию = Ложь;
	Если уатОбщегоНазначенияПовтИсп.ВариантПоставкиКОРП() Тогда
		ИспользоватьАвтоматическуюМаршрутизацию  = ПолучитьФункциональнуюОпцию("уатИспользоватьАвтоматическуюМаршрутизацию");
		Элементы.СтраницаМаршрутизация.Видимость = ИспользоватьАвтоматическуюМаршрутизацию;
	Иначе
		Элементы.СтраницаМаршрутизация.Видимость = Ложь;
		Элементы.СтраницаСекции.Видимость		 = Ложь;
	КонецЕсли;
		
	// уатУправлениеАвтотранспортом.МодификацияКонфигурации
	уатМодификацияКонфигурацииПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	// Конец уатУправлениеАвтотранспортом.МодификацияКонфигурации
	УстановитьВидимость();
	
	НаименованиеПоШаблону = СформироватьНаименованиеСервер();
	Элементы.ГруппаСтатус.Видимость = ЗначениеЗаполнено(Объект.ДатаВыбытия) И Объект.ДатаВыбытия < ТекущаяДата();
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.ПринадлежностьТС = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(,
			ПланыВидовХарактеристик.уатПраваИНастройки.ОсновнаяПринадлежностьТС);
		
	КонецЕсли;
	
	Если уатОбщегоНазначенияПовтИсп.ВариантПоставкиКОРП() И ПолучитьФункциональнуюОпцию("уатИспользоватьЖДПеревозки")
		И Параметры.Свойство("Основание") И ТипЗнч(Параметры.Основание) = Тип("ДокументСсылка.уатСправкаНаВагон") Тогда
		Параметры.Свойство("НомерВагона", Объект.Наименование);
		Параметры.Свойство("ВладелецТС", Объект.ВладелецТС);
		
		Параметры.Свойство("Грузоподъемность", Объект.Грузоподъемность);
		Параметры.Свойство("СобственныйВес", Объект.СобственныйВес);
		Параметры.Свойство("ОбъемКузова", Объект.ОбъемКузова);
		Параметры.Свойство("ГодВыпускаВагона", Объект.ГодВыпуска);
		
		Объект.Модель = СоздатьНайтиМодельЖДТранспорта(Параметры.Модель);
		Объект.ВидМоделиТС = Перечисления.уатВидыМоделейТС.ЖДТранспорт;
		Объект.ТипТС = СоздатьНайтиТипТСЖДТранспорта(Параметры.РодВагона);
		Объект.ПринадлежностьТС = Перечисления.уатПринадлежностьТС.Привлеченное;
		Объект.ВладелецТС = ?(ЗначениеЗаполнено(НайтиВладельцаПоНаименованию(Параметры.ВладелецТС)), НайтиВладельцаПоНаименованию(Параметры.ВладелецТС), Объект.ВладелецТС);
		Объект.ТипВладенияЖДТС = СопоставитьТипВладенияЖДТС(Параметры.ТипВладенияЖДТС);
	КонецЕсли;
	
	// ITOB +++	
	Если Объект.ИспользуемаяСистемаGPS = ПредопределенноеЗначение("Справочник.уатВнешниеСистемы._1СЦСМ") Тогда 
		Попытка  
			УстановитьПривилегированныйРежим(Истина);
			НастройкиОтображенияОбъекта = ItobОбщегоНазначения.ПолучитьНастройкиОтображенияОбъектов(Объект.Ссылка);
			УстановитьПривилегированныйРежим(Ложь); 
			
			МониторингЦветМаршрутаЧисло = НастройкиОтображенияОбъекта.ЦветМаршрутаНаКарте;
			МониторингЦветНадписиНаКартеЧисло =  НастройкиОтображенияОбъекта.ЦветНадписиНаКарте;
			МониторингИконкаНаКарте = НастройкиОтображенияОбъекта.ИконкаНаКарте;
			МониторингДополнительнаяИконкаНаКарте = НастройкиОтображенияОбъекта.ДополнительнаяИконкаНаКарте;
			МониторингВариантОтображенияТрека = НастройкиОтображенияОбъекта.ВариантОтображенияТрека;
		Исключение
		КонецПопытки;
	КонецЕсли;
	// ITOB --- 
	
	Если уатОбщегоНазначенияПовтИсп.ВариантПоставкиТакси() Тогда
		МодульТакОбщегоНазначенияСервер = ОбщегоНазначения.ОбщийМодуль("такОбщегоНазначенияСервер");
		АгентскиеДоговоры.ТекстЗапроса = МодульТакОбщегоНазначенияСервер.ПолучитьТекстЗапросаВодителиТСПоАгентскимДоговорам();
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(АгентскиеДоговоры, "ТС", Объект.Ссылка);
	КонецЕсли;
	
	//GDS++
	GDS_РаботаСФормами.ОбработкаФормыСправочникаТС(ЭтаФорма);
	//GDS--
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	уатЗащищенныеФункцииКлиент.уатСправочникФормаЭлементаПриОткрытии(Отказ, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	УстановитьСтраницуНачальногоПробегаНаработки();
	
	УстановитьСтраницуGPS();
	УстановитьВидимость();
	ОбновитьСписокВыбораИспользуемойСистемыМониторинга();
	ОбновитьСписокВыбораИспользуемогоСервисаШтрафов();
	
	уатСобытияФормКлиент.ПриОткрытии(ЭтаФорма, Отказ);
	
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	уатСобытияФорм.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	Если ИмяСобытия = "Изменен регистр агрегаты ТС" Тогда
		ОтобразитьАгрегатыТС();
		
	ИначеЕсли Источник = Объект.Ссылка И ИмяСобытия = "ОбновитьФорму" Тогда
		Если Параметр.Свойство("КоэффициентИзмененияНормТоплива") Тогда
			КоэффициентИзмененияНормТоплива = Параметр.КоэффициентИзмененияНормТоплива;
		КонецЕсли;
		ПрочитатьТранспортныйНалог();
		
	ИначеЕсли ИмяСобытия = "ОбновитьФорму" И ТипЗнч(Источник) = Тип("СправочникСсылка.уатТС") 
		И Параметр.Свойство("Организация") И Параметр.Свойство("Подразделение") Тогда
		
		Объект.Организация 		= Параметр.Организация;
		Объект.Подразделение	= Параметр.Подразделение;
		Объект.Колонна			= Параметр.Колонна;
		
	ИначеЕсли ИмяСобытия = "ОбновитьФорму_МестонахождениеТС" И ТипЗнч(Источник) = Тип("Массив")
		И Источник.Найти(Объект.Ссылка) <> Неопределено Тогда
		
		Прочитать();
		ОбновитьСвязанныеДанныеПоТС();
		УстановитьВидимость();
		
	ИначеЕсли ИмяСобытия = "ИзмененНомерБортовогоУстройстваТС" И Объект.Ссылка = Источник Тогда
		
		Если Параметр.ВнешняяСистема = ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.Платон") Тогда
			Объект.НомерБортовогоУстройстваПлатон = Параметр.НомерБортовогоУстройства;
			Модифицированность = Истина;
		ИначеЕсли Параметр.ВнешняяСистема = ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.Автодор") Тогда
			Объект.НомерБортовогоУстройстваАвтодор = Параметр.НомерБортовогоУстройства;
			Модифицированность = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	уатСобытияФормКлиент.ОбработкаОповещения(ЭтаФорма, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	уатСобытияФорм.ОбработкаПроверкиЗаполненияНаСервере(ЭтаФорма, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Наименование) Тогда
		Объект.Наименование = СформироватьНаименованиеСервер();
	КонецЕсли;
	
	Если НеобходимоЗаписать = Неопределено
		И ЗначениеЗаполнено(Объект.ОсновноеСредство)
		И ОсновноеСредствоУжеИспользуется(Объект.Ссылка, Объект.ОсновноеСредство) Тогда
		
		Отказ = Истина;
		Оповещ = Новый ОписаниеОповещения("ПередЗаписьюПроверкаОсновноеСредствоВопрос", ЭтотОбъект);
		ТекстВопроса = СтрШаблон(
			НСтр("en='Fixed assets for ""%1"" is already in use in other vehicles."
			"Continue record of object?';ru='Основное средство ""%1"" уже используется в других транспортных средствах."
			"Продолжить запись объекта?'"), Строка(Объект.ОсновноеСредство));
		
		ПоказатьВопрос(Оповещ, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;

	ПередЗаписьюКонтрольНаименованияПоШаблону(Отказ);
	уатСобытияФормКлиент.ПередЗаписью(ЭтаФорма, Отказ, ПараметрыЗаписи);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписьюПроверкаОсновноеСредствоВопрос(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		НеобходимоЗаписать = Истина;
		Отказ = Истина;
		ПередЗаписьюКонтрольНаименованияПоШаблону(Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписьюКонтрольНаименованияПоШаблону(Отказ)
	
	// условие того, что наименование ранее при записи элемента заполнялось по шаблону
	СтароеНаименование = уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Объект.Ссылка, "Наименование");
	Если ЗначениеЗаполнено(СтароеНаименование)
		И СтароеНаименование = НаименованиеПоШаблону
		И НЕ флОтключитьКонтрольНаименованияПоШаблону Тогда
		
		НовоеНаименованиеПоШаблону = СформироватьНаименованиеСервер();
		Если ЗначениеЗаполнено(НовоеНаименованиеПоШаблону) И Объект.Наименование <> НовоеНаименованиеПоШаблону Тогда
			Отказ = Истина;
			ДопПараметры = Новый Структура("НовоеНаименованиеПоШаблону, Отказ", НовоеНаименованиеПоШаблону, Отказ);
			Оповещ = Новый ОписаниеОповещения("ПередЗаписьюКонтрольНаименованияПоШаблонуВопрос", ЭтотОбъект, ДопПараметры);
			ПоказатьВопрос(Оповещ, "Измененить наименование на новое по шаблону?", РежимДиалогаВопрос.ДаНетОтмена);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если Отказ Тогда
		ЗаписатьИЗакрытьЗавершение();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписьюКонтрольНаименованияПоШаблонуВопрос(Результат, ДопПараметры) Экспорт
	
	флОтключитьКонтрольНаименованияПоШаблону = Ложь;
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.Наименование = ДопПараметры.НовоеНаименованиеПоШаблону;
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		флОтключитьКонтрольНаименованияПоШаблону = Истина;
	Иначе
		флЗакрыватьПриЗаписи = Ложь;
		Возврат;
	КонецЕсли;
	
	Если ДопПараметры.Отказ Тогда
		ЗаписатьИЗакрытьЗавершение();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрытьЗавершение()
	
	Если Записать() И флЗакрыватьПриЗаписи И Открыта() Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	флЗаписьНовогоТС = ТекущийОбъект.Ссылка.Пустая();
	уатСобытияФорм.ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

// ITOB +++
&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьПривилегированныйРежим(Истина);
	Если ТекущийОбъект.ИспользуемаяСистемаGPS = Справочники.уатВнешниеСистемы._1СЦСМ Тогда
		
		Выборка = РегистрыСведений.ItobНастройкиОтображенияОбъектов.Выбрать(Новый Структура("Объект", ТекущийОбъект.Ссылка));
		Пока Выборка.Следующий() Цикл
			Запись = Выборка.ПолучитьМенеджерЗаписи();
		КонецЦикла;
		Запись = ?(Запись = Неопределено, РегистрыСведений.ItobНастройкиОтображенияОбъектов.СоздатьМенеджерЗаписи(), Запись); 
		Запись.Объект = ТекущийОбъект.Ссылка;
		Запись.ЦветМаршрутаНаКарте = МониторингЦветМаршрутаЧисло;
		Запись.ЦветНадписиНаКарте  = МониторингЦветНадписиНаКартеЧисло;
		Запись.ИконкаНаКарте = МониторингИконкаНаКарте;
		Запись.ДополнительнаяИконкаНаКарте = МониторингДополнительнаяИконкаНаКарте;
		Запись.ВариантОтображенияТрека = МониторингВариантОтображенияТрека;
		Запись.Записать();
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	уатСобытияФорм.ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры
// ITOB ---

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов
	
	ЗаписатьНалоговуюБазуПоМощности();
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	уатСобытияФорм.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьСвязанныеДанныеПоТС();
	УстановитьВидимость();
	
	Если Объект.ПринадлежностьТС = ПредопределенноеЗначение("Перечисление.уатПринадлежностьТС.Собственное") Тогда
		Если флЗаписьНовогоТС ИЛИ Элементы.ГруппаВводВЭксплуатацию.ТекущаяСтраница = Элементы.ПомощникВводаВЭксплуатацию Тогда
			Режим = РежимДиалогаВопрос.ДаНет;
			ТекстНСТР = НСтр("en = 'The vehicle must be put into service.
			|Open the commissioning assistant?'; ru = 'Транспортное средство необходимо ввести в эксплуатацию. 
			|Открыть ""Помощник ввода  в эксплуатацию""?'");
			ПоказатьВопрос(Новый ОписаниеОповещения("ПослеЗаписиВопросПомощникВводаВЭксплуатацию", ЭтотОбъект), ТекстНСТР, Режим);
		КонецЕсли;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Оповестить("Изменено ТС", Объект.Ссылка, ЭтотОбъект);
	
	ПослеЗаписиЗавершение();
	уатСобытияФормКлиент.ПослеЗаписи(ЭтаФорма, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписиВопросПомощникВводаВЭксплуатацию(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ВопросПомощникВводаВЭксплуатацию = Истина;
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("ТС", Объект.Ссылка);
		ПараметрыФормы.Вставить("Организация", Объект.Организация);
		ПараметрыФормы.Вставить("Подразделение", Объект.Подразделение);
		ПараметрыФормы.Вставить("Колонна", Объект.Колонна);
		ПараметрыФормы.Вставить("ДатаВводаВЭксплуатацию", Объект.ДатаВводаВЭксплуатацию);
		ПараметрыФормы.Вставить("НачальныйПробег", Объект.НачальныйПробег);

		ОткрытьФорму("Справочник.уатТС.Форма.ПомощникВводаВЭксплуатацию", ПараметрыФормы,ЭтотОбъект);
	КонецЕсли;
	
	ПослеЗаписиЗавершение();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписиЗавершение()
	
	Если флЗакрыватьПриЗаписи И Открыта() Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	флЗакрыватьПриЗаписи = Истина;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// уатУправлениеАвтотранспортом.МодификацияКонфигурации
&НаКлиенте
Процедура Подключаемый_ПолеФормыПриИзменении(Элемент)
	
	уатМодификацияКонфигурацииКлиентПереопределяемый.ПолеФормыПриИзменении(ЭтотОбъект, Элемент);
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьДанныеCANшиныОдометрПриИзменении(Элемент)
	
	Если НЕ Объект.ИспользоватьДанныеCANшиныОдометр Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ИспользуемаяСистемаGPS = ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.Omnicomm") Тогда
		ТекстОшибки = "";
		// Должна быть разница во времени не менее 15 минут
		
		ДатаОкончания = ТекущаяДата();
		ДатаНачала    = ДатаОкончания - 86400;
		Одометр = уатМониторинг.Omnicomm_ПолучитьОдометрТС(ДатаНачала,, Объект.ИДвСистемеНавигации, Объект.Подразделение, ТекстОшибки,,Объект.УчетнаяЗаписьСистемыМониторинга);
		Если Одометр <> Неопределено И НЕ ЗначениеЗаполнено(ТекстОшибки) Тогда
			Режим   = РежимДиалогаВопрос.ДаНет;
			
			Если Одометр.КонечныйОдометр = 0 ИЛИ Одометр.КонечныйОдометр = Неопределено Тогда
				Одометр = "0";
			Иначе
				Одометр = Одометр.КонечныйОдометр;
			КонецЕсли;
			
			ТекстНСТР = СтрШаблон(НСтр("en = 'Current odometer reading = %1 km?'; ru = 'Текущее значение одометра = %1 км ?'"), Одометр);
			ПоказатьВопрос(Новый ОписаниеОповещения("ИспользоватьДанныеCANшиныОдометрПриИзмененииЗавершение", ЭтотОбъект), ТекстНСТР, Режим);
		Иначе
			Если ЗначениеЗаполнено(ТекстОшибки) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			КонецЕсли;
		КонецЕсли;
	Иначе
		
		НаименованиеДействия = "Справочник.уатТС.Форма.ФормаЭлемента.ИспользоватьДанныеCANшиныОдометрПриИзменении";
		#Если Не ТолстыйКлиентОбычноеПриложение Тогда
		уатРаботаСРасширениямиКлиент.ПСМ_ВыполнитьДействияВФорме(НаименованиеДействия,
		?(ТипЗнч(Объект.ИспользуемаяСистемаGPS) = Тип("Строка"), Объект.ИспользуемаяСистемаGPS, уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Объект.ИспользуемаяСистемаGPS, "НаименованиеПС"))
		,, ЭтотОбъект);
		#КонецЕсли
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьДанныеCANшиныОдометрПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Объект.ИспользоватьДанныеCANшиныОдометр = РезультатВопроса = КодВозвратаДиалога.Да;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолеФормыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	уатМодификацияКонфигурацииКлиентПереопределяемый.ПолеФормыНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолеФормыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	уатМодификацияКонфигурацииКлиентПереопределяемый.ПолеФормыОбработкаВыбора(ЭтотОбъект, Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолеФормыАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	уатМодификацияКонфигурацииКлиентПереопределяемый.ПолеФормыАвтоПодбор(ЭтотОбъект, Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолеФормыОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	уатМодификацияКонфигурацииКлиентПереопределяемый.ПолеФормыОкончаниеВводаТекста(ЭтотОбъект, Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура МодельПриИзменении(Элемент)
	ЗаполнитьРеквизитыТСПоМоделиТС(Новый ОписаниеОповещения("МодельПриИзмененииЗавершение", ЭтотОбъект));
	УстановитьНазваниеРасходаГСМ();
КонецПроцедуры

&НаКлиенте
Процедура ТипТСПриИзменении(Элемент)
	Если ЗаполненыОбязательныеДокументыУТипаТС() Тогда
		Текст = НСтр("ru = 'Перезаполнить обязательные виды документов по типу ТС?'; en = 'Refill out the required documents for the vehicle type?'");
		Оповещение = Новый ОписаниеОповещения("ВопросЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, Текст, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МодельПриИзмененииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	УстановитьСтраницуНачальногоПробегаНаработки();
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновнойРежимРаботыПриИзменении(Элемент)
	Элементы.РазрешитьНарушениеРежимаРаботы.Видимость = ЗначениеЗаполнено(Объект.ОсновнойРежимРаботы);
КонецПроцедуры

&НаКлиенте
Процедура СостояниеТСОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДокументСостояние = ПолучитьДокументСостоянияТС(Объект.Ссылка);
	Если ЗначениеЗаполнено(ДокументСостояние) Тогда
		ПоказатьЗначение(Неопределено, ДокументСостояние);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДокументСостоянияТС(Ссылка)
	Возврат уатОбщегоНазначения.уатСостояниеТС(Ссылка, ТекущаяДата()).Документ;
КонецФункции

&НаКлиенте
Процедура СекцииТСПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Ложь;
	уатОбщегоНазначенияКлиент.ПроверитьЗаписьНовогоОбъектаВФорме(ЭтотОбъект, Объект.Ссылка,,, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставТСВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле = Элементы.СоставТСТСМодель Тогда
		СтандартнаяОбработка = Ложь;
		СпрСсылка = ВернутьСсылкуНаОбъектПоКлючу("СоставТС", ВыбраннаяСтрока);
		ПоказатьЗначение(Новый ОписаниеОповещения("СоставТСВыборЗавершение", ЭтотОбъект), СпрСсылка);
	КонецЕсли;
	Если Поле = Элементы.СоставТСВСоставеМодель Тогда
		СтандартнаяОбработка = Ложь; 
		СпрСсылка = ВернутьСсылкуНаОбъектПоКлючу("СоставТС", ВыбраннаяСтрока,,Истина);
		ПоказатьЗначение(Новый ОписаниеОповещения("СоставТСВыборЗавершение", ЭтотОбъект), СпрСсылка);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоставТСВыборЗавершение(ДополнительныеПараметры) Экспорт
    Заглушка = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СоставТСПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Ложь;
	уатОбщегоНазначенияКлиент.ПроверитьЗаписьНовогоОбъектаВФорме(ЭтотОбъект, Объект.Ссылка,,, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	#Если ВебКлиент Тогда
		Если НЕ Копирование Тогда
			Отказ = Истина;
			ПараметрыОткрытия = Новый Структура("ВСоставе", Объект.Ссылка);
			ОткрытьФорму("РегистрСведений.уатСоставТС.ФормаЗаписи", ПараметрыОткрытия,,,,, Новый ОписаниеОповещения("СоставТСПередНачаломДобавленияЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		КонецЕсли;
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура СоставТСПередНачаломДобавленияЗавершение(Результат, ДополнительныеПараметры) Экспорт
    Заглушка = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТопливныеКартыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Ложь;
	уатОбщегоНазначенияКлиент.ПроверитьЗаписьНовогоОбъектаВФорме(ЭтотОбъект, Объект.Ссылка,,, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	#Если ВебКлиент Тогда
		Если НЕ Копирование Тогда
			Отказ = Истина;
	    	ПараметрыОткрытия = Новый Структура("КомуВыдана", Объект.Ссылка);
			ОткрытьФорму("Справочник.уатПластиковыеКарты.ФормаОбъекта", ПараметрыОткрытия,,,,, Новый ОписаниеОповещения("ТопливныеКартыПередНачаломДобавленияЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		КонецЕсли;
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ТопливныеКартыПередНачаломДобавленияЗавершение(Результат, ДополнительныеПараметры) Экспорт
    Заглушка = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЭкипажПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Ложь;
	уатОбщегоНазначенияКлиент.ПроверитьЗаписьНовогоОбъектаВФорме(ЭтотОбъект, Объект.Ссылка,,, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	#Если ВебКлиент Тогда
		Если НЕ Копирование Тогда
			Отказ = Истина;
			ПараметрыОткрытия = Новый Структура("ТС", Объект.Ссылка);
			ОткрытьФорму("РегистрСведений.уатЭкипажТС.ФормаЗаписи", ПараметрыОткрытия,,,,, Новый ОписаниеОповещения("ЭкипажПередНачаломДобавленияЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		КонецЕсли;
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ЭкипажПередНачаломДобавленияЗавершение(Результат, ДополнительныеПараметры) Экспорт
    Заглушка = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДокументыТСПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Ложь;
	уатОбщегоНазначенияКлиент.ПроверитьЗаписьНовогоОбъектаВФорме(ЭтотОбъект, Объект.Ссылка,,, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	#Если ВебКлиент Тогда
		Если НЕ Копирование Тогда
			Отказ = Истина;
	    	ПараметрыОткрытия = Новый Структура("ВладелецДокументов, ПринадлежностьДокументов",
				Объект.Ссылка, ПредопределенноеЗначение("Перечисление.уатПринадлежностьДокументов.ДокументыТС"));
			ОткрытьФорму("Справочник.уатРегистрационныеДокументы.ФормаОбъекта", ПараметрыОткрытия,,,,, Новый ОписаниеОповещения("ДокументыТСПередНачаломДобавленияЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		КонецЕсли;
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ДокументыТСПередНачаломДобавленияЗавершение(Результат, ДополнительныеПараметры) Экспорт
    Заглушка = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаИзмеренияНалоговойБазыПриИзменении(Элемент)
	ОбновитьНалоговуюБазу();
КонецПроцедуры

&НаКлиенте
Процедура ШиныВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СпрСсылка = ВернутьСсылкуНаОбъектПоКлючу("Агрегаты", ВыбраннаяСтрока);	
	ПоказатьЗначение(Новый ОписаниеОповещения("ШиныВыборЗавершение", ЭтотОбъект), СпрСсылка);
КонецПроцедуры

&НаКлиенте
Процедура ШиныВыборЗавершение(ДополнительныеПараметры) Экспорт
    Заглушка = Истина;
КонецПроцедуры

&НаКлиенте
Процедура АккумуляторыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СпрСсылка = ВернутьСсылкуНаОбъектПоКлючу("Агрегаты", ВыбраннаяСтрока);	
	ПоказатьЗначение(Новый ОписаниеОповещения("АккумуляторыВыборЗавершение", ЭтотОбъект), СпрСсылка);
КонецПроцедуры

&НаКлиенте
Процедура АккумуляторыВыборЗавершение(ДополнительныеПараметры) Экспорт
    Заглушка = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПрочиеАгрегатыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СпрСсылка = ВернутьСсылкуНаОбъектПоКлючу("Агрегаты", ВыбраннаяСтрока);	
	ПоказатьЗначение(Новый ОписаниеОповещения("ПрочиеАгрегатыВыборЗавершение", ЭтотОбъект), СпрСсылка);
КонецПроцедуры

&НаКлиенте
Процедура ПрочиеАгрегатыВыборЗавершение(ДополнительныеПараметры) Экспорт
    Заглушка = Истина;
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеОМестонахождении()

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	уатМестонахождениеТССрезПоследних.Организация,
	               |	уатМестонахождениеТССрезПоследних.Подразделение,
	               |	уатМестонахождениеТССрезПоследних.Колонна
	               |ИЗ
	               |	РегистрСведений.уатМестонахождениеТС.СрезПоследних(, ТС = &ТС) КАК уатМестонахождениеТССрезПоследних";
	  
	Запрос.УстановитьПараметр("ТС", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Объект.Организация   = Выборка.Организация;
		Объект.Подразделение = Выборка.Подразделение;
		Объект.Колонна       = Выборка.Колонна;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СтавкаТранспортногоНалогаПриИзменении(Элемент)
	ОбновитьНадписьСтавкаТранспортногоНалога();
КонецПроцедуры

&НаСервере
Процедура ОбновитьНалоговуюБазу()
	Если ЕдиницаИзмеренияНалоговойБазы = "251" Тогда
		Элементы.НалоговаяБаза.Заголовок = НСтр("en='Engine power';ru='Мощность двигателя'");
	ИначеЕсли ЕдиницаИзмеренияНалоговойБазы = "999" Тогда
		Элементы.НалоговаяБаза.Заголовок = НСтр("en='Motive force';ru='Сила тяги'");
	ИначеЕсли ЕдиницаИзмеренияНалоговойБазы = "181" Тогда
		Элементы.НалоговаяБаза.Заголовок = НСтр("en='Gross tonnage';ru='Валовая вместимость'");
	Иначе
		Элементы.НалоговаяБаза.Заголовок = НСтр("en='Tax base';ru='Налоговая база'");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МощностьДвигателяЛСПриИзменении(Элемент)
	Если НЕ Объект.Ссылка.Пустая() Тогда
		ЗаписатьНалоговуюБазуПоМощности();
		ПрочитатьТранспортныйНалог();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНалоговуюБазуПоМощности()
	Если НЕ ЗначениеЗаполнено(Объект.МощностьДвигателяЛС) Тогда
		Возврат;
	КонецЕсли;
	
	тблСреза = РегистрыСведений.уатСведенияОТС.СрезПоследних(ТекущаяДата(), Новый Структура("ТС", Объект.Ссылка));
	Если тблСреза.Количество() = 0 Тогда
		НоваяЗапись = РегистрыСведений.уатСведенияОТС.СоздатьМенеджерЗаписи();
		НоваяЗапись.Заполнить(Неопределено);
		НоваяЗапись.Период = ТекущаяДата();
		НоваяЗапись.ТС = Объект.Ссылка;
		НоваяЗапись.НалоговаяБаза = Объект.МощностьДвигателяЛС;
		НоваяЗапись.ЕдиницаИзмеренияНалоговойБазы = 251;
		Попытка
			НоваяЗапись.Записать();
		Исключение
		КонецПопытки;
	Иначе
		Если НЕ ЗначениеЗаполнено(тблСреза[0].НалоговаяБаза) Тогда
			НоваяЗапись = РегистрыСведений.уатСведенияОТС.СоздатьМенеджерЗаписи();
			НоваяЗапись.Заполнить(Неопределено);
			ЗаполнитьЗначенияСвойств(НоваяЗапись, тблСреза[0]);
			НоваяЗапись.Период = ТекущаяДата();
			НоваяЗапись.НалоговаяБаза = Объект.МощностьДвигателяЛС;
			НоваяЗапись.ЕдиницаИзмеренияНалоговойБазы = 251;
			Попытка
				НоваяЗапись.Записать();
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИспользуемаяСистемаGPSПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ИспользуемаяСистемаGPS) 
			И Не ЗначениеЗаполнено(Объект.ИсточникФактическихДанныхДляКартографии) Тогда 
		Объект.ИсточникФактическихДанныхДляКартографии = ПредопределенноеЗначение("Перечисление.уатИсточникФактическихДанныхДляКартографии.СистемаСпутниковогоМониторинга");
	КонецЕсли;
	
	Объект.ИДвСистемеНавигации = "";
	УстановитьВидимость();
	УстановитьСтраницуGPS();
	УстановитьВидимостьГПС();
	Элементы.ИспользоватьДанныеCANшиныОдометр.Видимость = Объект.ИспользуемаяСистемаGPS = ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.Omnicomm");
	 
	уатСобытияФормКлиент.ПриИзмененииЭлемента(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура УчетнаяЗаписьСистемыМониторингаПриИзменении(Элемент)
	УстановитьВидимость();
	уатСобытияФормКлиент.ПриИзмененииЭлемента(ЭтаФорма, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ИсточникПолученияДанныхПробегаАвтографНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ЗагрузитьИсточникиПолученияДанныхПробега();
КонецПроцедуры

&НаКлиенте
Процедура ДатчикОдометрНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.ИДвСистемеНавигации) Тогда
		ЗагрузитьСписокДатчиковНаТС(Объект.ИДвСистемеНавигации);
	КонецЕсли;
КонецПроцедуры

// ITOB +++
&НаКлиенте
Процедура МониторингИконкаНаКартеПриИзменении(Элемент)
	МониторингАдресИконки = ПолучитьНавигационнуюСсылку(МониторингИконкаНаКарте, "Иконка")	
КонецПроцедуры

&НаКлиенте
Процедура МониторингДополнительнаяИконкаНаКартеПриИзменении(Элемент)
	МониторингАдресДополнительнойИконки = ПолучитьНавигационнуюСсылку(МониторингДополнительнаяИконкаНаКарте, "Иконка")	
КонецПроцедуры

&НаКлиенте
Процедура МониторингЦветНадписиНаКартеПриИзменении(Элемент)
	МониторингЦветНадписиНаКартеЧисло = УстановитьЧисленноеПредставлениеЦвета(МониторингЦветНадписиНаКарте);
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура МониторингЦветМаршрутаПриИзменении(Элемент)
	МониторингЦветМаршрутаЧисло = УстановитьЧисленноеПредставлениеЦвета(МониторингЦветМаршрута);
	Модифицированность = Истина;
КонецПроцедуры
// ITOB ---

&НаКлиенте
Процедура МаршрутыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПоказатьЗначение(Новый ОписаниеОповещения("МаршрутыВыборЗавершение", ЭтотОбъект), Элементы.Маршруты.ТекущиеДанные.Маршрут);
КонецПроцедуры

&НаКлиенте
Процедура МаршрутыВыборЗавершение(ДополнительныеПараметры) Экспорт
	Заглушка = Истина;
КонецПроцедуры

&НаКлиенте
Процедура НормыРасходаГСМПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
	ТекСтрока = Элементы.НормыРасходаГСМ.ТекущиеДанные;
	
	Если ТипЗнч(ТекСтрока.МодельТС) = Тип("СправочникСсылка.уатМоделиТС") Тогда //для модели запрещаем изменения всех данных
		ПараметрыФормы = Новый Структура("Ключ, ТолькоПросмотр",
			КлючЗаписиНормыРасходаГСМ(СтруктураЗаписиНормыГСМ(ТекСтрока)), Истина);
	Иначе //для ТС запрещаем изменение ТС
		ПараметрыФормы = Новый Структура("Ключ, ТолькоПросмотрМодели",
			КлючЗаписиНормыРасходаГСМ(СтруктураЗаписиНормыГСМ(ТекСтрока)), Истина);
	КонецЕсли;
	
	ОткрытьФорму("РегистрСведений.уатНормыРасходаГСМ.ФормаЗаписи", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура НормыРасходаГСМПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Ложь;
	уатОбщегоНазначенияКлиент.ПроверитьЗаписьНовогоОбъектаВФорме(ЭтотОбъект, Объект.Ссылка,,, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Копирование Тогда
		Отказ = Истина;
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения, ТолькоПросмотрМодели", Новый Структура("Период, МодельТС, ГСМ, Организация",
			ТекущаяДата(), Объект.Ссылка, уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Объект.Модель, "ОсновноеТопливо"), Объект.Организация), Истина);
		ОткрытьФорму("РегистрСведений.уатНормыРасходаГСМ.ФормаЗаписи", ПараметрыФормы);
	КонецЕсли;
	
	Если Копирование И ТипЗнч(Элементы.НормыРасходаГСМ.ТекущиеДанные.МодельТС) = Тип("СправочникСсылка.уатМоделиТС") Тогда
		Отказ = Истина;
		ТекСтрока = Элементы.НормыРасходаГСМ.ТекущиеДанные;
		
		ПараметрыФормы = Новый Структура("ТолькоПросмотрМодели, ЗначениеКопирования",
			Истина, КлючЗаписиНормыРасходаГСМ(СтруктураЗаписиНормыГСМ(ТекСтрока)));
			
		Форма = ПолучитьФорму("РегистрСведений.уатНормыРасходаГСМ.ФормаЗаписи", ПараметрыФормы, ЭтотОбъект);
		
		ЗаполнитьЗначенияСвойств(Форма.Запись, ТекСтрока);
		Форма.Запись.Период   = ТекущаяДата();
		Форма.Запись.МодельТС = Объект.Ссылка;
		Форма.Открыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НормыРасходаГСМПередУдалением(Элемент, Отказ)
	ТекСтрока = Элементы.НормыРасходаГСМ.ТекущиеДанные;
	Если ТипЗнч(ТекСтрока.МодельТС) = Тип("СправочникСсылка.уатМоделиТС") Тогда 
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НормыРасходаГСМПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		ТекСтрока = Элементы.НормыРасходаГСМ.ТекущиеДанные;
		ТекСтрока.МодельТС = Объект.Ссылка;
		ТекСтрока.ГСМ = уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Объект.Модель, "ОсновноеТопливо");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НормыРасходаТЖПередНачаломИзменения(Элемент, Отказ)
	ТекСтрока = Элементы.НормыРасходаТЖ.ТекущиеДанные;
	Если ТипЗнч(ТекСтрока.МодельТС) = Тип("СправочникСсылка.уатМоделиТС") Тогда
		Отказ = Истина;
		
		ПараметрыФормы = Новый Структура("Ключ, ТолькоПросмотр",
			КлючЗаписиНормыРасходаТЖ(СтруктураЗаписиНормыТЖ(ТекСтрока)), Истина);
		ОткрытьФорму("РегистрСведений.уатНормыРасходаТехническихЖидкостей.ФормаЗаписи", ПараметрыФормы);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НормыРасходаТЖПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Ложь;
	уатОбщегоНазначенияКлиент.ПроверитьЗаписьНовогоОбъектаВФорме(ЭтотОбъект, Объект.Ссылка,,, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Копирование Тогда
		Отказ = Истина;
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения, ТолькоПросмотрМодели", Новый Структура("Период, МодельТС",
			ТекущаяДата(), Объект.Ссылка), Истина);
		ОткрытьФорму("РегистрСведений.уатНормыРасходаТехническихЖидкостей.ФормаЗаписи", ПараметрыФормы);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
КонецПроцедуры

&НаКлиенте
Процедура ВладелецТСПриИзменении(Элемент)
	// очистка водителя, если он не относится к владельцу ТС
	Если ЗначениеЗаполнено(Объект.Водитель) Тогда
		СписокВодителей = Вычислить("уатОбщегоНазначения_уэ.ВодителиКонтрагента(Объект.ВладелецТС)");
		Если СписокВодителей.НайтиПоЗначению(Объект.Водитель) = Неопределено Тогда
			Объект.Водитель = Неопределено;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура АмортизацияПериодПриИзменении(Элемент)
	ТекСтрока = Элементы.Амортизация.ТекущиеДанные;
	ТекСтрока.Период = НачалоМесяца(ТекСтрока.Период);
КонецПроцедуры

&НаКлиенте
Процедура ОбязательныеВидыДокументовПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	УстановитьОтборКатегорииПоВидуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ОбязательныеВидыДокументовВидДокументаПриИзменении(Элемент)
	УстановитьОтборКатегорииПоВидуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборКатегорииПоВидуДокумента()
	ТекСтрока = Элементы.ОбязательныеВидыДокументов.ТекущиеДанные;
	
	мсвКатегории = ПолучитьКатегорииПоВидуДокумента(ТекСтрока.ВидДокумента);
	
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", мсвКатегории));
	Элементы.ОбязательныеВидыДокументовКатегорияДокумента.ПараметрыВыбора = Новый ФиксированныйМассив(НовыйМассив);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКатегорииПоВидуДокумента(ВидДокумента)
	Возврат ВидДокумента.Категории.Выгрузить().ВыгрузитьКолонку("Категория");
КонецФункции

&НаКлиенте
Процедура ФормироватьУведомленияПриОтсутствииДанныхПриИзменении(Элемент)
	Элементы.ПолучательУведомленийПриОтсутствииДанных.Видимость = Объект.ФормироватьУведомленияПриОтсутствииДанных;
КонецПроцедуры

&НаКлиенте
Процедура НастройкиMultiGoПриИзменении(Элемент)
	ТекущиеДанные = Элементы.НастройкиMultiGo.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Значение = Неопределено Тогда
		 ТекущиеДанные.Значение = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УчетнаяЗаписьMultiGoПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура КастомнаяСтоимостьМаршрутаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.КастомнаяСтоимостьМаршрута",
		НСтр("ru = 'Кастомная стоимость маршрута'; en = 'Custom route cost'"));
КонецПроцедуры

&НаКлиенте
Процедура КастомнаяСтоимостьМаршрутаПриИзменении(Элемент)
	Элементы.ГруппаСтоимостьТранспортаПараметры.Доступность = НЕ ЗначениеЗаполнено(Объект.КастомнаяСтоимостьМаршрута);
КонецПроцедуры

&НаКлиенте
Процедура КастомнаяСтоимостьМаршрутаОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	Элементы.ГруппаСтоимостьТранспортаПараметры.Доступность = НЕ ЗначениеЗаполнено(Объект.КастомнаяСтоимостьМаршрута);
КонецПроцедуры

&НаКлиенте
Процедура ИспользуютсяАгентскиеДоговорыПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ДоступенДляТаксиПриИзменении(Элемент)
	Объект.ИспользуютсяАгентскиеДоговоры = Ложь;
	УстановитьВидимость();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов
&НаКлиенте
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовОбъекта(Команда)
	ЗапретРедактированияРеквизитовОбъектовКлиент.РазрешитьРедактированиеРеквизитовОбъекта(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	уатСобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтотОбъект, Команда);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоМоделиТС(Команда)
	ЗаполнитьРеквизитыТСПоМоделиТС(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ВводВЭксплуатацию(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		ТекстНСТР = НСтр("en='To perform this operation, you must record the item. Continue?';ru='Для выполнения данной операции необходимо записать элемент. Продолжить?'");
		
		ОповещениеЗаписатьОбъект = Новый ОписаниеОповещения("ВводВЭксплуатациюПродолжение", ЭтотОбъект);
		
		ПоказатьВопрос(ОповещениеЗаписатьОбъект, ТекстНСТР, РежимДиалогаВопрос.ДаНет);
	Иначе
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("ТС", Объект.Ссылка);
		ПараметрыФормы.Вставить("Организация", Объект.Организация);
		ПараметрыФормы.Вставить("Подразделение", Объект.Подразделение);
		ПараметрыФормы.Вставить("Колонна", Объект.Колонна);
		ОткрытьФорму("Документ.уатВводВЭксплуатациюТСиОборудования.ФормаОбъекта", ПараметрыФормы);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПеремещениеТС(Команда)
	Отказ = Ложь;
	уатОбщегоНазначенияКлиент.ПроверитьЗаписьНовогоОбъектаВФорме(ЭтотОбъект, Объект.Ссылка,,, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("ТС", Объект.Ссылка);
	ОткрытьФорму("Документ.уатПеремещениеТСиОборудования.ФормаОбъекта", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура ВыбытиеТС(Команда)
	Отказ = Ложь;
	уатОбщегоНазначенияКлиент.ПроверитьЗаписьНовогоОбъектаВФорме(ЭтотОбъект, Объект.Ссылка,,, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ТС", Объект.Ссылка);
	ПараметрыФормы.Вставить("Организация", Объект.Организация);
	ПараметрыФормы.Вставить("Подразделение", Объект.Подразделение);
	ПараметрыФормы.Вставить("Колонна", Объект.Колонна);
	
	ОткрытьФорму("Документ.уатВыбытиеТСиОборудования.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура История(Команда)
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаМестонахождение;
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьКоэффициентГСМ(Команда)
	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(Неопределено, "Перед вводом коэффициента ГСМ необходимо записать ТС!");
		Возврат;
	КонецЕсли;
	
	СтараяЗапись = СтруктураСрезаСведенийОТС(Объект.Ссылка);
	Если СтараяЗапись = Неопределено Тогда //нет записей регистра
		СтруктураЗаполнения = Новый Структура("Период, ТС", ТекущаяДата(), Объект.Ссылка);
		ПараметрыОткрытия = Новый Структура("ЗначенияЗаполнения", СтруктураЗаполнения);
		
	Иначе //есть записи регистра
		Если НачалоДня(СтараяЗапись.Период) = НачалоДня(ТекущаяДата()) Тогда //
			ПараметрыОткрытия = Новый Структура("Ключ", ПолучитьКлючСтаройЗаписи(СтараяЗапись));
		Иначе
			СтруктураЗаполнения = СтараяЗапись;
			СтруктураЗаполнения.Вставить("Период", ТекущаяДата());
			СтруктураЗаполнения.Вставить("ТС", Объект.Ссылка);
			ПараметрыОткрытия = Новый Структура("ЗначенияЗаполнения", СтруктураЗаполнения);
		КонецЕсли;
		
	КонецЕсли;
	
	ОткрытьФорму("РегистрСведений.уатСведенияОТС.ФормаЗаписи", ПараметрыОткрытия);
КонецПроцедуры

&НаКлиенте
Процедура ИсторияКоэффициентаГСМ(Команда)
	ОткрытьФорму("РегистрСведений.уатСведенияОТС.ФормаСписка", Новый Структура("Отбор", Новый Структура("ТС", Объект.Ссылка)),, "История");
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьТранспортныйНалог(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(Новый ОписаниеОповещения("ИзменитьТранспортныйНалогЗавершение", ЭтотОбъект), "Перед вводом значения транспортного налога необходимо записать ТС!");
		Возврат;
	КонецЕсли;

	// ДатаСреза = НачалоГода(ТекущаяДатаСеанса()))-1; // конец предыдущего года, т.к. ТН начисляется за предыдущий год
	ДатаСреза = ТекущаяДата();
	СтараяЗапись = СтруктураСрезаСведенийОТС(Объект.Ссылка, ДатаСреза);
	Если СтараяЗапись = Неопределено Тогда //нет записей регистра
		СтруктураЗаполнения = Новый Структура("Период, ТС, НачислятьТранспортныйНалог", НачалоГода(ДатаСреза), Объект.Ссылка, Истина);
		ПараметрыОткрытия = Новый Структура("ЗначенияЗаполнения", СтруктураЗаполнения);
		
	Иначе // есть записи регистра
		Если НачалоГода(СтараяЗапись.Период) = НачалоГода(ДатаСреза) Тогда //
			ПараметрыОткрытия = Новый Структура("Ключ", ПолучитьКлючСтаройЗаписи(СтараяЗапись));
		Иначе
			СтруктураЗаполнения = СтараяЗапись;
			СтруктураЗаполнения.Вставить("Период", НачалоГода(ДатаСреза));
			СтруктураЗаполнения.Вставить("ТС", Объект.Ссылка);
			// СтруктураЗаполнения.Вставить("СтавкаТранспортногоНалога", Неопределено);
			ПараметрыОткрытия = Новый Структура("ЗначенияЗаполнения", СтруктураЗаполнения);
		КонецЕсли;
		
	КонецЕсли;
	
	ОткрытьФорму("РегистрСведений.уатСведенияОТС.ФормаЗаписи", ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияТранспортногоНалога(Команда)
	ОткрытьФорму("РегистрСведений.уатСведенияОТС.ФормаСписка", Новый Структура("Отбор", Новый Структура("ТС", Объект.Ссылка)),, "История");
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАмортизацию(Команда)
	Если Объект.СрокИспользования = 0 ИЛИ Объект.БалансоваяСтоимость = 0 Тогда
		ТекстНСТР = НСтр("en='For automatic calculation by period, you must specify the period of use and book value of vehicle';ru='Для автоматического расчета по периодам следует указать срок использования и балансовую стоимость ТС'");
		ПоказатьПредупреждение(Неопределено, ТекстНСТР);
		Возврат;
	КонецЕсли;
	
	Если Объект.Амортизация.Количество() = 0 Тогда
		ЗаполнитьАмортизациюВводДаты();
	Иначе
		ОписОповещ = Новый ОписаниеОповещения("ЗаполнитьАмортизациюВопросОчистить", ЭтотОбъект);
		ТекстНСТР = НСтр("en='Clear the tabular section before filling?';ru='Очистить табличную часть перед заполнением?'");
		ПоказатьВопрос(ОписОповещ, ТекстНСТР, РежимДиалогаВопрос.ДаНетОтмена);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАмортизациюВопросОчистить(Результат, ДопПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.Амортизация.Очистить();
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
	Иначе
		Возврат;
	КонецЕсли;
	
	ЗаполнитьАмортизациюВводДаты();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАмортизациюВводДаты()
	ОписОповещ = Новый ОписаниеОповещения("ЗаполнитьАмортизациюВводДатыОкончание", ЭтотОбъект);
	ТекстНСТР = НСтр("en='Commissioning date for depreciation calculating';ru='Дата ввода в эксплуатацию для расчета амортизации'");
	ПоказатьВводДаты(ОписОповещ, Объект.ДатаВводаВЭксплуатацию, ТекстНСТР, ЧастиДаты.Дата);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАмортизациюВводДатыОкончание(Результат, ДопПараметры) Экспорт
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	ДатаНач = НачалоМесяца(Результат);
	ПоследняяКопейка = Объект.БалансоваяСтоимость; //учет последней копейки
	
	Для Сч = 0 По Объект.СрокИспользования-1 Цикл
		НоваяСтрока = Объект.Амортизация.Добавить();
		НоваяСтрока.Период = ДобавитьМесяц(ДатаНач, Сч);
		НоваяСтрока.Сумма = Объект.БалансоваяСтоимость / Объект.СрокИспользования;
		
		ПоследняяКопейка = ПоследняяКопейка - НоваяСтрока.Сумма;
		Если Сч = Объект.СрокИспользования-1 И ПоследняяКопейка <> 0 Тогда
			НоваяСтрока.Сумма = НоваяСтрока.Сумма + ПоследняяКопейка;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура НастроитьШаблон(Команда)
	
	ПараметрыФормы = Новый Структура("ОбъектНастройки", "Справочник_уатТС");
	ОткрытьФорму("ОбщаяФорма.уатНастройкаШаблона", ПараметрыФормы, ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьНаименование(Команда)
	
	Объект.Наименование   = СформироватьНаименованиеСервер();
	НаименованиеПоШаблону = Объект.Наименование;
	Модифицированность  = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПомощникВводаВЭксплуатацию(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		ТекстНСТР = НСтр("en='To perform this operation, you must record the item. The document will be recorded.';ru='Для выполнения данной операции необходимо записать элемент. Данные будут записаны.'");
		
		ОповещениеЗаписатьОбъект = Новый ОписаниеОповещения("ОткрытьПомощникВводаВЭксплуатациюПродолжение", ЭтотОбъект);
		
		ПоказатьВопрос(ОповещениеЗаписатьОбъект, ТекстНСТР, РежимДиалогаВопрос.ДаНет);
	Иначе
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("ТС", Объект.Ссылка);
		ПараметрыФормы.Вставить("Организация", Объект.Организация);
		ПараметрыФормы.Вставить("Подразделение", Объект.Подразделение);
		ПараметрыФормы.Вставить("Колонна", Объект.Колонна);
		ПараметрыФормы.Вставить("ДатаВводаВЭксплуатацию", Объект.ДатаВводаВЭксплуатацию);
		ПараметрыФормы.Вставить("НачальныйПробег", Объект.НачальныйПробег);
		
		ОткрытьФорму("Справочник.уатТС.Форма.ПомощникВводаВЭксплуатацию", ПараметрыФормы,ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияЗакрепленияБортовыхУстройств(Команда)
		
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ОткрытаИзФормыТС", Истина);
	СтруктураОтбора = Новый Структура("ТС", Объект.Ссылка);
	ПараметрыФормы.Вставить("Отбор", СтруктураОтбора);
	
	ОповещениеОЗакрытииИсторииТС = Новый ОписаниеОповещения("ИсторияЗакрепленияБортовыхУстройствЗакрытие", ЭтотОбъект);
	
	ОткрытьФорму("РегистрСведений.уатИсторияЗакрепленияБортовыхУстройств.ФормаСписка", ПараметрыФормы, ЭтотОбъект,,,,ОповещениеОЗакрытииИсторииТС, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьНомерБортовогоУстройстваАвтодор(Команда)
	ИзменитьНомерБортовогоУстройстваНажатие("Автодор");
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьНомерБортовогоУстройстваПлатон(Команда)
	ИзменитьНомерБортовогоУстройстваНажатие("Платон");
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНастройкиMultiGo(Команда)
	Если Объект.НастройкиMultiGo.Количество() > 0 Тогда
		ТекстНСТР = НСтр("en='Do you want to clear the table before filling?';ru='Очистить таблицу перед заполнением?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗагрузитьНастройкиMultiGoПродолжение", ЭтотОбъект), ТекстНСТР, РежимДиалогаВопрос.ДаНетОтмена,,КодВозвратаДиалога.Нет);
	Иначе
		ЗагрузитьНастройкиMultiGoСервер();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Объект_ЗаписатьИЗакрыть(Команда)
	
	флЗакрыватьПриЗаписи = Истина;
	Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура Объект_Записать(Команда)
	
	флЗакрыватьПриЗаписи = Ложь;
	Записать();
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура УстановитьСтраницуНачальногоПробегаНаработки()
	
	Если уатОбщегоНазначения.уатЗначениеНеЗаполнено(Объект.Модель)
		ИЛИ уатОбщегоНазначенияТиповыеСервер.ПолучитьЗначениеРеквизита(Объект.Модель, "НаличиеСпидометра") = Истина Тогда
		Элементы.НачальныйПробег.Заголовок = НСтр("en='Initial mileage km';ru='Начальный пробег, км'");
	Иначе
		Элементы.НачальныйПробег.Заголовок = НСтр("en='Initial operation time, h';ru='Начальная наработка, ч'");
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОбновитьСостояниеИКоэффициентИзмененияНормТоплива(Ссылка)
	СтруктураВозврата = Новый Структура;
	
	СтруктураВозврата.Вставить("КоэффициентИзмененияНормТоплива", 
		уатОбщегоНазначения.уатПолучитьКоэффициентИзмененияНормТопливаТС(Ссылка, ТекущаяДата()));
	СтруктураВозврата.Вставить("СостояниеТС", уатОбщегоНазначения.уатСостояниеТС(Ссылка, ТекущаяДата()).Состояние);
	
	Возврат СтруктураВозврата;
КонецФункции

&НаСервереБезКонтекста
Функция ОсновноеСредствоУжеИспользуется(Ссылка, ОсновноеСредство)
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка",           Ссылка);
	Запрос.УстановитьПараметр("ОсновноеСредство", ОсновноеСредство);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатТС.Наименование
	|ИЗ
	|	Справочник.уатТС КАК уатТС
	|ГДЕ
	|	уатТС.Ссылка <> &Ссылка
	|	И уатТС.ОсновноеСредство = &ОсновноеСредство";
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатПустой = Запрос.Выполнить().Пустой();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Не РезультатПустой;
	
КонецФункции

&НаСервере
Процедура ОбновитьСвязанныеДанныеПоТС()
	СтруктураДанных = ОбновитьСостояниеИКоэффициентИзмененияНормТоплива(Объект.Ссылка);
	КоэффициентИзмененияНормТоплива = СтруктураДанных.КоэффициентИзмененияНормТоплива;
	СостояниеТС = СтруктураДанных.СостояниеТС;
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Экипаж.Отбор, "ТС", Объект.Ссылка,,,Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(МестонахождениеТС.Отбор, "ТС", Объект.Ссылка,,,Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ТопливныеКарты.Отбор, "КомуВыдана", Объект.Ссылка,,,Истина);
	Если (Объект.ВидМоделиТС = ПредопределенноеЗначение("Перечисление.уатВидыМоделейТС.Автотранспорт")) Тогда
		//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(СоставТС.Отбор, "ВСоставе", Объект.Ссылка,,,Истина);
		//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(СоставТС.Отбор, "ТС",,,,Ложь);  
		
		// Тест
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(СоставТС.Отбор, "ВСоставе", Объект.Ссылка,,,Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(СоставТС.Отбор, "ТС",,,,Ложь);
	Иначе
		//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(СоставТС.Отбор, "ВСоставе",,,,Ложь);
		//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(СоставТС.Отбор, "ТС", Объект.Ссылка,,,Истина);  
		
		// Тест
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(СоставТС.Отбор, "ВСоставе",,,,Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(СоставТС.Отбор, "ТС", Объект.Ссылка,,,Истина);
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ДокументыТС.Отбор, "ВладелецДокументов", Объект.Ссылка,,,Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(СекцииТС.Отбор, "Владелец", Объект.Ссылка,,,Истина);
	ОбновитьДанныеОМестонахождении();
	ОтобразитьАгрегатыТС();
	
	СписокМодельТС = Новый СписокЗначений;
	СписокМодельТС.Добавить(Объект.Ссылка);
	СписокМодельТС.Добавить(Объект.Модель);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(НормыРасходаГСМ.Отбор, "МодельТС", СписокМодельТС, ВидСравненияКомпоновкиДанных.ВСписке,,Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(НормыРасходаТЖ.Отбор, "МодельТС", СписокМодельТС, ВидСравненияКомпоновкиДанных.ВСписке,,Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(НормыРасходаГСМ, "ТС", Объект.Ссылка);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(НормыРасходаГСМ, "Модель", Объект.Модель);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(НормыРасходаТЖ, "ТС", Объект.Ссылка);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(НормыРасходаТЖ, "Модель", Объект.Модель);
КонецПроцедуры

&НаСервере
Процедура ОтобразитьАгрегатыТС()
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Шины, "Дата", ТекущаяДата(), Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Шины, "ТС", Объект.Ссылка, Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Аккумуляторы, "Дата", ТекущаяДата(), Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Аккумуляторы, "ТС", Объект.Ссылка, Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ПрочиеАгрегаты, "Дата", ТекущаяДата(), Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ПрочиеАгрегаты, "ТС", Объект.Ссылка, Истина);
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()
	  
	ЭтоАвиаТранспорт    = Объект.ВидМоделиТС = ПредопределенноеЗначение("Перечисление.уатВидыМоделейТС.АвиационныйТранспорт");
	ЭтоМорскойТранспорт = Объект.ВидМоделиТС = ПредопределенноеЗначение("Перечисление.уатВидыМоделейТС.МорскойТранспорт");
	ЭтоЖДТранспорт      = Объект.ВидМоделиТС = ПредопределенноеЗначение("Перечисление.уатВидыМоделейТС.ЖДТранспорт");
	ЭтоСобственноеТС    = Объект.ПринадлежностьТС = ПредопределенноеЗначение("Перечисление.уатПринадлежностьТС.Собственное");
	ЭтоПривлеченноеТС   = Объект.ПринадлежностьТС = ПредопределенноеЗначение("Перечисление.уатПринадлежностьТС.Привлеченное"); 
	ЭтоВиртуальноеТС    = Объект.ПринадлежностьТС = ПредопределенноеЗначение("Перечисление.уатПринадлежностьТС.Виртуальное");
	ЭтоАвтотранспорт    = Объект.ВидМоделиТС = ПредопределенноеЗначение("Перечисление.уатВидыМоделейТС.Автотранспорт");
	ЭтоПрицеп           = Объект.ВидМоделиТС = ПредопределенноеЗначение("Перечисление.уатВидыМоделейТС.Прицеп");
	ЭтоОборудование     = Объект.ВидМоделиТС = ПредопределенноеЗначение("Перечисление.уатВидыМоделейТС.Оборудование");

	Если ЭтоАвтотранспорт Тогда
		Заголовок = НСтр("en='Vehicle';ru='Транспортное средство'");
	ИначеЕсли ЭтоПрицеп Тогда
		Заголовок = НСтр("en='Trailer';ru='Прицеп'");
	ИначеЕсли ЭтоМорскойТранспорт Тогда 
		Заголовок = НСтр("en='Sea transport';ru='Морской транспорт'");
	ИначеЕсли ЭтоЖДТранспорт Тогда
		Заголовок = НСтр("en='Railway transport';ru='Железнодорожный транспорт'");
	ИначеЕсли ЭтоАвиаТранспорт Тогда
		Заголовок = НСтр("en='Air transport';ru='Авиационный транспорт'");
	Иначе
		Заголовок = НСтр("en='Equipment';ru='Оборудование'");
	КонецЕсли;
	
	Если ЭтоСобственноеТС Тогда 
		Элементы.ВладелецТС.Видимость        = Истина;
		Элементы.ВладелецТС.ОграничениеТипа  = Новый ОписаниеТипов("СправочникСсылка.Организации");
		Элементы.ВладелецТС2.Видимость       = Ложь;
		Элементы.ВладелецТС2.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Организации");
	ИначеЕсли ЭтоПривлеченноеТС Тогда 
		Элементы.ВладелецТС.Видимость        = Ложь;
		Элементы.ВладелецТС.ОграничениеТипа  = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
		Элементы.ВладелецТС2.Видимость       = Истина;
		Элементы.ВладелецТС2.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
	КонецЕсли;
	
	Если ЭтоМорскойТранспорт Или ЭтоАвиаТранспорт Тогда  
		
		// Шапка
		Элементы.Марка.Видимость                            = Ложь;
		Элементы.Гараж.Видимость                            = Ложь;
		Элементы.ГосударственныйНомер.Видимость             = Ложь;
		Элементы.ТипВладенияТС.Видимость                    = Ложь;
		Элементы.ГруппаТакси.Видимость                      = Ложь;
		Элементы.ВладелецТС2.Видимость                      = Ложь;
		Элементы.ГаражныйНомер.Заголовок                    = Нстр("en = 'Number'; ru = 'Номер'");
		Элементы.ГосударственныйНомер.Заголовок             = Нстр("en = 'License plate'; ru = 'Гос. номер'");

		// Страницы
		Элементы.ГруппаСтраницы.Видимость                   = Не ЭтоПривлеченноеТС И Не ЭтоВиртуальноеТС; 
		Элементы.СтраницаДопПараметры.Видимость             = Ложь;
		Элементы.СтраницаСекции.Видимость                   = Ложь;
		Элементы.СтраницаХарактеристики.Видимость           = Ложь;
		Элементы.СтраницаМаршрутизация.Видимость            = Ложь;
		Элементы.СтраницаМаршруты.Видимость                 = Ложь;
		Элементы.СтраницаСоставТС.Видимость                 = Ложь;
		Элементы.СтраницаДокументы.Видимость                = НЕ ЭтоВиртуальноеТС;
		Элементы.СтраницаЭкипаж.Видимость                   = Ложь;
		Элементы.СтраницаАгрегаты.Видимость                 = Ложь;
		Элементы.СтраницаМестонахождение.Видимость          = Ложь;
		Элементы.СтраницаТопливныеКарты.Видимость           = Ложь;
		Элементы.СтраницаНормыГСМ.Видимость                 = Ложь;
		Элементы.СтраницаНормыТЖ.Видимость                  = Ложь;
		Элементы.СтраницаМониторинг.Видимость               = Ложь;
		Элементы.СтраницаШтрафы.Видимость                   = Ложь;
		Элементы.СтраницаПарковки.Видимость                 = Ложь;
		Элементы.СтраницаПлатныеДороги.Видимость            = Ложь;
		Элементы.СтраницаMultiGo.Видимость                  = Ложь; 
		Элементы.СтраницаБухУчет.Видимость                  = Ложь;

		// Страница Основное
		Элементы.ГруппаСобственноеТС.Видимость              = Ложь; 
		Элементы.ГруппаПривлеченноеТС.Видимость             = ЭтоПривлеченноеТС;
		Элементы.ГруппаVINПривлеченноеТС.Видимость          = Ложь;

		// Страница Рег. документы
		Элементы.ГруппаОбязательныеВидыДокументов.Видимость = Ложь; 

		// Подвал
		Элементы.ГруппаДопИнформация1.Видимость             = ЭтоПривлеченноеТС Или ЭтоВиртуальноеТС;
		Элементы.ВладелецТС1.ОграничениеТипа                = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
		Элементы.ВладелецТС1.Видимость                      = Не ЭтоВиртуальноеТС;
		
		Элементы.СостояниеТС.Видимость                      = Истина;
		Элементы.ГрафикРаботыПривлеченные.Видимость         = Истина;
		Элементы.Водитель.Видимость                         = Истина;
		Элементы.ГруппаГрузоподъемность.Видимость           = Ложь;
		
		уатИспользоватьСервисMultiGo       = Константы.уатИспользоватьСервисMultiGo.Получить();
		Элементы.СтраницаMultiGo.Видимость = уатИспользоватьСервисMultiGo;
		
	ИначеЕсли ЭтоЖДТранспорт Тогда
		
		Элементы.СтраницаДопПараметры.Видимость = Ложь;
		Элементы.СтраницаСекции.Видимость = Ложь;
		Элементы.СтраницаМаршрутизация.Видимость = Ложь;
		Элементы.СтраницаСоставТС.Видимость = Ложь;
		Элементы.СтраницаАгрегаты.Видимость = Ложь;
		Элементы.СтраницаТопливныеКарты.Видимость = Ложь;
		Элементы.СтраницаНормыГСМ.Видимость = Ложь;
		Элементы.СтраницаНормыТЖ.Видимость = Ложь;
		Элементы.СтраницаШтрафы.Видимость = Ложь;
		Элементы.СтраницаПарковки.Видимость = Ложь;
		Элементы.СтраницаПлатныеДороги.Видимость = Ложь;
		Элементы.ГрафикРаботы.Видимость = Не ЭтоПривлеченноеТС;
		Элементы.ГрафикРаботыПривлеченные.Видимость = Ложь;
		Элементы.Водитель.Видимость = Ложь;
		Элементы.СтраницаЭкипаж.Видимость = Не ЭтоПривлеченноеТС;
		Элементы.ГруппаТекущееМестонахождение.Видимость = Не ЭтоПривлеченноеТС И Не ЭтоВиртуальноеТС;
		Элементы.СостояниеТС.Видимость = Ложь;
		Элементы.ГруппаГрузоподъемность.Видимость = Истина;
		Элементы.ТипВладенияЖДТС.Видимость = Истина;
		Элементы.ТипВладенияТС.Видимость = Ложь;
		
		Элементы.ГруппаСтраницы.Видимость                        = Истина;
		Элементы.СтраницаМониторинг.Видимость                    = Не Объект.ПринадлежностьТС = ПредопределенноеЗначение("Перечисление.уатПринадлежностьТС.Виртуальное");
		Элементы.СтраницаБухУчет.Видимость                       = Объект.ПринадлежностьТС = ПредопределенноеЗначение("Перечисление.уатПринадлежностьТС.Собственное");
		Элементы.ГруппаVIN.Видимость                             = Ложь;
		Элементы.ГруппаЦветКузова.Видимость                      = Объект.ПринадлежностьТС = ПредопределенноеЗначение("Перечисление.уатПринадлежностьТС.Собственное");
		Элементы.ГруппаГодВыпуска.Видимость                      = Объект.ПринадлежностьТС = ПредопределенноеЗначение("Перечисление.уатПринадлежностьТС.Собственное");
		Элементы.ГруппаСобственныйВес.Видимость                  = Истина;
		//Элементы.ГруппаОсновнаяКолонкаПравая.Видимость           = Объект.ПринадлежностьТС = ПредопределенноеЗначение("Перечисление.уатПринадлежностьТС.Собственное");
		Элементы.ГруппаОсновнаяКолонкаПравая.Видимость = Истина;
		Элементы.ГруппаЛицензия.Видимость = Ложь;
		Элементы.НачальныйПробег.Видимость                       = Объект.ПринадлежностьТС = ПредопределенноеЗначение("Перечисление.уатПринадлежностьТС.Собственное");
		Элементы.Марка.Видимость                                 = Ложь;
		Элементы.Гараж.Видимость                                 = Истина;
		Элементы.ГосударственныйНомер.Видимость                  = Истина;
		Элементы.ТипВладенияТС.Видимость                         = Истина;
		Элементы.ГруппаОбязательныеВидыДокументов.Видимость      = Истина; 
		Элементы.ГруппаVINПривлеченноеТС.Видимость               = Ложь;
		Элементы.СтраницаДокументы.Видимость = Истина;
		Элементы.СтраницаMultiGo.Видимость = Ложь;
		Элементы.ГосударственныйНомер.Видимость = Ложь;
		
		Элементы.ГаражныйНомер.Заголовок                    = Нстр("en = 'Inventory number'; ru = 'Инвентарный номер'");
		
	Иначе
		
		ВариантПоставкиКОРП   = уатОбщегоНазначенияПовтИсп.ВариантПоставкиКОРП();
		ВариантПоставкиТакси  = уатОбщегоНазначенияПовтИсп.ВариантПоставкиТакси();
		НаличиеТопливногоБака = Объект.Модель.НаличиеТопливногоБака;
		
		// Шапка
		Элементы.Марка.Видимость                                 = Истина;
		Элементы.Гараж.Видимость                                 = Истина;
		Элементы.ГосударственныйНомер.Видимость                  = НЕ ЭтоВиртуальноеТС;
		Элементы.ГаражныйНомер.Видимость                         = НЕ ЭтоВиртуальноеТС;
		Элементы.ТипВладенияТС.Видимость                         = НЕ ЭтоВиртуальноеТС; 
		Элементы.ГруппаТакси.Видимость                           = ВариантПоставкиТакси И НЕ ЭтоВиртуальноеТС;
		Элементы.ГаражныйНомер.Заголовок                         = Нстр("en = 'Garage number'; ru = 'Гаражный номер'");
		
		уатИспользоватьСервисMultiGo       = Константы.уатИспользоватьСервисMultiGo.Получить();
		Элементы.СтраницаMultiGo.Видимость = уатИспользоватьСервисMultiGo;
		
		Элементы.СостояниеТС.Видимость                           = Истина;
		Элементы.ГрафикРаботыПривлеченные.Видимость              = Истина;
		Элементы.Водитель.Видимость                              = Истина;
		Элементы.ГруппаГрузоподъемность.Видимость                = Ложь;
		
		// Страницы
		Элементы.ГруппаСтраницы.Видимость                        = Истина;
		Элементы.СтраницаДопПараметры.Видимость                  = Истина;
		Элементы.СтраницаСекции.Видимость                        = Истина; 
		Элементы.СтраницаХарактеристики.Видимость                = Истина;   
		Элементы.СтраницаМаршрутизация.Видимость                 = ВариантПоставкиКОРП;
		Элементы.СтраницаМаршруты.Видимость                      = ВариантПоставкиКОРП;
		Элементы.СтраницаСоставТС.Видимость                      = Истина;
		Элементы.СтраницаДокументы.Видимость                     = НЕ ЭтоВиртуальноеТС;
		Элементы.СтраницаЭкипаж.Видимость                        = ЭтоАвтотранспорт И (ЭтоСобственноеТС ИЛИ ЭтоПривлеченноеТС);  
		Элементы.СтраницаАгрегаты.Видимость                      = ЭтоСобственноеТС; 
		Элементы.СтраницаМестонахождение.Видимость               = ЭтоСобственноеТС;
		Элементы.СтраницаТопливныеКарты.Видимость                = ЭтоСобственноеТС И
			(ЭтоАвтотранспорт ИЛИ ((ЭтоПрицеп ИЛИ ЭтоОборудование) И НаличиеТопливногоБака)); 
		Элементы.СтраницаНормыГСМ.Видимость                      = ЭтоСобственноеТС;
		Элементы.СтраницаНормыТЖ.Видимость                       = ЭтоСобственноеТС;
		Элементы.СтраницаМониторинг.Видимость                    = НЕ ЭтоВиртуальноеТС;   
		Элементы.СтраницаШтрафы.Видимость                        = уатИспользоватьСервисШтрафовНет И ЭтоСобственноеТС;
		Элементы.СтраницаПарковки.Видимость                      = уатИспользоватьИнтеграциюПаркоматика И ЭтоСобственноеТС;
		Элементы.СтраницаПлатныеДороги.Видимость                 = Истина;
		Элементы.СтраницаMultiGo.Видимость                       = уатИспользоватьСервисMultiGo; 
		Элементы.СтраницаБухУчет.Видимость                       = ЭтоСобственноеТС;
		
		// Страница Основное
		Элементы.ГруппаСобственноеТС.Видимость  = ЭтоСобственноеТС;
		Элементы.ГруппаПривлеченноеТС.Видимость = ЭтоПривлеченноеТС;  
		
		// Страница Основное. ГруппаСобственноеТС
		Элементы.ГруппаГиперссылки.Видимость    = НЕ (Объект.Ссылка.Пустая());  
		
		ВидимостьПеремещениеВыбытие = (Объект.ДатаВводаВЭксплуатацию <> '00010101' И Объект.ДатаВыбытия = '00010101');
		Если Элементы.ПеремещениеТС.Видимость <> ВидимостьПеремещениеВыбытие Тогда
			Элементы.ПеремещениеТС.Видимость = ВидимостьПеремещениеВыбытие;
		КонецЕсли;
		Если Элементы.ВыбытиеТС.Видимость <> ВидимостьПеремещениеВыбытие Тогда
			Элементы.ВыбытиеТС.Видимость = ВидимостьПеремещениеВыбытие;
		КонецЕсли; 
		
		// Страница Основное. ГруппаПривлеченноеТС
		Элементы.ГруппаVINПривлеченноеТС.Видимость = ЭтоПривлеченноеТС;

		// Страница Доп. параметры
		Элементы.ГруппаДопПараметрыШапкаКолонкаЛевая.Видимость         = ЭтоСобственноеТС;
		Элементы.ГруппаДопПараметрыПодвалКолонкаПривлеченное.Видимость = НЕ ЭтоСобственноеТС;
		Элементы.ГруппаДопПараметрыПодвалКолонкаПравая.Видимость       = ЭтоСобственноеТС;
		Элементы.ГруппаДопПараметрыПодвал.Видимость                    = ЭтоАвтотранспорт;
		
		// Страница Маршрутизация
		Элементы.ОсновнойРежимРаботыДляМаршрутизации.Видимость   = ЭтоСобственноеТС;
		Элементы.РазрешитьНарушениеРежимаРаботы.Видимость        = ЭтоСобственноеТС И ЗначениеЗаполнено(Объект.ОсновнойРежимРаботы);
		Элементы.ГруппаСтоимостьТранспортаПараметры.Доступность = НЕ ЗначениеЗаполнено(Объект.КастомнаяСтоимостьМаршрута);

		// Страница Рег. документы
		Элементы.ГруппаОбязательныеВидыДокументов.Видимость      = Истина; 
		
		// Страница Экипаж  
		Элементы.ИспользуютсяАгентскиеДоговоры.Видимость = ВариантПоставкиТакси И ЭтоПривлеченноеТС И Объект.ДоступноДляТакси;
		Элементы.ГруппаАгентскиеДоговоры.Видимость       = ВариантПоставкиТакси И ЭтоПривлеченноеТС И Объект.ИспользуютсяАгентскиеДоговоры;
		Элементы.ГруппаЭкипаж.Видимость                  = ЭтоСобственноеТС;
		
		// Страница Нормы расхода ГСМ
		УстановитьНазваниеРасходаГСМ();

		// Страница Мониторинг 
		Элементы.ТаблицаСоответствийДатчиков.Видимость            = Ложь;
		Элементы.ДатчикОдометр.Видимость                          = Ложь;
		Элементы.КалибровочноеЗначение.Видимость                  = Ложь;
		Элементы.ИсточникПолученияДанныхПробегаАвтограф.Видимость = Ложь;
		Если Объект.ИспользуемаяСистемаGPS = Справочники.уатВнешниеСистемы.АвтоГРАФ 
			И (Объект.УчетнаяЗаписьСистемыМониторинга.Версия = Перечисления.уатВерсииАвтоГРАФ.АвтоГРАФ_5
			ИЛИ Объект.УчетнаяЗаписьСистемыМониторинга.Версия = Перечисления.уатВерсииАвтоГРАФ.АвтоГРАФ_7) Тогда
			Элементы.ТаблицаСоответствийДатчиков.Видимость            = Истина;
			Элементы.ИсточникПолученияДанныхПробегаАвтограф.Видимость = Истина;
		КонецЕсли;
		Если Объект.ИспользуемаяСистемаGPS = Справочники.уатВнешниеСистемы.СКАУТ 
			И Объект.УчетнаяЗаписьСистемыМониторинга.СпособРеализацииВебСервиса = Перечисления.уатСпособыРеализацииВебСервиса.REST Тогда
			Элементы.ДатчикОдометр.Видимость         = Истина;
			Элементы.КалибровочноеЗначение.Видимость = Истина;
		КонецЕсли;
		Элементы.ПолучательУведомленийПриОтсутствииДанных.Видимость = Объект.ФормироватьУведомленияПриОтсутствииДанных;
		
		// Страница Штрафы
		Элементы.ШтрафыНЕТ_ОбновитьИнформацииОТС.Видимость = ЗначениеЗаполнено(Объект.УчетнаяЗаписьCервисаШтрафов)
			И уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Объект.УчетнаяЗаписьCервисаШтрафов, "ВнешняяСистема")
			= ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.ШтрафовНет");
		Элементы.ШтрафыНЕТ_ЗагрузитьШтрафы.Видимость = ЗначениеЗаполнено(Объект.УчетнаяЗаписьCервисаШтрафов)
			И уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Объект.УчетнаяЗаписьCервисаШтрафов, "ВнешняяСистема")
			= ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.ШтрафовНет");

		// Страница Платные дороги
		Если НЕ ПравоДоступа("Чтение", Метаданные.РегистрыСведений.уатИсторияЗакрепленияБортовыхУстройств) Тогда
			Элементы.ИсторияЗакрепленияБортовыхУстройств.Видимость 	   = Ложь;
			Элементы.ИзменитьНомерБортовогоУстройстваАвтодор.Видимость = Ложь;
			Элементы.ИзменитьНомерБортовогоУстройстваПлатон.Видимость  = Ложь;
		КонецЕсли;
		
		// Страница Состав ТС
		Элементы.СоставТСВСоставе.Видимость       = НЕ ЭтоАвтотранспорт;
		Элементы.СоставТСВСоставеМодель.Видимость = Не ЭтоАвтотранспорт;
		Элементы.СоставТСТС.Видимость             = ЭтоАвтотранспорт;
		Элементы.СоставТСТСМодель.Видимость       = ЭтоАвтотранспорт;
		
		// Страница MultiGo
		АдресСервисаMultiGo = уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Объект.УчетнаяЗаписьMultiGo, "АдресСервиса");
		Элементы.ИДвСервисеMultiGo.Видимость = ЗначениеЗаполнено(Объект.УчетнаяЗаписьMultiGo)
			И АдресСервисаMultiGo <> "https://api.multigo.ru"
			И АдресСервисаMultiGo <> "https://api.multigo.ru/router/1/";

		// Страница СтраницаБухУчет
		ОбновитьНалоговуюБазу();
		ОбновитьНадписьСтавкаТранспортногоНалога();
	КонецЕсли;
	
	ВидимостьВводВЭксплуатацию  = (Объект.ДатаВводаВЭксплуатацию = '00010101');
	Если Элементы.ВводВЭксплуатацию.Видимость <> ВидимостьВводВЭксплуатацию Тогда
		Элементы.ВводВЭксплуатацию.Видимость = ВидимостьВводВЭксплуатацию;
	КонецЕсли;
	Элементы.НачальныйПробег.ТолькоПросмотр          = НЕ ВидимостьВводВЭксплуатацию;
	Элементы.ГруппаВводВЭксплуатацию.ТекущаяСтраница = ?(ВидимостьВводВЭксплуатацию, Элементы.ПомощникВводаВЭксплуатацию, Элементы.Гиперссылки);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРеквизитыТСПоМоделиТС(Знач Оповещение)
	
	ТекстНСТР = НСтр("en='Refill attributes of corresponding model of vehicle?';ru='Перезаполнить реквизиты, соответствующие модели ТС?'");
	ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьРеквизитыТСПоМоделиТСЗавершение", ЭтотОбъект, Новый Структура("Оповещение", Оповещение)), 
		ТекстНСТР, 
		РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРеквизитыТСПоМоделиТСЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Оповещение = ДополнительныеПараметры.Оповещение;
	    
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Если Не Оповещение = Неопределено Тогда 
			ВыполнитьОбработкуОповещения(Оповещение);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	//Объект.ВладелецТС = Неопределено;
	//Объект.Водитель   = Неопределено;
	
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("ТипТС",                  Неопределено);
	СтруктураРеквизитов.Вставить("ВидМоделиТС",            Неопределено);
	СтруктураРеквизитов.Вставить("МодельДвигателя",        Неопределено);
	СтруктураРеквизитов.Вставить("МощностьДвигателяЛС",    Неопределено);
	СтруктураРеквизитов.Вставить("МощностьДвигателяКВт",   Неопределено);
	СтруктураРеквизитов.Вставить("СобственныйВес",         Неопределено);
	СтруктураРеквизитов.Вставить("ГабаритныйРазмерДлина",  Неопределено);
	СтруктураРеквизитов.Вставить("ГабаритныйРазмерВысота", Неопределено);
	СтруктураРеквизитов.Вставить("ГабаритныйРазмерШирина", Неопределено);
	СтруктураРеквизитов.Вставить("ПолезныйРазмерДлина",    Неопределено);
	СтруктураРеквизитов.Вставить("ПолезныйРазмерВысота",   Неопределено);
	СтруктураРеквизитов.Вставить("ПолезныйРазмерШирина",   Неопределено);
	СтруктураРеквизитов.Вставить("Марка",                  Неопределено);
	
	СтруктураЗначенияРекв = уатОбщегоНазначенияТиповыеСервер.ПолучитьЗначенияРеквизитов(Объект.Модель, СтруктураРеквизитов);
	
	Если ТипЗнч(СтруктураЗначенияРекв) = Тип("Структура") Тогда 
		Для Каждого ТекРекв Из СтруктураЗначенияРекв Цикл
			Объект[ТекРекв.Ключ] = ТекРекв.Значение;
		КонецЦикла;
	Иначе
		Для Каждого ТекРекв Из СтруктураРеквизитов Цикл
			Объект[ТекРекв.Ключ] = ТекРекв.Значение;
		КонецЦикла;
	КонецЕсли;
	
	УстановитьВидимость();
	ПриИзмененииВидаМоделиТС();
	ЗаполнитьОбязательныеДокументы();
	
	Если Не Оповещение = Неопределено Тогда 
		ВыполнитьОбработкуОповещения(Оповещение);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВернутьСсылкуНаОбъектПоКлючу(ИмяСписка, ВыбраннаяСтрока, ФлагТС = Ложь, ФлагМодельВСоставе = Ложь)
	Если ИмяСписка = "СоставТС" Тогда
		Если ФлагТС Тогда
			Возврат ВыбраннаяСтрока.ТС;
		ИначеЕсли ФлагМодельВСоставе Тогда 
			СтуктураОтбора = Новый Структура("ТС", ВыбраннаяСтрока.ТС);
			Запись = РегистрыСведений.уатСоставТС.Получить(СтуктураОтбора); 
			Возврат Запись.ВСоставе.Модель;
		Иначе
			Возврат ВыбраннаяСтрока.ТС.Модель;
		КонецЕсли;
	ИначеЕсли ИмяСписка = "Агрегаты" Тогда
		Возврат ВыбраннаяСтрока.СерияНоменклатуры;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ПриИзмененииВидаМоделиТС()
	Если Объект.ВидМоделиТС <> ПредопределенноеЗначение("Перечисление.уатВидыМоделейТС.Автотранспорт") Тогда
		Объект.ОсновнойВидПЛ         = Неопределено;
		Объект.ОсновнойРежимРаботы   = Неопределено;
		Объект.ОсновноеУсловиеРаботы = Неопределено;
		Объект.ОсновнойВидПеревозки   = Неопределено;
		Объект.АвтоматическиСписыватьРасходТопливаНаЗапуск = Ложь;
		ОчиститьКоэффициентИзмененияНормТопливаТС(Объект.Ссылка);
		КоэффициентИзмененияНормТоплива = 0;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОчиститьКоэффициентИзмененияНормТопливаТС(ТС)
	Если НЕ ЗначениеЗаполнено(ТС) Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.уатСведенияОТС.СоздатьНаборЗаписей();
	НаборЗаписей.Заполнить(Неопределено);
	НаборЗаписей.Отбор.ТС.Установить(ТС);
	НаборЗаписей.Записать();
КонецПроцедуры

&НаСервере
Процедура ОбновитьНадписьСтавкаТранспортногоНалога()
	ВалютаРегл = уатОбщегоНазначенияТиповые.ВалютаРегламентированногоУчета(Объект.Организация);
	Если Не ЗначениеЗаполнено(ВалютаРегл) Тогда
		ВалютаРегл = "руб";
	КонецЕсли;
	
	НадписьСтавкаТранспортногоНалога = ?(ЗначениеЗаполнено(СтавкаТранспортногоНалога), ""
		+ уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(СтавкаТранспортногоНалога, "Ставка") + " (" + ВалютаРегл + ")", НСтр("en='not specified';ru='не указана'"));
КонецПроцедуры

&НаСервере
Процедура ПрочитатьТранспортныйНалог()
	тблСреза = РегистрыСведений.уатСведенияОТС.СрезПоследних(ТекущаяДата(), Новый Структура("ТС", Объект.Ссылка));
	Если тблСреза.Количество() > 0 Тогда
		НачислятьТранспортныйНалог = тблСреза[0].НачислятьТранспортныйНалог;
		СтавкаТранспортногоНалога = тблСреза[0].СтавкаТранспортногоНалога;
		НалоговаяБаза = тблСреза[0].НалоговаяБаза;
		ЕдиницаИзмеренияНалоговойБазы = тблСреза[0].ЕдиницаИзмеренияНалоговойБазы;
		ЭкологическийКласс = тблСреза[0].ЭкологическийКласс;
		
		ОбновитьНадписьСтавкаТранспортногоНалога();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтраницуGPS()
	
	Если Объект.ИспользуемаяСистемаGPS = ПредопределенноеЗначение("Справочник.уатВнешниеСистемы._1СЦСМ") Тогда
		Элементы.СтраницыGPS.Видимость = Истина;
		Элементы.GPSобщее.Видимость = Ложь;
		Элементы.ИДвСистемеНавигации.Видимость = Ложь;
		Элементы.ЦСМ.Видимость = Истина;
		Элементы.СтраницыGPS.ТекущаяСтраница = Элементы.ЦСМ;
		
		ТекТерминал = ПрочитатьТерминал(Объект.Ссылка);
		Если ТекТерминал <> Неопределено Тогда
			Терминал = ТекТерминал;
		КонецЕсли;
		
		УстановитьКартинкиИконокОбъекта();
		ОбновитьЦветНастраиваемогоРевизита("МониторингЦветНадписиНаКарте", "МониторингЦветНадписиНаКартеЧисло");
		ОбновитьЦветНастраиваемогоРевизита("МониторингЦветМаршрута", "МониторингЦветМаршрутаЧисло");
		
	ИначеЕсли ЗначениеЗаполнено(Объект.ИспользуемаяСистемаGPS) Тогда
		Элементы.СтраницыGPS.Видимость = Истина;
		Элементы.GPSобщее.Видимость = Истина;
		Элементы.ИДвСистемеНавигации.Видимость = Истина;
		Элементы.ЦСМ.Видимость = Ложь;
		Элементы.СтраницыGPS.ТекущаяСтраница = Элементы.GPSобщее;
		УстановитьВидимостьГПС();
		
	Иначе
		Элементы.СтраницыGPS.Видимость = Ложь;
		Элементы.ИДвСистемеНавигации.Видимость = Истина;
	КонецЕсли;
	
	Элементы.ИспользоватьДанныеCANшиныОдометр.Видимость = Объект.ИспользуемаяСистемаGPS = ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.Omnicomm");
	Элементы.ИспользоватьДанныеCANшиныОдометр.Заголовок = "Использовать данные CAN-шины для получения пробега и значения одометра";
	Элементы.ИспользоватьДанныеCANшиныОдометр.Подсказка = "Использовать данные CAN-шины для получения пробега и значения одометра.";
	Элементы.УчетнаяЗаписьСистемыМониторинга.Видимость  = НЕ Объект.ИспользуемаяСистемаGPS = ПредопределенноеЗначение("Справочник.уатВнешниеСистемы._1СЦСМ");
	
	НаименованиеДействия = "Справочник.уатТС.Форма.ФормаЭлемента.УстановитьСтраницуGPS";
	#Если Не ТолстыйКлиентОбычноеПриложение Тогда
	уатРаботаСРасширениямиКлиент.ПСМ_ВыполнитьДействияВФорме(НаименованиеДействия,
		?(ТипЗнч(Объект.ИспользуемаяСистемаGPS) = Тип("Строка"), Объект.ИспользуемаяСистемаGPS,
		уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Объект.ИспользуемаяСистемаGPS, "НаименованиеПС")),, ЭтотОбъект);
	#КонецЕсли
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПрочитатьТерминал(Ссылка)
	БылУстановленПривилегированныйРежим = Истина;
	Если Не ПривилегированныйРежим() Тогда
		БылУстановленПривилегированныйРежим = Ложь;
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли; 
	
	СтруктураПривязки = РегистрыСведений.ItobПривязкиТрекеров.ПолучитьПоследнее(ТекущаяДата(), Новый Структура("Объект", Ссылка));
	
	Если НЕ БылУстановленПривилегированныйРежим Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли; 
	
	Если СтруктураПривязки.ТерминалУстановлен = Истина Тогда
		Возврат СтруктураПривязки.Терминал;
	КонецЕсли;
	
	Возврат Неопределено;

КонецФункции

&НаСервере
Процедура УстановитьВидимостьГПС()
	
	Если Объект.ИспользуемаяСистемаGPS = Справочники.уатВнешниеСистемы.Omnicomm
			ИЛИ Объект.ИспользуемаяСистемаGPS = Справочники.уатВнешниеСистемы.Wialon
			ИЛИ Объект.ИспользуемаяСистемаGPS = Справочники.уатВнешниеСистемы.СКАУТ Тогда 
		Элементы.НадписьЧасовойПояс.Видимость = Истина;
	Иначе 
		Элементы.НадписьЧасовойПояс.Видимость = Ложь;
	КонецЕсли;
	
	Если Элементы.НадписьЧасовойПояс.Видимость Тогда 
		Если Объект.ИспользуемаяСистемаGPS = Справочники.уатВнешниеСистемы.Omnicomm Тогда 
			Omnicomm_ЧасовойПоясПоПодразделению = Ложь;
			Omnicomm_ЧасовойПояс = 3;
			
			ПараметрыOmnicomm = Константы.уатПараметрыРеглЗаданияЗагрузкаДанныхOmnicomm.Получить().Получить();
			Если Не ПараметрыOmnicomm = Неопределено Тогда 
				Если ПараметрыOmnicomm.Свойство("ЧасовойПоясПоПодразделению") Тогда
					Omnicomm_ЧасовойПоясПоПодразделению = ПараметрыOmnicomm.ЧасовойПоясПоПодразделению;
				КонецЕсли;
				
				Если ПараметрыOmnicomm.Свойство("ЧасовойПояс") Тогда
					Omnicomm_ЧасовойПояс = ПараметрыOmnicomm.ЧасовойПояс;
				КонецЕсли;
			КонецЕсли;
			
			Если Omnicomm_ЧасовойПоясПоПодразделению Тогда 
				Omnicomm_ЧасовойПояс = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(
					Объект.Подразделение,
					ПланыВидовХарактеристик.уатПраваИНастройки.КорректировкаВремениДляЗагрузкиOmnicomm
				);
				
				НадписьЧасовойПояс = " " + НСтр("ru = 'по подразделению'; en = 'by division'") + " """ + Строка(Объект.Подразделение) + """: " 
					+ ?(Omnicomm_ЧасовойПояс < 0, "", "+") + Строка(Omnicomm_ЧасовойПояс);
				
			Иначе 
				НадписьЧасовойПояс = ": " + ?(Omnicomm_ЧасовойПояс < 0, "", "+") + Строка(Omnicomm_ЧасовойПояс);
			КонецЕсли;
			
		ИначеЕсли Объект.ИспользуемаяСистемаGPS = Справочники.уатВнешниеСистемы.Wialon Тогда  
			Wialon_ЧасовойПоясПоПодразделению = Ложь;
			Wialon_ЧасовойПояс = 3;
			
			ПараметрыWialon = Константы.уатПараметрыРеглЗаданияЗагрузкаДанныхWialon.Получить().Получить();
			Если Не ПараметрыWialon = Неопределено Тогда 
				Если ПараметрыWialon.Свойство("ЧасовойПоясПоПодразделению") Тогда
					Wialon_ЧасовойПоясПоПодразделению = ПараметрыWialon.ЧасовойПоясПоПодразделению;
				КонецЕсли;
				
				Если ПараметрыWialon.Свойство("ЧасовойПояс") Тогда
					Wialon_ЧасовойПояс = ПараметрыWialon.ЧасовойПояс;
				КонецЕсли;
			КонецЕсли;
			
			Если Wialon_ЧасовойПоясПоПодразделению Тогда 
				Wialon_ЧасовойПояс = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(
					Объект.Подразделение,
					ПланыВидовХарактеристик.уатПраваИНастройки.КорректировкаВремениДляЗагрузкиWialon
				);
				
				НадписьЧасовойПояс = " " + НСтр("ru = 'по подразделению'; en = 'by division'") + " """ + Строка(Объект.Подразделение) + """: " 
					+ ?(Wialon_ЧасовойПояс < 0, "", "+") + Строка(Wialon_ЧасовойПояс);
				
			Иначе 
				НадписьЧасовойПояс = ": " + ?(Wialon_ЧасовойПояс < 0, "", "+") + Строка(Wialon_ЧасовойПояс);
			КонецЕсли;
			
		ИначеЕсли Объект.ИспользуемаяСистемаGPS = Справочники.уатВнешниеСистемы.СКАУТ Тогда  
			СКАУТ_ЧасовойПоясПоПодразделению = Ложь;
			СКАУТ_ЧасовойПояс = "Europe/Moscow";
			
			ПараметрыСКАУТ = Константы.уатПараметрыРеглЗаданияЗагрузкаДанныхСКАУТ.Получить().Получить();
			Если Не ПараметрыСКАУТ = Неопределено Тогда 
				Если ПараметрыСКАУТ.Свойство("ЧасовойПоясПоПодразделению") Тогда
					СКАУТ_ЧасовойПоясПоПодразделению = ПараметрыСКАУТ.ЧасовойПоясПоПодразделению;
				КонецЕсли;
				
				Если ПараметрыСКАУТ.Свойство("ЧасовойПояс") Тогда
					СКАУТ_ЧасовойПояс = ПараметрыСКАУТ.ЧасовойПояс;
				КонецЕсли;
			КонецЕсли;
			
			Если СКАУТ_ЧасовойПоясПоПодразделению Тогда 
				СКАУТ_ЧасовойПояс = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(
					Объект.Подразделение,
					ПланыВидовХарактеристик.уатПраваИНастройки.ЧасовойПоясДляВзаимодействияСКАУТ
				);
				
				НадписьЧасовойПояс = " " + НСтр("ru = 'по подразделению'; en = 'by division'") + " """ + Строка(Объект.Подразделение) + """: " 
					+ Строка(СКАУТ_ЧасовойПояс);
				
			Иначе 
				НадписьЧасовойПояс = ": " + Строка(СКАУТ_ЧасовойПояс);
			КонецЕсли;
		Иначе 
			НадписьЧасовойПояс = "";
		КонецЕсли;
		
		НадписьЧасовойПояс = НСтр("ru = 'При загрузке данных будет использоваться настройка часового пояса'; en = 'The time zone setting will be used when loading data.'") + НадписьЧасовойПояс;
		
	Иначе 
		НадписьЧасовойПояс = "";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьИсточникФактическихДанныхДляКартографии()
	
	Если Константы.уатИспользоватьМобильноеПриложениеВодителя.Получить() <> Истина Тогда
		Элементы.ИсточникФактическихДанныхДляКартографии.СписокВыбора.Удалить(
			Элементы.ИсточникФактическихДанныхДляКартографии.СписокВыбора.НайтиПоЗначению(
				Перечисления.уатИсточникФактическихДанныхДляКартографии.МобильноеПриложение));
		Элементы.НадписьМПНеИспользуется.Видимость = Истина;
	Иначе 
		Элементы.НадписьМПНеИспользуется.Видимость = Ложь;
	КонецЕсли;
	ИспользоватьМониторинг = Константы.уатИспользоватьМониторинг.Получить();
	
	Если ИспользоватьМониторинг <> Истина Тогда
		Элементы.ИсточникФактическихДанныхДляКартографии.СписокВыбора.Удалить(
			Элементы.ИсточникФактическихДанныхДляКартографии.СписокВыбора.НайтиПоЗначению(
				Перечисления.уатИсточникФактическихДанныхДляКартографии.СистемаСпутниковогоМониторинга));
		Элементы.НадписьССМНеИспользуется.Видимость = Истина;
		Элементы.ГруппаGPSдоп.Видимость = Ложь;
		Элементы.ИспользуемаяСистемаGPS.Видимость = Ложь;
		Элементы.УчетнаяЗаписьСистемыМониторинга.Видимость = Ложь;
	Иначе 
		Элементы.НадписьССМНеИспользуется.Видимость = Ложь;
		Элементы.ГруппаGPSдоп.Видимость = Истина;
		Элементы.ИспользуемаяСистемаGPS.Видимость = Истина;
		Элементы.УчетнаяЗаписьСистемыМониторинга.Видимость = Истина;
	КонецЕсли;
	
	Элементы.ГруппаМониторинг.Видимость = ИспользоватьМониторинг;
	
	Если Элементы.ИсточникФактическихДанныхДляКартографии.СписокВыбора.Количество() = 1 Тогда 
		Элементы.ИсточникФактическихДанныхДляКартографии.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВводВЭксплуатациюПродолжение(Результат, ДопПараметры) Экспорт 
	
	Если Не Результат = КодВозвратаДиалога.Да Тогда
		Возврат;
	Иначе
		Если Не ПроверитьЗаполнение() Тогда
			Возврат;
		КонецЕсли;
		
		Попытка
			Если Записать() Тогда 
				ПараметрыФормы = Новый Структура("ТС", Объект.Ссылка);
				ОткрытьФорму("Документ.уатВводВЭксплуатациюТСиОборудования.ФормаОбъекта", ПараметрыФормы);
			КонецЕсли;
		Исключение
			ТекстСообщения = ИнформацияОбОшибке().Описание;
			ТекПричина = ИнформацияОбОшибке().Причина;
			Сч = 1; МаксСч = 10;
			Пока ТекПричина <> Неопределено И Сч <= МаксСч Цикл
				ТекстСообщения = ТекстСообщения + " \ " + ТекПричина.Описание;
				ТекПричина = ТекПричина.Причина;
				Сч = Сч + 1;
			КонецЦикла;
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПомощникВводаВЭксплуатациюПродолжение(Результат, ДопПараметры) Экспорт 
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Если Не ПроверитьЗаполнение() Тогда
			Возврат;
		КонецЕсли;
		
		Попытка
			Записать();
		Исключение
			ТекстСообщения = ИнформацияОбОшибке().Описание;
			ТекПричина = ИнформацияОбОшибке().Причина;
			Сч = 1; МаксСч = 10;
			Пока ТекПричина <> Неопределено И Сч <= МаксСч Цикл
				ТекстСообщения = ТекстСообщения + " \ " + ТекПричина.Описание;
				ТекПричина = ТекПричина.Причина;
				Сч = Сч + 1;
			КонецЦикла;
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьТранспортныйНалогЗавершение(ДополнительныеПараметры) Экспорт
    Заглушка = Истина;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКлючСтаройЗаписи(СтараяЗапись)
	Возврат РегистрыСведений.уатСведенияОТС.СоздатьКлючЗаписи(Новый Структура("Период, ТС", СтараяЗапись.Период, СтараяЗапись.ТС));
КонецФункции

&НаСервереБезКонтекста
Функция СтруктураСрезаСведенийОТС(ТС, Знач ДатаСреза = Неопределено)
	Если ДатаСреза = Неопределено Тогда
		ДатаСреза = ТекущаяДата();
	КонецЕсли;
	
	тблСрез = РегистрыСведений.уатСведенияОТС.СрезПоследних(ДатаСреза, Новый Структура("ТС", ТС));
	Если тблСрез.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		СтруктРез = Новый Структура("Период, ТС, СтавкаТранспортногоНалога, КоэффициентИзмененияНормТоплива, НачислятьТранспортныйНалог, НалоговаяБаза, ЕдиницаИзмеренияНалоговойБазы, ЭкологическийКласс, Комментарий");
		ЗаполнитьЗначенияСвойств(СтруктРез, тблСрез[0]);
		Возврат СтруктРез;
	КонецЕсли;
КонецФункции

&НаСервере
Функция СформироватьНаименованиеСервер()
	
	СпрОб = РеквизитФормыВЗначение("Объект");
	Рез = уатНастройкиШаблонов.СформироватьНаименованиеПоШаблону("Справочник_уатТС", СпрОб);
	Возврат Рез;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьСписокВыбораИспользуемойСистемыМониторинга()
	Элементы.ИспользуемаяСистемаGPS.СписокВыбора.Очистить();
	Если уатМодификацияКонфигурацииВызовСервера_проф.ПолучитьЗначениеКонстанты("уатИспользоватьOmnicomm") Тогда
		Элементы.ИспользуемаяСистемаGPS.СписокВыбора.Добавить(ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.Omnicomm"));
	КонецЕсли;
	Если уатМодификацияКонфигурацииВызовСервера_проф.ПолучитьЗначениеКонстанты("уатИспользоватьWialon") Тогда
		Элементы.ИспользуемаяСистемаGPS.СписокВыбора.Добавить(ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.Wialon"));
	КонецЕсли;
	Если уатМодификацияКонфигурацииВызовСервера_проф.ПолучитьЗначениеКонстанты("уатИспользоватьЦСМ") Тогда
		Элементы.ИспользуемаяСистемаGPS.СписокВыбора.Добавить(ПредопределенноеЗначение("Справочник.уатВнешниеСистемы._1СЦСМ"));
	КонецЕсли;
	Если уатМодификацияКонфигурацииВызовСервера_проф.ПолучитьЗначениеКонстанты("уатИспользоватьАвтоГРАФ") Тогда
		Элементы.ИспользуемаяСистемаGPS.СписокВыбора.Добавить(ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.АвтоГРАФ"));
	КонецЕсли;
	Если уатМодификацияКонфигурацииВызовСервера_проф.ПолучитьЗначениеКонстанты("уатИспользоватьСКАУТ") Тогда
		Элементы.ИспользуемаяСистемаGPS.СписокВыбора.Добавить(ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.СКАУТ"));
	КонецЕсли;
	МассивПСМ = Новый Массив();
	уатРаботаСРасширениями.ПСМ_ЗаполнитьМассивВнешихСистем(МассивПСМ);
	Для Каждого ТекСтрока Из МассивПСМ Цикл
		Элементы.ИспользуемаяСистемаGPS.СписокВыбора.Добавить(ТекСтрока);
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Объект.ИспользуемаяСистемаGPS)
		И Элементы.ИспользуемаяСистемаGPS.СписокВыбора.НайтиПоЗначению(Объект.ИспользуемаяСистемаGPS) = Неопределено Тогда
		Элементы.ИспользуемаяСистемаGPS.СписокВыбора.Добавить(Объект.ИспользуемаяСистемаGPS);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокВыбораИспользуемогоСервисаШтрафов()
	Элементы.ИспользуемыйСервисШтрафов.СписокВыбора.Очистить();
	Если уатМодификацияКонфигурацииВызовСервера_проф.ПолучитьЗначениеКонстанты("уатИспользоватьСервисШтрафовНет") Тогда
		Элементы.ИспользуемыйСервисШтрафов.СписокВыбора.Добавить(ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.ШтрафовНет"));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ИспользуемыйСервисШтрафов)
		И Элементы.ИспользуемыйСервисШтрафов.СписокВыбора.НайтиПоЗначению(Объект.ИспользуемыйСервисШтрафов) = Неопределено Тогда
		Элементы.ИспользуемыйСервисШтрафов.СписокВыбора.Добавить(Объект.ИспользуемыйСервисШтрафов);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗначенияШтрафов()
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ТС", Объект.Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	уатИнформацияоТСпоДаннымСервисаШтрафов.Статус КАК Статус,
	               |	уатИнформацияоТСпоДаннымСервисаШтрафов.ПричинаНеактивности КАК ПричинаНеактивности,
	               |	уатИнформацияоТСпоДаннымСервисаШтрафов.ДатаПоследнейПроверкивГИС КАК ДатаПоследнейПроверкивГИС,
	               |	уатИнформацияоТСпоДаннымСервисаШтрафов.ДатаПоследнейПроверкивГИБДД КАК ДатаПоследнейПроверкивГИБДД,
	               |	уатИнформацияоТСпоДаннымСервисаШтрафов.ДатаПоследнейПроверкивДИТ КАК ДатаПоследнейПроверкивДИТ,
	               |	уатИнформацияоТСпоДаннымСервисаШтрафов.ДатаДобавленияТС КАК ДатаДобавленияТС,
	               |	уатИнформацияоТСпоДаннымСервисаШтрафов.КоличествоШтрафов КАК КоличествоШтрафов,
	               |	уатИнформацияоТСпоДаннымСервисаШтрафов.СуммаЗадолженности КАК СуммаЗадолженности,
	               |	уатИнформацияоТСпоДаннымСервисаШтрафов.Автопарк КАК Автопарк
	               |ИЗ
	               |	РегистрСведений.уатИнформацияоТСпоДаннымСервисаШтрафов КАК уатИнформацияоТСпоДаннымСервисаШтрафов
	               |ГДЕ
	               |	уатИнформацияоТСпоДаннымСервисаШтрафов.ТС = &ТС";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Штрафы_Статус						 = Выборка.Статус;
		Штрафы_Автопарк						 = Выборка.Автопарк;
		Штрафы_ПричинаНеактивности			 = Выборка.ПричинаНеактивности;
		Штрафы_ДатаПоследнейПроверкивГИБДД	 = Выборка.ДатаПоследнейПроверкивГИБДД;
		Штрафы_ДатаПоследнейПроверкивГИС	 = Выборка.ДатаПоследнейПроверкивГИС;
		Штрафы_ДатаПоследнейПроверкивДИТ	 = Выборка.ДатаПоследнейПроверкивДИТ;
		Штрафы_ДатаДобавленияТС				 = Выборка.ДатаДобавленияТС;
		Штрафы_КоличествоШтрафов			 = Выборка.КоличествоШтрафов;
		Штрафы_СуммаЗадолженности			 = Выборка.СуммаЗадолженности;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УчетнаяЗаписьCистемыШтрафовПриИзменении(Элемент)
	Элементы.ШтрафыНЕТ_ОбновитьИнформацииОТС.Видимость = ЗначениеЗаполнено(Объект.УчетнаяЗаписьCервисаШтрафов)
	И уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Объект.УчетнаяЗаписьCервисаШтрафов, "ВнешняяСистема")
		= ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.ШтрафовНет");
	Элементы.ШтрафыНЕТ_ЗагрузитьШтрафы.Видимость = ЗначениеЗаполнено(Объект.УчетнаяЗаписьCервисаШтрафов)
	И уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Объект.УчетнаяЗаписьCервисаШтрафов, "ВнешняяСистема")
		= ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.ШтрафовНет");
КонецПроцедуры

&НаКлиенте
Процедура ШтрафыНЕТ_ОбновитьИнформацииОТС(Команда)
	Если Объект.Ссылка.Пустая() Тогда
		Отказ = Истина;
		ТекстНСТР = НСтр("ru = 'Перед обновлением информации о ТС в сервисе штрафов необходимо записать объект!'; en = 'Before updating vehicle information in the fines service, you must register the object!'");
		ПоказатьПредупреждение(Неопределено, ТекстНСТР);
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(Объект.УчетнаяЗаписьCервисаШтрафов)
		И ЗначениеЗаполнено(Объект.ИДвСервисеШтрафов) Тогда
		
		ТекстОшибки = "";
		
		уатИнтеграции_проф.ОбновитьИнформациюОТСВСервисеШтрафов(Объект.УчетнаяЗаписьCервисаШтрафов, Объект.Ссылка, Объект.ИДвСервисеШтрафов, ТекстОшибки);
		Если НЕ ЗначениеЗаполнено(ТекстОшибки) Тогда
			ЗаполнитьЗначенияШтрафов();
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ШтрафыНЕТ_ЗагрузитьШтрафы(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		Отказ = Истина;
		ТекстНСТР = НСтр("ru = 'Перед обновлением информации о ТС в сервисе штрафов необходимо записать объект!'; en = 'Before updating vehicle information in the fines service, you must register the object!'");
		ПоказатьПредупреждение(Неопределено, ТекстНСТР);
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.УчетнаяЗаписьCервисаШтрафов)
		И ЗначениеЗаполнено(Объект.ИДвСервисеШтрафов) Тогда
		
		ТекущийПериод = Новый СтандартныйПериод;
		
		Обработчик    = Новый ОписаниеОповещения("ЗагрузитьШтрафыЗавершениеПериод", ЭтотОбъект);
		Диалог        = Новый ДиалогРедактированияСтандартногоПериода;
		Диалог.Период = ТекущийПериод;
		Диалог.Показать(Обработчик);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПараметры(Команда)
	Если Объект.ТаблицаСоответствийДатчиков.Количество() > 0 Тогда
		ТекстНСТР = НСтр("en='Do you want to clear the table before filling?';ru='Очистить таблицу перед заполнением?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗагрузитьПараметрыЗавершение", ЭтотОбъект), ТекстНСТР, РежимДиалогаВопрос.ДаНетОтмена,,КодВозвратаДиалога.Нет);
		Возврат;
	КонецЕсли;
	ЗагрузитьПараметрыФрагмент();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПараметрыЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	ИначеЕсли Ответ = КодВозвратаДиалога.Да Тогда
		Объект.ТаблицаСоответствийДатчиков.Очистить();
		Модифицированность = Истина;
	КонецЕсли;
	
	ЗагрузитьПараметрыФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПараметрыФрагмент()

	СоответствиеКолонок	 = Новый Соответствие();
	ТекстОшибки			 = "";
	
	КодОтвета = уатМониторинг.АвтоГРАФ5_ЗагрузитьПараметры(Объект.ИДвСистемеНавигации, СоответствиеКолонок, ТекстОшибки, Объект.УчетнаяЗаписьСистемыМониторинга);
	Если ЗначениеЗаполнено(ТекстОшибки)Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекСтрока Из СоответствиеКолонок Цикл
		ИскСтроки = Объект.ТаблицаСоответствийДатчиков.НайтиСтроки(Новый Структура("НаименованиеДатчика", ТекСтрока.Ключ));
		Если ИскСтроки.Количество() = 0 Тогда
			НоваяСтрока                     = Объект.ТаблицаСоответствийДатчиков.Добавить();
			НоваяСтрока.НаименованиеДатчика = ТекСтрока.Ключ;
			НоваяСтрока.ОписаниеДатчика     = ТекСтрока.Значение;
			Если НоваяСтрока.НаименованиеДатчика = "TotalDistance" 
				ИЛИ НоваяСтрока.НаименованиеДатчика = "Total1Distance" Тогда
				НоваяСтрока.НазначениеДатчика = "Пробег";
			ИначеЕсли НоваяСтрока.НаименованиеДатчика = "EngineMotohours" 
				ИЛИ НоваяСтрока.НаименованиеДатчика = "Engine1Motohours" Тогда
				НоваяСтрока.НазначениеДатчика = "Время работы двигателя";
			ИначеЕсли НоваяСтрока.НаименованиеДатчика = "EngineFuelConsum"
				ИЛИ НоваяСтрока.НаименованиеДатчика = "Engine1FuelConsum" Тогда
				НоваяСтрока.НазначениеДатчика = "Расход топлива";
			ИначеЕсли НоваяСтрока.НаименованиеДатчика = "TankFuelLevel Last" 
				ИЛИ НоваяСтрока.НаименованиеДатчика = "Tank1FuelLevel Last" Тогда
				НоваяСтрока.НазначениеДатчика = "Уровень топлива";
			ИначеЕсли НоваяСтрока.НаименованиеДатчика = "SummaryTankFuelLevelLast" Тогда
				НоваяСтрока.НазначениеДатчика = "Остаток топлива возврат";
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	 Объект.ТаблицаСоответствийДатчиков.Сортировать("НазначениеДатчика УБЫВ, НаименованиеДатчика");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИсточникиПолученияДанныхПробега()
	
	Элементы.ИсточникПолученияДанныхПробегаАвтограф.СписокВыбора.Очистить();
	
	МассивИсточников	 = Новый Массив();
	ТекстОшибки			 = "";
	
	КодОтвета = уатМониторинг.АвтоГРАФ5_ЗагрузитьИсточникиПолученияДанныхПробега(Объект.ИДвСистемеНавигации, МассивИсточников, ТекстОшибки, Объект.УчетнаяЗаписьСистемыМониторинга);
	Если ЗначениеЗаполнено(ТекстОшибки)Тогда
		Элементы.ИсточникПолученияДанныхПробегаАвтограф.СписокВыбора.Добавить(Объект.ИсточникПолученияДанныхПробегаАвтограф, "Движение (Motion)");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекСтрока Из МассивИсточников Цикл
		Элементы.ИсточникПолученияДанныхПробегаАвтограф.СписокВыбора.Добавить(ТекСтрока.Значение, ТекСтрока.Представление);
	КонецЦикла;
	
 КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСписокДатчиковНаТС(ID)
	
	Элементы.ДатчикОдометр.СписокВыбора.Очистить();
	
	МассивДатчиков = Новый Массив;
	ТекстОшибки    = "";
	
	КодОтвета = уатМониторинг.СКАУТ_REST_ЗагрузитьСписокДатчиков(ID, МассивДатчиков, ТекстОшибки, Объект.УчетнаяЗаписьСистемыМониторинга);
	
	Если ЗначениеЗаполнено(ТекстОшибки)Тогда
		Элементы.ДатчикОдометр.СписокВыбора.Добавить(Объект.ДатчикОдометр, "Нет доступных датчиков");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекСтрока Из МассивДатчиков Цикл
		Элементы.ДатчикОдометр.СписокВыбора.Добавить(ТекСтрока.Значение, ТекСтрока.Представление);
	КонецЦикла;
	
КонецПроцедуры

// ITOB +++
&НаКлиенте
Функция УстановитьЧисленноеПредставлениеЦвета(НовыйЦвет)
	
	Реузльтат = 0;
	УстановитьЦветСервер(НовыйЦвет, Реузльтат);
	
	Возврат Реузльтат;
	
КонецФункции

&НаСервере
Процедура УстановитьЦветСервер(ВыбранныйЦвет, ЦветДесятичный)
	
	АбсолютныйЦвет = ItobОбщегоНазначения.ПолучитьАбсолютныйЦвет(ВыбранныйЦвет); 
	ЦветДесятичный = ItobОбщегоНазначенияКлиентСервер.ПолучитьЗначениеХраненияЦвета(АбсолютныйЦвет.Красный, 
																					АбсолютныйЦвет.Зеленый, 
																					АбсолютныйЦвет.Синий);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЦветНастраиваемогоРевизита(ИмяНастраемогоРеквизита, ИмяРеквезитаХранение)
	
	Синий = Цел(ЭтотОбъект[ИмяРеквезитаХранение]/(256*256));
	Зеленый = Цел((ЭтотОбъект[ИмяРеквезитаХранение] - Синий*256*256)/256);
	Красный = ЭтотОбъект[ИмяРеквезитаХранение] - Синий*256*256 - Зеленый*256;
	
	ЭтотОбъект[ИмяНастраемогоРеквизита] = Новый Цвет(Красный, Зеленый, Синий);
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКартинкиИконокОбъекта()
	
	МониторингАдресДополнительнойИконки = ПолучитьНавигационнуюСсылку(МониторингДополнительнаяИконкаНаКарте, "Иконка");	
	МониторингАдресИконки = ПолучитьНавигационнуюСсылку(МониторингИконкаНаКарте, "Иконка")	
	
КонецПроцедуры
// ITOB ---

&НаКлиенте
Процедура ЗагрузитьШтрафыЗавершениеПериод(Результат, ДопПараметры) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	ДатаНачала    = НачалоДня(Результат.ДатаНачала);
	ДатаОкончания = НачалоДня(Результат.ДатаОкончания);
		
	Загружено   = 0;	
	ЗагрузитьШтрафыЗавершениеСервер(ДатаНачала, ДатаОкончания, Загружено);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьШтрафыЗавершениеСервер(ДатаНачала, ДатаОкончания, Загружено = 0)
	
	ТекстОшибки = "";

	ДлительнаяОперация = ЗагрузитьШтрафыЗавершениеДлительнаяОперацияСервер(ДатаНачала, ДатаОкончания, ТекстОшибки);
	
	НастройкиОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтаФорма);
	НастройкиОжидания.ВыводитьОкноОжидания       = Истина;
	НастройкиОжидания.ВыводитьПрогрессВыполнения = Истина;
	
	Обработчик = Новый ОписаниеОповещения("ЗагрузитьШтрафыЗавершениеДлительнаяОперацияЗавершение", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Обработчик, НастройкиОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьШтрафыЗавершениеДлительнаяОперацияЗавершение(Операция, ДополнительныеПараметры) Экспорт
	
	Если Операция = Неопределено Тогда
		
	Иначе
		Если Операция.Статус = "Выполнено" Тогда
			Если ЭтоАдресВременногоХранилища(Операция.АдресРезультата) Тогда
				Данные = ПолучитьИзВременногоХранилища(Операция.АдресРезультата);
				Если ТипЗнч(Данные) = Тип("Структура") Тогда
					Если Данные.Свойство("ТекстОшибки") Тогда
						Если ЗначениеЗаполнено(Данные.ТекстОшибки) Тогда
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Данные.ТекстОшибки);
							Возврат;
						Иначе
							ОповеститьОбИзменении(Тип("ДокументСсылка.уатШтраф"));
						КонецЕсли;
					КонецЕсли;
					
				КонецЕсли;
			КонецЕсли;
		Иначе
			ВызватьИсключение Операция.КраткоеПредставлениеОшибки;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьШтрафыЗавершениеДлительнаяОперацияСервер(ДатаНачала, ДатаОкончания, ТекстОшибки)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Загрузка штрафов'; en = 'Loading fines'");
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(
	"уатИнтеграции_проф.ШтрафовНет_СписокШтрафовДлительнаяОперация",
	Новый Структура("УчетнаяЗапись, ИДвСервисеШтрафов, ТС, ДатаНачала, ДатаОкончания",
		Объект.УчетнаяЗаписьCервисаШтрафов, Объект.ИДвСервисеШтрафов, Объект.Ссылка, ДатаНачала, ДатаОкончания),
	ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Функция СтруктураЗаписиНормыГСМ(ТекСтрока)
	СтруктураЗаписи = Новый Структура;
	СтруктураЗаписи.Вставить("Период", ТекСтрока.Период);
	СтруктураЗаписи.Вставить("Организация", ТекСтрока.Организация);
	СтруктураЗаписи.Вставить("МодельТС", ТекСтрока.МодельТС);
	СтруктураЗаписи.Вставить("ГСМ", ТекСтрока.ГСМ);
	СтруктураЗаписи.Вставить("РаботаНаДвухВидахТопливаОдновременно", ТекСтрока.РаботаНаДвухВидахТопливаОдновременно);
	
	Возврат СтруктураЗаписи;
КонецФункции

&НаСервереБезКонтекста
Функция КлючЗаписиНормыРасходаГСМ(СтруктураЗаписи)
	Возврат РегистрыСведений.уатНормыРасходаГСМ.СоздатьКлючЗаписи(СтруктураЗаписи);
КонецФункции

&НаКлиенте
Функция СтруктураЗаписиНормыТЖ(ТекСтрока)
	СтруктураЗаписи = Новый Структура;
	СтруктураЗаписи.Вставить("Период", ТекСтрока.Период);
	СтруктураЗаписи.Вставить("МодельТС", ТекСтрока.МодельТС);
	СтруктураЗаписи.Вставить("ГСМ", ТекСтрока.ГСМ);
	
	Возврат СтруктураЗаписи;
КонецФункции

&НаСервереБезКонтекста
Функция КлючЗаписиНормыРасходаТЖ(СтруктураЗаписи)
	Возврат РегистрыСведений.уатНормыРасходаТехническихЖидкостей.СоздатьКлючЗаписи(СтруктураЗаписи);
КонецФункции

&НаКлиенте
Процедура ИзменитьНомерБортовогоУстройстваНажатие(НаименованиеСистемы)
			
	ПараметрыФормы = Новый Структура("Период, ТС, ОткрытаИзФормыТС", ТекущаяДата(), Объект.Ссылка, Истина);
	ДопПараметры = Новый Структура();
	
	
	Если НаименованиеСистемы = "Платон" Тогда
		ПараметрыФормы.Вставить("ВнешняяСистема", ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.Платон"));
		ПараметрыФормы.Вставить("НомерБортовогоУстройства",  Объект.НомерБортовогоУстройстваПлатон);
		
		ДопПараметры.Вставить("ВнешняяСистема", ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.Платон"));
	ИначеЕсли НаименованиеСистемы = "Автодор" Тогда
		ПараметрыФормы.Вставить("ВнешняяСистема", ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.Автодор"));
		ПараметрыФормы.Вставить("НомерБортовогоУстройства", Объект.НомерБортовогоУстройстваАвтодор);
		
		ДопПараметры.Вставить("ВнешняяСистема", ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.Автодор"));
	КонецЕсли;
	
	ОповещениеОСменеНомераУстройства = Новый ОписаниеОповещения("ИзменитьНомерБортовогоУстройстваПродолжение", ЭтотОбъект, ДопПараметры);
	
	ОткрытьФорму("РегистрСведений.уатИсторияЗакрепленияБортовыхУстройств.ФормаЗаписи", ПараметрыФормы, ЭтотОбъект,,,, ОповещениеОСменеНомераУстройства, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьНомерБортовогоУстройстваПродолжение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
		
	СтруктураИстории	 = ОбновитьДанныеОНомереУстройства(Объект.Ссылка, ДополнительныеПараметры.ВнешняяСистема);
	Если СтруктураИстории.ВнешняяСистема = ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.Платон") Тогда
		Объект.НомерБортовогоУстройстваПлатон = СтруктураИстории.НомерБортовогоУстройства;
	ИначеЕсли СтруктураИстории.ВнешняяСистема = ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.Автодор") Тогда
		Объект.НомерБортовогоУстройстваАвтодор = СтруктураИстории.НомерБортовогоУстройства;
	КонецЕсли;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОбновитьДанныеОНомереУстройства(ТС, ВнешняяСистема)
	ИсторияЗакрепленияБортовыхУстройствСрезПоследних = Новый Структура("ВнешняяСистема, НомерБортовогоУстройства", Справочники.уатВнешниеСистемы.ПустаяСсылка(), "");
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	уатИсторияЗакрепленияБортовыхУстройствСрезПоследних.ВнешняяСистема КАК ВнешняяСистема,
	               |	уатИсторияЗакрепленияБортовыхУстройствСрезПоследних.НомерБортовогоУстройства КАК НомерБортовогоУстройства
	               |ИЗ
	               |	РегистрСведений.уатИсторияЗакрепленияБортовыхУстройств.СрезПоследних(
	               |			&Дата,
	               |			ТС = &ТС
	               |				И ВнешняяСистема = &ВнешняяСистема) КАК уатИсторияЗакрепленияБортовыхУстройствСрезПоследних";
	
	
	Запрос.УстановитьПараметр("ТС", ТС);
	Запрос.УстановитьПараметр("ВнешняяСистема", ВнешняяСистема);
	Запрос.УстановитьПараметр("Дата",  ТекущаяДата());
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ИсторияЗакрепленияБортовыхУстройствСрезПоследних.ВнешняяСистема = Выборка.ВнешняяСистема;
		ИсторияЗакрепленияБортовыхУстройствСрезПоследних.НомерБортовогоУстройства = Выборка.НомерБортовогоУстройства;
	КонецЕсли;
	
	Возврат ИсторияЗакрепленияБортовыхУстройствСрезПоследних;
	
КонецФункции

&НаСервере
Процедура ИсторияЗакрепленияБортовыхУстройствЗакрытие(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	СтруктураИсторииПлатон	 = ОбновитьДанныеОНомереУстройства(Объект.Ссылка, Справочники.уатВнешниеСистемы.Платон);
	Если Объект.Ссылка.НомерБортовогоУстройстваПлатон <> СтруктураИсторииПлатон.НомерБортовогоУстройства Тогда
		Объект.НомерБортовогоУстройстваПлатон = СтруктураИсторииПлатон.НомерБортовогоУстройства;
		Модифицированность = Истина;
	КонецЕсли;
	
	СтруктураИсторииАвтодор  = ОбновитьДанныеОНомереУстройства(Объект.Ссылка, Справочники.уатВнешниеСистемы.Автодор);
	Если Объект.Ссылка.НомерБортовогоУстройстваАвтодор <> СтруктураИсторииАвтодор.НомерБортовогоУстройства Тогда	
		Объект.НомерБортовогоУстройстваАвтодор = СтруктураИсторииАвтодор.НомерБортовогоУстройства;	
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНастройкиMultiGoПродолжение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	ИначеЕсли Ответ = КодВозвратаДиалога.Да Тогда
		Объект.НастройкиMultiGo.Очистить();
	КонецЕсли;
	
	ЗагрузитьНастройкиMultiGoСервер();
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНастройкиMultiGoСервер()
	МакетДанных = Справочники.уатТС.ПолучитьМакет("НастройкиMultiGo");
	КолСтрок    = МакетДанных.ВысотаТаблицы;
	Для Сч = 1 По КолСтрок Цикл
		НоваяСтрока = Объект.НастройкиMultiGo.Добавить();
		НоваяСтрока.Наименование = МакетДанных.Область(сч,1,сч,1).Текст;
		НоваяСтрока.ПараметрAPI  = МакетДанных.Область(сч,2,сч,2).Текст;
		НоваяСтрока.Описание     = МакетДанных.Область(сч,5,сч,5).Текст;
		Значение                 = МакетДанных.Область(сч,3,сч,3).Текст;

		ТипЗначения = МакетДанных.Область(сч,4,сч,4).ТипЗначения;
		Если Тип(ТипЗначения) = Тип("Булево") Тогда
			НоваяСтрока.Значение = ?(Значение = "Истина", Истина, Ложь);
		ИначеЕсли Тип(ТипЗначения) = Тип("Число") Тогда
			Попытка
				НоваяСтрока.Значение = Число(Значение);
			Исключение
				НоваяСтрока.Значение = 0;
			КонецПопытки;
		Иначе
			НоваяСтрока.Значение = Значение;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВопросЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьОбязательныеДокументы();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОбязательныеДокументы()
	
	Если ЗначениеЗаполнено(Объект.ТипТС) Тогда
		Объект.ОбязательныеВидыДокументов.Очистить();
		Для каждого ОбязательныйДокумент Из Объект.ТипТС.ОбязательныеВидыДокументов Цикл
			НоваяСтрока = Объект.ОбязательныеВидыДокументов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ОбязательныйДокумент);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗаполненыОбязательныеДокументыУТипаТС()
	Если Объект.ТипТС.ОбязательныеВидыДокументов.Количество() <> 0 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

&НаСервере
Процедура УстановитьНазваниеРасходаГСМ()
	
	Если Объект.Модель.ТипДвигателя = Перечисления.уатТипыДвигателей.Электрический
		ИЛИ Объект.Модель.ТипДвигателя = Перечисления.уатТипыДвигателей.Гибридный Тогда
		
		Элементы.СтраницаНормыГСМ.Заголовок =  НСтр("ru = 'Нормы расхода энергии'; en = 'Energy consumption standards'");
		
		Элементы.НормыРасходаГСМЛинейнаяНорма.Заголовок = СтрЗаменить(Элементы.НормыРасходаГСМЛинейнаяНорма.Заголовок, "л/", "кВт/");
		Элементы.НормыРасходаГСМНормаНаИзменениеСобственногоВеса.Заголовок = СтрЗаменить(Элементы.НормыРасходаГСМНормаНаИзменениеСобственногоВеса.Заголовок, "л/", "кВт/");
		Элементы.НормыРасходаГСМНормаНаТранспортнуюРаботу.Заголовок = СтрЗаменить(Элементы.НормыРасходаГСМНормаНаТранспортнуюРаботу.Заголовок, "л/", "кВт/");
		Элементы.НормыРасходаГСМНормаСпециальнаяНаМоточас.Заголовок = СтрЗаменить(Элементы.НормыРасходаГСМНормаСпециальнаяНаМоточас.Заголовок, "л/", "кВт/");
		Элементы.НормыРасходаГСМНормаНаОтопитель.Заголовок = СтрЗаменить(Элементы.НормыРасходаГСМНормаНаОтопитель.Заголовок, "л/", "кВт/");
		Элементы.НормыРасходаГСМНормаНаЕздку.Заголовок = СтрЗаменить(Элементы.НормыРасходаГСМНормаНаЕздку.Заголовок, "л", "кВт");
		Элементы.НормыРасходаГСМНормаНаОперацию.Заголовок = СтрЗаменить(Элементы.НормыРасходаГСМНормаНаОперацию.Заголовок, "л", "кВт");
		Элементы.НормыРасходаГСМНормаНаЗапуск.Заголовок = СтрЗаменить(Элементы.НормыРасходаГСМНормаНаЗапуск.Заголовок, "л", "кВт");
		
		Элементы.НормыРасходаГСМЛинейнаяНорма.Подсказка = НСтр("ru = 'Линейная норма, кВт/100 км'; en = 'Linear rate, kW/100 km'");
		Элементы.НормыРасходаГСМНормаНаИзменениеСобственногоВеса.Подсказка = НСтр("ru = 'Норма на изменение собственного веса, кВт/100 т.км'; en = 'Standard for change in tare weight, kW/100 t.km'");
		Элементы.НормыРасходаГСМНормаНаТранспортнуюРаботу.Подсказка = НСтр("ru = 'Норма на транспортную работу, кВт/100 т.км'; en = 'Standard for transport work, kW/100 t.km'");
		Элементы.НормыРасходаГСМНормаСпециальнаяНаМоточас.Подсказка = НСтр("ru = 'Норма специальная на моточас, кВт/ч'; en = 'Special rate per engine hour, kW/h'");
		Элементы.НормыРасходаГСМНормаНаОтопитель.Подсказка = НСтр("ru = 'Норма расхода на отопитель, кондиционер, климат-контроль, кВт/ч'; en = 'Consumption rate for heater, air conditioner, climate control, kW/h'");
		Элементы.НормыРасходаГСМНормаНаЕздку.Подсказка = НСтр("ru = 'Норма на ездку, кВт'; en = 'Driving rate, kW'");
		Элементы.НормыРасходаГСМНормаНаОперацию.Подсказка = НСтр("ru = 'Норма на выполнение операции, кВт'; en = 'Standard for performing an operation, kW'");
		Элементы.НормыРасходаГСМНормаНаЗапуск.Подсказка = НСтр("ru = 'На запуск, кВт'; en = 'For starting, kW'");
		
		Элементы.НормыРасходаТЖНорма.Заголовок = СтрЗаменить(Элементы.НормыРасходаТЖНорма.Заголовок, "100л", "100кВт");
		Элементы.НормыРасходаТЖНормаНаДопТопливо.Заголовок = СтрЗаменить(Элементы.НормыРасходаТЖНормаНаДопТопливо.Заголовок, "100л", "100кВт");
		
		Элементы.НормыРасходаТЖНорма.Подсказка = НСтр("ru = 'Норма расхода на 100 кВт основной энергии, л/100кВт'; en = 'Consumption rate per 100 kW of primary energy, l/100 kW'");
		Элементы.НормыРасходаТЖНормаНаДопТопливо.Подсказка = НСтр("ru = 'Норма расхода на 100 кВт дополнительной энергии, л/100кВт'; en = 'Consumption rate per 100 kW of additional energy, l/100 kW'");
		
	Иначе
		
		Элементы.СтраницаНормыГСМ.Заголовок =  НСтр("ru = 'Нормы расхода ГСМ'; en = 'Fuels consumption norms'");
		
		Элементы.НормыРасходаГСМЛинейнаяНорма.Заголовок = СтрЗаменить(Элементы.НормыРасходаГСМЛинейнаяНорма.Заголовок, "кВт/", "л/");
		Элементы.НормыРасходаГСМНормаНаИзменениеСобственногоВеса.Заголовок = СтрЗаменить(Элементы.НормыРасходаГСМНормаНаИзменениеСобственногоВеса.Заголовок, "кВт/", "л/");
		Элементы.НормыРасходаГСМНормаНаТранспортнуюРаботу.Заголовок = СтрЗаменить(Элементы.НормыРасходаГСМНормаНаТранспортнуюРаботу.Заголовок, "кВт/", "л/");
		Элементы.НормыРасходаГСМНормаСпециальнаяНаМоточас.Заголовок = СтрЗаменить(Элементы.НормыРасходаГСМНормаСпециальнаяНаМоточас.Заголовок, "кВт/", "л/");
		Элементы.НормыРасходаГСМНормаНаОтопитель.Заголовок = СтрЗаменить(Элементы.НормыРасходаГСМНормаНаОтопитель.Заголовок, "кВт/", "л/");
		Элементы.НормыРасходаГСМНормаНаЕздку.Заголовок = СтрЗаменить(Элементы.НормыРасходаГСМНормаНаЕздку.Заголовок, "кВт", "л");
		Элементы.НормыРасходаГСМНормаНаОперацию.Заголовок = СтрЗаменить(Элементы.НормыРасходаГСМНормаНаОперацию.Заголовок, "кВт", "л");
		Элементы.НормыРасходаГСМНормаНаЗапуск.Заголовок = СтрЗаменить(Элементы.НормыРасходаГСМНормаНаЗапуск.Заголовок, "кВт", "л");
		
		Элементы.НормыРасходаГСМЛинейнаяНорма.Подсказка = НСтр("ru = 'Линейная норма, л/100 км'; en = 'Linear rate, l/100 km'");
		Элементы.НормыРасходаГСМНормаНаИзменениеСобственногоВеса.Подсказка = НСтр("ru = 'Норма на изменение собственного веса, л/100 т.км'; en = 'Standard for change in tare weight, l/100 t.km'");
		Элементы.НормыРасходаГСМНормаНаТранспортнуюРаботу.Подсказка = НСтр("ru = 'Норма на транспортную работу, л/100 т.км'; en = 'Standard for transport work, l/100 t.km'");
		Элементы.НормыРасходаГСМНормаСпециальнаяНаМоточас.Подсказка = НСтр("ru = 'Норма специальная на моточас, л/ч'; en = 'Special rate per engine hour, l/h'");
		Элементы.НормыРасходаГСМНормаНаОтопитель.Подсказка = НСтр("ru = 'Норма расхода на отопитель, кондиционер, климат-контроль, л/ч'; en = 'Consumption rate for heater, air conditioner, climate control, l/h'");
		Элементы.НормыРасходаГСМНормаНаЕздку.Подсказка = НСтр("ru = 'Норма на ездку, л'; en = 'Driving norm, l'");
		Элементы.НормыРасходаГСМНормаНаОперацию.Подсказка = НСтр("ru = 'Норма на выполнение операции, л'; en = 'Standard for performing an operation, l'");
		Элементы.НормыРасходаГСМНормаНаЗапуск.Подсказка = НСтр("ru = 'На запуск, л'; en = 'To start, l'");
		
		Элементы.НормыРасходаТЖНорма.Заголовок = СтрЗаменить(Элементы.НормыРасходаТЖНорма.Заголовок, "100кВт", "100л");
		Элементы.НормыРасходаТЖНормаНаДопТопливо.Заголовок = СтрЗаменить(Элементы.НормыРасходаТЖНормаНаДопТопливо.Заголовок, "100кВт", "100л");
		
		Элементы.НормыРасходаТЖНорма.Подсказка = НСтр("ru = 'Норма расхода на 100 л основного топлива, л/100л'; en = 'Consumption rate per 100 liters of main fuel, l/100l'");
		Элементы.НормыРасходаТЖНормаНаДопТопливо.Подсказка = НСтр("ru = 'Норма расхода на 100 л дополнительного топлива, л/100л'; en = 'Consumption norm for 100 l of second fuel'");
		
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция СоздатьНайтиМодельЖДТранспорта(НаименованиеМодели)
	
	Если ПустаяСтрока(НаименованиеМодели) Тогда
		ТекстНСтр = НСтр("ru='Не заполнено значение модели'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСтр);
		Возврат Справочники.уатМоделиТС.ПустаяСсылка();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	уатМоделиТС.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.уатМоделиТС КАК уатМоделиТС
	|ГДЕ
	|	НЕ уатМоделиТС.ПометкаУдаления
	|	И уатМоделиТС.Наименование = &Наименование";
	Запрос.УстановитьПараметр("Наименование", НаименованиеМодели);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ТекстНСтр = НСтр("ru='Была найдена модель: %1'");
		ТекстНСтр = СтрЗаменить(ТекстНСтр, "%1", Выборка.Ссылка.Наименование);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСтр);
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	МодельЖД = Справочники.уатМоделиТС.СоздатьЭлемент();
	МодельЖД.Наименование = НаименованиеМодели;
	МодельЖД.ВидМоделиТС = Перечисления.уатВидыМоделейТС.ЖДТранспорт;
	
	Попытка
		МодельЖД.Записать();
		ТекстНСтр = НСтр("ru='Была создана модель: %1'");
		ТекстНСтр = СтрЗаменить(ТекстНСтр, "%1", НаименованиеМодели);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСтр);
		Возврат МодельЖД.Ссылка;
	Исключение
		ТекстНСтр = НСтр("ru='Ошибка при записи элемента справочника модели ТС: %1'");
		ТекстНСтр = СтрЗаменить(ТекстНСтр, "%1", НаименованиеМодели);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСтр);
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

&НаСервереБезКонтекста
Функция СоздатьНайтиТипТСЖДТранспорта(РодВагонаНаименование)
	
	Если ПустаяСтрока(РодВагонаНаименование) Тогда
		ТекстНСтр = НСтр("ru='Не заполнено значение классификатора родов подвижного состава'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСтр);
		Возврат Справочники.уатТипыТС.ПустаяСсылка();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	уатКлассификаторРодовПодвижногоСостава.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.уатКлассификаторРодовПодвижногоСостава КАК уатКлассификаторРодовПодвижногоСостава
	|ГДЕ
	|	НЕ уатКлассификаторРодовПодвижногоСостава.ПометкаУдаления
	|	И уатКлассификаторРодовПодвижногоСостава.Наименование = &Наименование";
	Запрос.УстановитьПараметр("Наименование", РодВагонаНаименование);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ТекстНСтр = НСтр("ru='Был найден классификатор родов подвижного состава: %1'");
		ТекстНСтр = СтрЗаменить(ТекстНСтр, "%1", Выборка.Ссылка.Наименование);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСтр);
		РодВагона = Выборка.Ссылка;
	Иначе
		РодВагонаОбъект = Справочники.уатКлассификаторРодовПодвижногоСостава.СоздатьЭлемент();
		РодВагонаОбъект.Наименование = РодВагонаНаименование;
		Попытка
			РодВагонаОбъект.Записать();
			ТекстНСтр = НСтр("ru='Был создан классификатор родов подвижного состава: %1'");
			ТекстНСтр = СтрЗаменить(ТекстНСтр, "%1", РодВагонаНаименование);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСтр);
			РодВагона = РодВагонаОбъект.Ссылка;
		Исключение
			ТекстНСтр = НСтр("ru='Ошибка при записи элемента справочника Классификатор родов подвижного состава %1'");
			ТекстНСтр = СтрЗаменить(ТекстНСтр, "%1", РодВагонаНаименование);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСтр);
			Возврат Неопределено
		КонецПопытки;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	уатТипыТС.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.уатТипыТС КАК уатТипыТС
	|ГДЕ
	|	НЕ уатТипыТС.ПометкаУдаления
	|	И уатТипыТС.РодВагона = &РодВагона";
	Запрос.УстановитьПараметр("РодВагона", РодВагона);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ТекстНСтр = НСтр("ru='Был найден тип ТС: %1'");
		ТекстНСтр = СтрЗаменить(ТекстНСтр, "%1", Выборка.Ссылка.Наименование);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСтр);
		Возврат Выборка.Ссылка;
	Иначе
		ТипТСОбъект = Справочники.уатТипыТС.СоздатьЭлемент();
		ТипТСОбъект.Наименование = РодВагонаНаименование;
		ТипТСОбъект.ВидТС = Перечисления.уатВидыТС.Вагон;
		ТипТСОбъект.РодВагона = РодВагона;
		Попытка
			ТипТСОбъект.Записать();
			ТекстНСтр = НСтр("ru='Был создан тип ТС: %1'");
			ТекстНСтр = СтрЗаменить(ТекстНСтр, "%1", РодВагонаНаименование);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСтр);
			Возврат ТипТСОбъект.Ссылка;
		Исключение
			ТекстНСтр = НСтр("ru='Ошибка при записи элемента справочника Тип ТС %1'");
			ТекстНСтр = СтрЗаменить(ТекстНСтр, "%1", РодВагонаНаименование);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСтр);
			Возврат Неопределено
		КонецПопытки;
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция НайтиВладельцаПоНаименованию(ВладелецТСНаименование)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Контрагенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Наименование = &Наименование
	|	И НЕ Контрагенты.ПометкаУдаления";
	Запрос.УстановитьПараметр("Наименование", ВладелецТСНаименование);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ТекстНСтр = НСтр("ru='Был найден владелец ТС: %1'");
		ТекстНСтр = СтрЗаменить(ТекстНСтр, "%1", ВладелецТСНаименование);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСтр);
		Возврат Выборка.Ссылка;
	Иначе
		ТекстНСтр = НСтр("ru='Не был найден владелец ТС: %1'");
		ТекстНСтр = СтрЗаменить(ТекстНСтр, "%1", ВладелецТСНаименование);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСтр);
		Возврат Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;
КонецФункции

&НаСервереБезКонтекста
Функция СопоставитьТипВладенияЖДТС(ТипВладенияЖДТСНаменование)
	Если ПустаяСтрока(ТипВладенияЖДТСНаменование) Тогда
		ТекстНСтр = НСтр("ru='Не заполнен тип владения вагоном'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСтр);
		Возврат Перечисления.уатТипыВладенияЖДТС.ПустаяСсылка();
	КонецЕсли;
	Если ТипВладенияЖДТСНаменование = "Собственный" Тогда
		Возврат Перечисления.уатТипыВладенияЖДТС.Собственный;
	ИначеЕсли ТипВладенияЖДТСНаменование = "Арендованный" Тогда
		Возврат Перечисления.уатТипыВладенияЖДТС.Арендованный;
	ИначеЕсли ТипВладенияЖДТСНаменование = "Принадлежат перевозчику" Тогда 
		Возврат Перечисления.уатТипыВладенияЖДТС.ПринадлежатПеревозчику;
	Иначе
		ТекстНСтр = НСтр("ru='Не найден тип владения вагоном: %1'");
		ТекстНСтр = СтрЗаменить(ТекстНСтр, "%1", ТипВладенияЖДТСНаменование);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСтр);
		Возврат Перечисления.уатТипыВладенияЖДТС.ПустаяСсылка();
	КонецЕсли;
КонецФункции

#КонецОбласти
