////////////////////////////////////////////////////////////////////////////////
// Общий модуль взаимодействия с мобильным приложением водителя УАТ.
//  
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Процедура выполняет установку значения констант, используемых при работе с мобильным приложением
//
// Параметры:
//  стрНастроек   - структура - структура, содержащая устанавливаемые настройки работы мобильного приложения 
//  стрПараметров - структура - структура, содержащая устанавливаемые параметры работы мобильного приложения
//  ЛогированиеWS - булево    - признак ведения лога работы web-сервиса "uatDriverAppService"
//
Процедура СохранитьНастройкиМобильногоПриложения(Знач стрНастроек=Неопределено, Знач стрПараметров=Неопределено, 
		Знач ЛогированиеWS=Неопределено, Знач стрНастройкиХраненияИсторииМестоположения=Неопределено, 
		Знач ИнтервалНеактивностиДляСнятияСЛинии=Неопределено) Экспорт  
	
	Если Не стрНастроек = Неопределено Тогда 
		БазаНастроек = уатМобильноеПриложениеВодителяСерверПовтИсп.НастройкиМобильногоПриложенияПоУмолчанию();
		
		Для Каждого ТекНастройка Из БазаНастроек Цикл 
			Если стрНастроек.Свойство(ТекНастройка.Ключ) Тогда
				БазаНастроек.Вставить(ТекНастройка.Ключ, стрНастроек[ТекНастройка.Ключ]);
			КонецЕсли;
		КонецЦикла;
		
		Константы.уатНастройкиМобильногоПриложенияВодителя.Установить(Новый ХранилищеЗначения(БазаНастроек, Новый СжатиеДанных(9)));
	КонецЕсли;
	
	Если Не стрПараметров = Неопределено Тогда 
		БазаПараметров = уатМобильноеПриложениеВодителяСерверПовтИсп.ПараметрыМобильногоПриложенияПоУмолчанию();
		
		Для Каждого ТекПараметр Из БазаПараметров Цикл 
			Если стрПараметров.Свойство(ТекПараметр.Ключ) Тогда
				БазаПараметров.Вставить(ТекПараметр.Ключ, стрПараметров[ТекПараметр.Ключ]);
			КонецЕсли;
		КонецЦикла;
		
		Константы.уатПараметрыМобильногоПриложенияВодителя.Установить(Новый ХранилищеЗначения(БазаПараметров, Новый СжатиеДанных(9)));
	КонецЕсли;
	
	Если Не ЛогированиеWS = Неопределено Тогда 
		Константы.уатВестиЛогWSМПВУАТ.Установить(ЛогированиеWS);
	КонецЕсли;
	
	Если Не стрНастройкиХраненияИсторииМестоположения = Неопределено Тогда 
		БазаНастроекХраненияИстории = уатМобильноеПриложениеВодителяСерверПовтИсп.ПараметрыХраненияИсторииМестоположенияПоУмолчанию();
		
		Для Каждого ТекНастрока Из БазаНастроекХраненияИстории Цикл 
			Если стрНастройкиХраненияИсторииМестоположения.Свойство(ТекНастрока.Ключ) Тогда
				БазаНастроекХраненияИстории.Вставить(ТекНастрока.Ключ, стрНастройкиХраненияИсторииМестоположения[ТекНастрока.Ключ]);
			КонецЕсли;
		КонецЦикла;
		
		Константы.уатНастройкиХраненияИсторииМестоположения.Установить(Новый ХранилищеЗначения(БазаНастроекХраненияИстории, Новый СжатиеДанных(9)));
	КонецЕсли;
	
	Если Не ИнтервалНеактивностиДляСнятияСЛинии = Неопределено Тогда 
		Константы.уатИнтервалНеактивностиДляСнятияСЛинии.Установить(ИнтервалНеактивностиДляСнятияСЛинии);
	КонецЕсли;
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры // СохранитьНастройкиМобильногоПриложения()

// Функция получения ключа служебного обсуждения
//
Функция КлючСлужебногоОбсуждения() Экспорт
	Возврат "НовыеСообщенияМобильногоПриложения_ВодительУАТ";
КонецФункции

// Функция выполняет создание служебного обсуждения
//
Функция СоздатьСлужебноеОбсуждение() Экспорт
	
	Обсуждение = Неопределено; 
	Если НЕ Обсуждения.ОбсужденияДоступны() Тогда
		Возврат Обсуждение;
	Конецесли;
	
	КлючСлужебногоОбсуждения = уатМобильноеПриложениеВодителяСервер.КлючСлужебногоОбсуждения();
	Если НЕ ЗначениеЗаполнено(КлючСлужебногоОбсуждения) Тогда
		Возврат Обсуждение;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	Попытка
		Обсуждение = СистемаВзаимодействия.ПолучитьОбсуждение(КлючСлужебногоОбсуждения);
		Если СистемаВзаимодействия.ПолучитьОбсуждение(КлючСлужебногоОбсуждения) = Неопределено Тогда
			Обсуждение = СистемаВзаимодействия.СоздатьОбсуждение();
			Обсуждение.Групповое    = Истина;
			Обсуждение.Отображаемое = Ложь;
			Обсуждение.Ключ         = КлючСлужебногоОбсуждения;
			Обсуждение.Участники.Добавить(СистемаВзаимодействия.ИдентификаторТекущегоПользователя()); 
			Обсуждение.Записать();
		ИначеЕсли НЕ Обсуждение.Участники.Содержит(СистемаВзаимодействия.ИдентификаторТекущегоПользователя()) Тогда
			Обсуждение.Участники.Добавить(СистемаВзаимодействия.ИдентификаторТекущегоПользователя());
			Обсуждение.Записать();
		КонецЕсли;
	Исключение
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);
	Возврат Обсуждение;

КонецФункции

// Процедура выполняет отправку служебного сообщения
//
Процедура ОтправитьСообщениеВСлужебноеОбсуждение() Экспорт
	
	Попытка
		СлужебноеОбсуждение = СоздатьСлужебноеОбсуждение(); 
	Исключение 
		Возврат;
	КонецПопытки;

	Если СлужебноеОбсуждение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("НовоеСообщение", Истина);
	
	Сообщение = СистемаВзаимодействия.СоздатьСообщение(СлужебноеОбсуждение.Идентификатор);
	Сообщение.Данные = СтруктураДанных;
	Сообщение.Записать();
	
	ОчиститьУстаревшиеСообщения(СлужебноеОбсуждение.Идентификатор);
	
КонецПроцедуры

// Функция обработки операции "Execute command" web-сервиса "Driver app service (UAT)"
//
// Параметры:
//  loginData         - строка - строка XML, содержащая структуру логина пользователя мобильного приложения
//  commandName       - строка - имя выполняемой команды
//  requestData       - строка - строка XML, входные данные, содержимое определяется контекстом выполняемого метода
//  responseData      - строка - строка XML, выходные данные, содержимое определяется контекстом выполняемого метода
//  resultCode        - число  - код результата выполнения
//  resultDescription - строка - строковое описание результата выполнения
//
// Возвращаемое значение:
//   Булево           - истина - метод выполен успешно;
//                    - ложь   - при выполнении метода возникли ошибки.
//
Функция ОбработатьМетодExecuteCommand(loginData, commandName, requestData, responseData, resultCode, resultDescription, СпособРеализацииВебСервиса = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт 
	
	Результат = Ложь;
	ДопПараметрыРезультат = Новый Структура();
	
	Если Не уатМобильноеПриложениеВодителяСерверПовтИсп.РазрешенаРаботаСМобильнымПриложением() Тогда 
		ТекстНСТР = НСтр("en='Use of subsystem ""Driver mobile app"" is disabled.';ru='Использование подсистемы ""Мобильное приложение водителя"" отключено.'");
		ЗаписатьСообщениеОбОшибке("ExecuteCommand", ТекстНСТР);
		resultCode = 3;
		resultDescription = уатМобильноеПриложениеВодителяСерверПовтИсп.ПолучитьОписаниеКодаОшибки(resultCode, "ru");
		
		Возврат Ложь;
	КонецЕсли;
	
	Если СпособРеализацииВебСервиса <> Перечисления.уатСпособыРеализацииВебСервиса.REST Тогда
		ЗаписатьЛогExecuteCommandВходнойНаборДанных(loginData, commandName, requestData);
	КонецЕсли; 
	
	ЕстьДанные = Истина;
	
	Результат = Ложь;
	ТекстОшибкиЗаполнения = "";
	
	ТипКоманды = ОпределитьТипКоманды(commandName); 
	Если ТипКоманды = "СлужебныеКоманды" Тогда
		// Служебные команды механизмов авторизации
		Результат = ОбработатьМетодExecuteCommandСлужебныеКоманды(loginData, commandName, requestData, responseData, resultCode, resultDescription, ЕстьДанные, ДопПараметрыРезультат, СпособРеализацииВебСервиса, ДополнительныеПараметры);
		
	ИначеЕсли  ТипКоманды = "КомандыМеханизмаОбменаСообщениями" Тогда
		// Команды механизма обмена сообщениями
		
		Результат = ОбработатьМетодExecuteCommandКомандыМеханизмаОбменаСообщениями(loginData, commandName, requestData, responseData, resultCode, resultDescription, ЕстьДанные, ДопПараметрыРезультат, СпособРеализацииВебСервиса);
		
	ИначеЕсли  ТипКоманды = "КомандыМЛ" Тогда
		// Команды механизма Маршрутные листы
		Результат = ОбработатьМетодExecuteCommandКомандыМеханизмаМЛ(loginData, commandName, requestData, responseData,
		resultCode, resultDescription, ЕстьДанные, ДопПараметрыРезультат, СпособРеализацииВебСервиса, ТекстОшибкиЗаполнения);
		
	ИначеЕсли  ТипКоманды = "КомандыПЛ" Тогда
		// Команды механизма Путевые листы
		
		Результат = ОбработатьМетодExecuteCommandКомандыМеханизмаПЛ(loginData, commandName, requestData, responseData, resultCode, resultDescription, ЕстьДанные, ДопПараметрыРезультат, СпособРеализацииВебСервиса);
		
	ИначеЕсли  ТипКоманды = "КомандыЗаявкиНаРемонт" Тогда
		// Команды механизма Заявки на ремонт
		
		Результат = ОбработатьМетодExecuteCommandКомандыМеханизмаЗаявкиНаРемонт(loginData, commandName, requestData, responseData, resultCode, resultDescription, ЕстьДанные, ДопПараметрыРезультат, СпособРеализацииВебСервиса);
		
	ИначеЕсли  ТипКоманды = "КомандыЗаказыТакси" Тогда
		
		Результат = ОбработатьМетодExecuteCommandКомандыЗаказыТакси(loginData, commandName, requestData, responseData, resultCode, resultDescription, ЕстьДанные, ДопПараметрыРезультат, СпособРеализацииВебСервиса);
		
	ИначеЕсли  ТипКоманды = "КомандыОбщегоНазначения" Тогда
		// Команды общего назначения
		
		Результат = ОбработатьМетодExecuteCommandКомандыОбщегоНазначения(loginData, commandName, requestData, responseData, resultCode, resultDescription, ЕстьДанные, ДопПараметрыРезультат, СпособРеализацииВебСервиса);
		
	Иначе 
		// Нет вызываемого метода
		responseData = ПолучитьПустыеВыходныеДанные(СпособРеализацииВебСервиса);
		resultCode   = 29998;
		
		Результат = Ложь;
	КонецЕсли;


	resultDescription = уатМобильноеПриложениеВодителяСерверПовтИсп.ПолучитьОписаниеКодаОшибки(resultCode, "ru", ТекстОшибкиЗаполнения);
	
	Если ДопПараметрыРезультат.Количество() Тогда 
		ПодставитьДопПараметрыВОтветСервиса(resultCode, resultDescription, ДопПараметрыРезультат);
	КонецЕсли;
	
	Если СпособРеализацииВебСервиса <> Перечисления.уатСпособыРеализацииВебСервиса.REST Тогда
		ЗаписатьЛогExecuteCommandВыходнойНаборДанных(responseData, resultCode, resultDescription, ЕстьДанные, СпособРеализацииВебСервиса);
	КонецЕсли;

	Возврат Результат;
	
КонецФункции // ОбработатьМетодExecuteCommand()

Функция ОпределитьТипКоманды(commandName)
	СоответвиеКоманд = Новый Соответствие(); 
	
	// Служебные команды механизмов авторизации
	СоответвиеКоманд.Вставить(НРег("ping"),                "СлужебныеКоманды");
	СоответвиеКоманд.Вставить(НРег("getUsers"),            "СлужебныеКоманды"); // Метод предназначен для получения перечня пользователей и возврата их серверу
	СоответвиеКоманд.Вставить(НРег("getUsersToUpdate"),    "СлужебныеКоманды"); // Метод предназначен для получения списка пользователей, для которых для которых необходимо произвести обновление данных
	СоответвиеКоманд.Вставить(НРег("login"),               "СлужебныеКоманды"); // При поступлении команды проверяем пароль и может ли такой пользователь работать
	СоответвиеКоманд.Вставить(НРег("logout"),              "СлужебныеКоманды"); // При поступлении команды проверяем пароль и может ли такой пользователь работать
	СоответвиеКоманд.Вставить(НРег("getSettings"),         "СлужебныеКоманды"); // Команда предназначена для получения настроек хранимых на стороне 1С
	СоответвиеКоманд.Вставить(НРег("setVehiclePositions"), "СлужебныеКоманды"); // Метод предназначен для отправки координат в базу 1С
	СоответвиеКоманд.Вставить(НРег("sendAppStatus"),       "СлужебныеКоманды"); // Команда выполняет отправку статуса активности приложения
	СоответвиеКоманд.Вставить(НРег("get1CInfo"),           "СлужебныеКоманды");
	
	// Команды механизма обмена сообщениями
	СоответвиеКоманд.Вставить(НРег("getChats"),            "КомандыМеханизмаОбменаСообщениями");
	СоответвиеКоманд.Вставить(НРег("sendMessages"),        "КомандыМеханизмаОбменаСообщениями");
	СоответвиеКоманд.Вставить(НРег("getMessages"),         "КомандыМеханизмаОбменаСообщениями");
	СоответвиеКоманд.Вставить(НРег("updateMessageStatus"), "КомандыМеханизмаОбменаСообщениями");
	
	// Команды механизма Маршрутные листы
	СоответвиеКоманд.Вставить(НРег("getRouteList"),     "КомандыМЛ"); // Метод предназначен для получения списка заданий маршрутных листов
	СоответвиеКоманд.Вставить(НРег("updateOrders"),     "КомандыМЛ"); // Метод предназначен для изменения данных по заданиям маршрутных листов
	СоответвиеКоманд.Вставить(НРег("sendAcceptStatus"), "КомандыМЛ"); // Метод предназначен для регистрации статуса принятия водителем Маршрутного листа: принят или отклонен
	СоответвиеКоманд.Вставить(НРег("setNextPoint"),     "КомандыМЛ"); // Метод предназначен для регистрации даты выбора водителем пункта в приложении
	СоответвиеКоманд.Вставить(НРег("sendLateArrival"),  "КомандыМЛ"); // Метод предназначен для отправки сообщения об опоздании
	
	// Команды механизма Путевые листы 
	СоответвиеКоманд.Вставить(НРег("getWaybills"),                     "КомандыПЛ"); // Метод предназначен для получения списка путевых листов
	СоответвиеКоманд.Вставить(НРег("updateWaybill"),                   "КомандыПЛ"); // Метод предназначен для изменения данных попутевых листов
	СоответвиеКоманд.Вставить(НРег("addWaybill"),                      "КомандыПЛ"); // Метод предназначен для создания попутевого листа
	СоответвиеКоманд.Вставить(НРег("getMileageConsumptionMonitoring"), "КомандыПЛ"); // Метод предназначен дляполучение пробега и расхода топлива
	СоответвиеКоманд.Вставить(НРег("getWaybillPDF"),                   "КомандыПЛ"); // Метод предназначен для получения печатной формы ПЛ в формате PDF
	СоответвиеКоманд.Вставить(НРег("getQRcode"),                       "КомандыПЛ"); // Метод предназначен для получения QR кода ЭПЛ
	
	// Команды механизма Заявки на ремонт
	СоответвиеКоманд.Вставить(НРег("getOrdersForRepair"),   "КомандыЗаявкиНаРемонт"); // Метод предназначен для получения списка Заявок на ремонт
	СоответвиеКоманд.Вставить(НРег("addOrderForRepair"),    "КомандыЗаявкиНаРемонт"); // Метод предназначен для изменения данных Заявок на ремонт
	СоответвиеКоманд.Вставить(НРег("updateOrderForRepair"), "КомандыЗаявкиНаРемонт"); // Метод предназначен для создания Заявки на ремонт
	
	// Команды механизма Заказы такси
	СоответвиеКоманд.Вставить(НРег("getTaxiOrders"),       "КомандыЗаказыТакси"); // Метод предназначен для получения списка Заказов такси
	СоответвиеКоманд.Вставить(НРег("updateTaxiOrder"),     "КомандыЗаказыТакси"); // Метод предназначен для изменения данных Заказов такси
	СоответвиеКоманд.Вставить(НРег("sendRequestForOrder"), "КомандыЗаказыТакси"); // Метод подачи заявки водителя на распределенный заказ

	// Команды общего назначения
	СоответвиеКоманд.Вставить(НРег("sendImage"),                "КомандыОбщегоНазначения"); 
	СоответвиеКоманд.Вставить(НРег("deleteImages"),             "КомандыОбщегоНазначения");
	СоответвиеКоманд.Вставить(НРег("getOrderResults"),          "КомандыОбщегоНазначения");
	СоответвиеКоманд.Вставить(НРег("getRepairTypes"),           "КомандыОбщегоНазначения");
	СоответвиеКоманд.Вставить(НРег("getStatus"),                "КомандыОбщегоНазначения");
	СоответвиеКоманд.Вставить(НРег("getVehicles"),              "КомандыОбщегоНазначения");
	СоответвиеКоманд.Вставить(НРег("getFuellingTypes"),         "КомандыОбщегоНазначения");
	СоответвиеКоманд.Вставить(НРег("getAllFuels"),              "КомандыОбщегоНазначения");
	СоответвиеКоманд.Вставить(НРег("getAllFuelCards"),          "КомандыОбщегоНазначения"); 
	СоответвиеКоманд.Вставить(НРег("getGasStations"),           "КомандыОбщегоНазначения");
	СоответвиеКоманд.Вставить(НРег("getShippingDocumentTypes"), "КомандыОбщегоНазначения");
	// Устарели. Оставлено для совместимости со старыми версиями приложения
	СоответвиеКоманд.Вставить(НРег("getFuelCards"),    "КомандыОбщегоНазначения");
	СоответвиеКоманд.Вставить(НРег("getFuels"),        "КомандыОбщегоНазначения");
	СоответвиеКоманд.Вставить(НРег("sendImageRepair"), "КомандыОбщегоНазначения");
	
	ТипКоманды = СоответвиеКоманд.Получить(НРег(commandName));
	Если ТипКоманды = Неопределено Тогда
		ТипКоманды = "";
	КонецЕсли;
	Возврат ТипКоманды;
	
КонецФункции

// Функция обработки операции "Execute command" web-сервиса "Driver app service (UAT)"
//
// Параметры:
//  loginData         - строка - строка XML, содержащая структуру логина пользователя мобильного приложения
//  commandName       - строка - имя выполняемой команды
//  requestData       - строка - строка XML, входные данные, содержимое определяется контекстом выполняемого метода
//  responseData      - строка - строка XML, выходные данные, содержимое определяется контекстом выполняемого метода
//  resultCode        - число  - код результата выполнения
//  resultDescription - строка - строковое описание результата выполнения
//
// Возвращаемое значение:
//   Булево           - истина - метод выполен успешно;
//                    - ложь   - при выполнении метода возникли ошибки.
//
Функция ОбработатьМетодExecuteCommandСлужебныеКоманды(loginData, commandName, requestData, responseData, resultCode, resultDescription, ЕстьДанные,
	ДопПараметрыРезультат, СпособРеализацииВебСервиса = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт 
	
	Если НРег(commandName) = НРег("ping") Тогда  
		
		responseData = ПолучитьПустыеВыходныеДанные(СпособРеализацииВебСервиса);
		resultCode   = 0;
		Результат    = Истина;
		
	ИначеЕсли НРег(commandName) = НРег("getUsers") Тогда 
		
		Результат = ОбработатьМетодGetUsers(responseData, resultCode, СпособРеализацииВебСервиса); 
		
	ИначеЕсли НРег(commandName) = НРег("getUsersToUpdate") Тогда 
		
		Результат = ОбработатьМетодGetUsersToUpdate(responseData, resultCode, ЕстьДанные, СпособРеализацииВебСервиса, ДополнительныеПараметры);
			
	ИначеЕсли НРег(commandName) = НРег("get1CInfo") Тогда
		
		ДанныеАвторизации = Неопределено;
		Результат = АвторизоватьПользователя(loginData, responseData, resultCode, ДанныеАвторизации,, Истина,, СпособРеализацииВебСервиса);
		
		Если Результат Тогда 
			Результат = ОбработатьМетодGet1CInfo(responseData, resultCode, СпособРеализацииВебСервиса);
		Иначе 
			Если resultCode = -1 Тогда 
				resultCode = 10;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли НРег(commandName) = НРег("login") Тогда
		
		ДанныеАвторизации = Неопределено;
		Результат = АвторизоватьПользователя(loginData, responseData, resultCode, ДанныеАвторизации, requestData,,Истина, СпособРеализацииВебСервиса);
		
		Если Результат Тогда 
			Результат = ОбработатьМетодLogin(resultCode, ДанныеАвторизации, requestData, ДопПараметрыРезультат, СпособРеализацииВебСервиса);
		Иначе 
			Если resultCode = -1 Тогда 
				resultCode = 15;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли НРег(commandName) = НРег("logout") Тогда
		
		ДанныеАвторизации = Неопределено;
		Результат = АвторизоватьПользователя(loginData, responseData, resultCode, ДанныеАвторизации,,,, СпособРеализацииВебСервиса);
		
		Если Результат Тогда 
			Результат = ОбработатьМетодLogout(responseData, resultCode, ДанныеАвторизации, СпособРеализацииВебСервиса);
		Иначе    
			// Мы уже не авторизованы  
			responseData = ПолучитьПустыеВыходныеДанные(СпособРеализацииВебСервиса);
			resultCode = 0;
		КонецЕсли;
		
	ИначеЕсли НРег(commandName) = НРег("getSettings") Тогда
		
		ДанныеАвторизации = Неопределено;
		Результат = АвторизоватьПользователя(loginData, responseData, resultCode, ДанныеАвторизации,,,, СпособРеализацииВебСервиса);
		
		Если Результат Тогда 
			Результат = ОбработатьМетодGetSettings(responseData, resultCode, ДанныеАвторизации, СпособРеализацииВебСервиса);
		Иначе 
			Если resultCode = -1 Тогда  
				resultCode = 30;
			КонецЕсли;
		КонецЕсли;
	
	ИначеЕсли НРег(commandName) = НРег("setVehiclePositions") Тогда
		
		ДанныеАвторизации = Неопределено;
		Результат = АвторизоватьПользователя(loginData, responseData, resultCode, ДанныеАвторизации,,,, СпособРеализацииВебСервиса);
		
		Если Результат Тогда 
			Результат = ОбработатьМетодSetVehiclePositions(requestData, responseData, resultCode, ДанныеАвторизации, СпособРеализацииВебСервиса);
		Иначе 
			Если resultCode = -1 Тогда 
				resultCode = 35;
			КонецЕсли;
		КонецЕсли;
		
		Если Результат И resultCode = 0 Тогда 
			ОбновитьВремяПоследнегоСобытия(ДанныеАвторизации);
		КонецЕсли;
		
	ИначеЕсли НРег(commandName) = НРег("sendAppStatus") Тогда
		
		ДанныеАвторизации = Неопределено;
		Результат = АвторизоватьПользователя(loginData, responseData, resultCode, ДанныеАвторизации,,,, СпособРеализацииВебСервиса);
		
		Если Результат Тогда 
			Результат = ОбработатьМетодSendAppStatus(requestData, responseData, resultCode, ДанныеАвторизации, СпособРеализацииВебСервиса);
		Иначе 
			Если resultCode = -1 Тогда 
				resultCode = 120;
			КонецЕсли;
		КонецЕсли;
		
		Если Результат И resultCode = 0 Тогда 
			ОбновитьВремяПоследнегоСобытия(ДанныеАвторизации);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ОбработатьМетодExecuteCommand()

// Функция обработки операции "Execute command" web-сервиса "Driver app service (UAT)"
//
// Параметры:
//  loginData         - строка - строка XML, содержащая структуру логина пользователя мобильного приложения
//  commandName       - строка - имя выполняемой команды
//  requestData       - строка - строка XML, входные данные, содержимое определяется контекстом выполняемого метода
//  responseData      - строка - строка XML, выходные данные, содержимое определяется контекстом выполняемого метода
//  resultCode        - число  - код результата выполнения
//  resultDescription - строка - строковое описание результата выполнения
//
// Возвращаемое значение:
//   Булево           - истина - метод выполен успешно;
//                    - ложь   - при выполнении метода возникли ошибки.
//
Функция ОбработатьМетодExecuteCommandКомандыМеханизмаОбменаСообщениями(loginData, commandName, requestData, responseData, resultCode, resultDescription, ЕстьДанные, ДопПараметрыРезультат, СпособРеализацииВебСервиса = Неопределено) Экспорт 
	
	Если НРег(commandName) = НРег("getChats") Тогда
		
		ДанныеАвторизации = Неопределено;
		Результат = АвторизоватьПользователя(loginData, responseData, resultCode, ДанныеАвторизации,,,, СпособРеализацииВебСервиса);
		
		Если Результат Тогда 
			Результат = ОбработатьМетодGetChats(responseData, resultCode, ДанныеАвторизации, СпособРеализацииВебСервиса);
		Иначе 
			Если resultCode = -1 Тогда  
				resultCode = 130;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли НРег(commandName) = НРег("sendMessages") Тогда
		
		ДанныеАвторизации = Неопределено;
		Результат = АвторизоватьПользователя(loginData, responseData, resultCode, ДанныеАвторизации,,,, СпособРеализацииВебСервиса);
		
		Если Результат Тогда 
			Результат = ОбработатьМетодSendMessages(requestData, responseData, resultCode, ДанныеАвторизации, СпособРеализацииВебСервиса);
		Иначе 
			Если resultCode = -1 Тогда 
				resultCode = 50;
			КонецЕсли;
		КонецЕсли;
		
		Если Результат И resultCode = 0 Тогда 
			ОбновитьВремяПоследнегоСобытия(ДанныеАвторизации);
		КонецЕсли;
		
	ИначеЕсли НРег(commandName) = НРег("getMessages") Тогда
		
		ДанныеАвторизации = Неопределено;
		Результат = АвторизоватьПользователя(loginData, responseData, resultCode, ДанныеАвторизации,,,, СпособРеализацииВебСервиса);
		
		Если Результат Тогда 
			Результат = ОбработатьМетодGetMessages(requestData, responseData, resultCode, ДанныеАвторизации, СпособРеализацииВебСервиса);
		Иначе 
			Если resultCode = -1 Тогда 
				resultCode = 55;
			КонецЕсли;
		КонецЕсли;
		
		Если Результат И resultCode = 0 Тогда 
			ОбновитьВремяПоследнегоСобытия(ДанныеАвторизации);
		КонецЕсли;
		
	ИначеЕсли НРег(commandName) = НРег("updateMessageStatus") Тогда
		
		ДанныеАвторизации = Неопределено;
		Результат = АвторизоватьПользователя(loginData, responseData, resultCode, ДанныеАвторизации,,,, СпособРеализацииВебСервиса);
		
		Если Результат Тогда 
			Результат = ОбработатьМетодUpdateMessageStatus(requestData, responseData, resultCode, ДанныеАвторизации, СпособРеализацииВебСервиса);
		Иначе 
			Если resultCode = -1 Тогда 
				resultCode = 135;
			КонецЕсли;
		КонецЕсли;
		
		Если Результат И resultCode = 0 Тогда 
			ОбновитьВремяПоследнегоСобытия(ДанныеАвторизации);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ОбработатьМетодExecuteCommand()

// Функция обработки операции "Execute command" web-сервиса "Driver app service (UAT)"
//
// Параметры:
//  loginData         - строка - строка XML, содержащая структуру логина пользователя мобильного приложения
//  commandName       - строка - имя выполняемой команды
//  requestData       - строка - строка XML, входные данные, содержимое определяется контекстом выполняемого метода
//  responseData      - строка - строка XML, выходные данные, содержимое определяется контекстом выполняемого метода
//  resultCode        - число  - код результата выполнения
//  resultDescription - строка - строковое описание результата выполнения
//
// Возвращаемое значение:
//   Булево           - истина - метод выполен успешно;
//                    - ложь   - при выполнении метода возникли ошибки.
//
Функция ОбработатьМетодExecuteCommandКомандыМеханизмаМЛ(loginData, commandName, requestData, 
	responseData, resultCode, resultDescription, ЕстьДанные, ДопПараметрыРезультат, СпособРеализацииВебСервиса = Неопределено, ТекстОшибкиЗаполнения = "") Экспорт 
	
	Если НРег(commandName) = НРег("getRouteList") Тогда
		
		ДанныеАвторизации = Неопределено;
		Результат = АвторизоватьПользователя(loginData, responseData, resultCode, ДанныеАвторизации,,,, СпособРеализацииВебСервиса);
		
		Если Результат Тогда 
			Результат = ОбработатьМетодGetRouteList(responseData, resultCode, ДанныеАвторизации, СпособРеализацииВебСервиса);
		Иначе  
			responseData = ПолучитьПустыеВыходныеДанныеМассив(СпособРеализацииВебСервиса);
			Если resultCode = -1 Тогда 
				resultCode = 60;
			КонецЕсли;
		КонецЕсли;
		
		Если Результат И resultCode = 0 Тогда 
			ОбновитьВремяПоследнегоСобытия(ДанныеАвторизации);
		КонецЕсли; 
		
	ИначеЕсли НРег(commandName) = НРег("updateOrders") Тогда
		
		ДанныеАвторизации = Неопределено;
		Результат = АвторизоватьПользователя(loginData, responseData, resultCode, ДанныеАвторизации,,,, СпособРеализацииВебСервиса);
		
		Если Результат Тогда  
			ТекстОшибкиЗаполнения = "";
			Результат = ОбработатьМетодUpdateOrders(requestData, responseData,
			resultCode, ДанныеАвторизации, СпособРеализацииВебСервиса, ТекстОшибкиЗаполнения);
		Иначе 
			Если resultCode = -1 Тогда 
				resultCode = 65;
			КонецЕсли;
		КонецЕсли;
		
		Если Результат И resultCode = 0 Тогда 
			ОбновитьВремяПоследнегоСобытия(ДанныеАвторизации);
		КонецЕсли; 
		
	ИначеЕсли НРег(commandName) = НРег("sendAcceptStatus") Тогда
		
		ДанныеАвторизации = Неопределено;
		Результат = АвторизоватьПользователя(loginData, responseData, resultCode, ДанныеАвторизации,,,, СпособРеализацииВебСервиса);
		
		Если Результат Тогда 
			Результат = ОбработатьМетодSendAcceptStatus(requestData, responseData, resultCode, ДанныеАвторизации, СпособРеализацииВебСервиса);
		Иначе 
			Если resultCode = -1 Тогда 
				resultCode = 60;
			КонецЕсли;
		КонецЕсли;
		
		Если Результат И resultCode = 0 Тогда 
			ОбновитьВремяПоследнегоСобытия(ДанныеАвторизации);
		КонецЕсли;
		
	ИначеЕсли НРег(commandName) = НРег("setNextPoint") Тогда
		
		ДанныеАвторизации = Неопределено;
		Результат = АвторизоватьПользователя(loginData, responseData, resultCode, ДанныеАвторизации,,,, СпособРеализацииВебСервиса);
		
		Если Результат Тогда 
			Результат = ОбработатьМетодSetNextPoint(requestData, responseData, resultCode, ДанныеАвторизации, СпособРеализацииВебСервиса);
		Иначе 
			Если resultCode = -1 Тогда 
				resultCode = 190;
			КонецЕсли;
		КонецЕсли;
		
		Если Результат И resultCode = 0 Тогда 
			ОбновитьВремяПоследнегоСобытия(ДанныеАвторизации);
		КонецЕсли;
	

	ИначеЕсли НРег(commandName) = НРег("sendLateArrival") Тогда
		
		ДанныеАвторизации = Неопределено;
		Результат = АвторизоватьПользователя(loginData, responseData, resultCode, ДанныеАвторизации,,,, СпособРеализацииВебСервиса);
		
		Если Результат Тогда 
			Результат = ОбработатьМетодSendLateArrival(requestData, responseData, resultCode, ДанныеАвторизации, СпособРеализацииВебСервиса);
		Иначе 
			Если resultCode = -1 Тогда 
				resultCode = 75;
			КонецЕсли;
		КонецЕсли;
		
		Если Результат И resultCode = 0 Тогда 
			ОбновитьВремяПоследнегоСобытия(ДанныеАвторизации);
		КонецЕсли;
			
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ОбработатьМетодExecuteCommand()

// Функция обработки операции "Execute command" web-сервиса "Driver app service (UAT)"
//
// Параметры:
//  loginData         - строка - строка XML, содержащая структуру логина пользователя мобильного приложения
//  commandName       - строка - имя выполняемой команды
//  requestData       - строка - строка XML, входные данные, содержимое определяется контекстом выполняемого метода
//  responseData      - строка - строка XML, выходные данные, содержимое определяется контекстом выполняемого метода
//  resultCode        - число  - код результата выполнения
//  resultDescription - строка - строковое описание результата выполнения
//
// Возвращаемое значение:
//   Булево           - истина - метод выполен успешно;
//                    - ложь   - при выполнении метода возникли ошибки.
//
Функция ОбработатьМетодExecuteCommandКомандыМеханизмаПЛ(loginData, commandName, requestData, responseData, resultCode, resultDescription, ЕстьДанные, ДопПараметрыРезультат, СпособРеализацииВебСервиса = Неопределено) Экспорт 
	
    Если НРег(commandName) = НРег("getWaybills") Тогда
		
		ДанныеАвторизации = Неопределено;
		Результат = АвторизоватьПользователя(loginData, responseData, resultCode, ДанныеАвторизации,,,, СпособРеализацииВебСервиса);
		
		Если Результат Тогда 
			Результат = ОбработатьМетодGetWaybills(responseData, resultCode, ДанныеАвторизации, СпособРеализацииВебСервиса);
		Иначе 
			Если resultCode = -1 Тогда 
				resultCode = 120;
			КонецЕсли;
		КонецЕсли;
		
		Если Результат И resultCode = 0 Тогда 
			ОбновитьВремяПоследнегоСобытия(ДанныеАвторизации);
		КонецЕсли;
	ИначеЕсли НРег(commandName) = НРег("updateWaybill") Тогда
		
		ДанныеАвторизации = Неопределено;
		Результат = АвторизоватьПользователя(loginData, responseData, resultCode, ДанныеАвторизации,,,, СпособРеализацииВебСервиса);
		
		Если Результат Тогда 
			Результат = ОбработатьМетодUpdateWaybill(requestData, responseData, resultCode, ДанныеАвторизации, СпособРеализацииВебСервиса);
		Иначе 
			Если resultCode = -1 Тогда 
				resultCode = 120;
			КонецЕсли;
		КонецЕсли;
		
		Если Результат И resultCode = 0 Тогда 
			ОбновитьВремяПоследнегоСобытия(ДанныеАвторизации);
		КонецЕсли;
	ИначеЕсли НРег(commandName) = НРег("addWaybill") Тогда
		
		ДанныеАвторизации = Неопределено;
		Результат = АвторизоватьПользователя(loginData, responseData, resultCode, ДанныеАвторизации,,,, СпособРеализацииВебСервиса);
		
		Если Результат Тогда 
			Результат = ОбработатьМетодAddWaybill(requestData, responseData, resultCode, ДанныеАвторизации, СпособРеализацииВебСервиса);
		Иначе 
			Если resultCode = -1 Тогда 
				resultCode = 120;
			КонецЕсли;
		КонецЕсли;
		
		Если Результат И resultCode = 0 Тогда 
			ОбновитьВремяПоследнегоСобытия(ДанныеАвторизации);
		КонецЕсли;
	ИначеЕсли НРег(commandName) = НРег("getMileageConsumptionMonitoring") Тогда
	
		ДанныеАвторизации = Неопределено;
		Результат = АвторизоватьПользователя(loginData, responseData, resultCode, ДанныеАвторизации,,,, СпособРеализацииВебСервиса);
		
		Если Результат Тогда 
			Результат = ОбработатьМетодGetMileageConsumptionMonitoring(requestData, responseData, resultCode, ДанныеАвторизации, СпособРеализацииВебСервиса);
		Иначе 
			Если resultCode = -1 Тогда 
				resultCode = 120;
			КонецЕсли;
		КонецЕсли;
		
		Если Результат И resultCode = 0 Тогда 
			ОбновитьВремяПоследнегоСобытия(ДанныеАвторизации);
		КонецЕсли;
		
	ИначеЕсли НРег(commandName) = НРег("getWaybillPDF") Тогда
	
		ДанныеАвторизации = Неопределено;
		Результат = АвторизоватьПользователя(loginData, responseData, resultCode, ДанныеАвторизации,,,, СпособРеализацииВебСервиса); 
		
		Если Результат Тогда 
			Результат = ОбработатьМетодGetWaybillPDF(requestData, responseData, resultCode, ДанныеАвторизации, СпособРеализацииВебСервиса);
		Иначе 
			Если resultCode = -1 Тогда 
				resultCode = 120;
			КонецЕсли;
		КонецЕсли;
		
		Если Результат И resultCode = 0 Тогда 
			ОбновитьВремяПоследнегоСобытия(ДанныеАвторизации);
		КонецЕсли;
			
	ИначеЕсли НРег(commandName) = НРег("getQRcode") Тогда
		
		ДанныеАвторизации = Неопределено;
		Результат = АвторизоватьПользователя(loginData, responseData, resultCode, ДанныеАвторизации,,,, СпособРеализацииВебСервиса);
		
		Если Результат Тогда 
			Результат = ОбработатьМетодGetQRcode(requestData, responseData, resultCode, ДанныеАвторизации, СпособРеализацииВебСервиса);
		Иначе 
			Если resultCode = -1 Тогда 
				resultCode = 145;
			КонецЕсли;
		КонецЕсли;
		
		Если Результат И resultCode = 0 Тогда 
			ОбновитьВремяПоследнегоСобытия(ДанныеАвторизации);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ОбработатьМетодExecuteCommand()

// Функция обработки операции "Execute command" web-сервиса "Driver app service (UAT)"
//
// Параметры:
//  loginData         - строка - строка XML, содержащая структуру логина пользователя мобильного приложения
//  commandName       - строка - имя выполняемой команды
//  requestData       - строка - строка XML, входные данные, содержимое определяется контекстом выполняемого метода
//  responseData      - строка - строка XML, выходные данные, содержимое определяется контекстом выполняемого метода
//  resultCode        - число  - код результата выполнения
//  resultDescription - строка - строковое описание результата выполнения
//
// Возвращаемое значение:
//   Булево           - истина - метод выполен успешно;
//                    - ложь   - при выполнении метода возникли ошибки.
//
Функция ОбработатьМетодExecuteCommandКомандыМеханизмаЗаявкиНаРемонт(loginData, commandName, requestData, responseData, resultCode, resultDescription, ЕстьДанные, ДопПараметрыРезультат, СпособРеализацииВебСервиса = Неопределено) Экспорт 
	
	Если НРег(commandName) = НРег("getOrdersForRepair") Тогда
		
		ДанныеАвторизации = Неопределено;
		Результат = АвторизоватьПользователя(loginData, responseData, resultCode, ДанныеАвторизации,,,, СпособРеализацииВебСервиса);
		
		Если Результат Тогда 
			Результат = ОбработатьМетодGetOrdersForRepair(responseData, resultCode, ДанныеАвторизации, СпособРеализацииВебСервиса);
		Иначе   
			responseData = ПолучитьПустыеВыходныеДанныеМассив(СпособРеализацииВебСервиса);
			Если resultCode = -1 Тогда 
				resultCode = 120;
			КонецЕсли;
		КонецЕсли;
		
		Если Результат И resultCode = 0 Тогда 
			ОбновитьВремяПоследнегоСобытия(ДанныеАвторизации);
		КонецЕсли;
		
	ИначеЕсли НРег(commandName) = НРег("addOrderForRepair") Тогда
		ДанныеАвторизации = Неопределено;
		Результат = АвторизоватьПользователя(loginData, responseData, resultCode, ДанныеАвторизации,,,, СпособРеализацииВебСервиса);
		
		Если Результат Тогда 
			Результат = ОбработатьМетодAddOrderForRepair(requestData, responseData, resultCode, ДанныеАвторизации, СпособРеализацииВебСервиса);
		Иначе 
			Если resultCode = -1 Тогда 
				resultCode = 29999;
			КонецЕсли;
		КонецЕсли;
		
		Если Результат И resultCode = 0 Тогда 
			ОбновитьВремяПоследнегоСобытия(ДанныеАвторизации);
		КонецЕсли;
	ИначеЕсли НРег(commandName) = НРег("updateOrderForRepair") Тогда
		ДанныеАвторизации = Неопределено;
		Результат = АвторизоватьПользователя(loginData, responseData, resultCode, ДанныеАвторизации,,,, СпособРеализацииВебСервиса);
		
		Если Результат Тогда 
			Результат = ОбработатьМетодUpdateOrderForRepair(requestData, responseData, resultCode, ДанныеАвторизации, СпособРеализацииВебСервиса);
		Иначе 
			Если resultCode = -1 Тогда 
				resultCode = 29999;
			КонецЕсли;
		КонецЕсли;
		
		Если Результат И resultCode = 0 Тогда 
			ОбновитьВремяПоследнегоСобытия(ДанныеАвторизации);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ОбработатьМетодExecuteCommand()

// Функция обработки операции "Execute command" web-сервиса "Driver app service (UAT)"
//
// Параметры:
//  loginData         - строка - строка XML, содержащая структуру логина пользователя мобильного приложения
//  commandName       - строка - имя выполняемой команды
//  requestData       - строка - строка XML, входные данные, содержимое определяется контекстом выполняемого метода
//  responseData      - строка - строка XML, выходные данные, содержимое определяется контекстом выполняемого метода
//  resultCode        - число  - код результата выполнения
//  resultDescription - строка - строковое описание результата выполнения
//
// Возвращаемое значение:
//   Булево           - истина - метод выполен успешно;
//                    - ложь   - при выполнении метода возникли ошибки.
//
Функция ОбработатьМетодExecuteCommandКомандыЗаказыТакси(loginData, commandName, requestData, responseData, resultCode, resultDescription, ЕстьДанные, ДопПараметрыРезультат, СпособРеализацииВебСервиса = Неопределено) Экспорт 
	
	Если НРег(commandName) = НРег("getTaxiOrders") Тогда
		
		ДанныеАвторизации = Неопределено;
		Результат = АвторизоватьПользователя(loginData, responseData, resultCode, ДанныеАвторизации,,,, СпособРеализацииВебСервиса);
		
		Если Результат Тогда 
			Результат = ОбработатьМетодGetTaxiOrders(responseData, resultCode, ДанныеАвторизации, СпособРеализацииВебСервиса);
		Иначе  
			responseData = ПолучитьПустыеВыходныеДанныеМассив(СпособРеализацииВебСервиса);
			Если resultCode = -1 Тогда 
				resultCode = 150;
			КонецЕсли;
		КонецЕсли;
		
		Если Результат И resultCode = 0 Тогда 
			ОбновитьВремяПоследнегоСобытия(ДанныеАвторизации);
		КонецЕсли;
	ИначеЕсли НРег(commandName) = НРег("updateTaxiOrder") Тогда
		
		ДанныеАвторизации = Неопределено;
		Результат = АвторизоватьПользователя(loginData, responseData, resultCode, ДанныеАвторизации,,,, СпособРеализацииВебСервиса);
		
		Если Результат Тогда 
			Результат = ОбработатьМетодUpdateTaxiOrder(requestData, responseData, resultCode, ДанныеАвторизации, СпособРеализацииВебСервиса);
		Иначе 
			Если resultCode = -1 Тогда 
				resultCode = 160;
			КонецЕсли;
		КонецЕсли;
		
		Если Результат И resultCode = 0 Тогда 
			ОбновитьВремяПоследнегоСобытия(ДанныеАвторизации);
		КонецЕсли;
		
	ИначеЕсли НРег(commandName) = НРег("sendRequestForOrder") Тогда
		
		ДанныеАвторизации = Неопределено;
		Результат = АвторизоватьПользователя(loginData, responseData, resultCode, ДанныеАвторизации,,,, СпособРеализацииВебСервиса);
		
		Если Результат Тогда 
			Результат = ОбработатьМетодSendRequestForOrder(requestData, responseData, resultCode, ДанныеАвторизации, СпособРеализацииВебСервиса);
		Иначе 
			Если resultCode = -1 Тогда 
				resultCode = 175;
			КонецЕсли;
		КонецЕсли;
		
		Если Результат И resultCode = 0 Тогда 
			ОбновитьВремяПоследнегоСобытия(ДанныеАвторизации);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ОбработатьМетодExecuteCommand()

// Функция обработки операции "Execute command" web-сервиса "Driver app service (UAT)"
//
// Параметры:
//  loginData         - строка - строка XML, содержащая структуру логина пользователя мобильного приложения
//  commandName       - строка - имя выполняемой команды
//  requestData       - строка - строка XML, входные данные, содержимое определяется контекстом выполняемого метода
//  responseData      - строка - строка XML, выходные данные, содержимое определяется контекстом выполняемого метода
//  resultCode        - число  - код результата выполнения
//  resultDescription - строка - строковое описание результата выполнения
//
// Возвращаемое значение:
//   Булево           - истина - метод выполен успешно;
//                    - ложь   - при выполнении метода возникли ошибки.
//
Функция ОбработатьМетодExecuteCommandКомандыОбщегоНазначения(loginData, commandName, requestData, responseData, resultCode, resultDescription, ЕстьДанные, ДопПараметрыРезультат, СпособРеализацииВебСервиса = Неопределено) Экспорт 
	
	Если НРег(commandName) = НРег("sendImage") Тогда
		
		ДанныеАвторизации = Неопределено;
		Результат = АвторизоватьПользователя(loginData, responseData, resultCode, ДанныеАвторизации,,,, СпособРеализацииВебСервиса);
		
		Если Результат Тогда 
			Результат = ОбработатьМетодSendImage(requestData, responseData, resultCode, ДанныеАвторизации, СпособРеализацииВебСервиса);
		Иначе 
			Если resultCode = -1 Тогда 
				resultCode = 85;
			КонецЕсли;
		КонецЕсли;
		
		Если Результат И resultCode = 0 Тогда 
			ОбновитьВремяПоследнегоСобытия(ДанныеАвторизации);
		КонецЕсли;
		
	ИначеЕсли НРег(commandName) = НРег("deleteImages") Тогда
		
		ДанныеАвторизации = Неопределено;
		Результат = АвторизоватьПользователя(loginData, responseData, resultCode, ДанныеАвторизации,,,, СпособРеализацииВебСервиса);
		
		Если Результат Тогда 
			Результат = ОбработатьМетодDeleteImages(requestData, responseData, resultCode, ДанныеАвторизации, СпособРеализацииВебСервиса);
		Иначе 
			Если resultCode = -1 Тогда 
				resultCode = 90;
			КонецЕсли;
		КонецЕсли;
		
		Если Результат И resultCode = 0 Тогда 
			ОбновитьВремяПоследнегоСобытия(ДанныеАвторизации);
		КонецЕсли;
		
	ИначеЕсли НРег(commandName) = НРег("getOrderResults") Тогда
		
		ДанныеАвторизации = Неопределено;
		Результат = АвторизоватьПользователя(loginData, responseData, resultCode, ДанныеАвторизации,,,, СпособРеализацииВебСервиса);
		
		Если Результат Тогда 
			Результат = ОбработатьМетодGetOrderResults(requestData, responseData, resultCode, ДанныеАвторизации, СпособРеализацииВебСервиса);
		Иначе 
			Если resultCode = -1 Тогда 
				resultCode = 120;
			КонецЕсли;
		КонецЕсли;
		
		Если Результат И resultCode = 0 Тогда 
			ОбновитьВремяПоследнегоСобытия(ДанныеАвторизации);
		КонецЕсли;
		
		
	ИначеЕсли НРег(commandName) = НРег("getRepairTypes") Тогда
		
		ДанныеАвторизации = Неопределено;
		Результат = АвторизоватьПользователя(loginData, responseData, resultCode, ДанныеАвторизации,,,, СпособРеализацииВебСервиса);
		
		Если Результат Тогда 
			Результат = ОбработатьМетодGetRepairTypes(responseData, resultCode, СпособРеализацииВебСервиса);
		Иначе 
			Если resultCode = -1 Тогда 
				resultCode = 120;
			КонецЕсли;
		КонецЕсли;
		
		Если Результат И resultCode = 0 Тогда 
			ОбновитьВремяПоследнегоСобытия(ДанныеАвторизации);
		КонецЕсли;
		
	ИначеЕсли НРег(commandName) = НРег("getStatus") Тогда
		
		ДанныеАвторизации = Неопределено;
		Результат = АвторизоватьПользователя(loginData, responseData, resultCode, ДанныеАвторизации,,,, СпособРеализацииВебСервиса);
		
		Если Результат Тогда 
			Результат = ОбработатьМетодGetStatus(responseData, resultCode, СпособРеализацииВебСервиса);
		Иначе   
			responseData = ПолучитьПустыеВыходныеДанныеМассив(СпособРеализацииВебСервиса);
			Если resultCode = -1 Тогда 
				resultCode = 120;
			КонецЕсли;
		КонецЕсли;
		
		Если Результат И resultCode = 0 Тогда 
			ОбновитьВремяПоследнегоСобытия(ДанныеАвторизации);
		КонецЕсли;
		
	ИначеЕсли НРег(commandName) = НРег("getVehicles") Тогда
		
		ДанныеАвторизации = Неопределено;
		Результат = АвторизоватьПользователя(loginData, responseData, resultCode, ДанныеАвторизации,,,, СпособРеализацииВебСервиса);
		
		Если Результат Тогда 
			Результат = ОбработатьМетодGetVehicles(loginData, responseData, requestData, resultCode, ДанныеАвторизации, СпособРеализацииВебСервиса);
		Иначе 
			Если resultCode = -1 Тогда 
				resultCode = 120;
			КонецЕсли;
		КонецЕсли;
		
		Если Результат И resultCode = 0 Тогда 
			ОбновитьВремяПоследнегоСобытия(ДанныеАвторизации);
		КонецЕсли;
	ИначеЕсли НРег(commandName) = НРег("getFuellingTypes") Тогда
		
		ДанныеАвторизации = Неопределено;
		Результат = АвторизоватьПользователя(loginData, responseData, resultCode, ДанныеАвторизации,,,, СпособРеализацииВебСервиса);
		
		Если Результат Тогда 
			Результат = ОбработатьМетодGetFuellingTypes(responseData, resultCode, СпособРеализацииВебСервиса);
		Иначе 
			Если resultCode = -1 Тогда 
				resultCode = 120;
			КонецЕсли;
		КонецЕсли;
		
		Если Результат И resultCode = 0 Тогда 
			ОбновитьВремяПоследнегоСобытия(ДанныеАвторизации);
		КонецЕсли;
		
	ИначеЕсли НРег(commandName) = НРег("getAllFuels") Тогда
		
		ДанныеАвторизации = Неопределено;
		Результат = АвторизоватьПользователя(loginData, responseData, resultCode, ДанныеАвторизации,,,, СпособРеализацииВебСервиса);
		
		Если Результат Тогда 
			Результат = ОбработатьМетодGetAllFuels(requestData, responseData, resultCode, ДанныеАвторизации, СпособРеализацииВебСервиса);
		Иначе 
			Если resultCode = -1 Тогда 
				resultCode = 120;
			КонецЕсли;
		КонецЕсли;
		
		Если Результат И resultCode = 0 Тогда 
			ОбновитьВремяПоследнегоСобытия(ДанныеАвторизации);
		КонецЕсли;
		
	ИначеЕсли НРег(commandName) = НРег("getAllFuelCards") Тогда
		
		ДанныеАвторизации = Неопределено;
		Результат = АвторизоватьПользователя(loginData, responseData, resultCode, ДанныеАвторизации,,,, СпособРеализацииВебСервиса);
		
		Если Результат Тогда 
			Результат = ОбработатьМетодGetAllFuelCards(requestData, responseData, resultCode, ДанныеАвторизации, СпособРеализацииВебСервиса);
		Иначе 
			Если resultCode = -1 Тогда 
				resultCode = 120;
			КонецЕсли;
		КонецЕсли;
		
		Если Результат И resultCode = 0 Тогда 
			ОбновитьВремяПоследнегоСобытия(ДанныеАвторизации);
		КонецЕсли;
		
	ИначеЕсли НРег(commandName) = НРег("getGasStations") Тогда
		
		ДанныеАвторизации = Неопределено;
		Результат = АвторизоватьПользователя(loginData, responseData, resultCode, ДанныеАвторизации,,,, СпособРеализацииВебСервиса);
		
		Если Результат Тогда 
			Результат = ОбработатьМетодGetGasStations(requestData, responseData, resultCode, ДанныеАвторизации, СпособРеализацииВебСервиса);
		Иначе 
			Если resultCode = -1 Тогда 
				resultCode = 120;
			КонецЕсли;
		КонецЕсли;
		
		Если Результат И resultCode = 0 Тогда 
			ОбновитьВремяПоследнегоСобытия(ДанныеАвторизации);
		КонецЕсли;
		
		
	ИначеЕсли НРег(commandName) = НРег("getShippingDocumentTypes") Тогда
		
		ДанныеАвторизации = Неопределено;
		Результат = АвторизоватьПользователя(loginData, responseData, resultCode, ДанныеАвторизации,,,, СпособРеализацииВебСервиса); 
		
		Если Результат Тогда 
			Результат = ОбработатьМетодGetShippingDocumentTypes(requestData, responseData, resultCode, ДанныеАвторизации, СпособРеализацииВебСервиса);
		Иначе 
			Если resultCode = -1 Тогда 
				resultCode = 120;
			КонецЕсли;
		КонецЕсли;
		
		Если Результат И resultCode = 0 Тогда 
			ОбновитьВремяПоследнегоСобытия(ДанныеАвторизации);
		КонецЕсли;  
		
		
		// Устарели. Оставлено для совместимости со старыми версиями приложения
	ИначеЕсли НРег(commandName) = НРег("getFuelCards") Тогда
		
		ДанныеАвторизации = Неопределено;
		Результат = АвторизоватьПользователя(loginData, responseData, resultCode, ДанныеАвторизации);
		
		Если Результат Тогда 
			Результат = ОбработатьМетодGetFuelCards(requestData, responseData, resultCode, ДанныеАвторизации);
		Иначе 
			Если resultCode = -1 Тогда 
				resultCode = 120;
			КонецЕсли;
		КонецЕсли;
		
		Если Результат И resultCode = 0 Тогда 
			ОбновитьВремяПоследнегоСобытия(ДанныеАвторизации);
		КонецЕсли;  
	ИначеЕсли НРег(commandName) = НРег("getFuels") Тогда
		
		ДанныеАвторизации = Неопределено;
		Результат = АвторизоватьПользователя(loginData, responseData, resultCode, ДанныеАвторизации);
		
		Если Результат Тогда 
			Результат = ОбработатьМетодGetFuels(requestData, responseData, resultCode, ДанныеАвторизации);
		Иначе 
			Если resultCode = -1 Тогда 
				resultCode = 120;
			КонецЕсли;
		КонецЕсли;
		
		Если Результат И resultCode = 0 Тогда 
			ОбновитьВремяПоследнегоСобытия(ДанныеАвторизации);
		КонецЕсли;
		
	ИначеЕсли НРег(commandName) = НРег("sendImageRepair") Тогда
		
		ДанныеАвторизации = Неопределено;
		Результат = АвторизоватьПользователя(loginData, responseData, resultCode, ДанныеАвторизации,,,, СпособРеализацииВебСервиса);
		
		Если Результат Тогда 
			Результат = ОбработатьМетодSendImageRepair(requestData, responseData, resultCode, ДанныеАвторизации, СпособРеализацииВебСервиса);
		Иначе 
			Если resultCode = -1 Тогда 
				resultCode = 85;
			КонецЕсли;
		КонецЕсли;
		
		Если Результат И resultCode = 0 Тогда 
			ОбновитьВремяПоследнегоСобытия(ДанныеАвторизации);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ОбработатьМетодExecuteCommand()

функция ПолучитьПустыеВыходныеДанные(СпособРеализацииВебСервиса)
	Если СпособРеализацииВебСервиса = Перечисления.уатСпособыРеализацииВебСервиса.REST Тогда 
		ЗначениеJSON = Новый Соответствие();  
		ЗначениеJSON.Вставить("responseData" , Новый Соответствие);
		Возврат ЗначениеJSON;
	Иначе
		Возврат "<response/>";
	КонецЕсли;
КонецФункции

функция ПолучитьПустыеВыходныеДанныеМассив(СпособРеализацииВебСервиса)
	Если СпособРеализацииВебСервиса = Перечисления.уатСпособыРеализацииВебСервиса.REST Тогда 
		ЗначениеJSON = Новый Соответствие();  
		ЗначениеJSON.Вставить("responseData" , Новый Соответствие);
		Возврат ЗначениеJSON;
	Иначе
		Возврат "<response/>";
	КонецЕсли;
КонецФункции

// Функция предназначена для получения списка всех пользователей мобильного приложения водителя УАТ
//
Процедура ОбновитьПользователейМобильногоПриложения()
	
	стрНастроек = уатМобильноеПриложениеВодителяСерверПовтИсп.ПолучитьНастройкиМобильногоПриложения();
	Если стрНастроек.ВариантРаботыВебСервиса = "Облачный" Тогда
		уатМобильноеПриложениеВодителяСерверREST.ОтправитьСообщение("getUsers");
	Иначе
		стрПараметрыПодключения = Новый Структура();
		стрПараметрыПодключения.Вставить("АдресСервераМП",  стрНастроек.АдресСервераМП);
		стрПараметрыПодключения.Вставить("ЛогинСервераМП",  стрНастроек.ЛогинСервераМП);
		стрПараметрыПодключения.Вставить("ПарольСервераМП", стрНастроек.ПарольСервераМП);
		
		ТекстОшибки = "";
		стрДанныеОтвета = Неопределено;
		Если уатМобильноеПриложениеВодителяСервер.ВыполнитьМетодСервераМП(стрПараметрыПодключения, "updateUsers",, стрДанныеОтвета, ТекстОшибки) Тогда 
			Если стрДанныеОтвета.Свойство("resultCode") И стрДанныеОтвета.resultCode = "0" Тогда 
				ТекстНСТР = НСтр("en='List of users updated successfully.';ru='Список пользователей обновлен успешно.'");
			ИначеЕсли стрДанныеОтвета.Свойство("resultDescription") Тогда
				ТекстНСТР = НСтр("en = 'When updating the user list the error occurred.""Description of the error:'; ru = 'При обновлении списка пользователей возникла ошибка. Описание ошибки:'")
				+ " " + стрДанныеОтвета.resultDescription;
				ЗаписатьСообщениеОбОшибке(НСтр("ru = 'Обновление пользователей Мобильного приложенияи'; en = 'Updating Mobile Application Users'"), ТекстНСТР);
			Иначе 
				ТекстНСТР = НСтр("en='When updating the user list the error occurred.';ru='При обновлении списка пользователей возникла ошибка.'");
				ЗаписатьСообщениеОбОшибке(НСтр("ru = 'Обновление пользователей Мобильного приложенияи'; en = 'Updating Mobile Application Users'"), стрДанныеОтвета);
			КонецЕсли;
		Иначе 
			ЗаписатьСообщениеОбОшибке(НСтр("ru = 'Обновление пользователей Мобильного приложенияи'; en = 'Updating Mobile Application Users'"), ТекстОшибки);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Процедура снятия неактивных водителей с линии.
//
Процедура СнятьНеактивныхВодителейСЛинии() Экспорт
	
	ИнтервалНеактивности = Константы.уатИнтервалНеактивностиДляСнятияСЛинии.Получить();
	
	Если ИнтервалНеактивности = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	
	Запрос.УстановитьПараметр("ДатаСнятияПоНеактивности", ТекущаяДата()-ИнтервалНеактивности*60);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатВодителиНаЛинии.ФизическоеЛицо КАК ФизическоеЛицо,
	|	уатВодителиНаЛинии.ТС КАК ТС
	|ИЗ
	|	РегистрСведений.уатВодителиНаЛинии КАК уатВодителиНаЛинии
	|ГДЕ
	|	уатВодителиНаЛинии.ДатаПоследнегоСобытия <= &ДатаСнятияПоНеактивности";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		НаборЗаписей = РегистрыСведений.уатВодителиНаЛинии.СоздатьНаборЗаписей(); 
		НаборЗаписей.Заполнить(Неопределено);
		НаборЗаписей.Отбор.ФизическоеЛицо.Установить(Выборка.ФизическоеЛицо);
		НаборЗаписей.Отбор.ТС.Установить(Выборка.ТС);

		Попытка
			НаборЗаписей.Записать(Истина);
		Исключение
			ТекстНСТР = НСтр("en='Removing drivers from the line';ru='Снятие водителей с линии'");
			ЗаписатьСообщениеОбОшибке(ТекстНСТР, ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

// Процедура выполняет обмен данными с промежуточным сервером мобильного приложения.
//
Функция ВыполнитьМетодСервераМП(Знач стрПараметрыПодключения, Знач ИмяМетода, Знач ДанныеДляОтправки="", СтруктураОтвета, ТекстОшибки) Экспорт
	
	СтруктураОтвета = Новый Структура();
	
	СтруктураURI = ОбщегоНазначенияКлиентСервер.СтруктураURI(стрПараметрыПодключения.АдресСервераМП);
	// Пароль и логин можно передавать любой
	Попытка
		HTTPСоединение = Новый HTTPСоединение(
			СтруктураURI.Хост, 
			СтруктураURI.Порт, 
			стрПараметрыПодключения.ЛогинСервераМП,
			стрПараметрыПодключения.ПарольСервераМП,
			,
			15);
	Исключение
		ТекстОшибки = НСтр("en='Could not connect to the mobile app server.';ru='Не удалось установить соединение с сервером мобильного приложения.'");
		HTTPСоединение = Неопределено;
		Возврат Ложь;
	КонецПопытки;
	
	HTTPЗапрос = Новый HTTPЗапрос("/");
	HTTPЗапрос.УстановитьТелоИзСтроки(
		"<soapenv:Envelope xmlns:soapenv=""http://schemas.xmlsoap.org/soap/envelope/"" xmlns:w3=""http://www.w3.org/"">
		|	<soapenv:Header/>
		|	<soapenv:Body>
		|		<w3:ExecuteCommand>
		|		<w3:loginData><![CDATA[<loginStr><login></login><pass></pass><trackerID></trackerID><carID></carID></loginStr>]]></w3:loginData>
		|		<w3:commandName>" + ИмяМетода + "</w3:commandName>
		|		<w3:requestData>" + ДанныеДляОтправки + "</w3:requestData>
		|		</w3:ExecuteCommand>
		|	</soapenv:Body>
		|</soapenv:Envelope>",
		КодировкаТекста.UTF8,
		ИспользованиеByteOrderMark.НеИспользовать);
	
	Попытка
		HTTPОтвет = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	Исключение
		ТекстОшибки = НСтр("en='Failed to send data to mobile application server.';ru='Не удалось отправить данные на сервер мобильного приложения.'");
		HTTPСоединение = Неопределено;
		Возврат Ложь;
	КонецПопытки;
	
	Если Не HTTPОтвет.КодСостояния = 200 Тогда 
		ТекстОшибки = НСтр("en='Error occurred while sending data to mobile application server.';ru='Возникла ошибка при отправке данных на сервер мобильного приложения.'");
		HTTPСоединение = Неопределено;
		Возврат Ложь;
	КонецЕсли;
	
	Попытка
		ЧтениеXMLДанных = Новый ЧтениеXML;
		ЧтениеXMLДанных.УстановитьСтроку(HTTPОтвет.ПолучитьТелоКакСтроку());
		
		Пока ЧтениеXMLДанных.Прочитать() Цикл 
			Если ЧтениеXMLДанных.ТипУзла = ТипУзлаXML.НачалоЭлемента И ЧтениеXMLДанных.ЛокальноеИмя = "ExecuteCommandResponse" Тогда 
				Пока ЧтениеXMLДанных.Прочитать() Цикл 
					Если ЧтениеXMLДанных.ТипУзла = ТипУзлаXML.КонецЭлемента И ЧтениеXMLДанных.ЛокальноеИмя = "ExecuteCommandResponse" Тогда 
						Прервать;
					ИначеЕсли ЧтениеXMLДанных.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда 
						ИмяТега = ЧтениеXMLДанных.ЛокальноеИмя;
						ЧтениеXMLДанных.Прочитать();
						СтруктураОтвета.Вставить(ИмяТега, ЧтениеXMLДанных.Значение);
					КонецЕсли;
				КонецЦикла;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		ЧтениеXMLДанных.Закрыть();
	Исключение
		ТекстОшибки = НСтр("en='Error occurred when processing the server response of mobile app.';ru='Возникла ошибка при обработке ответа сервера мобильного приложения.'");
		HTTPСоединение = Неопределено;
		Возврат Ложь;
	КонецПопытки;
	
	HTTPСоединение = Неопределено;
	
	Возврат Истина;
	
КонецФункции // ВыполнитьМетодСервераМП()

#Область ЛогированиеИЗаписьОшибок

// Процедура выполняет запись ошибки в журнал регистрации
//
// Параметры:
//  ИмяСобытия             - строка            - имя события, в котором возникла ошибка
//  Комментарий            - строка            - описание ошибки
//  Объект                 - объект метаданных - объект метаданных конфигурации, в котором возникла ошибка
//  СтруктураДопПараметров - структура         - дополнительные параметры
//
Процедура ЗаписатьСообщениеОбОшибке(ИмяСобытия="", Комментарий="", Объект=Неопределено, 
	                                СтруктураДопПараметров=Неопределено) Экспорт
	
	Уровень = УровеньЖурналаРегистрации.Ошибка;
	
	Если Объект = Неопределено Тогда 
		Объект = Метаданные.ОбщиеМодули.уатМобильноеПриложениеВодителяСервер;
	КонецЕсли;
	
	ИмяСобытияВЖурналеРегистрации = НСтр("en='WS mobile app of the driver.';ru='WS мобильное приложение водителя.'") + " " + ИмяСобытия;
	ЗаписьЖурналаРегистрации(ИмяСобытияВЖурналеРегистрации,
		Уровень,
		Объект,
		,
		Комментарий);
	
КонецПроцедуры // ЗаписатьСообщениеОбОшибке()

// Процедура выполняет запись лога в журнал регистрации в случае, когда включено ведение лога работы web-сервиса
//
// Параметры:
//  ИмяСобытия             - строка                    - имя логируемого события
//  Комментарий            - строка                    - логируемые данные
//  Уровень                - УровеньЖурналаРегистрации - уровень важности события
//  Объект                 - объект метаданных         - логируемый объект метаданных конфигурации
//  СтруктураДопПараметров - структура                 - дополнительные параметры
//
Процедура ЗаписатьСообщениеЛога(ИмяСобытия="", Комментарий="", Уровень=Неопределено, Объект=Неопределено, 
	                            СтруктураДопПараметров=Неопределено) Экспорт
	
	Если уатМобильноеПриложениеВодителяСерверПовтИсп.ВестиЛогWSМПВУАТ() Тогда
		Если Уровень = Неопределено Тогда
			Уровень = УровеньЖурналаРегистрации.Информация;
		КонецЕсли;
		Если Объект = Неопределено Тогда 
			Объект = Метаданные.ОбщиеМодули.уатМобильноеПриложениеВодителяСервер;
		КонецЕсли;
		
		ИмяСобытияВЖурналеРегистрации = НСтр("en='WS mobile app of the driver.';ru='WS мобильное приложение водителя.'") + ИмяСобытия;
		ЗаписьЖурналаРегистрации(ИмяСобытияВЖурналеРегистрации,
			Уровень,
			Объект,
			,
			Комментарий);
	КонецЕсли;
	
КонецПроцедуры // ЗаписатьСообщениеЛога()

Процедура РассчитатьСпидометр(СтруктураПараметров, СтруктураРезультат) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СтруктураПараметров.ДатаВыезда)
		ИЛИ НЕ ЗначениеЗаполнено(СтруктураПараметров.ДатаВозвращения) Тогда 
		Возврат;
	КонецЕсли; 
	
	ДатаС  = СтруктураПараметров.ДатаВыезда;
	ДатаПо = СтруктураПараметров.ДатаВозвращения;
	
	врДатаС   = Дата(Год(ДатаС), Месяц(ДатаС), День(ДатаС), 0, 0, 0);
	врДатаПо  = Дата(Год(ДатаПо), Месяц(ДатаПо), День(ДатаПо), 0, 0, 0);
	врВремяС  = Дата(1, 1, 1, Час(ДатаС), Минута(ДатаС), Секунда(ДатаС));
	врВремяПо = Дата(1, 1, 1, Час(ДатаПо), Минута(ДатаПо), Секунда(ДатаПо));
	
	стрНастройкиМобильногоПриложения = уатМобильноеПриложениеВодителяСерверПовтИсп.ПолучитьНастройкиМобильногоПриложения();
	Если стрНастройкиМобильногоПриложения.ОбработкаФактическогоВремени = 2 Тогда
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("ТС",      СтруктураПараметров.ТранспортноеСредство);
		Запрос.УстановитьПараметр("ДатаС",   врДатаС);
		Запрос.УстановитьПараметр("ДатаПо",  врДатаПо);
		Запрос.УстановитьПараметр("ВремяС",  врВремяС);
		Запрос.УстановитьПараметр("ВремяПо", врВремяПо);
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	уатИсторияКоординатМП.Дата КАК Дата,
		|	уатИсторияКоординатМП.Время КАК Время,
		|	уатИсторияКоординатМП.Лат КАК Лат,
		|	уатИсторияКоординатМП.Лон КАК Лон,
		|	уатИсторияКоординатМП.Скорость КАК Скорость
		|ИЗ
		|	РегистрСведений.уатИсторияКоординатМП КАК уатИсторияКоординатМП
		|ГДЕ
		|	уатИсторияКоординатМП.ТС = &ТС
		|	И уатИсторияКоординатМП.Дата МЕЖДУ &ДатаС И &ДатаПо
		|	И уатИсторияКоординатМП.Скорость > 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата,
		|	Время";
		
		Расстояние = 0;
		
		Выборка = Запрос.Выполнить().Выбрать();
		СтруктураКоординат = Неопределено;
		Пока Выборка.Следующий() Цикл
			Если (Выборка.Дата = врДатаС И Выборка.Время < врВремяС)
				ИЛИ (Выборка.Дата = врДатаПо И Выборка.Время > врВремяПо) Тогда 
				Продолжить;
			КонецЕсли;
			
			Если СтруктураКоординат = Неопределено Тогда
				СтруктураКоординат = Новый Структура("Лат, Лон", Выборка.Лат, Выборка.Лон);
				Продолжить;
			КонецЕсли;
			
			Дистанция = уатЗащищенныеФункцииСервер_проф.РассчитатьДистанциюПоКоординатам(СтруктураКоординат.Лат, СтруктураКоординат.Лон,
			Выборка.Лат, Выборка.Лон);
			Расстояние = Расстояние + Дистанция;	
			СтруктураКоординат = Новый Структура("Лат, Лон", Выборка.Лат, Выборка.Лон);
		КонецЦикла;
	Иначе
		ДатаСUTC  = УниверсальноеВремя(ДатаС, ЧасовойПоясСеанса()); 
		ДатаПоUTC = УниверсальноеВремя(ДатаПо, ЧасовойПоясСеанса());
		
		ДатаС  = УниверсальноеВремя(СтруктураПараметров.ДатаВыезда, ЧасовойПоясСеанса());
		ДатаПо = УниверсальноеВремя(СтруктураПараметров.ДатаВозвращения, ЧасовойПоясСеанса());
		
		мЗапрос = Новый Запрос();
		мЗапрос.УстановитьПараметр("ТС",     СтруктураПараметров.ТранспортноеСредство);
		мЗапрос.УстановитьПараметр("ДатаС",  врДатаС);
		мЗапрос.УстановитьПараметр("ДатаПо", врДатаПо);
		мЗапрос.УстановитьПараметр("ДатаСUTC",  ДатаС);
		мЗапрос.УстановитьПараметр("ДатаПоUTC", ДатаПо);
		
		мЗапрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	уатИсторияКоординатМП.Дата КАК Дата,
		|	уатИсторияКоординатМП.Время КАК Время,
		|	уатИсторияКоординатМП.Лат КАК Лат,
		|	уатИсторияКоординатМП.Лон КАК Лон,
		|	уатИсторияКоординатМП.Скорость КАК Скорость,
		|	уатИсторияКоординатМП.ДатаВремяUTC КАК ДатаВремяUTC,
		|	ВЫБОР
		|		КОГДА уатИсторияКоординатМП.ДатаВремяUTC = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЕстьДатаВремяUTC
		|ПОМЕСТИТЬ втКоординаты
		|ИЗ
		|	РегистрСведений.уатИсторияКоординатМП КАК уатИсторияКоординатМП
		|ГДЕ
		|	уатИсторияКоординатМП.ТС = &ТС
		|	И ВЫБОР
		|			КОГДА уатИсторияКоординатМП.ДатаВремяUTC = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|				ТОГДА уатИсторияКоординатМП.Дата МЕЖДУ &ДатаС И &ДатаПо
		|			ИНАЧЕ уатИсторияКоординатМП.ДатаВремяUTC МЕЖДУ &ДатаСUTC И &ДатаПоUTC
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МАКСИМУМ(втКоординаты.ЕстьДатаВремяUTC) КАК ЕстьДатаВремяUTC
		|ПОМЕСТИТЬ ЕстьДатаUTC
		|ИЗ
		|	втКоординаты КАК втКоординаты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ЕстьДатаUTC.ЕстьДатаВремяUTC
		|			ТОГДА втКоординаты.ДатаВремяUTC
		|		ИНАЧЕ втКоординаты.Дата
		|	КОНЕЦ КАК Период,
		|	ВЫБОР
		|		КОГДА ЕстьДатаUTC.ЕстьДатаВремяUTC
		|			ТОГДА ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|		ИНАЧЕ втКоординаты.Время
		|	КОНЕЦ КАК ПериодВремя,
		|	втКоординаты.Лат КАК Лат,
		|	втКоординаты.Лон КАК Лон,
		|	втКоординаты.Скорость КАК Скорость,
		|	втКоординаты.ДатаВремяUTC КАК ДатаВремяUTC,
		|	втКоординаты.ЕстьДатаВремяUTC КАК ЕстьДатаВремяUTC,
		|	втКоординаты.Дата КАК Дата,
		|	втКоординаты.Время КАК Время
		|ИЗ
		|	ЕстьДатаUTC КАК ЕстьДатаUTC,
		|	втКоординаты КАК втКоординаты
		|ГДЕ
		|	ВЫБОР
		|			КОГДА ЕстьДатаUTC.ЕстьДатаВремяUTC
		|				ТОГДА втКоординаты.ЕстьДатаВремяUTC
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период,
		|	ПериодВремя";
		
		Расстояние = 0;
		
		Выборка = мЗапрос.Выполнить().Выбрать();
		СтруктураКоординат = Неопределено;
		Пока Выборка.Следующий() Цикл
			Если (Выборка.Дата = врДатаС И Выборка.Время < врВремяС)
				ИЛИ (Выборка.Дата = врДатаПо И Выборка.Время > врВремяПо) Тогда 
				Продолжить;
			КонецЕсли;
			
			Если СтруктураКоординат = Неопределено Тогда
				СтруктураКоординат = Новый Структура("Лат, Лон", Выборка.Лат, Выборка.Лон);
				Продолжить;
			КонецЕсли;
			
			Дистанция = уатЗащищенныеФункцииСервер_проф.РассчитатьДистанциюПоКоординатам(СтруктураКоординат.Лат, СтруктураКоординат.Лон,
			Выборка.Лат, Выборка.Лон);
			Расстояние = Расстояние + Дистанция;	
			СтруктураКоординат = Новый Структура("Лат, Лон", Выборка.Лат, Выборка.Лон);
		КонецЦикла; 
		
	КонецЕсли;
	Расстояние = Расстояние / 1000;
	
	СтруктураРезультат = Новый Структура("СчетчикПоGPS", Расстояние);
	
КонецПроцедуры

Функция ПолучитьВремяОтправленияДоставкиПоЗаказам(ДокументОбъект) Экспорт
	
	Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.уатМаршрутныйЛист") Тогда
		Ссылка = ДокументОбъект.Ссылка;
	Иначе
		Ссылка = ДокументОбъект;
	КонецЕсли;  
	
	Результат = Новый Соответствие;
	НомераОбработанныхСтрокFTLЗаказов = Новый Соответствие;
	
	Запрос = Новый Запрос(); 
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	уатМаршрутныйЛистЗаказы.ЗаказГрузоотправителя.FTL КАК ЗаказГрузоотправителяFTL,
	               |	уатМаршрутныйЛистЗаказы.ЗаказГрузоотправителя КАК ЗаказГрузоотправителя,
	               |	уатМаршрутныйЛистЗаказы.ТипТочкиМаршрута КАК ТипТочкиМаршрута,
	               |	уатМаршрутныйЛистЗаказы.Пункт КАК Пункт,
	               |	уатМаршрутныйЛистЗаказы.НомерСтроки КАК НомерСтроки,
	               |	уатМаршрутныйЛистЗаказы.ЗаказГрузоотправителя.ОтправлениеС КАК ЗаказГрузоотправителяОтправлениеС,
	               |	уатМаршрутныйЛистЗаказы.ЗаказГрузоотправителя.ОтправлениеПо КАК ЗаказГрузоотправителяОтправлениеПо,
	               |	уатМаршрутныйЛистЗаказы.ЗаказГрузоотправителя.ДоставкаС КАК ЗаказГрузоотправителяДоставкаС,
	               |	уатМаршрутныйЛистЗаказы.ЗаказГрузоотправителя.ДоставкаПо КАК ЗаказГрузоотправителяДоставкаПо
	               |ИЗ
	               |	Документ.уатМаршрутныйЛист.Заказы КАК уатМаршрутныйЛистЗаказы
	               |ГДЕ
	               |	уатМаршрутныйЛистЗаказы.Ссылка = &Ссылка";
	ТекЗаказ = Запрос.Выполнить().Выбрать();
	Пока ТекЗаказ.Следующий() Цикл  
		СтрокаРезультата = Новый Структура("ОтправлениеС, ОтправлениеПо, ДоставкаС, ДоставкаПо");
		
		Если ЗначениеЗаполнено(ТекЗаказ.ЗаказГрузоотправителя)
			И ТекЗаказ.ЗаказГрузоотправителяFTL Тогда 
			ОкноС = '00010101000000';
			ОкноПо = '00010101000000';
			НомерОбработаннойСтрокиЗаказа = НомераОбработанныхСтрокFTLЗаказов.Получить(ТекЗаказ.ЗаказГрузоотправителя);
			Если НомерОбработаннойСтрокиЗаказа = Неопределено Тогда
				НомерТекущейСтрокиЗаказа = 0;
			Иначе
				НомерТекущейСтрокиЗаказа = НомерОбработаннойСтрокиЗаказа;
			КонецЕсли;
			Пока НомерТекущейСтрокиЗаказа < ТекЗаказ.ЗаказГрузоотправителя.ПромежуточныеПункты.Количество() Цикл
				Если ТекЗаказ.Пункт = ТекЗаказ.ЗаказГрузоотправителя.ПромежуточныеПункты[НомерТекущейСтрокиЗаказа].Пункт
					И ТекЗаказ.ТипТочкиМаршрута = ТекЗаказ.ЗаказГрузоотправителя.ПромежуточныеПункты[НомерТекущейСтрокиЗаказа].ТипТочкиМаршрута Тогда
					ОкноС  = ТекЗаказ.ЗаказГрузоотправителя.ПромежуточныеПункты[НомерТекущейСтрокиЗаказа].ОкноС;
					ОкноПо = ТекЗаказ.ЗаказГрузоотправителя.ПромежуточныеПункты[НомерТекущейСтрокиЗаказа].ОкноПо;
					Прервать;
				Иначе
					НомерТекущейСтрокиЗаказа = НомерТекущейСтрокиЗаказа + 1;
				КонецЕсли;
			КонецЦикла;
			Если НомерТекущейСтрокиЗаказа <> НомерОбработаннойСтрокиЗаказа Тогда
				НомераОбработанныхСтрокFTLЗаказов.Вставить(ТекЗаказ.ЗаказГрузоотправителя, НомерТекущейСтрокиЗаказа);
			КонецЕсли;
			СтрокаРезультата.ОтправлениеС  = ОкноС;
			СтрокаРезультата.ОтправлениеПо = ОкноПо;
			СтрокаРезультата.ДоставкаС     = ОкноС;
			СтрокаРезультата.ДоставкаПо    = ОкноПо;
		ИначеЕсли ЗначениеЗаполнено(ТекЗаказ.ЗаказГрузоотправителя) Тогда
			СтрокаРезультата.ОтправлениеС  = ТекЗаказ.ЗаказГрузоотправителяОтправлениеС;
			СтрокаРезультата.ОтправлениеПо = ТекЗаказ.ЗаказГрузоотправителяОтправлениеПо;
			СтрокаРезультата.ДоставкаС     = ТекЗаказ.ЗаказГрузоотправителяДоставкаС;
			СтрокаРезультата.ДоставкаПо    = ТекЗаказ.ЗаказГрузоотправителяДоставкаПо;
		Иначе 
			СтрокаРезультата.ОтправлениеС  = '00010101000000';
			СтрокаРезультата.ОтправлениеПо = '00010101000000';
			СтрокаРезультата.ДоставкаС     = '00010101000000';
			СтрокаРезультата.ДоставкаПо    = '00010101000000';
		КонецЕсли;
		
		Результат.Вставить(ТекЗаказ.НомерСтроки - 1, СтрокаРезультата);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиРегламентныхЗаданийИПодписокНаСобытия

Процедура ПриЗаписиУстановкаПризнакаОбновленияМобильногоПриложения(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если НЕ уатМобильноеПриложениеВодителяСерверПовтИсп.РазрешенаРаботаСМобильнымПриложением()
		ИЛИ Источник.ДополнительныеСвойства.Свойство("НеУстановливатьПризнакОбновленияМобильногоПриложения") Тогда 
		Возврат;
	КонецЕсли;
	
	Если Отказ Или РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда 
		Возврат;
	КонецЕсли;
	ИсточникСсылка = Источник.Ссылка;
	ТС             = Неопределено;
	
	ЗарегистрироватьВодителей = Новый Массив();
	Если ТипЗнч(ИсточникСсылка) = Тип("ДокументСсылка.уатМаршрутныйЛист") Тогда
		ПередЗаписьюМаршрутногоЛистаУстановкаПризнакаОбновления(ИсточникСсылка, ЗарегистрироватьВодителей); 
		ТС = Источник.ТС;
	ИначеЕсли ТипЗнч(ИсточникСсылка) = Тип("ДокументСсылка.уатПутевойЛист") Тогда
		ПередЗаписьюПутевогоЛистаУстановкаПризнакаОбновления(ИсточникСсылка, ЗарегистрироватьВодителей);  
		ТС = Источник.ТранспортноеСредство;   
	ИначеЕсли уатОбщегоНазначенияПовтИсп.ВариантПоставкиТакси()
		И ТипЗнч(ИсточникСсылка) = Тип("ДокументСсылка.такЗаказТакси") Тогда
		ПередЗаписьюЗаказаТаксиУстановкаПризнакаОбновления(ИсточникСсылка, ЗарегистрироватьВодителей);
		ТС = Источник.ТС;
	ИначеЕсли ТипЗнч(ИсточникСсылка) = Тип("ДокументСсылка.уатЗаявкаНаРемонт") Тогда
		ПередЗаписьюЗаявкиНаРемонтУстановкаПризнакаОбновления(ИсточникСсылка, ЗарегистрироватьВодителей);  
		ТС = Источник.ТС;
	КонецЕсли;
	
	стрНастроек = уатМобильноеПриложениеВодителяСерверПовтИсп.ПолучитьНастройкиМобильногоПриложения();
	Если стрНастроек.ВариантРаботыВебСервиса = "Облачный" Тогда
		Попытка  
			ДополнительныеПараметры = Новый Структура("ЗарегистрироватьВодителей,ИсточникСсылка,ТС",
				ЗарегистрироватьВодителей, ИсточникСсылка, ТС);
			уатМобильноеПриложениеВодителяСерверREST.ОтправитьСообщение("getUsersToUpdate", ДополнительныеПараметры);
		Исключение
		КонецПопытки;
	Иначе
		ЗарегистрироватьНеобходимостьОбновленияОбъекта(ИсточникСсылка, ЗарегистрироватьВодителей, ТС);
	КонецЕсли;
		
КонецПроцедуры

Процедура ЗарегистрироватьНеобходимостьОбновленияСообщений(ВодителиКРегистрации, Чат = Неопределено) Экспорт
	
	Если Чат = Неопределено Тогда
		Чат = Справочники.уатЧаты.ПустаяСсылка();
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	уатВодителиНаЛинии.ФизическоеЛицо КАК ФизическоеЛицо
	               |ИЗ
	               |	РегистрСведений.уатВодителиНаЛинии КАК уатВодителиНаЛинии
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уатПользователиМобильногоПриложения КАК уатПользователиМобильногоПриложения
	               |		ПО уатВодителиНаЛинии.ФизическоеЛицо = уатПользователиМобильногоПриложения.Пользователь
	               |ГДЕ
	               |	уатВодителиНаЛинии.ФизическоеЛицо В(&массивВодителей)
	               |	И уатПользователиМобильногоПриложения.ИспользоватьЧат И &ИспользоватьЧат
	               |	И уатПользователиМобильногоПриложения.РаботаРазрешена";
	Запрос.УстановитьПараметр("массивВодителей", ВодителиКРегистрации); 
	стрНастройкиМобильногоПриложения = уатМобильноеПриложениеВодителяСерверПовтИсп.ПолучитьНастройкиМобильногоПриложения(); 
	Запрос.УстановитьПараметр("ИспользоватьЧат", ?(стрНастройкиМобильногоПриложения.useChat, Истина, Ложь));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.уатОбъектыДляОбновленияМобильногоПриложения.СоздатьНаборЗаписей(); 
		НаборЗаписей.Заполнить(Неопределено);
		НаборЗаписей.Отбор.ФизическоеЛицо.Установить(Выборка.ФизическоеЛицо);
		НаборЗаписей.Отбор.Объект.Установить(Чат);
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() = 0 Тогда 
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.ФизическоеЛицо = Выборка.ФизическоеЛицо;
			НоваяЗапись.Объект         = Чат; 
			НоваяЗапись.ДатаЗанесения  = ТекущаяДатаСеанса();
			НаборЗаписей.Записать();
		КонецЕсли;

	КонецЦикла;
	
	ОтправитьСообщениеВСлужебноеОбсуждение();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиРегламентныхЗаданий

// Процедура обработчик регламентного задания "Контроль срока действия лицензий мобильного приложения".
//
Процедура уатКонтрольСрокаДействияЛицензийМобильногоПриложения() Экспорт
	
	Если НЕ уатМобильноеПриложениеВодителяСерверПовтИсп.РазрешенаРаботаСМобильнымПриложением()
		ИЛИ НЕ Обсуждения.СистемаВзаимодействийПодключена() Тогда 
		Возврат;
	КонецЕсли;

	стрНастроек = уатМобильноеПриложениеВодителяСерверПовтИсп.ПолучитьНастройкиМобильногоПриложения();
	АдресСервераМП  = стрНастроек.АдресСервераМП;
	ЛогинСервераМП  = стрНастроек.ЛогинСервераМП;
	ПарольСервераМП = стрНастроек.ПарольСервераМП;
	
	ГруппаДиспетчеровДляИнформированияОСрокеДействияЛицензий = стрНастроек.ГруппаДиспетчеровДляИнформированияОСрокеДействияЛицензий;
	Если НЕ ЗначениеЗаполнено(ГруппаДиспетчеровДляИнформированияОСрокеДействияЛицензий) Тогда
		Возврат;
	КонецЕсли;

	ИмяСобытияВЖурналеРегистрации = НСтр("ru = 'Информирование о сроке действия лицензий Мобильного приложенияи'; en = 'Informing about the validity period of the Mobile Application licenses'");
	
	ТекстНСТР = НСтр("en='beginning of operation';ru='Начало операции'");
	КомментарийВЖурналеРегистрации = ТекстНСТР;
	ЗаписьЖурналаРегистрации(ИмяСобытияВЖурналеРегистрации,
		УровеньЖурналаРегистрации.Информация,
		,
		,
		КомментарийВЖурналеРегистрации);
	
	стрПараметрыПодключения = Новый Структура();
	стрПараметрыПодключения.Вставить("АдресСервераМП",  АдресСервераМП);
    стрПараметрыПодключения.Вставить("ЛогинСервераМП",  ЛогинСервераМП);
	стрПараметрыПодключения.Вставить("ПарольСервераМП", ПарольСервераМП);
	
	ТекстОшибки     = "";
	стрДанныеОтвета = Неопределено;
	МассивЛицензий  = Новый Массив();
	Если уатМобильноеПриложениеВодителяСервер.ВыполнитьМетодСервераМП(стрПараметрыПодключения, "getDounglesList",, стрДанныеОтвета, ТекстОшибки) Тогда 
		Если стрДанныеОтвета.Свойство("responseData") Тогда
			Попытка
				ЧтениеXMLДанных = Новый ЧтениеXML;
				ЧтениеXMLДанных.УстановитьСтроку(стрДанныеОтвета.responseData);
				
				Пока ЧтениеXMLДанных.Прочитать() Цикл 
					Если ЧтениеXMLДанных.ТипУзла = ТипУзлаXML.НачалоЭлемента И ЧтениеXMLДанных.ЛокальноеИмя = "keys" Тогда 
						Пока ЧтениеXMLДанных.Прочитать() Цикл 
							Если ЧтениеXMLДанных.ТипУзла = ТипУзлаXML.КонецЭлемента И ЧтениеXMLДанных.ЛокальноеИмя = "keys" Тогда 
								Прервать;
							ИначеЕсли ЧтениеXMLДанных.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда 
								ИмяТега = ЧтениеXMLДанных.ЛокальноеИмя;
								
								СтруктураСвойств = Новый Структура;
								Для Счетчик = 0 По ЧтениеXMLДанных.КоличествоАтрибутов() - 1 Цикл
									ИмяАтрибута = ЧтениеXMLДанных.ИмяАтрибута(Счетчик);
									СтруктураСвойств.Вставить(ИмяАтрибута, ЧтениеXMLДанных.ЗначениеАтрибута(Счетчик));
								КонецЦикла;
								МассивЛицензий.Добавить(СтруктураСвойств);
							КонецЕсли;
						КонецЦикла;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				ЧтениеXMLДанных.Закрыть();
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;

	ТекущаяДата            = НачалоДня(ТекущаяДатаСеанса());
	ДниДоОкончанияДействия = 30 * 86400;
	
	НаименованиеСообщения = НСтр("ru = 'Мобильное приложение Водитель УАТ:'; en = 'Driver UAT mobile app:'");
	ТекстСообщения        = "";
	Для Каждого ТекСтрока Из МассивЛицензий Цикл
		Если ТекСтрока.Свойство("exp_str") 
			И ТекСтрока.Свойство("sn") Тогда
			флОшибка      = Ложь;
			ДатаОкончания = ДесериализоватьДатаВремя(ТекСтрока.exp_str, флОшибка);
			Если НЕ флОшибка 
				И ЗначениеЗаполнено(ДатаОкончания)
				И НачалоДня(ДатаОкончания) <= ТекущаяДата + ДниДоОкончанияДействия 
				И НачалоДня(ДатаОкончания) >= ТекущаяДата Тогда
				
				КолВоДней = (НачалоДня(ДатаОкончания) - ТекущаяДата) / 86400;
				ТекСообщение = СтрШаблон(НСтр("ru = 'Срок действия лицензии №%1 истекает через %2 дней (%3).'; en = 'License #%1 expires in %2 days (%3).'"),
					ТекСтрока.sn, КолВоДней, Формат(ДатаОкончания, "ДФ=dd.MM.yyyy"));

				ТекстСообщения = Новый ФорматированнаяСтрока(
				ТекстСообщения + Символы.ПС + ТекСообщение);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Пользователь1С = Пользователи.ТекущийПользователь();
	Если ЗначениеЗаполнено(ТекСообщение)
		И ЗначениеЗаполнено(Пользователь1С) Тогда
		
		ТекстСообщения = Новый ФорматированнаяСтрока(
		НаименованиеСообщения + ТекстСообщения); 
		Попытка
			Справочники.уатГруппыДиспетчеров.ОтправитьСообщениеВСлужебноеОбсуждение(ГруппаДиспетчеровДляИнформированияОСрокеДействияЛицензий, ТекстСообщения, Пользователь1С);
		Исключение
		КонецПопытки;   
		
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("ГруппаДиспетчеров", ГруппаДиспетчеровДляИнформированияОСрокеДействияЛицензий);
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	уатЧаты.ГруппаДиспетчеров КАК ГруппаДиспетчеров,
	               |	уатЧаты.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.уатЧаты КАК уатЧаты
	               |ГДЕ
	               |	уатЧаты.ГруппаДиспетчеров = &ГруппаДиспетчеров
	               |	И НЕ уатЧаты.ПометкаУдаления";
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			СообщениеСоздано = РегистрыСведений.уатЧатыСВодителями.СоздатьСообщениеМобильногоПриложения(
			Выборка.Ссылка,
			ТекстСообщения,
			Выборка.Ссылка,
			Пользователь1С,
			Перечисления.уатВидыСообщенийМобильногоПриложения.Опоздание,
			ТекущаяДатаСеанса(),
			Истина,
			Истина,
			ТекущаяДатаСеанса(),
			,,
			,
			""
			);
		КонецЦикла;
		Если НЕ РезультатЗапроса.Пустой() Тогда
			ОтправитьСообщениеВСлужебноеОбсуждение();
		КонецЕсли;
	КонецЕсли;
	
	ТекстНСТР = НСтр("en='End of operation';ru='Окончание операции'");
	КомментарийВЖурналеРегистрации = ТекстНСТР;
	ЗаписьЖурналаРегистрации(ИмяСобытияВЖурналеРегистрации,
		УровеньЖурналаРегистрации.Информация,
		,
		,
		КомментарийВЖурналеРегистрации);

КонецПроцедуры

// Процедура обработчик регламентного задания "Автоматическое снятие неактивных водителей с линии".
// Выполняет удаление записей в регистре сведений "Водители на линии"
//
Процедура АвтоматическоеСнятиеНеактивныхВодителейСЛинии() Экспорт
	
	Если Не уатМобильноеПриложениеВодителяСерверПовтИсп.РазрешенаРаботаСМобильнымПриложением() Тогда 
		Возврат;
	КонецЕсли;
	
	ИмяСобытияВЖурналеРегистрации = НСтр("en='Automatic removal of inactive drivers from line';ru='Автоматическое снятие неактивных водителей с линии'");
	
	ТекстНСТР = НСтр("en='beginning of operation';ru='Начало операции'");
	КомментарийВЖурналеРегистрации = ТекстНСТР;
	ЗаписьЖурналаРегистрации(ИмяСобытияВЖурналеРегистрации,
							УровеньЖурналаРегистрации.Информация,
							,
							,
							КомментарийВЖурналеРегистрации);
	
	СнятьНеактивныхВодителейСЛинии();
	
	ТекстНСТР = НСтр("en='End of operation';ru='Окончание операции'");
	КомментарийВЖурналеРегистрации = ТекстНСТР;
	ЗаписьЖурналаРегистрации(ИмяСобытияВЖурналеРегистрации,
							УровеньЖурналаРегистрации.Информация,
							,
							,
							КомментарийВЖурналеРегистрации);
	
КонецПроцедуры

// Процедура обработчик регламентного задания "Обновление пользователей Мобильного приложения".
//
Процедура ОбновлениеПользователейМобильногоПриложения() Экспорт
	
	Если НЕ уатМобильноеПриложениеВодителяСерверПовтИсп.РазрешенаРаботаСМобильнымПриложением() Тогда 
		Возврат;
	КонецЕсли;
	
	ИмяСобытияВЖурналеРегистрации = НСтр("ru = 'Обновление пользователей Мобильного приложенияи'; en = 'Updating Mobile Application Users'");
	
	ТекстНСТР = НСтр("en='beginning of operation';ru='Начало операции'");
	КомментарийВЖурналеРегистрации = ТекстНСТР;
	ЗаписьЖурналаРегистрации(ИмяСобытияВЖурналеРегистрации,
							УровеньЖурналаРегистрации.Информация,
							,
							,
							КомментарийВЖурналеРегистрации);
	
	ОбновитьПользователейМобильногоПриложения();
	
	ТекстНСТР = НСтр("en='End of operation';ru='Окончание операции'");
	КомментарийВЖурналеРегистрации = ТекстНСТР;
	ЗаписьЖурналаРегистрации(ИмяСобытияВЖурналеРегистрации,
							УровеньЖурналаРегистрации.Информация,
							,
							,
							КомментарийВЖурналеРегистрации);
	
КонецПроцедуры

// Процедура обработчик регламентного задания "Очистка сообщений водителей".
// Выполняет удаление записей в регистре сведений "Сообщения водителям", помеченных как отправленные
// и регистре сведений "Cообщения от водителей", устаревших на 1 календарный месяц
//
Процедура РегламентноеУдалениеСообщенийВодителей() Экспорт 
	
	ИмяСобытияВЖурналеРегистрации = НСтр("en='Clearing messages to drivers.';ru='Очистка сообщений водителей.'");
	
	ТекстНСТР = НСтр("en='Beginning of operation.';ru='Начало операции.'");
	КомментарийВЖурналеРегистрации = ТекстНСТР;
	ЗаписьЖурналаРегистрации(ИмяСобытияВЖурналеРегистрации,
							УровеньЖурналаРегистрации.Информация,
							,
							,
							КомментарийВЖурналеРегистрации);
	
	мЗапрос = Новый Запрос;
	мЗапрос.УстановитьПараметр("Дата", ДобавитьМесяц(ТекущаяДата(), -1));

	мЗапрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатЧатыСВодителями.Отправитель КАК Отправитель,
	|	уатЧатыСВодителями.Идентификатор КАК Идентификатор
	|ИЗ
	|	РегистрСведений.уатЧатыСВодителями КАК уатЧатыСВодителями
	|ГДЕ
	|	ВЫБОР
	|			КОГДА уатЧатыСВодителями.ВидСообщения = ЗНАЧЕНИЕ(Перечисление.уатВидыСообщенийМобильногоПриложения.Исходящее)
	|					И уатЧатыСВодителями.Отправлено = ИСТИНА
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ уатЧатыСВодителями.Дата <= &Дата
	|		КОНЕЦ";
	
	мВыборка = мЗапрос.Выполнить().Выбрать();
	Пока мВыборка.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.уатЧатыСВодителями.СоздатьНаборЗаписей();  
		НаборЗаписей.Заполнить(Неопределено);
		НаборЗаписей.Отбор.Отправитель.Установить(мВыборка.Отправитель);
		НаборЗаписей.Отбор.Идентификатор.Установить(мВыборка.Идентификатор);
		
		НаборЗаписейСтатусов = РегистрыСведений.уатСтатусыСообщенийМобильногоПриложения.СоздатьНаборЗаписей(); 
		НаборЗаписейСтатусов.Заполнить(Неопределено);
		НаборЗаписейСтатусов.Отбор.Идентификатор.Установить(мВыборка.Идентификатор);

		Попытка
			НаборЗаписей.Записать();
		Исключение
			ЗаписьЖурналаРегистрации(ИмяСобытияВЖурналеРегистрации, УровеньЖурналаРегистрации.Ошибка, , ,
				ОписаниеОшибки());
				
			ТекстНСТР = НСтр("en='The end of the operation.';ru='Конец операции.'");
			КомментарийВЖурналеРегистрации = ТекстНСТР;
			ЗаписьЖурналаРегистрации(ИмяСобытияВЖурналеРегистрации,
									УровеньЖурналаРегистрации.Информация,
									,
									,
									КомментарийВЖурналеРегистрации);
			Возврат;
		КонецПопытки;
		
		НаборЗаписей = РегистрыСведений.уатСтатусыСообщенийМобильногоПриложения.СоздатьНаборЗаписей();  
		НаборЗаписей.Заполнить(Неопределено);
		НаборЗаписей.Отбор.Идентификатор.Установить(мВыборка.Идентификатор);
		
		Попытка
			НаборЗаписей.Записать();
		Исключение
			ЗаписьЖурналаРегистрации(ИмяСобытияВЖурналеРегистрации, УровеньЖурналаРегистрации.Ошибка, , ,
				ОписаниеОшибки());
				
			ТекстНСТР = НСтр("en='The end of the operation.';ru='Конец операции.'");
			КомментарийВЖурналеРегистрации = ТекстНСТР;
			ЗаписьЖурналаРегистрации(ИмяСобытияВЖурналеРегистрации,
									УровеньЖурналаРегистрации.Информация,
									,
									,
									КомментарийВЖурналеРегистрации);
			Возврат;
		КонецПопытки;
		
	КонецЦикла;
	
	текстрНастройкиМобильногоПриложения = уатМобильноеПриложениеВодителяСерверПовтИсп.ПолучитьНастройкиМобильногоПриложения();
	Если текстрНастройкиМобильногоПриложения <> Неопределено
		И уатМобильноеПриложениеВодителяСерверПовтИсп.ВестиЛогWSМПВУАТ()
		И текстрНастройкиМобильногоПриложения.ВариантРаботыВебСервиса = "Облачный" Тогда
		ТекДата = ТекущаяДатаСеанса();
		
		Если текстрНастройкиМобильногоПриложения.ВидПериодаОчистикиЛогов = 1 Тогда
			ДатаПо = ТекДата - 1 * 60 * 60 * 24;
		ИначеЕсли текстрНастройкиМобильногоПриложения.ВидПериодаОчистикиЛогов = 30 Тогда
			ДатаПо = ДобавитьМесяц(ТекДата, (-1));
		Иначе
			ДатаПо = ТекДата - 7 * 60 * 60 * 24;
		КонецЕсли;
		ДатаС = '00010101000000';
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	уатЛогиОблачногоСервераПриложения.Дата КАК Дата
		|ИЗ
		|	РегистрСведений.уатЛогиОблачногоСервераПриложения КАК уатЛогиОблачногоСервераПриложения
		|ГДЕ
		|	уатЛогиОблачногоСервераПриложения.Дата МЕЖДУ &ДатаС И &ДатаПо";
		Запрос.УстановитьПараметр("ДатаС", ДатаС);
		Запрос.УстановитьПараметр("ДатаПо", ДатаПо);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			НаборЗаписей = РегистрыСведений.уатЛогиОблачногоСервераПриложения.СоздатьНаборЗаписей();
			НаборЗаписей.Заполнить(Неопределено);
			НаборЗаписей.Отбор.Дата.Установить(Выборка.Дата);
			Попытка
				НаборЗаписей.Записать(Истина);
			Исключение
				Возврат;
			КонецПопытки;
		КонецЦикла;
	КонецЕсли;
	
	ДатаПо = ТекущаяДатаСеанса() - 1 * 60 * 60 * 24; 
	
	ДатаС = '00010101000000';
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатОбъектыДляОбновленияМобильногоПриложения.ФизическоеЛицо КАК ФизическоеЛицо,
	|	уатОбъектыДляОбновленияМобильногоПриложения.ТС КАК ТС,
	|	уатОбъектыДляОбновленияМобильногоПриложения.Объект КАК Объект
	|ИЗ
	|	РегистрСведений.уатОбъектыДляОбновленияМобильногоПриложения КАК уатОбъектыДляОбновленияМобильногоПриложения
	|ГДЕ
	|	уатОбъектыДляОбновленияМобильногоПриложения.ДатаЗанесения МЕЖДУ &ДатаС И &ДатаПо";
	Запрос.УстановитьПараметр("ДатаС", ДатаС);
	Запрос.УстановитьПараметр("ДатаПо", ДатаПо);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.уатОбъектыДляОбновленияМобильногоПриложения.СоздатьНаборЗаписей();
		НаборЗаписей.Заполнить(Неопределено);
		НаборЗаписей.Отбор.ФизическоеЛицо.Установить(Выборка.ФизическоеЛицо);
		НаборЗаписей.Отбор.ТС.Установить(Выборка.ТС);
		НаборЗаписей.Отбор.Объект.Установить(Выборка.Объект);
		Попытка
			НаборЗаписей.Записать(Истина);
		Исключение
			Возврат;
		КонецПопытки;
	КонецЦикла;

	ТекстНСТР = НСтр("en='The end of the operation.';ru='Конец операции.'");
	КомментарийВЖурналеРегистрации = ТекстНСТР;
	ЗаписьЖурналаРегистрации(ИмяСобытияВЖурналеРегистрации,
							УровеньЖурналаРегистрации.Информация,
							,
							,
							КомментарийВЖурналеРегистрации);
	ОтправитьСообщениеВСлужебноеОбсуждение();
	
КонецПроцедуры

#КонецОбласти

#Область ЛогированиеИЗаписьОшибок

// Процедура выполняет запись входного набора данных метода "Execute command" web-сервиса "Driver app service (UAT)"
//
// Параметры:
//  loginData   - строка - строка XML, содержащая структуру логина пользователя мобильного приложения
//  commandName - строка - имя выполняемой команды
//  requestData - строка - строка XML, входные данные метода, содержимое определяется контекстом выполняемого метода
//
Процедура ЗаписатьЛогExecuteCommandВходнойНаборДанных(loginData, commandName, requestData)
	
	// Комманда вызывается каждые 2 секунды, в журнал пишем только результат с данными
	Если НРег(commandName) = НРег("getUsersToUpdate") Тогда
		Возврат;
	КонецЕсли;
	
	// Картинка слишком нагружает ЖР
	Если НРег(commandName) = НРег("sendImage")
		ИЛИ НРег(commandName) = НРег("sendImageRepair") Тогда
		ТекстЛога = "IN
		|loginData="   + loginData   + "
		|commandName=" + commandName;
	Иначе
		ТекстЛога = "IN
		|loginData="   + loginData   + "
		|commandName=" + commandName + "
		|requestData=" + requestData;  
	КонецЕсли;
	
	ЗаписатьСообщениеЛога("ExecuteCommand", ТекстЛога);
	
КонецПроцедуры // ЗаписатьЛогExecuteCommandВходнойНаборДанных()

// Процедура выполняет запись выходного набора данных метода "Execute command" web-сервиса "Driver app service (UAT)"
//
// Параметры:
//  responseData      - строка - строка XML, выходные данные, содержимое определяется контекстом выполняемого метода
//  resultCode        - число  - код результата выполнения
//  resultDescription - строка - строковое описание результата выполнения
//
Процедура ЗаписатьЛогExecuteCommandВыходнойНаборДанных(responseData, resultCode, resultDescription, ЕстьДанные = Истина, СпособРеализацииВебСервиса = Неопределено)
	
	Если ЕстьДанные Тогда 
		Если СпособРеализацииВебСервиса = Перечисления.уатСпособыРеализацииВебСервиса.REST Тогда 
			
			Попытка
				ЗаписьJSON = Новый ЗаписьJSON();
				ЗаписьJSON.УстановитьСтроку();
				ЗаписатьJSON(ЗаписьJSON, responseData);
				Response = ЗаписьJSON.Закрыть();
				
				ТекстЛога = "OUT
				|responseData="      + Response + "
				|resultCode="        + resultCode   + "
				|resultDescription=" + resultDescription;
				
				ЗаписатьСообщениеЛога("ExecuteCommand", ТекстЛога);
			Исключение
				ТекстЛога = "OUT
				|responseData="      + responseData + "
				|resultCode="        + resultCode   + "
				|resultDescription=" + resultDescription;
				
				ЗаписатьСообщениеЛога("ExecuteCommand", ТекстЛога);
			КонецПопытки;
		Иначе
			ТекстЛога = "OUT
			|responseData="      + responseData + "
			|resultCode="        + resultCode   + "
			|resultDescription=" + resultDescription;
			
			ЗаписатьСообщениеЛога("ExecuteCommand", ТекстЛога);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПодставитьДопПараметрыВОтветСервиса(resultCode, resultDescription, ДопПараметрыРезультат)
	
	Если resultCode = 101 Тогда 
		resultDescription = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			resultDescription,
			ДопПараметрыРезультат.ТС,
			Формат(ДопПараметрыРезультат.ВремяВыхода, "ДФ='dd.MM.yy HH:mm'"),
			ДопПараметрыРезультат.ФизическоеЛицо);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкаМетодовВебСервиса_uatDriverAppService

// Функция предназначена для получения списка всех пользователей мобильного приложения водителя УАТ
//
// Параметры:
//  responseData - строка - строка XML, выходные данные, содержимое определяется контекстом выполняемого метода
//  resultCode   - число  - код результата выполнения
//
// Возвращаемое значение:
//   Булево      - истина - метод выполнен успешно;
//               - ложь   - при выполнении метода возникла ошибка
//
Функция ОбработатьМетодGetUsers(responseData, resultCode, СпособРеализацииВебСервиса)
	
	мЗапрос = Новый Запрос;
	мЗапрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатПользователиМобильногоПриложения.Логин КАК Логин,
	|	уатПользователиМобильногоПриложения.Пароль КАК Пароль,
	|	уатПользователиМобильногоПриложения.РаботаРазрешена КАК РаботаРазрешена
	|ИЗ
	|	РегистрСведений.уатПользователиМобильногоПриложения КАК уатПользователиМобильногоПриложения";
	
	Попытка
		responseData = СериализоватьUsers(мЗапрос.Выполнить().Выгрузить(), СпособРеализацииВебСервиса);
		
	Исключение
		ЗаписатьСообщениеОбОшибке("GetUsers", ОписаниеОшибки());
		responseData = ПолучитьПустыеВыходныеДанные(СпособРеализацииВебСервиса);
		
		resultCode = 25;
		
		Возврат Ложь;
	КонецПопытки;
	
	resultCode = 0;
	
	Возврат Истина;
	
КонецФункции // ОбработатьМетодGetUsers()

// Функция предназначена для получения получения списка пользователей,
// для которых для которых необходимо произвести обновление данных
//
// Параметры:
//  responseData - строка - строка XML, выходные данные, содержимое определяется контекстом выполняемого метода
//  resultCode   - число  - код результата выполнения
//
// Возвращаемое значение:
//   Булево      - истина - метод выполнен успешно;
//               - ложь   - при выполнении метода возникла ошибка
//
Функция ОбработатьМетодGetUsersToUpdate(responseData, resultCode, ЕстьДанные, СпособРеализацииВебСервиса, ДополнительныеПараметры) Экспорт
	
	ЕстьДанные = Ложь;
	
	Если СпособРеализацииВебСервиса = Перечисления.уатСпособыРеализацииВебСервиса.REST Тогда
		Запрос = Новый Запрос(); 
		Запрос.УстановитьПараметр("ЗарегистрироватьВодителей", ДополнительныеПараметры.ЗарегистрироватьВодителей);
		Запрос.УстановитьПараметр("ИсточникСсылка", ДополнительныеПараметры.ИсточникСсылка);
		Запрос.УстановитьПараметр("ТС", ДополнительныеПараметры.ТС);
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	уатПользователиМобильногоПриложения.Логин КАК Логин,
		|	&ИсточникСсылка КАК Объект,
		|	уатПользователиМобильногоПриложения.Пользователь КАК ФизическоеЛицо,
		|	&ТС КАК ТС
		|ИЗ
		|	РегистрСведений.уатПользователиМобильногоПриложения КАК уатПользователиМобильногоПриложения
		|ГДЕ
		|	уатПользователиМобильногоПриложения.Пользователь В(&ЗарегистрироватьВодителей)
		|ИТОГИ ПО
		|	Логин";
	Иначе
		Запрос = Новый Запрос();
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	уатПользователиМобильногоПриложения.Логин КАК Логин,
		|	уатОбъектыДляОбновленияМобильногоПриложения.Объект КАК Объект,
		|	уатОбъектыДляОбновленияМобильногоПриложения.ФизическоеЛицо КАК ФизическоеЛицо,
		|	уатОбъектыДляОбновленияМобильногоПриложения.ТС КАК ТС
		|ИЗ
		|	РегистрСведений.уатОбъектыДляОбновленияМобильногоПриложения КАК уатОбъектыДляОбновленияМобильногоПриложения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уатПользователиМобильногоПриложения КАК уатПользователиМобильногоПриложения
		|		ПО уатОбъектыДляОбновленияМобильногоПриложения.ФизическоеЛицо = уатПользователиМобильногоПриложения.Пользователь
		|ИТОГИ ПО
		|	Логин";
	КонецЕсли;

	Попытка
		responseData = СериализоватьUsersToUpdate(Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам), ЕстьДанные, СпособРеализацииВебСервиса);
		
	Исключение
		ЗаписатьСообщениеОбОшибке("GetUsersToUpdate", ОписаниеОшибки());
		responseData = ПолучитьПустыеВыходныеДанные(СпособРеализацииВебСервиса);
		resultCode = 80;
		
		Возврат Ложь;
	КонецПопытки;
	
	resultCode = 0;
	
	Возврат Истина;
	
КонецФункции 

// Функция предназначена для получения информации о версии конфигурации и параметров работы мобильного приложения
//
// Параметры:
//  responseData - строка - строка XML, выходные данные, содержимое определяется контекстом выполняемого метода
//  resultCode   - число  - код результата выполнения
//
// Возвращаемое значение:
//   Булево      - истина - метод выполнен успешно;
//               - ложь   - при выполнении метода возникла ошибка
//
Функция ОбработатьМетодGet1CInfo(responseData, resultCode, СпособРеализацииВебСервиса)
	
	Если СпособРеализацииВебСервиса = Перечисления.уатСпособыРеализацииВебСервиса.REST Тогда 
		Возврат уатМобильноеПриложениеВодителяСерверREST.ОбработатьМетодGet1CInfo(responseData, resultCode);
	Иначе
		Возврат уатМобильноеПриложениеВодителяСерверSOAP.ОбработатьМетодGet1CInfo(responseData, resultCode);
	КонецЕсли;
	
КонецФункции // ОбработатьМетодGet1CInfo()

Функция ПолучитьТерминалПоID(IDУстройства)
	
	ЗапросТерминал = Новый Запрос();
	ЗапросТерминал.УстановитьПараметр("IDУстройства", IDУстройства);
	ЗапросТерминал.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	уатМобильныеУстройства.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.уатМобильныеУстройства КАК уатМобильныеУстройства
	|ГДЕ
	|	уатМобильныеУстройства.IDУстройства = &IDУстройства";
	
	Выборка = ЗапросТерминал.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Справочники.уатМобильныеУстройства.ПустаяСсылка();
	
КонецФункции

// Функция предназначена для вывода водителя на линию
//
// Параметры:
//  resultCode        - число     - код результата выполнения метода
//  ДанныеАвторизации - структура - данные об авторизованном пользователе (ФизическоеЛицо и ТС)
//
// Возвращаемое значение:
//   Булево      - истина - метод выполнен успешно;
//               - ложь   - при выполнении метода возникла ошибка
//
Функция ОбработатьМетодLogin(resultCode, Знач ДанныеАвторизации, requestData, ДопПараметрыОтвета=Неопределено, СпособРеализацииВебСервиса)
	
	pushID = "";
	
	ДанныеrequestData = ДесериализоватьrequestData(requestData, СпособРеализацииВебСервиса);
	pushID = ДанныеrequestData.pushID;
	
	// Проверим, что данный водитель или ТС не на линии
	// Если ТС и/или водитель уже на линии, тогда возможны такие ситуации:
	// 1. ТС на линии с другим водителем - идем в отказ (код 101)
	// 3. Водитель и ТС идентичны тем, что сейчас на линии - всё ок (код 0)
	
	ЗапросВодителиНаЛинии = Новый Запрос();
	ЗапросВодителиНаЛинии.УстановитьПараметр("ТС",             ДанныеАвторизации.ТС);
	
	ЗапросВодителиНаЛинии.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатВодителиНаЛинии.ФизическоеЛицо КАК ФизическоеЛицо,
	|	уатВодителиНаЛинии.ТС КАК ТС,
	|	уатВодителиНаЛинии.ВремяВыхода КАК ВремяВыхода,
	|	уатВодителиНаЛинии.МобильноеУстройство.IDУстройства КАК МобильноеУстройствоIDУстройства
	|ИЗ
	|	РегистрСведений.уатВодителиНаЛинии КАК уатВодителиНаЛинии
	|ГДЕ
	|	уатВодителиНаЛинии.ТС = &ТС";
	
	ВыборкаВодителиНаЛинии = ЗапросВодителиНаЛинии.Выполнить().Выбрать();
	Если ВыборкаВодителиНаЛинии.Следующий() Тогда 
		Если НЕ ДопПараметрыОтвета = Неопределено Тогда 
			ДопПараметрыОтвета.Вставить("ФизическоеЛицо", ВыборкаВодителиНаЛинии.ФизическоеЛицо);
			ДопПараметрыОтвета.Вставить("ТС",             ВыборкаВодителиНаЛинии.ТС);
			ДопПараметрыОтвета.Вставить("ВремяВыхода",    ВыборкаВодителиНаЛинии.ВремяВыхода);
			ДопПараметрыОтвета.Вставить("trackerID",      ДанныеАвторизации.trackerID);
		КонецЕсли;
		Если ДанныеАвторизации.ФизическоеЛицо <> ВыборкаВодителиНаЛинии.ФизическоеЛицо Тогда
			resultCode = 101;
			Возврат Ложь;
		ИначеЕсли ДанныеАвторизации.trackerID <> ВыборкаВодителиНаЛинии.МобильноеУстройствоIDУстройства Тогда  
			МобильноеУстройство = ПолучитьТерминалПоID(ВыборкаВодителиНаЛинии.МобильноеУстройствоIDУстройства);
			ВыполнитьСнятиеСЛинии(ДанныеАвторизации.ФизическоеЛицо, ДанныеАвторизации.ТС, МобильноеУстройство);
		КонецЕсли;
	КонецЕсли;
	
	Попытка
		МенЗаписи = РегистрыСведений.уатВодителиНаЛинии.СоздатьМенеджерЗаписи(); 
		МенЗаписи.Заполнить(Неопределено);

	Исключение
		ЗаписатьСообщениеОбОшибке("Login", ОписаниеОшибки());
		resultCode = 15;
		
		Возврат Ложь;
	КонецПопытки;
	
	МобильноеУстройство = ПолучитьТерминалПоID(ДанныеАвторизации.trackerID);
	
	МенЗаписи.ФизическоеЛицо        = ДанныеАвторизации.ФизическоеЛицо;
	МенЗаписи.ТС                    = ДанныеАвторизации.ТС;
	МенЗаписи.МобильноеУстройство   = МобильноеУстройство;
	МенЗаписи.ВремяВыхода           = ТекущаяДата();
	МенЗаписи.pushID                = pushID;
	МенЗаписи.ДатаПоследнегоСобытия = ТекущаяДата();
	
	мсвВодителей = ПолучитьВсехВодителейНаЛинии();
	
	// Фиксация операции для статистики
	ИмяКлючевойОперации = "уатОперации.МобильноеПриложениеВодительУАТ.ВыходВодителяНаЛинию";
	ЦентрМониторинга.ЗаписатьОперациюБизнесСтатистики(ИмяКлючевойОперации, мсвВодителей.Количество());

	Попытка
		МенЗаписи.Записать(Истина);
	Исключение
		ЗаписатьСообщениеОбОшибке("Login", ОписаниеОшибки());
		resultCode = 15;
		
		Возврат Ложь;
	КонецПопытки;
	
	resultCode = 0;
	
	Возврат Истина;
	
КонецФункции // ОбработатьМетодLogin()

// Функция предназначена для получения настроек для работы мобильного приложения
//
// Параметры:
//  responseData - строка - строка XML, выходные данные, содержимое определяется контекстом выполняемого метода
//  resultCode   - число  - код результата выполнения
//
// Возвращаемое значение:
//   Булево      - истина - метод выполнен успешно;
//               - ложь   - при выполнении метода возникла ошибка
//
Функция ОбработатьМетодGetSettings(responseData, resultCode, ДанныеАвторизации, СпособРеализацииВебСервиса)
	
	// Заполним хранимые настройки МП
	текстрНастройкиМобильногоПриложения = уатМобильноеПриложениеВодителяСерверПовтИсп.ПолучитьНастройкиМобильногоПриложения();
	
	стрНастройкиМобильногоПриложения = Новый Структура();
	Для Каждого ТекНастройка Из текстрНастройкиМобильногоПриложения Цикл 
		стрНастройкиМобильногоПриложения.Вставить(ТекНастройка.Ключ, ТекНастройка.Значение); 		
	КонецЦикла;
	
	// Заполним время сервера
	стрНастройкиМобильногоПриложения.Вставить("serverTime", СериализоватьДатаВремя(ТекущаяДата()));
	
	ЗапросФизическоеЛицо = Новый Запрос;
	ЗапросФизическоеЛицо.УстановитьПараметр("Логин",        ДанныеАвторизации.Логин);
	ЗапросФизическоеЛицо.УстановитьПараметр("Пользователь", ДанныеАвторизации.ФизическоеЛицо);
	
	ЗапросФизическоеЛицо.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МИНИМУМ(ВЫБОР
	|			КОГДА уатПользователиМобильногоПриложения.ИспользоватьПутевыеЛисты
	|					И НЕ уатПользователиМобильногоПриложения_ТС.ТС.ПринадлежностьТС = ЗНАЧЕНИЕ(Перечисление.уатПринадлежностьТС.Привлеченное)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ИспользоватьПутевыеЛисты,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА уатПользователиМобильногоПриложения.ИспользоватьМаршрутныеЛисты
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ИспользоватьМаршрутныеЛисты,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА уатПользователиМобильногоПриложения.ИспользоватьЗаявкиНаРемонт
	|					И НЕ уатПользователиМобильногоПриложения_ТС.ТС.ПринадлежностьТС = ЗНАЧЕНИЕ(Перечисление.уатПринадлежностьТС.Привлеченное)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ИспользоватьЗаявкиНаРемонт,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА уатПользователиМобильногоПриложения.ИспользоватьЗаказыТакси
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ИспользоватьЗаказыТакси,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА уатПользователиМобильногоПриложения.ИспользоватьЧат
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ИспользоватьЧат
	|ИЗ
	|	РегистрСведений.уатПользователиМобильногоПриложения КАК уатПользователиМобильногоПриложения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уатПользователиМобильногоПриложения_ТС КАК уатПользователиМобильногоПриложения_ТС
	|		ПО уатПользователиМобильногоПриложения.Пользователь = уатПользователиМобильногоПриложения_ТС.Пользователь
	|ГДЕ
	|	уатПользователиМобильногоПриложения.Логин = &Логин
	|	И уатПользователиМобильногоПриложения.Пользователь = &Пользователь";
	Выборка = ЗапросФизическоеЛицо.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		стрНастройкиМобильногоПриложения.useRouteLists      = ?(стрНастройкиМобильногоПриложения.useRouteLists, 
			Выборка.ИспользоватьМаршрутныеЛисты, 0);
		стрНастройкиМобильногоПриложения.useWaybills        = ?(стрНастройкиМобильногоПриложения.useWaybills, 
			Выборка.ИспользоватьПутевыеЛисты, 0);
		стрНастройкиМобильногоПриложения.useOrdersForRepair = ?(стрНастройкиМобильногоПриложения.useOrdersForRepair, 
			Выборка.ИспользоватьЗаявкиНаРемонт, 0);
		стрНастройкиМобильногоПриложения.useTaxiOrders      = ?(стрНастройкиМобильногоПриложения.useTaxiOrders, 
			Выборка.ИспользоватьЗаказыТакси, 0);
		стрНастройкиМобильногоПриложения.useChat            = ?(стрНастройкиМобильногоПриложения.useChat, 
			Выборка.ИспользоватьЧат, 0);
	КонецЕсли;
	
	Если стрНастройкиМобильногоПриложения.useRouteLists = 0
		И стрНастройкиМобильногоПриложения.useWaybills = 0
		И стрНастройкиМобильногоПриложения.useOrdersForRepair = 0
		И стрНастройкиМобильногоПриложения.useTaxiOrders = 0
		И стрНастройкиМобильногоПриложения.useChat = 0 Тогда
		стрНастройкиМобильногоПриложения.useChat = 1;
	КонецЕсли;
	
	navigatorkey      = уатЭлектронныеКартыСервер.ПолучитьНастройкуСервераКартографииМаршрутизации("Навигация_Ключ");
	navigatorClientId = уатЭлектронныеКартыСервер.ПолучитьНастройкуСервераКартографииМаршрутизации("Навигация_ИдентификаторКлиента");
	стрНастройкиМобильногоПриложения.Вставить("navigatorkey",      Строка(navigatorkey));
	стрНастройкиМобильногоПриложения.Вставить("navigatorClientId", Строка(navigatorClientId));
	
	Если стрНастройкиМобильногоПриложения.ОбработкаФактическогоВремени = 2 Тогда 
		ЧасовойПоясПрограммы = ПолучитьЧасовойПоясИнформационнойБазы();
		Если ПустаяСтрока(ЧасовойПоясПрограммы) Тогда
			ЧасовойПоясПрограммы = ЧасовойПояс();
		КонецЕсли;
		СмещенияВремени = СмещениеСтандартногоВремени(ЧасовойПоясПрограммы);
		ЧасыСмещения    = Цел(СмещенияВремени / 3600);
		ServerTimeZone  = ?(ЧасыСмещения >= 0, "+", "") + Формат(ЧасыСмещения,"ЧЦ=2; ЧН=00; ЧВН=;");
		стрНастройкиМобильногоПриложения.Вставить("serverTimeZone", ServerTimeZone);
	КонецЕсли;
	
	// Заполним настройки видов контактной информации
	стрНастройкиВидовКонтактнойИнформации = уатОбщегоНазначенияПовтИсп_проф.ПолучитьНастройкиВидовКонтактнойИнформации();
	стрНастройкиМобильногоПриложения.Вставить("ВидКонтактнойИнформацииТелефонКонтрагента", Строка(стрНастройкиВидовКонтактнойИнформации.видКонтактнойИнформацииТелефонКонтрагента));
	стрНастройкиМобильногоПриложения.Вставить("ВидКонтактнойИнформацииEmailКонтрагента", Строка(стрНастройкиВидовКонтактнойИнформации.видКонтактнойИнформацииEmailКонтрагента));
	стрНастройкиМобильногоПриложения.Вставить("ВидКонтактнойИнформацииТелефонКонтактногоЛица", Строка(стрНастройкиВидовКонтактнойИнформации.видКонтактнойИнформацииТелефонКонтактногоЛица));
	стрНастройкиМобильногоПриложения.Вставить("ВидКонтактнойИнформацииEmailКонтактногоЛица", Строка(стрНастройкиВидовКонтактнойИнформации.видКонтактнойИнформацииEmailКонтактногоЛица));
	стрНастройкиМобильногоПриложения.Вставить("ВидКонтактнойИнформацииТелефонОтветственного", Строка(стрНастройкиВидовКонтактнойИнформации.видКонтактнойИнформацииТелефонПользователя));
	стрНастройкиМобильногоПриложения.Вставить("ВидКонтактнойИнформацииEmailОтветственного", Строка(стрНастройкиВидовКонтактнойИнформации.видКонтактнойИнформацииEmailПользователя));
	стрНастройкиМобильногоПриложения.Вставить("Имя", ДанныеАвторизации.Логин);
	
	мсвСлужебныеНастройки = уатМобильноеПриложениеВодителяСерверПовтИсп.СлужебныеНастройкиМобильногоПриложения();
	Для Каждого ТекНастрока Из мсвСлужебныеНастройки Цикл
		Если стрНастройкиМобильногоПриложения.Свойство(ТекНастрока) Тогда
			стрНастройкиМобильногоПриложения.Удалить(ТекНастрока);
		КонецЕсли;
	КонецЦикла;    
	
	Если СпособРеализацииВебСервиса = Перечисления.уатСпособыРеализацииВебСервиса.REST Тогда 
		Возврат уатМобильноеПриложениеВодителяСерверREST.ОбработатьМетодGetSettings(responseData, resultCode, ДанныеАвторизации, стрНастройкиМобильногоПриложения);
	Иначе
		Возврат уатМобильноеПриложениеВодителяСерверSOAP.ОбработатьМетодGetSettings(responseData, resultCode, ДанныеАвторизации, стрНастройкиМобильногоПриложения);
	КонецЕсли;
	
КонецФункции // ОбработатьМетодGetSettings()

// Функция предназначена для отправки списка чатов, доступных водителю, и их участников
//
// Параметры:
//  responseData - строка - строка XML, выходные данные, содержимое определяется контекстом выполняемого метода
//  resultCode   - число  - код результата выполнения
//
// Возвращаемое значение:
//   Булево      - истина - метод выполнен успешно;
//               - ложь   - при выполнении метода возникла ошибка
//
Функция ОбработатьМетодGetChats(responseData, resultCode, ДанныеАвторизации, СпособРеализацииВебСервиса)
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Водитель", ДанныеАвторизации.ФизическоеЛицо);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	уатЧатыВодители.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.уатЧаты.Водители КАК уатЧатыВодители
	               |ГДЕ
	               |	уатЧатыВодители.Водитель = &Водитель";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЧатВодителя = Выборка.Ссылка;
	Иначе
		ЧатВодителя = Справочники.уатЧаты.ОбщийЧат;
	КонецЕсли;
	
	МассивКонтактов = Новый Массив();
	Для Каждого ТекСтрока Из ЧатВодителя.Водители Цикл
		МассивКонтактов.Добавить(ТекСтрока.Водитель);
	КонецЦикла;
	
	Для Каждого ТекСтрока Из ЧатВодителя.ГруппаДиспетчеров.Диспетчеры Цикл
		МассивКонтактов.Добавить(ТекСтрока.Диспетчер);
	КонецЦикла;
	
	Если СпособРеализацииВебСервиса = Перечисления.уатСпособыРеализацииВебСервиса.REST Тогда 
		responseData = уатМобильноеПриложениеВодителяСерверREST.СериализоватьChats(МассивКонтактов, ЧатВодителя);
	Иначе
		responseData = уатМобильноеПриложениеВодителяСерверSOAP.СериализоватьChats(МассивКонтактов, ЧатВодителя);
	КонецЕсли;
		
	resultCode = 0; 
	
	Возврат Истина;
	
КонецФункции // ОбработатьМетодGetSettings()

// Функция предназначена для сохранения данных о местоположении мобильного устройства
//
// Параметры:
//  requestData       - строка    - строка XML, входные данные, содержимое определяется контекстом выполняемого метода
//  responseData      - строка    - строка XML, выходные данные, содержимое определяется контекстом выполняемого метода
//  resultCode        - число     - код результата выполнения
//  ДанныеАвторизации - структура - данные об авторизованном пользователе (ФизическоеЛицо и ТС)
//
// Возвращаемое значение:
//   Булево      - истина - метод выполнен успешно;
//               - ложь   - при выполнении метода возникла ошибка
//
Функция ОбработатьМетодSetVehiclePositions(Знач requestData, responseData, resultCode, Знач ДанныеАвторизации, СпособРеализацииВебСервиса)
	
	responseData = ПолучитьПустыеВыходныеДанные(СпособРеализацииВебСервиса);
	
	флОшибка = Ложь;
	
	ДанныеРезультат = ДесериализоватьVehiclePositions(requestData, флОшибка, СпособРеализацииВебСервиса);
	ТабКоординат    = ДанныеРезультат.ТабКоординат;
	Таксометр       = ДанныеРезультат.Таксометр;
	Если флОшибка Тогда 
		resultCode = 35;
		
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ЗаписатьДанныеТаксометра(ДанныеАвторизации, Таксометр, resultCode) Тогда
		Возврат Ложь;
	КонецЕсли;

	Если ТабКоординат.Количество() = 0 Тогда 
		resultCode = 0;
		
		Возврат Истина;
	КонецЕсли;
	
	// вилочка по записи истории координат
	стрНастройкиХраненияИсторииМестоположения = уатМобильноеПриложениеВодителяСерверПовтИсп.ПолучитьНастройкиХраненияИсторииМестоположения();
	
	РежимХраненияИсторииМестоположения = стрНастройкиХраненияИсторииМестоположения.РежимСохранения;
	
	Если РежимХраненияИсторииМестоположения = 1 Тогда 
		Если Не ЗаписатьКоординатыВоВнешнююБазу(ДанныеАвторизации, ТабКоординат, стрНастройкиХраненияИсторииМестоположения, resultCode) Тогда 
			Возврат Ложь;
		КонецЕсли;
	ИначеЕсли РежимХраненияИсторииМестоположения = 2 Тогда
		Если Не ЗаписатьКоординатыВРегистрИсторииМестоположения(ДанныеАвторизации, ТабКоординат, resultCode) Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗаписатьКоординатыВРегистрТекущегоМестоположения(ДанныеАвторизации, ТабКоординат, resultCode) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	resultCode = 0;
	
	Возврат Истина;
	
КонецФункции // ОбработатьМетодSetVehiclePositions()

// Функция предназначена для снятия водителя с линии
//
// Параметры:
//  responseData      - строка    - строка XML, выходные данные, содержимое определяется контекстом выполняемого метода
//  resultCode        - число     - код результата выполнения
//  ДанныеАвторизации - структура - данные об авторизованном пользователе (ФизическоеЛицо и ТС)
//
// Возвращаемое значение:
//   Булево      - истина - метод выполнен успешно;
//               - ложь   - при выполнении метода возникла ошибка
//
Функция ОбработатьМетодLogout(responseData, resultCode, Знач ДанныеАвторизации, СпособРеализацииВебСервиса)
	
	responseData = ПолучитьПустыеВыходныеДанные(СпособРеализацииВебСервиса);   
	
	МобильноеУстройство = ПолучитьТерминалПоID(ДанныеАвторизации.trackerID);
	Возврат ВыполнитьСнятиеСЛинии(ДанныеАвторизации.ФизическоеЛицо, ДанныеАвторизации.ТС, МобильноеУстройство, resultCode);
	
КонецФункции // ОбработатьМетодLogout()

Функция ВыполнитьСнятиеСЛинии(ФизическоеЛицо, ТС, МобильноеУстройство = Неопределено, resultCode = 0)
	
	Попытка
		НаборЗаписи = РегистрыСведений.уатВодителиНаЛинии.СоздатьНаборЗаписей();
		НаборЗаписи.Заполнить(Неопределено);
		НаборЗаписи.Отбор.ФизическоеЛицо.Установить(ФизическоеЛицо);
		НаборЗаписи.Отбор.ТС.Установить(ТС);  
		 
		Если ЗначениеЗаполнено(МобильноеУстройство) Тогда
			НаборЗаписи.Отбор.МобильноеУстройство.Установить(МобильноеУстройство);
		КонецЕсли;
		НаборЗаписи.Прочитать();
	Исключение
		ЗаписатьСообщениеОбОшибке("Login", ОписаниеОшибки());
		resultCode = 40;
		
		Возврат Ложь;
	КонецПопытки;
	
	МассивДляУдаления = Новый Массив();
	Для Каждого ТекСтрока Из НаборЗаписи Цикл
		МассивДляУдаления.Добавить(ТекСтрока);
	КонецЦикла;
	
	Для Каждого ТекСтрока Из МассивДляУдаления Цикл
		Попытка
			НаборЗаписи.Удалить(ТекСтрока);
			
		Исключение
			ЗаписатьСообщениеОбОшибке("Login", ОписаниеОшибки());
			resultCode = 40;
			
			Возврат Ложь;
		КонецПопытки;
	КонецЦикла;
	
	Попытка
		НаборЗаписи.Записать(Истина);
		resultCode = 0;
		
		Возврат Истина;
		
	Исключение
		ЗаписатьСообщениеОбОшибке("Login", ОписаниеОшибки());
		resultCode = 40;
		
		Возврат Ложь;
	КонецПопытки;

КонецФункции

// Функция предназначена для создания обычного сообщения от водителя
//
// Параметры:
//  requestData       - строка    - строка XML, входные данные, содержимое определяется контекстом выполняемого метода
//  responseData      - строка    - строка XML, выходные данные, содержимое определяется контекстом выполняемого метода
//  resultCode        - число     - код результата выполнения
//  ДанныеАвторизации - структура - данные об авторизованном пользователе (ФизическоеЛицо и ТС)
//
// Возвращаемое значение:
//   Булево      - истина - метод выполнен успешно;
//               - ложь   - при выполнении метода возникла ошибка
//
Функция ОбработатьМетодSendMessages(Знач requestData, responseData, resultCode, Знач ДанныеАвторизации, СпособРеализацииВебСервиса) Экспорт
	
	responseData = ПолучитьПустыеВыходныеДанные(СпособРеализацииВебСервиса);
	
	флОшибка = Ложь;
	
	ТабСообщений = ДесериализоватьMessages(requestData, флОшибка, СпособРеализацииВебСервиса);
	
	Если флОшибка Тогда 
		resultCode = 50;
		
		Возврат Ложь;
	КонецЕсли;
	
	Если ТабСообщений.Количество() = 0 Тогда 
		resultCode = 0;
		
		Возврат Истина;
	КонецЕсли;
	
	ДатаДоставки = ТекущаяДатаСеанса();
	Для Каждого ТекСообщение Из ТабСообщений Цикл 
		
		ТекстОшибки = "";
		СообщениеСоздано = РегистрыСведений.уатЧатыСВодителями.СоздатьСообщениеМобильногоПриложения(
			ТекСообщение.Чат,
			ТекСообщение.Текст,
			ТекСообщение.Чат,
			ДанныеАвторизации.ФизическоеЛицо,
			Перечисления.уатВидыСообщенийМобильногоПриложения.Входящее,
			ТекСообщение.Дата,
			Истина,
			Истина,
			ТекущаяДатаСеанса(),
			,,
			ТекСообщение.ИдентификаторСообщения,
			ТекстОшибки
			);
			
		НаименованиеСообщения = НСтр("en='Message from driver';ru='Сообщение от водителя'")
		+ " " + ДанныеАвторизации.ФизическоеЛицо.Наименование + ", " + НСтр("en = 'Vehicle'; ru = 'ТС'") + " " + ДанныеАвторизации.ТС.Наименование;
		
		ТекстСообщения = Новый ФорматированнаяСтрока(
				НаименованиеСообщения + Символы.ПС + ТекСообщение.Текст,
				Символы.ПС,
				Новый ФорматированнаяСтрока("Ответить",,,, "e1cib/command/Обработка.уатСообщенияМобильногоПриложения.Команда.СообщенияМобильногоПриложения"));
		ГруппаДиспетчеров = ТекСообщение.Чат.ГруппаДиспетчеров; 
		Попытка
			Справочники.уатГруппыДиспетчеров.ОтправитьСообщениеВСлужебноеОбсуждение(ГруппаДиспетчеров, ТекстСообщения); 
		Исключение
		КонецПопытки;
		ОтправитьСообщениеВСлужебноеОбсуждение();

	КонецЦикла;
		
	resultCode = 0;
	
	Возврат Истина;
	
КонецФункции // ОбработатьМетодSendMessages()

// Функция предназначена для создания обычного сообщения от водителя
//
// Параметры:
//  requestData       - строка    - строка XML, входные данные, содержимое определяется контекстом выполняемого метода
//  responseData      - строка    - строка XML, выходные данные, содержимое определяется контекстом выполняемого метода
//  resultCode        - число     - код результата выполнения
//  ДанныеАвторизации - структура - данные об авторизованном пользователе (ФизическоеЛицо и ТС)
//
// Возвращаемое значение:
//   Булево      - истина - метод выполнен успешно;
//               - ложь   - при выполнении метода возникла ошибка
//
Функция ОбработатьМетодSendAcceptStatus(Знач requestData, responseData, resultCode, Знач ДанныеАвторизации, СпособРеализацииВебСервиса)
	
	responseData = ПолучитьПустыеВыходныеДанные(СпособРеализацииВебСервиса);
	
	флОшибка = Ложь;
	
	ДанныеМодификацииМЛ = ДесериализоватьAcceptStatus(requestData, флОшибка, СпособРеализацииВебСервиса);
	
	Если флОшибка Тогда  
		resultCode = 50;
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДанныеМодификацииМЛ.МЛ)
		ИЛИ НЕ ТипЗнч(ДанныеМодификацииМЛ.МЛ) = Тип("ДокументСсылка.уатМаршрутныйЛист") Тогда
		Возврат Истина;
	КонецЕсли;
	
	Попытка 
		Если ТипЗнч(ДанныеМодификацииМЛ.МЛ.Водитель1) = Тип("СправочникСсылка.Сотрудники") Тогда
			Водитель1 = ДанныеМодификацииМЛ.МЛ.Водитель1.ФизическоеЛицо;
		Иначе 
			Водитель1 = ДанныеМодификацииМЛ.МЛ.Водитель1;
		КонецЕсли; 
		Если ТипЗнч(ДанныеМодификацииМЛ.МЛ.Водитель2) = Тип("СправочникСсылка.Сотрудники") Тогда
			Водитель2 = ДанныеМодификацииМЛ.МЛ.Водитель2.ФизическоеЛицо;
		Иначе 
			Водитель2 = ДанныеМодификацииМЛ.МЛ.Водитель2;
		КонецЕсли;
		Если НЕ ((Водитель1 = ДанныеАвторизации.ФизическоеЛицо
			ИЛИ Водитель2 = ДанныеАвторизации.ФизическоеЛицо)
			И ДанныеМодификацииМЛ.МЛ.ТС = ДанныеАвторизации.ТС) Тогда 
			ТекстНСТР = НСтр("en='Routing list assigned to another driver or vehicle.';ru='Маршрутный лист назначен другому водителю или ТС.'");
			ЗаписатьСообщениеОбОшибке("SendAcceptStatus", ТекстНСТР);
			resultCode = 66;
			
			Возврат Ложь;
		КонецЕсли;
		МаршЛистОб = ДанныеМодификацииМЛ.МЛ.ПолучитьОбъект();
		МаршЛистОб.ПринятВодителем       = ДанныеМодификацииМЛ.Статус;
		МаршЛистОб.ДатаПринятияВодителем = ДанныеМодификацииМЛ.Дата;
		
		МаршЛистОб.ДополнительныеСвойства.Вставить("НеУстановливатьПризнакОбновленияМобильногоПриложения", Истина);
		МаршЛистОб.Записать();
	Исключение
		ЗаписатьСообщениеОбОшибке("SendAcceptStatus", ОписаниеОшибки());
		resultCode = 125;
		
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции // ОбработатьМетодSendMessages()

// Функция предназначена для регистрации даты выбора водителем пункта в приложении
//
// Параметры:
//  requestData       - строка    - строка XML, входные данные, содержимое определяется контекстом выполняемого метода
//  responseData      - строка    - строка XML, выходные данные, содержимое определяется контекстом выполняемого метода
//  resultCode        - число     - код результата выполнения
//  ДанныеАвторизации - структура - данные об авторизованном пользователе (ФизическоеЛицо и ТС)
//
// Возвращаемое значение:
//   Булево      - истина - метод выполнен успешно;
//               - ложь   - при выполнении метода возникла ошибка
//
Функция ОбработатьМетодSetNextPoint(Знач requestData, responseData, resultCode, Знач ДанныеАвторизации, СпособРеализацииВебСервиса) Экспорт
	
	responseData = ПолучитьПустыеВыходныеДанные(СпособРеализацииВебСервиса);
	
	флОшибка = Ложь;
	
	ДанныеМодификацииМЛ = ДесериализоватьNextPoint(requestData, флОшибка, СпособРеализацииВебСервиса);
	
	Если флОшибка Тогда 
		resultCode = 190;
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДанныеМодификацииМЛ.ДокументСсылка)
		ИЛИ НЕ ТипЗнч(ДанныеМодификацииМЛ.ДокументСсылка) = Тип("ДокументСсылка.уатМаршрутныйЛист") Тогда
		Возврат Истина;
	КонецЕсли;
	Попытка 
		ИспользоватьУведомления = ПолучитьФункциональнуюОпцию("уатИспользоватьУведомления_уэ");
		
		МаршЛистОб = ДанныеМодификацииМЛ.ДокументСсылка.ПолучитьОбъект();  
		
		НайдСтр = МаршЛистОб.Заказы.НайтиСтроки(Новый Структура("Пункт", ДанныеМодификацииМЛ.ПунктСсылка));
		
		Если НайдСтр.Количество() = 1 Тогда 
			НайдСтр[0].ДатаВыбораВодителем = ДанныеМодификацииМЛ.ДатаВыбораВодителем;
			МаршЛистОб.ДополнительныеСвойства.Вставить("НеУстановливатьПризнакОбновленияМобильногоПриложения", Истина);
			МаршЛистОб.Записать();
			Если ИспользоватьУведомления Тогда
				ДополнительныеПараметрыСобытия = Новый Структура;
				ДополнительныеПараметрыСобытия.Вставить("Пункт", НайдСтр[0].Пункт);
				Если ТипЗнч(НайдСтр[0].Пункт) = Тип("СправочникСсылка.уатПунктыНазначения") Тогда
					ДополнительныеПараметрыСобытия.Вставить("ТипПункта", НайдСтр[0].Пункт.ТипПункта);
				КонецЕсли;
				ДополнительныеПараметрыСобытия.Вставить("ТипТочкиМаршрута", НайдСтр[0].ТипТочкиМаршрута);
				ДополнительныеПараметрыСобытия.Вставить("ДополнительныйДокумент", НайдСтр[0].ЗаказГрузоотправителя);
				ДополнительныеПараметрыСобытия.Вставить("GUIDСтроки", НайдСтр[0].GUIDСтроки);
				ДополнительныеПараметрыСобытия.Вставить("УбытиеПлан", НайдСтр[0].УбытиеПлан); 
				уатОбщегоНазначения_уэ.СформироватьУведомление(МаршЛистОб.Ссылка, Перечисления.уатТипыСобытийДляУведомления_уэ.ВыборВодителемСледующегоПункта,
					ДополнительныеПараметрыСобытия);
			КонецЕсли;
		Иначе     
			НомерПункта    = 0;
			ТекПунктСсылка = Неопределено;
			
			СоответвиеЗаказов = Новый Соответствие();
			Для Каждого ТекСтрока Из МаршЛистОб.Заказы Цикл   
				Если ТекПунктСсылка <> ТекСтрока.Пункт Тогда
					НомерПункта    = НомерПункта + 1;
					ТекПунктСсылка = ТекСтрока.Пункт;
				КонецЕсли;
				Если ТекСтрока.Пункт = ДанныеМодификацииМЛ.ПунктСсылка
					И НомерПункта = ДанныеМодификацииМЛ.НомерПункта Тогда
					ТекСтрока.ДатаВыбораВодителем = ДанныеМодификацииМЛ.ДатаВыбораВодителем; 
					
					Если СоответвиеЗаказов.Получить(ТекСтрока.ЗаказГрузоотправителя) <> Неопределено Тогда
						Продолжить;
					КонецЕсли;
					
					СоответвиеЗаказов.Вставить(ТекСтрока.ЗаказГрузоотправителя, Истина);    
					
					Если ИспользоватьУведомления Тогда
						ДополнительныеПараметрыСобытия = Новый Структура;
						ДополнительныеПараметрыСобытия.Вставить("Пункт", ТекСтрока.Пункт);
						Если ТипЗнч(НайдСтр[0].Пункт) = Тип("СправочникСсылка.уатПунктыНазначения") Тогда
							ДополнительныеПараметрыСобытия.Вставить("ТипПункта", ТекСтрока.Пункт.ТипПункта);
						КонецЕсли;
						ДополнительныеПараметрыСобытия.Вставить("ТипТочкиМаршрута", ТекСтрока.ТипТочкиМаршрута);
						ДополнительныеПараметрыСобытия.Вставить("ДополнительныйДокумент", ТекСтрока.ЗаказГрузоотправителя);
						ДополнительныеПараметрыСобытия.Вставить("GUIDСтроки", ТекСтрока.GUIDСтроки);
						ДополнительныеПараметрыСобытия.Вставить("УбытиеПлан", ТекСтрока.УбытиеПлан); 
						уатОбщегоНазначения_уэ.СформироватьУведомление(МаршЛистОб.Ссылка, Перечисления.уатТипыСобытийДляУведомления_уэ.ВыборВодителемСледующегоПункта,
							ДополнительныеПараметрыСобытия);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			МаршЛистОб.ДополнительныеСвойства.Вставить("НеУстановливатьПризнакОбновленияМобильногоПриложения", Истина);
			МаршЛистОб.Записать();
		КонецЕсли;
		
		Если ИспользоватьУведомления Тогда
			Запрос = Новый Запрос(); 
			Запрос.УстановитьПараметр("ТипСобытия", Перечисления.уатТипыСобытийДляУведомления_уэ.ВыборВодителемСледующегоПункта);
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	уатПравилаФормированияУведомлений_уэ.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.уатПравилаФормированияУведомлений_уэ КАК уатПравилаФормированияУведомлений_уэ
			|ГДЕ
			|	НЕ уатПравилаФормированияУведомлений_уэ.ПометкаУдаления
			|	И уатПравилаФормированияУведомлений_уэ.ПравилоИспользуется
			|	И уатПравилаФормированияУведомлений_уэ.ТипСобытия = &ТипСобытия";
			Выборка = Запрос.Выполнить().Выбрать();  
			
			ЕстьДанныеДляОтправкиSMS = Ложь;    
			ЕстьДанныеДляОтправкиЭлектронноеПисьмо = Ложь;
			
			Пока Выборка.Следующий() Цикл 
				НаборЗаписей = РегистрыСведений.уатОчередьУведомлений_уэ.СоздатьНаборЗаписей();
				НаборЗаписей.Заполнить(Неопределено);
				НаборЗаписей.Отбор.Документ.Установить(ДанныеМодификацииМЛ.ДокументСсылка);
				НаборЗаписей.Отбор.ПравилоФормированияУведомлений.Установить(Выборка.Ссылка);
				НаборЗаписей.Прочитать(); 
				
				тзУникальныеУведомления = Новый ТаблицаЗначений;
				тзУникальныеУведомления.Колонки.Добавить("ТекстСообщения", Новый ОписаниеТипов("Строка"));
				тзУникальныеУведомления.Колонки.Добавить("ТемаПисьма", Новый ОписаниеТипов("Строка"));
				тзУникальныеУведомления.Колонки.Добавить("ВидУведомления", Новый ОписаниеТипов("СправочникСсылка.уатСпособыВзаимодействий_уэ"));
				тзУникальныеУведомления.Колонки.Добавить("Получатель");  
				
				Для Каждого Запись Из НаборЗаписей Цикл  
					// Формирование текста сообщения
					Если Не ЗначениеЗаполнено(Запись.ТекстСообщения)
						Или ((Запись.ПравилоФормированияУведомлений.ВидУведомления = Справочники.уатСпособыВзаимодействий_уэ.ЭлектронноеПисьмо или Запись.ПравилоФормированияУведомлений.ВидУведомления = Справочники.уатСпособыВзаимодействий_уэ.ОформлениеКомплектаДокументов)
						И Не ЗначениеЗаполнено(Запись.ТемаПисьма)) Тогда
						ПараметрыСообщения = Новый Структура("ДополнительныйДокумент, GUIDСтрокиМЛ, ДатаУстановкиСтатуса, СтатусДокумента,
						|УбытиеПлан, ГрузовоеМесто, НазначенныеМаршрутныеЛисты");
						ЗаполнитьЗначенияСвойств(ПараметрыСообщения, Запись);
						Сообщение = ШаблоныСообщений.СформироватьСообщение(
						Запись.Шаблон,
						Запись.Документ,
						Новый УникальныйИдентификатор,
						ПараметрыСообщения
						);
						Если Не ЗначениеЗаполнено(Запись.ТекстСообщения) Тогда
							Запись.ТекстСообщения = Сообщение.Текст;
						КонецЕсли;
						Если Не ЗначениеЗаполнено(Запись.ТемаПисьма) Тогда
							Запись.ТемаПисьма = Сообщение.Тема;
						КонецЕсли;
					КонецЕсли;
					
					// Проверка наличия дубликата уведомления в наборе записей
					ПараметрыПоиска = Новый Структура("ТекстСообщения, ТемаПисьма, Получатель, ВидУведомления");
					ЗаполнитьЗначенияСвойств(ПараметрыПоиска, Запись);
					ПараметрыПоиска.ВидУведомления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.ПравилоФормированияУведомлений, "ВидУведомления");
					
					Если тзУникальныеУведомления.НайтиСтроки(ПараметрыПоиска).Количество() > 0 Тогда
						// Сообщение не уникально
						НаборЗаписей.Удалить(Запись);
					Иначе
						НовоеУникальноеУведомление = тзУникальныеУведомления.Добавить();
						ЗаполнитьЗначенияСвойств(НовоеУникальноеУведомление, ПараметрыПоиска); 
					КонецЕсли;
				КонецЦикла;
				НаборЗаписей.Записать(); 
				
				Для Каждого Запись Из НаборЗаписей Цикл 
					Попытка
						УведомлениеМенеджерЗаписи = РегистрыСведений.уатОчередьУведомлений_уэ.СоздатьМенеджерЗаписи(); 
						УведомлениеМенеджерЗаписи.Заполнить(Неопределено);

						ЗаполнитьЗначенияСвойств(УведомлениеМенеджерЗаписи, Запись);
						
						ПараметрыУведомления = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
						УведомлениеМенеджерЗаписи.ПравилоФормированияУведомлений,
						"ВидУведомления"
						);
                        ЕстьДанныеДляОтправкиSMS = ЕстьДанныеДляОтправкиSMS ИЛИ ПараметрыУведомления.ВидУведомления = Справочники.уатСпособыВзаимодействий_уэ.SMSСообщение; 
						ЕстьДанныеДляОтправкиЭлектронноеПисьмо = ПараметрыУведомления.ВидУведомления = Справочники.уатСпособыВзаимодействий_уэ.ЭлектронноеПисьмо;


						УведомлениеМенеджерЗаписи.Прочитать(); 
						Событие = Неопределено;  
						МодульРаботаСУведомлениями = ОбщегоНазначения.ОбщийМодуль("уатРаботаСУведомлениями_уэ");
						МодульРаботаСУведомлениями.ОбработатьУведомление(УведомлениеМенеджерЗаписи, Истина, Событие);
						Если ЕстьДанныеДляОтправкиЭлектронноеПисьмо 
							И ЗначениеЗаполнено(Событие) Тогда 
							УстановитьПривилегированныйРежим(Истина);
							ПисьмоОбъект = Событие.ПолучитьОбъект(); 
							
							Результат = Новый Структура;
							Результат.Вставить("ТекстСообщения", "");
							Результат.Вставить("ПисьмоОтправлено", Ложь);
							Результат.Вставить("ОшибкаПодключения", Ложь);
							
							ПараметрыПисьма = Взаимодействия.ПараметрыПисьмаДляОтправки(ПисьмоОбъект);
							Письмо = РаботаСПочтовымиСообщениями.ПодготовитьПисьмо(ПисьмоОбъект.УчетнаяЗапись, ПараметрыПисьма); 
							Попытка
								РезультатОтправки = РаботаСПочтовымиСообщениями.ОтправитьПисьмо(ПисьмоОбъект.УчетнаяЗапись, Письмо);
							Исключение       
							КонецПопытки;
						КонецЕсли;
					Исключение
						ТекстНСТР = НСтр("en='An error has occurred ';ru='Произошла ошибка при формировании уведомления '")
						+ ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
						ЗаписьЖурналаРегистрации(НСтр("en='Sending notifications';ru='Рассылка уведомлений'"), УровеньЖурналаРегистрации.Ошибка,,, ТекстНСТР);
					КонецПопытки;
				КонецЦикла; 
			КонецЦикла; 
			Если ЕстьДанныеДляОтправкиSMS Тогда 
				Попытка
					Взаимодействия.ОтправитьSMS(); 
				Исключение
				КонецПопытки;
			КонецЕсли;

		КонецЕсли;
	Исключение
		ЗаписатьСообщениеОбОшибке("SetNextPoint", ОписаниеОшибки());
		resultCode = 125;
		
		Возврат Ложь;
	КонецПопытки;


	Возврат Истина;
	
КонецФункции

// Функция предназначена для отправки сообщений водителям
//
// Параметры:
//  responseData      - строка    - строка XML, выходные данные, содержимое определяется контекстом выполняемого метода
//  resultCode        - число     - код результата выполнения
//  ДанныеАвторизации - структура - данные об авторизованном пользователе (ФизическоеЛицо и ТС)
//
// Возвращаемое значение:
//   Булево      - истина - метод выполнен успешно;
//               - ложь   - при выполнении метода возникла ошибка
//
Функция ОбработатьМетодGetMessages(Знач requestData, responseData, resultCode, Знач ДанныеАвторизации, СпособРеализацииВебСервиса)
	 
	responseData = ПолучитьПустыеВыходныеДанные(СпособРеализацииВебСервиса);;
	
	флОшибка = Ложь;
	
	ПараметрыОтбора = ДесериализоватьGetMessages(requestData, флОшибка, СпособРеализацииВебСервиса);
	
	Если флОшибка Тогда 
		resultCode = 55;
		
		Возврат Ложь;
	КонецЕсли;
	
	мЗапрос = Новый Запрос;
	мЗапрос.УстановитьПараметр("ФизическоеЛицо", ДанныеАвторизации.ФизическоеЛицо);
	мЗапрос.УстановитьПараметр("НачалоПериода",  ПараметрыОтбора.НачалоПериода);
	мЗапрос.УстановитьПараметр("КонецПериода",   ПараметрыОтбора.КонецПериода);
	мЗапрос.УстановитьПараметр("Чат",            ?(НЕ ЗначениеЗаполнено(ПараметрыОтбора.Чат),
		Справочники.уатЧаты.ОбщийЧат,
		ПараметрыОтбора.Чат));
	
	мЗапрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ " + ?(ПараметрыОтбора.КоличествоСообщений=Неопределено, "", "ПЕРВЫЕ " + Формат(ПараметрыОтбора.КоличествоСообщений, "ЧН=0; ЧГ=0")) + "
	                |	уатЧатыСВодителями.ТекстСообщения КАК ТекстСообщения,
	                |	уатЧатыСВодителями.Отправитель КАК Отправитель,
	                |	уатСтатусыСообщенийМобильногоПриложения.Получатель КАК Получатель,
	                |	уатЧатыСВодителями.Дата КАК ДатаСоздания,
	                |	уатЧатыСВодителями.Отправлено КАК Отправлено,
	                |	уатЧатыСВодителями.ВидСообщения КАК ВидСообщения,
	                |	уатЧатыСВодителями.Чат КАК Чат,
	                |	уатСтатусыСообщенийМобильногоПриложения.Прочитано КАК Прочитано,
	                |	уатСтатусыСообщенийМобильногоПриложения.Доставлено КАК Доставлено,
	                |	уатСтатусыСообщенийМобильногоПриложения.ДатаДоставки КАК ДатаДоставки,
	                |	уатСтатусыСообщенийМобильногоПриложения.ДатаПрочтения КАК ДатаПрочтения,
	                |	ВЫБОР
	                |		КОГДА уатЧатыСВодителями.ВидСообщения = ЗНАЧЕНИЕ(Перечисление.уатВидыСообщенийМобильногоПриложения.Входящее)
	                |			ТОГДА 0
	                |		ИНАЧЕ ВЫБОР
	                |				КОГДА уатЧатыСВодителями.ВидСообщения = ЗНАЧЕНИЕ(Перечисление.уатВидыСообщенийМобильногоПриложения.Исходящее)
	                |					ТОГДА 1
	                |				ИНАЧЕ 2
	                |			КОНЕЦ
	                |	КОНЕЦ КАК ИндексКартинки,
	                |	ВЫБОР
	                |		КОГДА ТИПЗНАЧЕНИЯ(уатСтатусыСообщенийМобильногоПриложения.Получатель) = ТИП(Справочник.уатЧаты)
	                |			ТОГДА ИСТИНА
	                |		ИНАЧЕ ЛОЖЬ
	                |	КОНЕЦ КАК ПолучательЧат,
	                |	уатЧатыСВодителями.Идентификатор КАК ИдентификаторСообщения,
	                |	ВЫБОР
	                |		КОГДА уатЧатыСВодителями.ВидСообщения = ЗНАЧЕНИЕ(Перечисление.уатВидыСообщенийМобильногоПриложения.Исходящее)
	                |			ТОГДА ""1С""
	                |		ИНАЧЕ ""user""
	                |	КОНЕЦ КАК Источник
	                |ИЗ
	                |	РегистрСведений.уатЧатыСВодителями КАК уатЧатыСВодителями
	                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уатСтатусыСообщенийМобильногоПриложения КАК уатСтатусыСообщенийМобильногоПриложения
	                |		ПО уатЧатыСВодителями.Идентификатор = уатСтатусыСообщенийМобильногоПриложения.Идентификатор
	                |ГДЕ
	                |	уатЧатыСВодителями.Чат = &Чат
	                |	И ВЫБОР
	                |			КОГДА уатЧатыСВодителями.ВидСообщения = ЗНАЧЕНИЕ(Перечисление.уатВидыСообщенийМобильногоПриложения.Исходящее)
	                |				ТОГДА уатСтатусыСообщенийМобильногоПриложения.Получатель = &ФизическоеЛицо
	                |			ИНАЧЕ уатЧатыСВодителями.Отправитель = &ФизическоеЛицо
	                |		КОНЕЦ
	                |	И (ВЫБОР
	                |					КОГДА &НачалоПериода = НЕОПРЕДЕЛЕНО
	                |						ТОГДА ИСТИНА
	                |					ИНАЧЕ уатЧатыСВодителями.Дата > &НачалоПериода
	                |				КОНЕЦ
	                |				И ВЫБОР
	                |					КОГДА &КонецПериода = НЕОПРЕДЕЛЕНО
	                |						ТОГДА ИСТИНА
	                |					ИНАЧЕ уатЧатыСВодителями.Дата <= &КонецПериода
	                |				КОНЕЦ
	                |			ИЛИ ВЫБОР
	                |					КОГДА &НачалоПериода = НЕОПРЕДЕЛЕНО
	                |						ТОГДА ИСТИНА
	                |					ИНАЧЕ уатСтатусыСообщенийМобильногоПриложения.ДатаПрочтения > &НачалоПериода
	                |				КОНЕЦ
	                |				И ВЫБОР
	                |					КОГДА &КонецПериода = НЕОПРЕДЕЛЕНО
	                |						ТОГДА ИСТИНА
	                |					ИНАЧЕ уатСтатусыСообщенийМобильногоПриложения.ДатаПрочтения <= &КонецПериода
	                |				КОНЕЦ)";
	
	Попытка
		ТабСообщений = мЗапрос.Выполнить().Выгрузить();
		
		responseData = СериализоватьMessages(ТабСообщений, СпособРеализацииВебСервиса);
		
	Исключение
		ЗаписатьСообщениеОбОшибке("GetMessages", ОписаниеОшибки());
		resultCode = 55;
		
		responseData = ПолучитьПустыеВыходныеДанные(СпособРеализацииВебСервиса);;
		
		Возврат Ложь;
	КонецПопытки;
	
	// Проставим признак "отправлено" 
	ТребуетсяОбновление = Ложь;
	Для Каждого ТекСообщение Из ТабСообщений Цикл 
		Если ТекСообщение.ВидСообщения <> Перечисления.уатВидыСообщенийМобильногоПриложения.Исходящее
			ИЛИ (ТекСообщение.Доставлено
			И ТекСообщение.Отправлено) Тогда 
			Продолжить;
		КонецЕсли;
		
		НаборЗаписей = РегистрыСведений.уатЧатыСВодителями.СоздатьНаборЗаписей(); 
		НаборЗаписей.Заполнить(Неопределено);
		НаборЗаписей.Отбор.Отправитель.Установить(ТекСообщение.Отправитель);
		НаборЗаписей.Отбор.Идентификатор.Установить(ТекСообщение.ИдентификаторСообщения);
		
		Попытка
			НаборЗаписей.Прочитать();
		Исключение
			ЗаписатьСообщениеОбОшибке("GetMessages", ОписаниеОшибки());
		КонецПопытки;
		
		Если НаборЗаписей.Выбран() 
			И НЕ НаборЗаписей.Количество() = 0 
			И НЕ НаборЗаписей[0].Отправлено Тогда 
			НаборЗаписей[0].Отправлено = Истина;
			
			Попытка
				НаборЗаписей.Записать();
			Исключение
				ЗаписатьСообщениеОбОшибке("GetMessages", ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;
		
		НаборЗаписей = РегистрыСведений.уатСтатусыСообщенийМобильногоПриложения.СоздатьНаборЗаписей();
		НаборЗаписей.Заполнить(Неопределено);
		НаборЗаписей.Отбор.Получатель.Установить(ТекСообщение.Получатель);
		НаборЗаписей.Отбор.Идентификатор.Установить(ТекСообщение.ИдентификаторСообщения);
		
		Попытка
			НаборЗаписей.Прочитать();
		Исключение
			ЗаписатьСообщениеОбОшибке("GetMessages", ОписаниеОшибки());
		КонецПопытки;
		
		ЕстьИзменения = Ложь;
		Для Каждого Запись Из НаборЗаписей Цикл
			
			Если Запись.Доставлено Тогда
				Продолжить;
			КонецЕсли;
			
			Запись.Доставлено   = Истина;
			Запись.ДатаДоставки = ТекущаяДатаСеанса();
			
			ЕстьИзменения = Истина;
		КонецЦикла;
		
		Если НаборЗаписей.Количество() = 0 Тогда
			
			Запись = НаборЗаписей.Добавить();
			Запись.Получатель    = ТекСообщение.Получатель;
			Запись.Идентификатор = ТекСообщение.ИдентификаторСообщения;
			Запись.ДатаДоставки  = ТекущаяДатаСеанса();
			Запись.Доставлено    = Истина;
			
			ЕстьИзменения = Истина;
		КонецЕсли;
		
		Если ЕстьИзменения Тогда
			ТребуетсяОбновление = Истина;
			Попытка
				НаборЗаписей.Записать(Истина);
			Исключение
				ЗаписатьСообщениеОбОшибке("GetMessages", ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;
	
	КонецЦикла;
	
	Если ТребуетсяОбновление Тогда  
		Если НЕ СпособРеализацииВебСервиса = Перечисления.уатСпособыРеализацииВебСервиса.REST Тогда
			УстановитьПризнакОтправлено(ДанныеАвторизации.ФизическоеЛицо,,,,, Истина); 
		КонецЕсли;
		ОтправитьСообщениеВСлужебноеОбсуждение();
	КонецЕсли; 
	
	resultCode = 0;
	
	Возврат Истина;
	
КонецФункции // ОбработатьМетодGetMessages()

// Функция предназначена для установки статуса “Прочитано” для сообщений, которые водитель прочитал в чате
//
// Параметры:
//  responseData      - строка    - строка XML, выходные данные, содержимое определяется контекстом выполняемого метода
//  resultCode        - число     - код результата выполнения
//  ДанныеАвторизации - структура - данные об авторизованном пользователе (ФизическоеЛицо и ТС)
//
// Возвращаемое значение:
//   Булево      - истина - метод выполнен успешно;
//               - ложь   - при выполнении метода возникла ошибка
//
Функция ОбработатьМетодUpdateMessageStatus(Знач requestData, responseData, resultCode, Знач ДанныеАвторизации, СпособРеализацииВебСервиса)
	
	responseData = ПолучитьПустыеВыходныеДанные(СпособРеализацииВебСервиса);
	
	флОшибка = Ложь;
	
	ТабСообщений = ДесериализоватьStatusMessages(requestData, флОшибка, СпособРеализацииВебСервиса);
	
	Если флОшибка Тогда 
		resultCode = 135;
		
		Возврат Ложь;
	КонецЕсли;
	
	Если ТабСообщений.Количество() = 0 Тогда 
		resultCode = 0;
		
		Возврат Истина;
	КонецЕсли;
	
	Получатель = ДанныеАвторизации.ФизическоеЛицо;
	Для Каждого ТекСообщение Из ТабСообщений Цикл
		НаборЗаписей = РегистрыСведений.уатСтатусыСообщенийМобильногоПриложения.СоздатьНаборЗаписей(); 
		НаборЗаписей.Заполнить(Неопределено);
		НаборЗаписей.Отбор.Получатель.Установить(Получатель);
		НаборЗаписей.Отбор.Идентификатор.Установить(ТекСообщение.ИдентификаторСообщения);
		НаборЗаписей.Прочитать();
		
		Для Каждого Запись Из НаборЗаписей Цикл 
			Запись.ДатаПрочтения = ТекСообщение.ДатаПрочтения;
			Запись.Прочитано     = ТекСообщение.Прочитано;
		КонецЦикла;
		
		Если НаборЗаписей.Количество() = 0 Тогда
			
			Запись = НаборЗаписей.Добавить();
			Запись.Получатель    = Получатель;
			Запись.Идентификатор = ТекСообщение.ИдентификаторСообщения;
			Запись.ДатаПрочтения = ТекСообщение.ДатаПрочтения;
			Запись.Прочитано     = ТекСообщение.Прочитано;
		КонецЕсли;
		
		Попытка
			НаборЗаписей.Записать(Истина);
		Исключение
			ЗаписатьСообщениеОбОшибке("UpdateMessageStatus", ОписаниеОшибки());
			resultCode = 135;
			
			Возврат Ложь;
		КонецПопытки;
	КонецЦикла;
	
	ОтправитьСообщениеВСлужебноеОбсуждение();
	
	resultCode = 0;
	
	Возврат Истина;
	
КонецФункции // ОбработатьМетодUpdateMessageStatus()

// Функция предназначена для формирования списка маршрутных листов водителя
//
// Параметры:
//  responseData      - строка    - строка XML, выходные данные, содержимое определяется контекстом выполняемого метода
//  resultCode        - число     - код результата выполнения
//  ДанныеАвторизации - структура - данные об авторизованном пользователе (ФизическоеЛицо и ТС)
//
// Возвращаемое значение:
//   Булево      - истина - метод выполнен успешно;
//               - ложь   - при выполнении метода возникла ошибка
//
Функция ОбработатьМетодGetRouteList(responseData, resultCode, Знач ДанныеАвторизации, СпособРеализацииВебСервиса)
	
	//стрНастройкиМобильногоПриложения = уатМобильноеПриложениеВодителяСерверПовтИсп.ПолучитьНастройкиМобильногоПриложения();
	стрНастройкиВидовКонтактнойИнформации = уатОбщегоНазначенияПовтИсп_проф.ПолучитьНастройкиВидовКонтактнойИнформации();
	стрНастроек = уатМобильноеПриложениеВодителяСерверПовтИсп.ПолучитьНастройкиМобильногоПриложения();
	ИспользоватьСкладскиеАкты = ПолучитьФункциональнуюОпцию("уатРазделятьПланФактВСкладскихАктах_уэ");

	ОграничениеЧислаМЛДнейВперед = стрНастроек.ОграничениеЧислаМЛДнейВперед;
	ОграничениеЧислаМЛДнейНазад  = стрНастроек.ОграничениеЧислаМЛДнейНазад;

	
	ТекущаяДатаСеанса = ТекущаяДатаСеанса();
	ДатаОт = НачалоДня(ТекущаяДатаСеанса) - ОграничениеЧислаМЛДнейНазад * (60 * 60 * 24);
	ДатаПо = КонецДня(ТекущаяДатаСеанса) + ОграничениеЧислаМЛДнейВперед * (60 * 60 * 24);
	
	мЗапрос = Новый Запрос;
	мЗапрос.УстановитьПараметр("ТС",           ДанныеАвторизации.ТС);
	мЗапрос.УстановитьПараметр("Водитель",     ДанныеАвторизации.ФизическоеЛицо);
	
	мЗапрос.УстановитьПараметр("ВидКонтактнойИнформацииТелефонКонтрагента",     стрНастройкиВидовКонтактнойИнформации.видКонтактнойИнформацииТелефонКонтрагента);
	мЗапрос.УстановитьПараметр("ВидКонтактнойИнформацииEmailКонтрагента",       стрНастройкиВидовКонтактнойИнформации.видКонтактнойИнформацииEmailКонтрагента);
	мЗапрос.УстановитьПараметр("ВидКонтактнойИнформацииТелефонКонтактногоЛица", стрНастройкиВидовКонтактнойИнформации.видКонтактнойИнформацииТелефонКонтактногоЛица);
	мЗапрос.УстановитьПараметр("ВидКонтактнойИнформацииEmailКонтактногоЛица",   стрНастройкиВидовКонтактнойИнформации.видКонтактнойИнформацииEmailКонтактногоЛица);
	мЗапрос.УстановитьПараметр("ВидКонтактнойИнформацииТелефонОтветственного",  стрНастройкиВидовКонтактнойИнформации.видКонтактнойИнформацииТелефонПользователя);
	мЗапрос.УстановитьПараметр("ВидКонтактнойИнформацииEmailОтветственного",    стрНастройкиВидовКонтактнойИнформации.видКонтактнойИнформацииEmailПользователя);
	
	мЗапрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатМаршрутныйЛист.Ссылка КАК МаршрутныйЛистСсылка,
	|	уатМаршрутныйЛист.Номер КАК МаршрутныйЛистНомер,
	|	уатМаршрутныйЛист.ТС КАК МаршрутныйЛистТС,
	|	уатМаршрутныйЛист.ДатаИВремяОтправленияПлан КАК МаршрутныйЛистДатаОтправленияПлан,
	|	уатМаршрутныйЛист.ДатаИВремяВыполненияПлан КАК МаршрутныйЛистДатаВыполненияПлан,
	|	уатМаршрутныйЛист.КомментарийВодителю КАК МаршрутныйЛистКомментарий,
	|	уатМаршрутныйЛистЗаказы.GUIDСтроки КАК ГУИДСтроки,
	|	уатМаршрутныйЛистЗаказы.НомерСтроки КАК НомерСтроки,
	|	уатМаршрутныйЛистЗаказы.Выполнен КАК Выполнен,
	|	ЕСТЬNULL(уатМаршрутныйЛистЗаказы.ЗаказГрузоотправителя.Номер, """") КАК ЗаказНомер,
	|	ЕСТЬNULL(уатМаршрутныйЛистЗаказы.ЗаказГрузоотправителя.ВидДоставки, ЗНАЧЕНИЕ(Перечисление.уатВидыДоставки_уэ.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.уатВидыДоставки_уэ.ДверьДверь)
	|		ИЛИ ЕСТЬNULL(уатМаршрутныйЛистЗаказы.ЗаказГрузоотправителя.ВидДоставки, ЗНАЧЕНИЕ(Перечисление.уатВидыДоставки_уэ.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.уатВидыДоставки_уэ.СкладДверь) КАК ПриемкаИзРейсаВПункте,
	|	ЕСТЬNULL(уатМаршрутныйЛистЗаказы.ЗаказГрузоотправителя.ВидДоставки, ЗНАЧЕНИЕ(Перечисление.уатВидыДоставки_уэ.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.уатВидыДоставки_уэ.ДверьДверь)
	|		ИЛИ ЕСТЬNULL(уатМаршрутныйЛистЗаказы.ЗаказГрузоотправителя.ВидДоставки, ЗНАЧЕНИЕ(Перечисление.уатВидыДоставки_уэ.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.уатВидыДоставки_уэ.ДверьСклад) КАК ОтгрузкаВРейсВПункте,
	|	ВЫБОР
	|		КОГДА уатМаршрутныйЛистЗаказы.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА уатМаршрутныйЛистЗаказы.ЗаказГрузоотправителя = ЗНАЧЕНИЕ(Документ.уатЗаказГрузоотправителя.ПустаяСсылка)
	|						ТОГДА """"
	|					ИНАЧЕ ЕСТЬNULL(уатМаршрутныйЛистЗаказы.ЗаказГрузоотправителя.Контрагент.Наименование, """")
	|				КОНЕЦ
	|		ИНАЧЕ уатМаршрутныйЛистЗаказы.Контрагент.Наименование
	|	КОНЕЦ КАК КонтрагентНаименование,
	|	ВЫБОР
	|		КОГДА уатМаршрутныйЛистЗаказы.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА уатМаршрутныйЛистЗаказы.ЗаказГрузоотправителя = ЗНАЧЕНИЕ(Документ.уатЗаказГрузоотправителя.ПустаяСсылка)
	|						ТОГДА ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|					ИНАЧЕ ЕСТЬNULL(уатМаршрутныйЛистЗаказы.ЗаказГрузоотправителя.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
	|				КОНЕЦ
	|		ИНАЧЕ уатМаршрутныйЛистЗаказы.Контрагент
	|	КОНЕЦ КАК КонтрагентСсылка,
	|	ВЫБОР
	|		КОГДА уатМаршрутныйЛистЗаказы.ЗаказГрузоотправителя = ЗНАЧЕНИЕ(Документ.уатЗаказГрузоотправителя.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|		ИНАЧЕ ЕСТЬNULL(уатМаршрутныйЛистЗаказы.ЗаказГрузоотправителя.Грузоотправитель, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
	|	КОНЕЦ КАК ГрузоотправительСсылка,
	|	ВЫБОР
	|		КОГДА уатМаршрутныйЛистЗаказы.ЗаказГрузоотправителя = ЗНАЧЕНИЕ(Документ.уатЗаказГрузоотправителя.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|		ИНАЧЕ ЕСТЬNULL(уатМаршрутныйЛистЗаказы.ЗаказГрузоотправителя.Грузополучатель, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
	|	КОНЕЦ КАК ГрузополучательСсылка,
	|	ВЫБОР
	|		КОГДА уатМаршрутныйЛистЗаказы.ЗаказГрузоотправителя = ЗНАЧЕНИЕ(Документ.уатЗаказГрузоотправителя.ПустаяСсылка)
	|				ИЛИ НЕ ТИПЗНАЧЕНИЯ(уатМаршрутныйЛистЗаказы.ЗаказГрузоотправителя.КонтактноеЛицоГрузоотправителя) = ТИП(Справочник.КонтактныеЛица)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.КонтактныеЛица.ПустаяСсылка)
	|		ИНАЧЕ ЕСТЬNULL(уатМаршрутныйЛистЗаказы.ЗаказГрузоотправителя.КонтактноеЛицоГрузоотправителя, ЗНАЧЕНИЕ(Справочник.КонтактныеЛица.ПустаяСсылка))
	|	КОНЕЦ КАК КонтактноеЛицоГрузоотправителяСсылка,
	|	ВЫБОР
	|		КОГДА уатМаршрутныйЛистЗаказы.ЗаказГрузоотправителя = ЗНАЧЕНИЕ(Документ.уатЗаказГрузоотправителя.ПустаяСсылка)
	|				ИЛИ НЕ ТИПЗНАЧЕНИЯ(уатМаршрутныйЛистЗаказы.ЗаказГрузоотправителя.КонтактноеЛицоГрузополучателя) = ТИП(Справочник.КонтактныеЛица)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.КонтактныеЛица.ПустаяСсылка)
	|		ИНАЧЕ ЕСТЬNULL(уатМаршрутныйЛистЗаказы.ЗаказГрузоотправителя.КонтактноеЛицоГрузополучателя, ЗНАЧЕНИЕ(Справочник.КонтактныеЛица.ПустаяСсылка))
	|	КОНЕЦ КАК КонтактноеЛицоГрузополучателяСсылка,
	|	ВЫБОР
	|		КОГДА уатМаршрутныйЛистЗаказы.ЗаказГрузоотправителя = ЗНАЧЕНИЕ(Документ.уатЗаказГрузоотправителя.ПустаяСсылка)
	|				ИЛИ НЕ ТИПЗНАЧЕНИЯ(уатМаршрутныйЛистЗаказы.ЗаказГрузоотправителя.КонтактноеЛицоЗаказчика) = ТИП(Справочник.КонтактныеЛица)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.КонтактныеЛица.ПустаяСсылка)
	|		ИНАЧЕ ЕСТЬNULL(уатМаршрутныйЛистЗаказы.ЗаказГрузоотправителя.КонтактноеЛицоЗаказчика, ЗНАЧЕНИЕ(Справочник.КонтактныеЛица.ПустаяСсылка))
	|	КОНЕЦ КАК КонтактноеЛицоЗаказчикаСсылка,
	|	ВЫБОР
	|		КОГДА уатМаршрутныйЛистЗаказы.ЗаказГрузоотправителя = ЗНАЧЕНИЕ(Документ.уатЗаказГрузоотправителя.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|		ИНАЧЕ ЕСТЬNULL(уатМаршрутныйЛистЗаказы.ЗаказГрузоотправителя.Ответственный, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка))
	|	КОНЕЦ КАК ОтветственныйПоЗаказу,
	|	ВЫБОР
	|		КОГДА уатМаршрутныйЛистЗаказы.ЗаказГрузоотправителя = ЗНАЧЕНИЕ(Документ.уатЗаказГрузоотправителя.ПустаяСсылка)
	|			ТОГДА """"
	|		ИНАЧЕ ЕСТЬNULL(уатМаршрутныйЛистЗаказы.ЗаказГрузоотправителя.КомментарийВодителю, """")
	|	КОНЕЦ КАК КомментарийПоЗаказу,
	|	уатМаршрутныйЛистЗаказы.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(уатМаршрутныйЛистЗаказы.ЕдиницаИзмерения, """") КАК ЕдиницаИзмерения,
	|	уатМаршрутныйЛистЗаказы.Количество КАК Количество,
	|	уатМаршрутныйЛистЗаказы.КоличествоМест КАК КоличествоМест,
	|	уатМаршрутныйЛистЗаказы.ВесБрутто КАК ВесБрутто,
	|	уатМаршрутныйЛистЗаказы.Объем КАК Объем,
	|	ВЫБОР
	|		КОГДА уатМаршрутныйЛистЗаказы.Пункт ЕСТЬ NULL
	|				ИЛИ ТИПЗНАЧЕНИЯ(уатМаршрутныйЛистЗаказы.Пункт) = ТИП(СТРОКА)
	|			ТОГДА уатМаршрутныйЛистЗаказы.Пункт
	|		ИНАЧЕ уатМаршрутныйЛистЗаказы.Пункт.Наименование
	|	КОНЕЦ КАК ПунктНаименование,
	|	ВЫБОР
	|		КОГДА уатМаршрутныйЛистЗаказы.Пункт ЕСТЬ NULL
	|			ТОГДА """"
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТИПЗНАЧЕНИЯ(уатМаршрутныйЛистЗаказы.Пункт) = ТИП(СТРОКА)
	|					ТОГДА уатМаршрутныйЛистЗаказы.Пункт
	|				ИНАЧЕ уатМаршрутныйЛистЗаказы.Пункт.Адрес
	|			КОНЕЦ
	|	КОНЕЦ КАК ПунктАдрес,
	|	ВЫБОР
	|		КОГДА уатМаршрутныйЛистЗаказы.Пункт ЕСТЬ NULL
	|				ИЛИ ТИПЗНАЧЕНИЯ(уатМаршрутныйЛистЗаказы.Пункт) = ТИП(СТРОКА)
	|			ТОГДА 0
	|		ИНАЧЕ уатМаршрутныйЛистЗаказы.Пункт.Лат
	|	КОНЕЦ КАК ПунктШирота,
	|	ВЫБОР
	|		КОГДА уатМаршрутныйЛистЗаказы.Пункт ЕСТЬ NULL
	|				ИЛИ ТИПЗНАЧЕНИЯ(уатМаршрутныйЛистЗаказы.Пункт) = ТИП(СТРОКА)
	|			ТОГДА 0
	|		ИНАЧЕ уатМаршрутныйЛистЗаказы.Пункт.Лон
	|	КОНЕЦ КАК ПунктДолгота,
	|	ВЫБОР
	|		КОГДА уатМаршрутныйЛистЗаказы.Пункт ЕСТЬ NULL
	|				ИЛИ ТИПЗНАЧЕНИЯ(уатМаршрутныйЛистЗаказы.Пункт) = ТИП(СТРОКА)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ уатМаршрутныйЛистЗаказы.Пункт.Гараж
	|	КОНЕЦ КАК ПунктЭтоГараж,
	|	уатМаршрутныйЛистЗаказы.Стоянка КАК ВремяСтоянки,
	|	уатМаршрутныйЛистЗаказы.ТипТочкиМаршрута КАК ТипТочкиМаршрута,
	|	уатМаршрутныйЛистЗаказы.ПрибытиеПлан КАК ПрибытиеПлан,
	|	уатМаршрутныйЛистЗаказы.УбытиеПлан КАК УбытиеПлан,
	|	уатМаршрутныйЛистЗаказы.ПрибытиеФакт КАК ПрибытиеФакт,
	|	уатМаршрутныйЛистЗаказы.УбытиеФакт КАК УбытиеФакт,
	|	уатМаршрутныйЛистЗаказы.Пункт КАК ПунктСсылка,
	|	уатМаршрутныйЛистЗаказы.СтоянкаИзПункта КАК СтоянкаИзПункта,
	|	уатМаршрутныйЛистЗаказы.Пункт.РадиусПоиска КАК ПунктРадиусПоиска,
	|	уатМаршрутныйЛист.ПринятВодителем КАК ПринятВодителем,
	|	уатМаршрутныйЛистЗаказы.ЗаказГрузоотправителя КАК ЗаказСсылка,
	|	уатМаршрутныйЛистЗаказы.Выработка1 КАК Выработка1,
	|	уатМаршрутныйЛистЗаказы.Выработка2 КАК Выработка2,
	|	уатМаршрутныйЛистЗаказы.Выработка3 КАК Выработка3,
	|	уатМаршрутныйЛистЗаказы.Выработка4 КАК Выработка4,
	|	уатМаршрутныйЛистЗаказы.Выработка5 КАК Выработка5,
	|	уатМаршрутныйЛистЗаказы.ПараметрВыработки1 КАК ПараметрВыработки1,
	|	уатМаршрутныйЛистЗаказы.ПараметрВыработки2 КАК ПараметрВыработки2,
	|	уатМаршрутныйЛистЗаказы.ПараметрВыработки3 КАК ПараметрВыработки3,
	|	уатМаршрутныйЛистЗаказы.ПараметрВыработки4 КАК ПараметрВыработки4,
	|	уатМаршрутныйЛистЗаказы.ПараметрВыработки5 КАК ПараметрВыработки5,
	|	уатМаршрутныйЛист.СсылкаMultiGo КАК СсылкаMultiGo,
	|	уатМаршрутныйЛистЗаказы.ОтветMultiGo КАК ОтветMultiGo,
	|	уатМаршрутныйЛистЗаказы.Пункт.ТипПункта.Служебный КАК СлужебныйТипПункта,
	|	уатМаршрутныйЛистЗаказы.ОценкаСервиса КАК ОценкаСервиса,
	|	уатМаршрутныйЛистЗаказы.Подпись КАК Подпись,
	|	уатМаршрутныйЛистЗаказы.ЗаказГрузоотправителя.FTL КАК ЗаказFTL
	|ПОМЕСТИТЬ ВТ_МаршрутныеЛисты
	|ИЗ
	|	Документ.уатМаршрутныйЛист КАК уатМаршрутныйЛист
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.уатМаршрутныйЛист.Заказы КАК уатМаршрутныйЛистЗаказы
	|		ПО (уатМаршрутныйЛистЗаказы.Ссылка = уатМаршрутныйЛист.Ссылка)
	|ГДЕ
	|	уатМаршрутныйЛист.ТС = &ТС
	|	И (ВЫБОР
	|				КОГДА ТИПЗНАЧЕНИЯ(уатМаршрутныйЛист.Водитель1) = ТИП(Справочник.Сотрудники)
	|					ТОГДА уатМаршрутныйЛист.Водитель1.ФизическоеЛицо = &Водитель
	|				ИНАЧЕ уатМаршрутныйЛист.Водитель1 = &Водитель
	|			КОНЕЦ
	|			ИЛИ ВЫБОР
	|				КОГДА ТИПЗНАЧЕНИЯ(уатМаршрутныйЛист.Водитель2) = ТИП(Справочник.Сотрудники)
	|					ТОГДА уатМаршрутныйЛист.Водитель2.ФизическоеЛицо = &Водитель
	|				ИНАЧЕ уатМаршрутныйЛист.Водитель2 = &Водитель
	|			КОНЕЦ)
	|	И уатМаршрутныйЛист.Выполнен = ЛОЖЬ
	|	И уатМаршрутныйЛист.ЗакрытВодителем = ЛОЖЬ
	|	И уатМаршрутныйЛист.Проведен = ИСТИНА
	|	И уатМаршрутныйЛист.ПометкаУдаления = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_МаршрутныеЛисты.МаршрутныйЛистСсылка КАК МаршрутныйЛистСсылка,
	|	ВТ_МаршрутныеЛисты.МаршрутныйЛистНомер КАК МаршрутныйЛистНомер,
	|	ВТ_МаршрутныеЛисты.МаршрутныйЛистТС КАК МаршрутныйЛистТС,
	|	ВТ_МаршрутныеЛисты.МаршрутныйЛистДатаОтправленияПлан КАК МаршрутныйЛистДатаОтправленияПлан,
	|	ВТ_МаршрутныеЛисты.МаршрутныйЛистДатаВыполненияПлан КАК МаршрутныйЛистДатаВыполненияПлан,
	|	ВТ_МаршрутныеЛисты.МаршрутныйЛистКомментарий КАК МаршрутныйЛистКомментарий,
	|	ВТ_МаршрутныеЛисты.ГУИДСтроки КАК ГУИДСтроки,
	|	ВТ_МаршрутныеЛисты.НомерСтроки КАК НомерСтроки,
	|	ВТ_МаршрутныеЛисты.Выполнен КАК Выполнен,
	|	ВТ_МаршрутныеЛисты.ЗаказНомер КАК ЗаказНомер,
	|	ВТ_МаршрутныеЛисты.КонтрагентНаименование КАК КонтрагентНаименование,
	|	ВТ_МаршрутныеЛисты.КонтрагентСсылка КАК КонтрагентСсылка,
	|	ВТ_МаршрутныеЛисты.ГрузоотправительСсылка КАК ГрузоотправительСсылка,
	|	ВТ_МаршрутныеЛисты.ГрузополучательСсылка КАК ГрузополучательСсылка,
	|	ВТ_МаршрутныеЛисты.КонтактноеЛицоГрузоотправителяСсылка КАК КонтактноеЛицоГрузоотправителяСсылка,
	|	ВТ_МаршрутныеЛисты.КонтактноеЛицоГрузополучателяСсылка КАК КонтактноеЛицоГрузополучателяСсылка,
	|	ВТ_МаршрутныеЛисты.КонтактноеЛицоЗаказчикаСсылка КАК КонтактноеЛицоЗаказчикаСсылка,
	|	ВТ_МаршрутныеЛисты.Номенклатура КАК Номенклатура,
	|	ВТ_МаршрутныеЛисты.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВТ_МаршрутныеЛисты.Количество КАК Количество,
	|	ВТ_МаршрутныеЛисты.КоличествоМест КАК КоличествоМест,
	|	ВТ_МаршрутныеЛисты.ВесБрутто КАК ВесБрутто,
	|	ВТ_МаршрутныеЛисты.Объем КАК Объем,
	|	ВТ_МаршрутныеЛисты.ПунктНаименование КАК ПунктНаименование,
	|	ВТ_МаршрутныеЛисты.ПунктАдрес КАК ПунктАдрес,
	|	ВТ_МаршрутныеЛисты.ПунктШирота КАК ПунктШирота,
	|	ВТ_МаршрутныеЛисты.ПунктДолгота КАК ПунктДолгота,
	|	ВТ_МаршрутныеЛисты.ПунктЭтоГараж КАК ПунктЭтоГараж,
	|	ВТ_МаршрутныеЛисты.ВремяСтоянки КАК ВремяСтоянки,
	|	ВТ_МаршрутныеЛисты.ТипТочкиМаршрута КАК ТипТочкиМаршрута,
	|	ВТ_МаршрутныеЛисты.ПрибытиеПлан КАК ПрибытиеПлан,
	|	ВТ_МаршрутныеЛисты.ПрибытиеФакт КАК ПрибытиеФакт,
	|	ВТ_МаршрутныеЛисты.УбытиеПлан КАК УбытиеПлан,
	|	ВТ_МаршрутныеЛисты.УбытиеФакт КАК УбытиеФакт,
	|	ВТ_МаршрутныеЛисты.ОтветственныйПоЗаказу КАК ОтветственныйПоЗаказу,
	|	ВТ_МаршрутныеЛисты.КомментарийПоЗаказу КАК КомментарийПоЗаказу,
	|	ВТ_МаршрутныеЛисты.ПунктСсылка КАК ПунктСсылка,
	|	ВТ_МаршрутныеЛисты.СтоянкаИзПункта КАК СтоянкаИзПункта,
	|	ВТ_МаршрутныеЛисты.ПунктРадиусПоиска КАК ПунктРадиусПоиска,
	|	ВТ_МаршрутныеЛисты.ПринятВодителем КАК ПринятВодителем,
	|	ВТ_МаршрутныеЛисты.ОтгрузкаВРейсВПункте КАК ОтгрузкаВРейсВПункте,
	|	ВТ_МаршрутныеЛисты.ПриемкаИзРейсаВПункте КАК ПриемкаИзРейсаВПункте,
	|	ВТ_МаршрутныеЛисты.ЗаказСсылка КАК ЗаказСсылка,
	|	ВТ_МаршрутныеЛисты.КонтрагентСсылка.ОсновноеКонтактноеЛицо КАК ОсновноеКонтактноеЛицоКонтрагента,
	|	ВТ_МаршрутныеЛисты.ГрузополучательСсылка.ОсновноеКонтактноеЛицо КАК ОсновноеКонтактноеЛицоГрузополучателя,
	|	ВТ_МаршрутныеЛисты.ГрузоотправительСсылка.ОсновноеКонтактноеЛицо КАК ОсновноеКонтактноеЛицоГрузоотправителя,
	|	ВТ_МаршрутныеЛисты.ПараметрВыработки1 КАК ПараметрВыработки1,
	|	ВТ_МаршрутныеЛисты.ПараметрВыработки2 КАК ПараметрВыработки2,
	|	ВТ_МаршрутныеЛисты.ПараметрВыработки3 КАК ПараметрВыработки3,
	|	ВТ_МаршрутныеЛисты.ПараметрВыработки4 КАК ПараметрВыработки4,
	|	ВТ_МаршрутныеЛисты.ПараметрВыработки5 КАК ПараметрВыработки5,
	|	ВТ_МаршрутныеЛисты.Выработка1 КАК Выработка1,
	|	ВТ_МаршрутныеЛисты.Выработка2 КАК Выработка2,
	|	ВТ_МаршрутныеЛисты.Выработка3 КАК Выработка3,
	|	ВТ_МаршрутныеЛисты.Выработка4 КАК Выработка4,
	|	ВТ_МаршрутныеЛисты.Выработка5 КАК Выработка5,
	|	ВТ_МаршрутныеЛисты.СсылкаMultiGo КАК СсылкаMultiGo,
	|	ВТ_МаршрутныеЛисты.ОтветMultiGo КАК ОтветMultiGo,
	|	ВТ_МаршрутныеЛисты.СлужебныйТипПункта КАК СлужебныйТипПункта,
	|	ВТ_МаршрутныеЛисты.ОценкаСервиса КАК ОценкаСервиса,
	|	ВТ_МаршрутныеЛисты.Подпись КАК Подпись,
	|	ВТ_МаршрутныеЛисты.ЗаказFTL КАК ЗаказFTL
	|ИЗ
	|	ВТ_МаршрутныеЛисты КАК ВТ_МаршрутныеЛисты
	|
	|УПОРЯДОЧИТЬ ПО
	|	МаршрутныйЛистНомер,
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_МаршрутныеЛисты.КонтрагентСсылка КАК Контакт,
	|	""Контрагент"" КАК ТипКонтакта,
	|	3 КАК Приоритет
	|ПОМЕСТИТЬ вт_Контакты
	|ИЗ
	|	ВТ_МаршрутныеЛисты КАК ВТ_МаршрутныеЛисты
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_МаршрутныеЛисты.КонтактноеЛицоЗаказчикаСсылка,
	|	""Контрагент"",
	|	1
	|ИЗ
	|	ВТ_МаршрутныеЛисты КАК ВТ_МаршрутныеЛисты
	|ГДЕ
	|	ВТ_МаршрутныеЛисты.КонтактноеЛицоЗаказчикаСсылка <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_МаршрутныеЛисты.КонтрагентСсылка.ОсновноеКонтактноеЛицо,
	|	""Контрагент"",
	|	2
	|ИЗ
	|	ВТ_МаршрутныеЛисты КАК ВТ_МаршрутныеЛисты
	|ГДЕ
	|	ВТ_МаршрутныеЛисты.КонтрагентСсылка.ОсновноеКонтактноеЛицо <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_МаршрутныеЛисты.КонтактноеЛицоГрузоотправителяСсылка,
	|	""Грузоотправитель"",
	|	1
	|ИЗ
	|	ВТ_МаршрутныеЛисты КАК ВТ_МаршрутныеЛисты
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_МаршрутныеЛисты.КонтактноеЛицоГрузополучателяСсылка,
	|	""Грузополучатель"",
	|	1
	|ИЗ
	|	ВТ_МаршрутныеЛисты КАК ВТ_МаршрутныеЛисты
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_МаршрутныеЛисты.ГрузоотправительСсылка.ОсновноеКонтактноеЛицо,
	|	""Грузоотправитель"",
	|	2
	|ИЗ
	|	ВТ_МаршрутныеЛисты КАК ВТ_МаршрутныеЛисты
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_МаршрутныеЛисты.ГрузополучательСсылка.ОсновноеКонтактноеЛицо,
	|	""Грузополучатель"",
	|	2
	|ИЗ
	|	ВТ_МаршрутныеЛисты КАК ВТ_МаршрутныеЛисты
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_МаршрутныеЛисты.ГрузоотправительСсылка,
	|	""Грузоотправитель"",
	|	3
	|ИЗ
	|	ВТ_МаршрутныеЛисты КАК ВТ_МаршрутныеЛисты
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_МаршрутныеЛисты.ГрузополучательСсылка,
	|	""Грузополучатель"",
	|	3
	|ИЗ
	|	ВТ_МаршрутныеЛисты КАК ВТ_МаршрутныеЛисты
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_МаршрутныеЛисты.ОтветственныйПоЗаказу,
	|	""Ответственный"",
	|	1
	|ИЗ
	|	ВТ_МаршрутныеЛисты КАК ВТ_МаршрутныеЛисты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	вт_Контакты.Контакт КАК Контакт,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(вт_Контакты.Контакт) = ТИП(Справочник.Контрагенты)
	|			ТОГДА ЕСТЬNULL(КонтрагентыПочта.Представление, """")
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТИПЗНАЧЕНИЯ(вт_Контакты.Контакт) = ТИП(Справочник.КонтактныеЛица)
	|					ТОГДА ЕСТЬNULL(КонтактныеЛицаПочта.Представление, """")
	|				ИНАЧЕ ЕСТЬNULL(ПользователиПочта.Представление, """")
	|			КОНЕЦ
	|	КОНЕЦ КАК ПредставлениеКИ,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты) КАК ТипКИ,
	|	вт_Контакты.ТипКонтакта КАК ТипКонтакта,
	|	вт_Контакты.Приоритет КАК Приоритет
	|ПОМЕСТИТЬ вт_Контакты_КИ
	|ИЗ
	|	вт_Контакты КАК вт_Контакты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛица.КонтактнаяИнформация КАК КонтактныеЛицаПочта
	|		ПО вт_Контакты.Контакт = КонтактныеЛицаПочта.Ссылка
	|			И (КонтактныеЛицаПочта.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты))
	|			И (КонтактныеЛицаПочта.Вид = &ВидКонтактнойИнформацииEmailКонтактногоЛица)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиПочта
	|		ПО вт_Контакты.Контакт = ПользователиПочта.Ссылка
	|			И (ПользователиПочта.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты))
	|			И (ПользователиПочта.Вид = &ВидКонтактнойИнформацииEmailОтветственного)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыПочта
	|		ПО вт_Контакты.Контакт = КонтрагентыПочта.Ссылка
	|			И (КонтрагентыПочта.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты))
	|			И (КонтрагентыПочта.Вид = &ВидКонтактнойИнформацииEmailКонтрагента)
	|ГДЕ
	|	вт_Контакты.Контакт <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	И вт_Контакты.Контакт <> ЗНАЧЕНИЕ(Справочник.КонтактныеЛица.ПустаяСсылка)
	|	И вт_Контакты.Контакт <> НЕОПРЕДЕЛЕНО
	|	И вт_Контакты.Контакт <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	вт_Контакты.Контакт,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(вт_Контакты.Контакт) = ТИП(Справочник.Контрагенты)
	|			ТОГДА ЕСТЬNULL(КонтрагентыТелефон.Представление, """")
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТИПЗНАЧЕНИЯ(вт_Контакты.Контакт) = ТИП(Справочник.КонтактныеЛица)
	|					ТОГДА ЕСТЬNULL(КонтактныеЛицаТелефон.Представление, """")
	|				ИНАЧЕ ЕСТЬNULL(ПользователиТелефон.Представление, """")
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон),
	|	вт_Контакты.ТипКонтакта,
	|	вт_Контакты.Приоритет
	|ИЗ
	|	вт_Контакты КАК вт_Контакты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛица.КонтактнаяИнформация КАК КонтактныеЛицаТелефон
	|		ПО вт_Контакты.Контакт = КонтактныеЛицаТелефон.Ссылка
	|			И (КонтактныеЛицаТелефон.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))
	|			И (КонтактныеЛицаТелефон.Вид = &ВидКонтактнойИнформацииТелефонКонтактногоЛица)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиТелефон
	|		ПО вт_Контакты.Контакт = ПользователиТелефон.Ссылка
	|			И (ПользователиТелефон.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))
	|			И (ПользователиТелефон.Вид = &ВидКонтактнойИнформацииТелефонОтветственного)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыТелефон
	|		ПО вт_Контакты.Контакт = КонтрагентыТелефон.Ссылка
	|			И (КонтрагентыТелефон.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))
	|			И (КонтрагентыТелефон.Вид = &ВидКонтактнойИнформацииТелефонКонтрагента)
	|ГДЕ
	|	вт_Контакты.Контакт <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	И вт_Контакты.Контакт <> ЗНАЧЕНИЕ(Справочник.КонтактныеЛица.ПустаяСсылка)
	|	И вт_Контакты.Контакт <> НЕОПРЕДЕЛЕНО
	|	И вт_Контакты.Контакт <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_Контакты_КИ.Контакт КАК Контакт,
	|	вт_Контакты_КИ.ПредставлениеКИ КАК ПредставлениеКИ,
	|	вт_Контакты_КИ.ТипКИ КАК ТипКИ,
	|	вт_Контакты_КИ.ТипКонтакта КАК ТипКонтакта,
	|	вт_Контакты_КИ.Приоритет КАК Приоритет
	|ИЗ
	|	вт_Контакты_КИ КАК вт_Контакты_КИ
	|ГДЕ
	|	вт_Контакты_КИ.ПредставлениеКИ <> """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	уатСопроводительныеДокументы.Ссылка КАК Ссылка,
	|	ВТ_МаршрутныеЛисты.МаршрутныйЛистСсылка КАК МаршрутныйЛистСсылка
	|ПОМЕСТИТЬ втСопроводительныеДокументы
	|ИЗ
	|	Справочник.уатСопроводительныеДокументы КАК уатСопроводительныеДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МаршрутныеЛисты КАК ВТ_МаршрутныеЛисты
	|		ПО (уатСопроводительныеДокументы.Основание = ВТ_МаршрутныеЛисты.МаршрутныйЛистСсылка
	|				ИЛИ уатСопроводительныеДокументы.Основание = ВТ_МаршрутныеЛисты.ЗаказСсылка)
	|ГДЕ
	|	НЕ уатСопроводительныеДокументы.ПометкаУдаления
	|	И уатСопроводительныеДокументы.ИспользоватьВМобильномПриложении
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втСопроводительныеДокументы.Ссылка КАК Ссылка,
	|	втСопроводительныеДокументы.МаршрутныйЛистСсылка КАК Основание,
	|	втСопроводительныеДокументы.Ссылка.ПунктНазначения КАК ПунктНазначения,
	|	втСопроводительныеДокументы.Ссылка.ВидДокумента КАК ВидДокумента,
	|	втСопроводительныеДокументы.Ссылка.ВидДокумента.Наименование КАК ВидДокументаНаименование,
	|	втСопроводительныеДокументы.Ссылка.Наименование КАК Наименование,
	|	втСопроводительныеДокументы.Ссылка.НомерДокумента КАК НомерДокумента,
	|	втСопроводительныеДокументы.Ссылка.ДатаДокумента КАК ДатаДокумента,
	|	втСопроводительныеДокументы.Ссылка.Комментарий КАК Комментарий,
	|	втСопроводительныеДокументы.Ссылка.ДатаОбработкиВодителемВМобильномПриложении КАК ДатаОбработкиВодителемВМобильномПриложении,
	|	втСопроводительныеДокументы.Ссылка.ВладелецДокумента КАК Контрагент,
	|	ВЫБОР
	|		КОГДА втСопроводительныеДокументы.Ссылка.Основание ССЫЛКА Документ.уатЗаказГрузоотправителя
	|			ТОГДА втСопроводительныеДокументы.Ссылка.Основание.Номер
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ЗаказНомер
	|ИЗ
	|	втСопроводительныеДокументы КАК втСопроводительныеДокументы
	|ГДЕ
	|	втСопроводительныеДокументы.Ссылка.Наименование <> """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_МаршрутныеЛисты.МаршрутныйЛистСсылка КАК МаршрутныйЛистСсылка,
	|	ВТ_МаршрутныеЛисты.ЗаказСсылка КАК ЗаказСсылка,
	|	ВТ_МаршрутныеЛисты.КонтрагентСсылка КАК КонтрагентСсылка,
	|	ВТ_МаршрутныеЛисты.КонтактноеЛицоЗаказчикаСсылка КАК КонтактноеЛицоЗаказчикаСсылка,
	|	ВТ_МаршрутныеЛисты.КонтактноеЛицоГрузоотправителяСсылка КАК КонтактноеЛицоГрузоотправителяСсылка,
	|	ВТ_МаршрутныеЛисты.ГрузоотправительСсылка КАК ГрузоотправительСсылка,
	|	ВТ_МаршрутныеЛисты.КонтактноеЛицоГрузополучателяСсылка КАК КонтактноеЛицоГрузополучателяСсылка,
	|	ВТ_МаршрутныеЛисты.ГрузополучательСсылка КАК ГрузополучательСсылка,
	|	ВТ_МаршрутныеЛисты.ОтветственныйПоЗаказу КАК ОтветственныйПоЗаказу,
	|	ВТ_МаршрутныеЛисты.КонтрагентСсылка.ОсновноеКонтактноеЛицо КАК ОсновноеКонтактноеЛицоКонтрагента,
	|	ВТ_МаршрутныеЛисты.ГрузополучательСсылка.ОсновноеКонтактноеЛицо КАК ОсновноеКонтактноеЛицоГрузоотправителя,
	|	ВТ_МаршрутныеЛисты.ГрузоотправительСсылка.ОсновноеКонтактноеЛицо КАК ОсновноеКонтактноеЛицоГрузополучателя
	|ИЗ
	|	ВТ_МаршрутныеЛисты КАК ВТ_МаршрутныеЛисты";
	
	Попытка
		РезультатЗапроса = мЗапрос.ВыполнитьПакет();
		Выборка          = РезультатЗапроса[1].Выбрать();
		ВыборкаКИ        = РезультатЗапроса[4].Выгрузить();
		ВыборкаСД        = РезультатЗапроса[6].Выгрузить();
		ВыборкаКИЗаказ   = РезультатЗапроса[7].Выгрузить();
		
	Исключение
		ЗаписатьСообщениеОбОшибке("GetRouteList", ОписаниеОшибки());
		responseData = "<response/>";
		resultCode   = 60;
		
		Возврат Ложь;
	КонецПопытки;
	
	СоответвиеКИ = ЗаполнитьКИМЛ(ВыборкаКИ, ВыборкаКИЗаказ);
	
	ДеревоЗаказов = Новый ДеревоЗначений;
	ДеревоЗаказов.Колонки.Добавить("МаршрутныйЛистСсылка",                 Новый ОписаниеТипов("ДокументСсылка.уатМаршрутныйЛист"));
	ДеревоЗаказов.Колонки.Добавить("МаршрутныйЛистНомер",                  Новый ОписаниеТипов("Строка"));
	ДеревоЗаказов.Колонки.Добавить("МаршрутныйЛистТС",                     Новый ОписаниеТипов("Строка"));
	ДеревоЗаказов.Колонки.Добавить("МаршрутныйЛистДатаОтправленияПлан",    Новый ОписаниеТипов("Дата"));
	ДеревоЗаказов.Колонки.Добавить("МаршрутныйЛистДатаВыполненияПлан",     Новый ОписаниеТипов("Дата"));
	ДеревоЗаказов.Колонки.Добавить("МаршрутныйЛистКомментарий",            Новый ОписаниеТипов("Строка"));
	ДеревоЗаказов.Колонки.Добавить("ЗаказНомер",                           Новый ОписаниеТипов("Строка"));
	ДеревоЗаказов.Колонки.Добавить("ЗаказFTL",                             Новый ОписаниеТипов("Булево"));
	ДеревоЗаказов.Колонки.Добавить("КонтрагентНаименование",               Новый ОписаниеТипов("Строка"));
	ДеревоЗаказов.Колонки.Добавить("КонтрагентСсылка",                     Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ДеревоЗаказов.Колонки.Добавить("ГрузоотправительСсылка",               Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ДеревоЗаказов.Колонки.Добавить("ГрузополучательСсылка",                Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ДеревоЗаказов.Колонки.Добавить("КонтактноеЛицоЗаказчикаСсылка",        Новый ОписаниеТипов("СправочникСсылка.КонтактныеЛица"));
	ДеревоЗаказов.Колонки.Добавить("КонтактноеЛицоГрузоотправителяСсылка", Новый ОписаниеТипов("СправочникСсылка.КонтактныеЛица"));
	ДеревоЗаказов.Колонки.Добавить("КонтактноеЛицоГрузополучателяСсылка",  Новый ОписаниеТипов("СправочникСсылка.КонтактныеЛица"));
	ДеревоЗаказов.Колонки.Добавить("ТипТочкиМаршрута",                     Новый ОписаниеТипов("ПеречислениеСсылка.уатТипыТочекМаршрута"));
	ДеревоЗаказов.Колонки.Добавить("ПунктНаименование",                    Новый ОписаниеТипов("Строка"));
	ДеревоЗаказов.Колонки.Добавить("ПунктАдрес",                           Новый ОписаниеТипов("Строка"));
	ДеревоЗаказов.Колонки.Добавить("ПунктСсылка",                          Новый ОписаниеТипов("СправочникСсылка.уатПунктыНазначения"));
	ДеревоЗаказов.Колонки.Добавить("ПунктРадиусПоиска",                    Новый ОписаниеТипов("Число"));
	ДеревоЗаказов.Колонки.Добавить("ПунктШирота",                          Новый ОписаниеТипов("Число"));
	ДеревоЗаказов.Колонки.Добавить("ПунктДолгота",                         Новый ОписаниеТипов("Число"));
	ДеревоЗаказов.Колонки.Добавить("ПунктЭтоГараж",                        Новый ОписаниеТипов("Булево"));
	ДеревоЗаказов.Колонки.Добавить("ВремяСтоянки",                         Новый ОписаниеТипов("Число"));
	ДеревоЗаказов.Колонки.Добавить("ПрибытиеПлан",                         Новый ОписаниеТипов("Дата"));
	ДеревоЗаказов.Колонки.Добавить("ПрибытиеФакт",                         Новый ОписаниеТипов("Дата"));
	ДеревоЗаказов.Колонки.Добавить("УбытиеПлан",                           Новый ОписаниеТипов("Дата"));
	ДеревоЗаказов.Колонки.Добавить("УбытиеФакт",                           Новый ОписаниеТипов("Дата"));
	ДеревоЗаказов.Колонки.Добавить("ГУИДСтроки",                           Новый ОписаниеТипов("Строка"));
	ДеревоЗаказов.Колонки.Добавить("НомерСтроки",                          Новый ОписаниеТипов("Число"));
	ДеревоЗаказов.Колонки.Добавить("Номенклатура",                         Новый ОписаниеТипов("Строка"));
	ДеревоЗаказов.Колонки.Добавить("ЕдиницаИзмерения",                     Новый ОписаниеТипов("Строка"));
	ДеревоЗаказов.Колонки.Добавить("Количество",                           Новый ОписаниеТипов("Число"));
	ДеревоЗаказов.Колонки.Добавить("КоличествоМест",                       Новый ОписаниеТипов("Число"));
	ДеревоЗаказов.Колонки.Добавить("ВесБрутто",                            Новый ОписаниеТипов("Число"));
	ДеревоЗаказов.Колонки.Добавить("Объем",                                Новый ОписаниеТипов("Число"));
	ДеревоЗаказов.Колонки.Добавить("Выполнен",                             Новый ОписаниеТипов("Булево"));
	ДеревоЗаказов.Колонки.Добавить("ТелефонКонтрагента",                   Новый ОписаниеТипов("Строка"));
	ДеревоЗаказов.Колонки.Добавить("ПочтаКонтрагента",                     Новый ОписаниеТипов("Строка"));
	ДеревоЗаказов.Колонки.Добавить("ТелефонГрузоотправителя",              Новый ОписаниеТипов("Строка"));
	ДеревоЗаказов.Колонки.Добавить("ПочтаГрузоотправителя",                Новый ОписаниеТипов("Строка"));
	ДеревоЗаказов.Колонки.Добавить("ТелефонГрузополучателя",               Новый ОписаниеТипов("Строка"));
	ДеревоЗаказов.Колонки.Добавить("ПочтаГрузополучателя",                 Новый ОписаниеТипов("Строка"));
	ДеревоЗаказов.Колонки.Добавить("ОтветственныйПоЗаказу",                Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	ДеревоЗаказов.Колонки.Добавить("ТелефонОтветственного",                Новый ОписаниеТипов("Строка"));
	ДеревоЗаказов.Колонки.Добавить("ПочтаОтветственного",                  Новый ОписаниеТипов("Строка"));
	ДеревоЗаказов.Колонки.Добавить("КомментарийПоЗаказу",                  Новый ОписаниеТипов("Строка"));
	ДеревоЗаказов.Колонки.Добавить("ПринятВодителем",                      Новый ОписаниеТипов("ПеречислениеСсылка.уатСтатусыПринятияМЛВодителем"));
	ДеревоЗаказов.Колонки.Добавить("СоздаватьСкладскойАкт",                Новый ОписаниеТипов("Число"));
	ДеревоЗаказов.Колонки.Добавить("ЗаказСсылка",                          Новый ОписаниеТипов("ДокументСсылка.уатЗаказГрузоотправителя"));
	ДеревоЗаказов.Колонки.Добавить("ПараметрВыработки1",                   Новый ОписаниеТипов("СправочникСсылка.уатПараметрыВыработки"));
	ДеревоЗаказов.Колонки.Добавить("ПараметрВыработки2",                   Новый ОписаниеТипов("СправочникСсылка.уатПараметрыВыработки"));
	ДеревоЗаказов.Колонки.Добавить("ПараметрВыработки3",                   Новый ОписаниеТипов("СправочникСсылка.уатПараметрыВыработки"));
	ДеревоЗаказов.Колонки.Добавить("ПараметрВыработки4",                   Новый ОписаниеТипов("СправочникСсылка.уатПараметрыВыработки"));
	ДеревоЗаказов.Колонки.Добавить("ПараметрВыработки5",                   Новый ОписаниеТипов("СправочникСсылка.уатПараметрыВыработки"));
	ДеревоЗаказов.Колонки.Добавить("Выработка1",                           Новый ОписаниеТипов("Число"));
	ДеревоЗаказов.Колонки.Добавить("Выработка2",                           Новый ОписаниеТипов("Число"));
	ДеревоЗаказов.Колонки.Добавить("Выработка3",                           Новый ОписаниеТипов("Число"));
	ДеревоЗаказов.Колонки.Добавить("Выработка4",                           Новый ОписаниеТипов("Число"));
	ДеревоЗаказов.Колонки.Добавить("Выработка5",                           Новый ОписаниеТипов("Число"));
	ДеревоЗаказов.Колонки.Добавить("СсылкаMultiGo",                        Новый ОписаниеТипов("Строка"));
	ДеревоЗаказов.Колонки.Добавить("ОтветMultiGo",                         Новый ОписаниеТипов("Строка"));
	ДеревоЗаказов.Колонки.Добавить("СлужебныйТипПункта",                   Новый ОписаниеТипов("Булево"));
	ДеревоЗаказов.Колонки.Добавить("ОценкаСервиса",                        Новый ОписаниеТипов("Число"));
	ДеревоЗаказов.Колонки.Добавить("Подпись",                              Новый ОписаниеТипов("Строка"));
	ДеревоЗаказов.Колонки.Добавить("КонтрагентКИ");
	ДеревоЗаказов.Колонки.Добавить("ГрузоотправительКИ");
	ДеревоЗаказов.Колонки.Добавить("ГрузополучательКИ");
	ДеревоЗаказов.Колонки.Добавить("СопроводительныеДокументы");
	
	ТабПлановогоВремени = Новый ТаблицаЗначений;
	ТабПлановогоВремени.Колонки.Добавить("МаршрутныйЛист",    Новый ОписаниеТипов("ДокументСсылка.уатМаршрутныйЛист"));
	ТабПлановогоВремени.Колонки.Добавить("ТипТочкиМаршрута",  Новый ОписаниеТипов("ПеречислениеСсылка.уатТипыТочекМаршрута"));
	ТабПлановогоВремени.Колонки.Добавить("ПунктНаименование", Новый ОписаниеТипов("Строка"));
	ТабПлановогоВремени.Колонки.Добавить("ПунктАдрес",        Новый ОписаниеТипов("Строка"));
	ТабПлановогоВремени.Колонки.Добавить("ПунктСсылка",       Новый ОписаниеТипов("СправочникСсылка.уатПунктыНазначения"));
	ТабПлановогоВремени.Колонки.Добавить("ЗаказНомер",        Новый ОписаниеТипов("Строка"));
	ТабПлановогоВремени.Колонки.Добавить("ЗаказСсылка",       Новый ОписаниеТипов("ДокументСсылка.уатЗаказГрузоотправителя"));
	ТабПлановогоВремени.Колонки.Добавить("ВремяСтоянкиСек",   Новый ОписаниеТипов("Число"));
	
	МассивУдаляемыхМЛ = Новый Массив();
	Пока Выборка.Следующий() Цикл 
		Если Выборка.НомерСтроки = 1
			И (Выборка.ПрибытиеПлан < ДатаОт
			ИЛИ Выборка.ПрибытиеПлан > ДатаПо) 
			ИЛИ Выборка.ПринятВодителем = Перечисления.уатСтатусыПринятияМЛВодителем.Отклонен Тогда
			МассивУдаляемыхМЛ.Добавить(Выборка.МаршрутныйЛистСсылка);
		КонецЕсли;
		стрОтборСтрок = Новый Структура("МаршрутныйЛист, ТипТочкиМаршрута, ПунктНаименование, ПунктАдрес, ЗаказНомер",
				Выборка.МаршрутныйЛистСсылка, 
				Выборка.ТипТочкиМаршрута, 
				Выборка.ПунктНаименование,
				Выборка.ПунктАдрес,
				Выборка.ЗаказНомер);
		НайдСтроки = ТабПлановогоВремени.НайтиСтроки(стрОтборСтрок);
		Если НайдСтроки.Количество() = 0 Тогда 
			РедСтр = ТабПлановогоВремени.Добавить();
			РедСтр.МаршрутныйЛист    = Выборка.МаршрутныйЛистСсылка;
			РедСтр.ТипТочкиМаршрута  = Выборка.ТипТочкиМаршрута;
			РедСтр.ПунктНаименование = Выборка.ПунктНаименование;
			РедСтр.ПунктАдрес        = Выборка.ПунктАдрес;
			РедСтр.ЗаказНомер        = Выборка.ЗаказНомер;
			РедСтр.ЗаказСсылка       = Выборка.ЗаказСсылка;
			РедСтр.ВремяСтоянкиСек   = ((Выборка.ВремяСтоянки - Цел(Выборка.ВремяСтоянки))*6000 + Цел(Выборка.ВремяСтоянки)*3600);
		Иначе 
			РедСтр = НайдСтроки.Получить(0);
			Если РедСтр.ЗаказНомер = Выборка.ЗаказНомер Тогда 
				Продолжить;
			КонецЕсли;
			РедСтр.ВремяСтоянкиСек = РедСтр.ВремяСтоянкиСек + ((Выборка.ВремяСтоянки - Цел(Выборка.ВремяСтоянки))*6000 + Цел(Выборка.ВремяСтоянки)*3600);
		КонецЕсли;
	КонецЦикла;
	
	ТабПлановогоВремени.Колонки.Удалить("ЗаказНомер");
	ТабПлановогоВремени.Свернуть("МаршрутныйЛист, ТипТочкиМаршрута, ПунктНаименование, ПунктАдрес", "ВремяСтоянкиСек");
	
	Выборка.Сбросить();
	
	Пока Выборка.Следующий() Цикл 
		СтрокаМЛ = ДеревоЗаказов.Строки.Найти(Выборка.МаршрутныйЛистСсылка, "МаршрутныйЛистСсылка", Ложь);
		Если СтрокаМЛ = Неопределено Тогда 
			Если МассивУдаляемыхМЛ.Найти(Выборка.МаршрутныйЛистСсылка) <> Неопределено Тогда
				Продолжить;
			КОнецЕсли;
			СтрокаМЛ = ДеревоЗаказов.Строки.Добавить();
			СтрокаМЛ.МаршрутныйЛистСсылка              = Выборка.МаршрутныйЛистСсылка;
			СтрокаМЛ.МаршрутныйЛистНомер               = Выборка.МаршрутныйЛистНомер;
			СтрокаМЛ.МаршрутныйЛистТС                  = Выборка.МаршрутныйЛистТС;
			СтрокаМЛ.МаршрутныйЛистДатаОтправленияПлан = Выборка.МаршрутныйЛистДатаОтправленияПлан;
			СтрокаМЛ.МаршрутныйЛистДатаВыполненияПлан  = Выборка.МаршрутныйЛистДатаВыполненияПлан;
			СтрокаМЛ.МаршрутныйЛистКомментарий         = Выборка.МаршрутныйЛистКомментарий;
			СтрокаМЛ.ПринятВодителем                   = Выборка.ПринятВодителем;
			СтрокаМЛ.СсылкаMultiGo                     = Выборка.СсылкаMultiGo;
			
			МассивСД = Новый Массив();
			СтрокиСД = ВыборкаСД.НайтиСтроки(Новый Структура("Основание", Выборка.МаршрутныйЛистСсылка)); 
			Для Каждого ТекСтрока Из СтрокиСД Цикл
				СтруктураСД = Новый Структура("Ссылка,Наименование,ПунктНазначения,ВидДокумента,ВидДокументаНаименование,НомерДокумента,
				|ДатаДокумента,Комментарий,ДатаОбработкиВодителемВМобильномПриложении,Контрагент,ЗаказНомер");
				ЗаполнитьЗначенияСвойств(СтруктураСД, ТекСтрока);
				МассивСД.Добавить(СтруктураСД);
			КонецЦикла;
			СтрокаМЛ.СопроводительныеДокументы = МассивСД;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.УбытиеПлан) Тогда
			УбытиеПлан = Выборка.УбытиеПлан;
		Иначе
			стрОтборСтрок = Новый Структура("МаршрутныйЛист, ТипТочкиМаршрута, ПунктНаименование, ПунктАдрес",
			Выборка.МаршрутныйЛистСсылка, 
			Выборка.ТипТочкиМаршрута, 
			Выборка.ПунктНаименование,
			Выборка.ПунктАдрес);
			
			НайдСтр = ТабПлановогоВремени.НайтиСтроки(стрОтборСтрок);
			
			Если ТипЗнч(Выборка.ПунктСсылка) = Тип("СправочникСсылка.уатПунктыНазначения") Тогда
				СтоянкаДоп = Выборка.СтоянкаИзПункта;
				СтоянкаДоп = ((СтоянкаДоп - Цел(СтоянкаДоп))*6000 + Цел(СтоянкаДоп)*3600);
			Иначе
				СтоянкаДоп = 0;
			КонецЕсли;
			
			Если НайдСтр.Количество() Тогда 
				УбытиеПлан = Выборка.ПрибытиеПлан + НайдСтр[0].ВремяСтоянкиСек + СтоянкаДоп;
			Иначе 
				УбытиеПлан = Выборка.ПрибытиеПлан + СтоянкаДоп;
			КонецЕсли;
		КонецЕсли;
		
		стрПараметрыОтбора = Новый Структура();
		стрПараметрыОтбора.Вставить("МаршрутныйЛистСсылка",                 Выборка.МаршрутныйЛистСсылка); 
		стрПараметрыОтбора.Вставить("ЗаказНомер",                           Выборка.ЗаказНомер);
		стрПараметрыОтбора.Вставить("КонтрагентНаименование",               Выборка.КонтрагентНаименование);
		стрПараметрыОтбора.Вставить("КонтрагентСсылка",                     Выборка.КонтрагентСсылка);
		стрПараметрыОтбора.Вставить("ГрузоотправительСсылка",               Выборка.ГрузоотправительСсылка);
		стрПараметрыОтбора.Вставить("ГрузополучательСсылка",                Выборка.ГрузополучательСсылка); 
		стрПараметрыОтбора.Вставить("КонтактноеЛицоЗаказчикаСсылка",        Выборка.КонтактноеЛицоЗаказчикаСсылка);
		стрПараметрыОтбора.Вставить("КонтактноеЛицоГрузоотправителяСсылка", Выборка.КонтактноеЛицоГрузоотправителяСсылка);
		стрПараметрыОтбора.Вставить("КонтактноеЛицоГрузополучателяСсылка",  Выборка.КонтактноеЛицоГрузополучателяСсылка);
		стрПараметрыОтбора.Вставить("ТипТочкиМаршрута",                     Выборка.ТипТочкиМаршрута); 
		стрПараметрыОтбора.Вставить("ПунктНаименование",                    Выборка.ПунктНаименование); 
		стрПараметрыОтбора.Вставить("ПунктАдрес",                           Выборка.ПунктАдрес);
		стрПараметрыОтбора.Вставить("ВремяСтоянки",                         Выборка.ВремяСтоянки); 
		стрПараметрыОтбора.Вставить("ПрибытиеПлан",                         Выборка.ПрибытиеПлан); 
		стрПараметрыОтбора.Вставить("ПрибытиеФакт",                         Выборка.ПрибытиеФакт); 
		стрПараметрыОтбора.Вставить("УбытиеПлан",                           УбытиеПлан);
		стрПараметрыОтбора.Вставить("УбытиеФакт",                           Выборка.УбытиеФакт);
		
		СтрокиЗаказа = СтрокаМЛ.Строки.НайтиСтроки(стрПараметрыОтбора, Ложь);
		
		Если СтрокиЗаказа.Количество() = 0 Тогда 
			СоответвиеЗаказ = СоответвиеКИ.Получить(Выборка.МаршрутныйЛистСсылка);
			Если СоответвиеЗаказ <> Неопределено Тогда
				СтруктураКИ = СоответвиеЗаказ.Получить(Выборка.ЗаказСсылка);
				Если СтруктураКИ = Неопределено Тогда 
					СтруктураКИ = Новый Структура();
					СтруктураКИ.Вставить("ТелефонКонтрагента",     "");
					СтруктураКИ.Вставить("ПочтаКонтрагента",       "");
					СтруктураКИ.Вставить("ТелефонГрузоотправителя","");
					СтруктураКИ.Вставить("ПочтаГрузоотправителя",  "");
					СтруктураКИ.Вставить("ТелефонГрузополучателя", "");
					СтруктураКИ.Вставить("ПочтаГрузополучателя",   "");
					СтруктураКИ.Вставить("ТелефонОтветственного",  "");
					СтруктураКИ.Вставить("ПочтаОтветственного",    "");
					СтруктураКИ.Вставить("КонтрагентКИ",           "");
					СтруктураКИ.Вставить("ГрузоотправительКИ",     "");
					СтруктураКИ.Вставить("ГрузополучательКИ",      "");
				КонецЕсли;
			Иначе
				СтруктураКИ = Новый Структура();
				СтруктураКИ.Вставить("ТелефонКонтрагента",     "");
				СтруктураКИ.Вставить("ПочтаКонтрагента",       "");
				СтруктураКИ.Вставить("ТелефонГрузоотправителя","");
				СтруктураКИ.Вставить("ПочтаГрузоотправителя",  "");
				СтруктураКИ.Вставить("ТелефонГрузополучателя", "");
				СтруктураКИ.Вставить("ПочтаГрузополучателя",   "");
				СтруктураКИ.Вставить("ТелефонОтветственного",  "");
				СтруктураКИ.Вставить("ПочтаОтветственного",    "");
				СтруктураКИ.Вставить("КонтрагентКИ",           "");
				СтруктураКИ.Вставить("ГрузоотправительКИ",     "");
				СтруктураКИ.Вставить("ГрузополучательКИ",      "");
			КонецЕсли;
			
			СтрокаЗаказа = СтрокаМЛ.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаЗаказа, Выборка);
			
			СтрокаЗаказа.МаршрутныйЛистСсылка                 = Выборка.МаршрутныйЛистСсылка;
			СтрокаЗаказа.МаршрутныйЛистНомер                  = Выборка.МаршрутныйЛистНомер;
			СтрокаЗаказа.МаршрутныйЛистТС                     = Выборка.МаршрутныйЛистТС;
			СтрокаЗаказа.МаршрутныйЛистДатаОтправленияПлан    = Выборка.МаршрутныйЛистДатаОтправленияПлан;
			СтрокаЗаказа.МаршрутныйЛистДатаВыполненияПлан     = Выборка.МаршрутныйЛистДатаВыполненияПлан;
			СтрокаЗаказа.МаршрутныйЛистКомментарий            = Выборка.МаршрутныйЛистКомментарий;
			СтрокаЗаказа.ЗаказНомер                           = Выборка.ЗаказНомер;
			СтрокаЗаказа.ЗаказFTL                             = Выборка.ЗаказFTL;
			СтрокаЗаказа.ЗаказСсылка                          = Выборка.ЗаказСсылка;
			СтрокаЗаказа.КонтрагентНаименование               = Выборка.КонтрагентНаименование; 
			СтрокаЗаказа.КонтрагентСсылка                     = Выборка.КонтрагентСсылка;
			СтрокаЗаказа.ГрузоотправительСсылка               = Выборка.ГрузоотправительСсылка;
			СтрокаЗаказа.ГрузополучательСсылка                = Выборка.ГрузополучательСсылка;
			СтрокаЗаказа.КонтактноеЛицоЗаказчикаСсылка        = Выборка.КонтактноеЛицоЗаказчикаСсылка;
			СтрокаЗаказа.КонтактноеЛицоГрузоотправителяСсылка = Выборка.КонтактноеЛицоГрузоотправителяСсылка;
			СтрокаЗаказа.КонтактноеЛицоГрузополучателяСсылка  = Выборка.КонтактноеЛицоГрузополучателяСсылка;
			СтрокаЗаказа.ТипТочкиМаршрута                     = Выборка.ТипТочкиМаршрута; 
			СтрокаЗаказа.ПунктНаименование                    = Выборка.ПунктНаименование; 
			СтрокаЗаказа.ПунктАдрес                           = Выборка.ПунктАдрес;
			СтрокаЗаказа.ПунктСсылка                          = Выборка.ПунктСсылка;
			СтрокаЗаказа.ПунктШирота                          = Выборка.ПунктШирота;
			СтрокаЗаказа.ПунктРадиусПоиска                    = Выборка.ПунктРадиусПоиска;
			СтрокаЗаказа.ПунктДолгота                         = Выборка.ПунктДолгота;
			СтрокаЗаказа.ПунктЭтоГараж                        = Выборка.ПунктЭтоГараж;
			СтрокаЗаказа.ВремяСтоянки                         = Выборка.ВремяСтоянки; 
			СтрокаЗаказа.ПрибытиеПлан                         = Выборка.ПрибытиеПлан; 
			СтрокаЗаказа.ПрибытиеФакт                         = Выборка.ПрибытиеФакт; 
			СтрокаЗаказа.УбытиеПлан                           = УбытиеПлан;
			СтрокаЗаказа.УбытиеФакт                           = Выборка.УбытиеФакт;
			СтрокаЗаказа.ОтветственныйПоЗаказу                = Выборка.ОтветственныйПоЗаказу;
			СтрокаЗаказа.КомментарийПоЗаказу                  = Выборка.КомментарийПоЗаказу;
			Если ИспользоватьСкладскиеАкты 
				И Выборка.ТипТочкиМаршрута = Перечисления.уатТипыТочекМаршрута.Погрузка 
				И Выборка.ОтгрузкаВРейсВПункте
				И стрНастроек.СоздаватьАктОтгрузкиВРейсПриПогрузке Тогда
				СтрокаЗаказа.СоздаватьСкладскойАкт = 1;
			ИначеЕсли ИспользоватьСкладскиеАкты 
				И Выборка.ТипТочкиМаршрута = Перечисления.уатТипыТочекМаршрута.Разгрузка 
				И Выборка.ПриемкаИзРейсаВПункте
				И стрНастроек.СоздаватьАктПриемкиИзРейсаПриРазгрузке Тогда
				СтрокаЗаказа.СоздаватьСкладскойАкт = 1;
			Иначе
				СтрокаЗаказа.СоздаватьСкладскойАкт = 0;
			КонецЕсли;
			
			СтрокаЗаказа.ТелефонКонтрагента                   = СтруктураКИ.ТелефонКонтрагента;
			СтрокаЗаказа.ПочтаКонтрагента                     = СтруктураКИ.ПочтаКонтрагента;
			СтрокаЗаказа.ТелефонГрузоотправителя              = СтруктураКИ.ТелефонГрузоотправителя;
			СтрокаЗаказа.ПочтаГрузоотправителя                = СтруктураКИ.ПочтаГрузоотправителя;
			СтрокаЗаказа.ТелефонГрузополучателя               = СтруктураКИ.ТелефонГрузополучателя;
			СтрокаЗаказа.ПочтаГрузополучателя                 = СтруктураКИ.ПочтаГрузополучателя;
			СтрокаЗаказа.ТелефонОтветственного                = СтруктураКИ.ТелефонОтветственного;
			СтрокаЗаказа.ПочтаОтветственного                  = СтруктураКИ.ПочтаОтветственного;
			СтрокаЗаказа.КонтрагентКИ                         = СтруктураКИ.КонтрагентКИ;
			СтрокаЗаказа.ГрузоотправительКИ                   = СтруктураКИ.ГрузоотправительКИ;
			СтрокаЗаказа.ГрузополучательКИ                    = СтруктураКИ.ГрузополучательКИ;
			СтрокаЗаказа.КонтрагентКИ                         = СтруктураКИ.КонтрагентКИ;
			
		Иначе 
			СтрокаЗаказа = СтрокиЗаказа.Получить(0);
		КонецЕсли;
		
		СтрокаНоменклатуры = СтрокаЗаказа.Строки.Найти(Строка(Выборка.ГУИДСтроки), "ГУИДСтроки", Ложь);
		Если СтрокаНоменклатуры = Неопределено Тогда 
			СтрокаНоменклатуры = СтрокаЗаказа.Строки.Добавить();
			СтрокаНоменклатуры.МаршрутныйЛистСсылка                 = Выборка.МаршрутныйЛистСсылка;
			СтрокаНоменклатуры.МаршрутныйЛистНомер                  = Выборка.МаршрутныйЛистНомер;
			СтрокаНоменклатуры.МаршрутныйЛистТС                     = Выборка.МаршрутныйЛистТС;
			СтрокаНоменклатуры.МаршрутныйЛистДатаОтправленияПлан    = Выборка.МаршрутныйЛистДатаОтправленияПлан;
			СтрокаНоменклатуры.МаршрутныйЛистДатаВыполненияПлан     = Выборка.МаршрутныйЛистДатаВыполненияПлан;
			СтрокаНоменклатуры.МаршрутныйЛистКомментарий            = Выборка.МаршрутныйЛистКомментарий;
			СтрокаНоменклатуры.ЗаказНомер                           = Выборка.ЗаказНомер;
			СтрокаНоменклатуры.ЗаказFTL                             = Выборка.ЗаказFTL;
			СтрокаНоменклатуры.ЗаказСсылка                          = Выборка.ЗаказСсылка; 
			СтрокаНоменклатуры.КонтрагентНаименование               = Выборка.КонтрагентНаименование; 
			СтрокаНоменклатуры.КонтрагентСсылка                     = Выборка.КонтрагентСсылка;
			СтрокаНоменклатуры.ГрузоотправительСсылка               = Выборка.ГрузоотправительСсылка;
			СтрокаНоменклатуры.ГрузополучательСсылка                = Выборка.ГрузополучательСсылка;
			СтрокаНоменклатуры.КонтактноеЛицоЗаказчикаСсылка        = Выборка.КонтактноеЛицоЗаказчикаСсылка;
			СтрокаНоменклатуры.КонтактноеЛицоГрузоотправителяСсылка = Выборка.КонтактноеЛицоГрузоотправителяСсылка;
			СтрокаНоменклатуры.КонтактноеЛицоГрузополучателяСсылка  = Выборка.КонтактноеЛицоГрузополучателяСсылка;
			СтрокаНоменклатуры.ТипТочкиМаршрута                     = Выборка.ТипТочкиМаршрута; 
			СтрокаНоменклатуры.ПунктНаименование                    = Выборка.ПунктНаименование; 
			СтрокаНоменклатуры.ПунктАдрес                           = Выборка.ПунктАдрес;
			СтрокаНоменклатуры.ПунктСсылка                          = Выборка.ПунктСсылка;
			СтрокаНоменклатуры.ПунктШирота                          = Выборка.ПунктШирота;
			СтрокаНоменклатуры.ПунктРадиусПоиска                    = Выборка.ПунктРадиусПоиска;
			СтрокаНоменклатуры.ПунктДолгота                         = Выборка.ПунктДолгота;
			СтрокаНоменклатуры.ПунктЭтоГараж                        = Выборка.ПунктЭтоГараж;
			СтрокаНоменклатуры.ВремяСтоянки                         = Выборка.ВремяСтоянки; 
			СтрокаНоменклатуры.ПрибытиеПлан                         = Выборка.ПрибытиеПлан; 
			СтрокаНоменклатуры.ПрибытиеФакт                         = Выборка.ПрибытиеФакт; 
			СтрокаНоменклатуры.УбытиеПлан                           = УбытиеПлан;
			СтрокаНоменклатуры.УбытиеФакт                           = Выборка.УбытиеФакт;
			СтрокаНоменклатуры.ОтветственныйПоЗаказу                = Выборка.ОтветственныйПоЗаказу;
			СтрокаНоменклатуры.КомментарийПоЗаказу                  = Выборка.КомментарийПоЗаказу;

			Если ИспользоватьСкладскиеАкты 
				И Выборка.ТипТочкиМаршрута = Перечисления.уатТипыТочекМаршрута.Погрузка 
				И Выборка.ОтгрузкаВРейсВПункте
				И стрНастроек.СоздаватьАктОтгрузкиВРейсПриПогрузке Тогда
				СтрокаНоменклатуры.СоздаватьСкладскойАкт = 1;
			ИначеЕсли ИспользоватьСкладскиеАкты 
				И Выборка.ТипТочкиМаршрута = Перечисления.уатТипыТочекМаршрута.Разгрузка 
				И Выборка.ПриемкаИзРейсаВПункте
				И стрНастроек.СоздаватьАктПриемкиИзРейсаПриРазгрузке Тогда
				СтрокаНоменклатуры.СоздаватьСкладскойАкт = 1;
			Иначе
				СтрокаНоменклатуры.СоздаватьСкладскойАкт = 0;
			КонецЕсли;
			СтрокаНоменклатуры.ГУИДСтроки                           = Строка(Выборка.ГУИДСтроки);
			СтрокаНоменклатуры.НомерСтроки                          = Выборка.НомерСтроки;
			СтрокаНоменклатуры.Номенклатура                         = Выборка.Номенклатура;
			СтрокаНоменклатуры.ЕдиницаИзмерения                     = Выборка.ЕдиницаИзмерения;
			СтрокаНоменклатуры.Количество                           = Выборка.Количество;
			СтрокаНоменклатуры.КоличествоМест                       = Выборка.КоличествоМест;
			СтрокаНоменклатуры.ВесБрутто                            = Выборка.ВесБрутто;
			СтрокаНоменклатуры.Объем                                = Выборка.Объем;
			СтрокаНоменклатуры.Выполнен                             = Выборка.Выполнен; 
			
			СтрокаНоменклатуры.ТелефонКонтрагента                   = СтруктураКИ.ТелефонКонтрагента;
			СтрокаНоменклатуры.ПочтаКонтрагента                     = СтруктураКИ.ПочтаКонтрагента;
			СтрокаНоменклатуры.ТелефонГрузоотправителя              = СтруктураКИ.ТелефонГрузоотправителя;
			СтрокаНоменклатуры.ПочтаГрузоотправителя                = СтруктураКИ.ПочтаГрузоотправителя;
			СтрокаНоменклатуры.ТелефонГрузополучателя               = СтруктураКИ.ТелефонГрузополучателя;
			СтрокаНоменклатуры.ПочтаГрузополучателя                 = СтруктураКИ.ПочтаГрузополучателя;
			СтрокаНоменклатуры.ТелефонОтветственного                = СтруктураКИ.ТелефонОтветственного;
			СтрокаНоменклатуры.ПочтаОтветственного                  = СтруктураКИ.ПочтаОтветственного;
			СтрокаНоменклатуры.КонтрагентКИ                         = СтруктураКИ.КонтрагентКИ;
			СтрокаНоменклатуры.ГрузоотправительКИ                   = СтруктураКИ.ГрузоотправительКИ;
			СтрокаНоменклатуры.ГрузополучательКИ                    = СтруктураКИ.ГрузополучательКИ;
			СтрокаНоменклатуры.КонтрагентКИ                         = СтруктураКИ.КонтрагентКИ;
		КонецЕсли;
	КонецЦикла;
	
	responseData = СериализоватьRouteList(ДеревоЗаказов, СпособРеализацииВебСервиса);
	
	Если НЕ СпособРеализацииВебСервиса = Перечисления.уатСпособыРеализацииВебСервиса.REST Тогда
		УстановитьПризнакОтправлено(ДанныеАвторизации.ФизическоеЛицо, ДанныеАвторизации.ТС, Истина); 
	КонецЕсли;
	resultCode = 0;
	
	Возврат Истина;
	
КонецФункции // ОбработатьМетодGetRouteList()

Функция ЗаполнитьКИМЛ(тчКонтакты, тчКИЗаказ)
	
	Результат = Новый Соответствие();
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("тчКонтакты", тчКонтакты);
	Запрос.УстановитьПараметр("тчКИЗаказ",  тчКИЗаказ);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонтактнаяИнформациЗаказ.МаршрутныйЛистСсылка КАК МаршрутныйЛистСсылка,
	               |	КонтактнаяИнформациЗаказ.ЗаказСсылка КАК ЗаказСсылка,
	               |	КонтактнаяИнформациЗаказ.КонтрагентСсылка КАК КонтрагентСсылка,
	               |	КонтактнаяИнформациЗаказ.КонтактноеЛицоЗаказчикаСсылка КАК КонтактноеЛицоЗаказчикаСсылка,
	               |	КонтактнаяИнформациЗаказ.КонтактноеЛицоГрузоотправителяСсылка КАК КонтактноеЛицоГрузоотправителяСсылка,
	               |	КонтактнаяИнформациЗаказ.ГрузоотправительСсылка КАК ГрузоотправительСсылка,
	               |	КонтактнаяИнформациЗаказ.КонтактноеЛицоГрузополучателяСсылка КАК КонтактноеЛицоГрузополучателяСсылка,
	               |	КонтактнаяИнформациЗаказ.ГрузополучательСсылка КАК ГрузополучательСсылка,
	               |	КонтактнаяИнформациЗаказ.ОтветственныйПоЗаказу КАК ОтветственныйПоЗаказу,
	               |	КонтактнаяИнформациЗаказ.ОсновноеКонтактноеЛицоКонтрагента КАК ОсновноеКонтактноеЛицоКонтрагента,
	               |	КонтактнаяИнформациЗаказ.ОсновноеКонтактноеЛицоГрузоотправителя КАК ОсновноеКонтактноеЛицоГрузоотправителя,
	               |	КонтактнаяИнформациЗаказ.ОсновноеКонтактноеЛицоГрузополучателя КАК ОсновноеКонтактноеЛицоГрузополучателя
	               |ПОМЕСТИТЬ втКонтактнаяИнформациЗаказ
	               |ИЗ
	               |	&тчКИЗаказ КАК КонтактнаяИнформациЗаказ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	КонтактнаяИнформаци.Контакт КАК Контакт,
	               |	КонтактнаяИнформаци.ПредставлениеКИ КАК ПредставлениеКИ,
	               |	КонтактнаяИнформаци.ТипКИ КАК ТипКИ,
	               |	КонтактнаяИнформаци.ТипКонтакта КАК ТипКонтакта,
	               |	КонтактнаяИнформаци.Приоритет КАК Приоритет
	               |ПОМЕСТИТЬ втКИ
	               |ИЗ
	               |	&тчКонтакты КАК КонтактнаяИнформаци
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	втКонтактнаяИнформациЗаказ.МаршрутныйЛистСсылка КАК МаршрутныйЛистСсылка,
	               |	втКонтактнаяИнформациЗаказ.ЗаказСсылка КАК ЗаказСсылка,
	               |	КонтактнаяИнформаци.Контакт КАК Контакт,
	               |	КонтактнаяИнформаци.ПредставлениеКИ КАК ПредставлениеКИ,
	               |	КонтактнаяИнформаци.ТипКИ КАК ТипКИ,
	               |	КонтактнаяИнформаци.ТипКонтакта КАК ТипКонтакта,
	               |	КонтактнаяИнформаци.Приоритет КАК Приоритет
	               |ПОМЕСТИТЬ втКонтактнаяИнформаци
	               |ИЗ
	               |	втКИ КАК КонтактнаяИнформаци
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКонтактнаяИнформациЗаказ КАК втКонтактнаяИнформациЗаказ
	               |		ПО (КонтактнаяИнформаци.ТипКонтакта = ""Контрагент""
	               |					И (КонтактнаяИнформаци.Контакт = втКонтактнаяИнформациЗаказ.КонтактноеЛицоЗаказчикаСсылка
	               |						ИЛИ КонтактнаяИнформаци.Контакт = втКонтактнаяИнформациЗаказ.КонтрагентСсылка
	               |						ИЛИ КонтактнаяИнформаци.Контакт = втКонтактнаяИнформациЗаказ.ОсновноеКонтактноеЛицоКонтрагента)
	               |				ИЛИ КонтактнаяИнформаци.ТипКонтакта = ""Грузоотправитель""
	               |					И (КонтактнаяИнформаци.Контакт = втКонтактнаяИнформациЗаказ.КонтактноеЛицоГрузоотправителяСсылка
	               |						ИЛИ КонтактнаяИнформаци.Контакт = втКонтактнаяИнформациЗаказ.ГрузоотправительСсылка
	               |						ИЛИ КонтактнаяИнформаци.Контакт = втКонтактнаяИнформациЗаказ.ОсновноеКонтактноеЛицоГрузоотправителя)
	               |				ИЛИ КонтактнаяИнформаци.ТипКонтакта = ""Грузополучатель""
	               |					И (КонтактнаяИнформаци.Контакт = втКонтактнаяИнформациЗаказ.КонтактноеЛицоГрузополучателяСсылка
	               |						ИЛИ КонтактнаяИнформаци.Контакт = втКонтактнаяИнформациЗаказ.ГрузополучательСсылка
	               |						ИЛИ КонтактнаяИнформаци.Контакт = втКонтактнаяИнформациЗаказ.ОсновноеКонтактноеЛицоГрузополучателя)
	               |				ИЛИ КонтактнаяИнформаци.ТипКонтакта = ""Ответственный""
	               |					И КонтактнаяИнформаци.Контакт = втКонтактнаяИнформациЗаказ.ОтветственныйПоЗаказу)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втКонтактнаяИнформаци.МаршрутныйЛистСсылка КАК МаршрутныйЛистСсылка,
	               |	втКонтактнаяИнформаци.ЗаказСсылка КАК ЗаказСсылка,
	               |	втКонтактнаяИнформаци.ТипКИ КАК ТипКИ,
	               |	втКонтактнаяИнформаци.ТипКонтакта КАК ТипКонтакта,
	               |	МИНИМУМ(втКонтактнаяИнформаци.Приоритет) КАК Приоритет
	               |ПОМЕСТИТЬ втМинимальныйПриоритет
	               |ИЗ
	               |	втКонтактнаяИнформаци КАК втКонтактнаяИнформаци
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	втКонтактнаяИнформаци.ТипКИ,
	               |	втКонтактнаяИнформаци.ТипКонтакта,
	               |	втКонтактнаяИнформаци.МаршрутныйЛистСсылка,
	               |	втКонтактнаяИнформаци.ЗаказСсылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втКонтактнаяИнформаци.МаршрутныйЛистСсылка КАК МаршрутныйЛистСсылка,
	               |	втКонтактнаяИнформаци.ЗаказСсылка КАК ЗаказСсылка,
	               |	втКонтактнаяИнформаци.Контакт КАК Контакт,
	               |	втКонтактнаяИнформаци.ПредставлениеКИ КАК ПредставлениеКИ,
	               |	втКонтактнаяИнформаци.ТипКИ КАК ТипКИ,
	               |	втКонтактнаяИнформаци.ТипКонтакта КАК ТипКонтакта
	               |ПОМЕСТИТЬ втРезультат
	               |ИЗ
	               |	втКонтактнаяИнформаци КАК втКонтактнаяИнформаци
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втМинимальныйПриоритет КАК втМинимальныйПриоритет
	               |		ПО втКонтактнаяИнформаци.МаршрутныйЛистСсылка = втМинимальныйПриоритет.МаршрутныйЛистСсылка
	               |			И втКонтактнаяИнформаци.ЗаказСсылка = втМинимальныйПриоритет.ЗаказСсылка
	               |			И втКонтактнаяИнформаци.ТипКИ = втМинимальныйПриоритет.ТипКИ
	               |			И втКонтактнаяИнформаци.ТипКонтакта = втМинимальныйПриоритет.ТипКонтакта
	               |			И втКонтактнаяИнформаци.Приоритет = втМинимальныйПриоритет.Приоритет
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втРезультат.МаршрутныйЛистСсылка КАК МаршрутныйЛистСсылка,
	               |	втРезультат.ЗаказСсылка КАК ЗаказСсылка,
	               |	втРезультат.Контакт КАК Контакт,
	               |	втРезультат.ПредставлениеКИ КАК ПредставлениеКИ,
	               |	втРезультат.ТипКИ КАК ТипКИ,
	               |	втРезультат.ТипКонтакта КАК ТипКонтакта
	               |ИЗ
	               |	втРезультат КАК втРезультат
	               |ИТОГИ ПО
	               |	МаршрутныйЛистСсылка,
	               |	ЗаказСсылка";
	ВыборкаМЛ = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаМЛ.Следующий() Цикл 
		МаршрутныйЛистСсылка = ВыборкаМЛ.МаршрутныйЛистСсылка;  
		
		СоответвиеЗаказ = Новый Соответствие();
		ВыборкаЗаказ    = ВыборкаМЛ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
		Пока ВыборкаЗаказ.Следующий() Цикл
			ЗаказСсылка     = ВыборкаЗаказ.ЗаказСсылка;
			СоответсвиеКИ   = Новый Соответствие();  
			
			РезультатСтруктура = Новый Структура(); 
			РезультатСтруктура.Вставить("ТелефонКонтрагента",     "");
			РезультатСтруктура.Вставить("ПочтаКонтрагента",       "");
			РезультатСтруктура.Вставить("ТелефонГрузоотправителя","");
			РезультатСтруктура.Вставить("ПочтаГрузоотправителя",  "");
			РезультатСтруктура.Вставить("ТелефонГрузополучателя", "");
			РезультатСтруктура.Вставить("ПочтаГрузополучателя",   "");
			РезультатСтруктура.Вставить("ТелефонОтветственного",  "");
			РезультатСтруктура.Вставить("ПочтаОтветственного",    "");
			РезультатСтруктура.Вставить("КонтрагентКИ",           "");
			РезультатСтруктура.Вставить("ГрузоотправительКИ",     "");
			РезультатСтруктура.Вставить("ГрузополучательКИ",      "");

			ВыборкаКИ = ВыборкаЗаказ.Выбрать();
			Пока ВыборкаКИ.Следующий() Цикл
				Если ВыборкаКИ.ТипКонтакта = "Контрагент" Тогда
					РезультатСтруктура.КонтрагентКИ = ВыборкаКИ.Контакт;
				ИначеЕсли ВыборкаКИ.ТипКонтакта = "Грузоотправитель" Тогда
					РезультатСтруктура.ГрузоотправительКИ = ВыборкаКИ.Контакт; 
				ИначеЕсли ВыборкаКИ.ТипКонтакта = "Грузополучатель" Тогда 
					РезультатСтруктура.ГрузополучательКИ = ВыборкаКИ.Контакт;
				Конецесли;
				Если ВыборкаКИ.ТипКонтакта = "Контрагент" 
					И ВыборкаКИ.ТипКИ = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
					ЗаполнитьВидКИМЛ("ТелефонКонтрагента", ВыборкаКИ.ПредставлениеКИ, СоответсвиеКИ);
				ИначеЕсли ВыборкаКИ.ТипКонтакта = "Контрагент" 
					И ВыборкаКИ.ТипКИ = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
					ЗаполнитьВидКИМЛ("ПочтаКонтрагента", ВыборкаКИ.ПредставлениеКИ, СоответсвиеКИ);
				ИначеЕсли ВыборкаКИ.ТипКонтакта = "Грузоотправитель" 
					И ВыборкаКИ.ТипКИ = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
					ЗаполнитьВидКИМЛ("ТелефонГрузоотправителя", ВыборкаКИ.ПредставлениеКИ, СоответсвиеКИ);
				ИначеЕсли ВыборкаКИ.ТипКонтакта = "Грузоотправитель" 
					И ВыборкаКИ.ТипКИ = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
					ЗаполнитьВидКИМЛ("ПочтаГрузоотправителя", ВыборкаКИ.ПредставлениеКИ, СоответсвиеКИ);
				ИначеЕсли ВыборкаКИ.ТипКонтакта = "Грузополучатель" 
					И ВыборкаКИ.ТипКИ = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
					ЗаполнитьВидКИМЛ("ТелефонГрузополучателя", ВыборкаКИ.ПредставлениеКИ, СоответсвиеКИ);
				ИначеЕсли ВыборкаКИ.ТипКонтакта = "Грузополучатель" 
					И ВыборкаКИ.ТипКИ = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
					ЗаполнитьВидКИМЛ("ПочтаГрузополучателя", ВыборкаКИ.ПредставлениеКИ, СоответсвиеКИ);
				ИначеЕсли ВыборкаКИ.ТипКонтакта = "Ответственный" 
					И ВыборкаКИ.ТипКИ = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
					ЗаполнитьВидКИМЛ("ТелефонОтветственного", ВыборкаКИ.ПредставлениеКИ, СоответсвиеКИ);
				ИначеЕсли ВыборкаКИ.ТипКонтакта = "Ответственный" 
					И ВыборкаКИ.ТипКИ = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
					ЗаполнитьВидКИМЛ("ПочтаОтветственного", ВыборкаКИ.ПредставлениеКИ, СоответсвиеКИ);
				КонецЕсли; 
			КонецЦикла; 
			
			МассивКИ = СоответсвиеКИ.Получить("ТелефонКонтрагента");
			Если ТипЗнч(МассивКИ) = Тип("Массив") Тогда
				Для Каждого ТекСтрокаКИ Из МассивКИ Цикл
					РезультатСтруктура.ТелефонКонтрагента  = РезультатСтруктура.ТелефонКонтрагента + 
					?(ЗначениеЗаполнено(РезультатСтруктура.ТелефонКонтрагента), "; ", "") + ТекСтрокаКИ;
				КонецЦикла;
			КонецЕсли;
			
			МассивКИ = СоответсвиеКИ.Получить("ПочтаКонтрагента");
			Если ТипЗнч(МассивКИ) = Тип("Массив") Тогда
				Для Каждого ТекСтрокаКИ Из МассивКИ Цикл
					РезультатСтруктура.ПочтаКонтрагента  = РезультатСтруктура.ПочтаКонтрагента + 
					?(ЗначениеЗаполнено(РезультатСтруктура.ПочтаКонтрагента), "; ", "") + ТекСтрокаКИ;
				КонецЦикла;
			КонецЕсли;
			
			МассивКИ = СоответсвиеКИ.Получить("ТелефонГрузоотправителя");
			Если ТипЗнч(МассивКИ) = Тип("Массив") Тогда
				Для Каждого ТекСтрокаКИ Из МассивКИ Цикл
					РезультатСтруктура.ТелефонГрузоотправителя  = РезультатСтруктура.ТелефонГрузоотправителя +
					?(ЗначениеЗаполнено(РезультатСтруктура.ТелефонГрузоотправителя), "; ", "") + ТекСтрокаКИ;
				КонецЦикла;
			КонецЕсли;
			
			МассивКИ = СоответсвиеКИ.Получить("ПочтаГрузоотправителя");
			Если ТипЗнч(МассивКИ) = Тип("Массив") Тогда
				Для Каждого ТекСтрокаКИ Из МассивКИ Цикл
					РезультатСтруктура.ПочтаГрузоотправителя  = РезультатСтруктура.ПочтаГрузоотправителя + 
					?(ЗначениеЗаполнено(РезультатСтруктура.ПочтаГрузоотправителя), "; ", "") + ТекСтрокаКИ;
				КонецЦикла;
			КонецЕсли;
			
			МассивКИ = СоответсвиеКИ.Получить("ТелефонГрузополучателя");
			Если ТипЗнч(МассивКИ) = Тип("Массив") Тогда
				Для Каждого ТекСтрокаКИ Из МассивКИ Цикл
					РезультатСтруктура.ТелефонГрузополучателя  = РезультатСтруктура.ТелефонГрузополучателя + 
					?(ЗначениеЗаполнено(РезультатСтруктура.ТелефонГрузополучателя), "; ", "") + ТекСтрокаКИ;
				КонецЦикла;
			КонецЕсли;
			
			МассивКИ = СоответсвиеКИ.Получить("ПочтаГрузополучателя");
			Если ТипЗнч(МассивКИ) = Тип("Массив") Тогда
				Для Каждого ТекСтрокаКИ Из МассивКИ Цикл
					РезультатСтруктура.ПочтаГрузополучателя  = РезультатСтруктура.ПочтаГрузополучателя + 
					?(ЗначениеЗаполнено(РезультатСтруктура.ПочтаГрузополучателя), "; ", "") + ТекСтрокаКИ;
				КонецЦикла;
			КонецЕсли;
			
			МассивКИ = СоответсвиеКИ.Получить("ТелефонОтветственного");
			Если ТипЗнч(МассивКИ) = Тип("Массив") Тогда
				Для Каждого ТекСтрокаКИ Из МассивКИ Цикл
					РезультатСтруктура.ТелефонОтветственного  = РезультатСтруктура.ТелефонОтветственного + 
					?(ЗначениеЗаполнено(РезультатСтруктура.ТелефонОтветственного), "; ", "") + ТекСтрокаКИ;
				КонецЦикла;
			КонецЕсли;
			
			МассивКИ = СоответсвиеКИ.Получить("ПочтаОтветственного");
			Если ТипЗнч(МассивКИ) = Тип("Массив") Тогда
				Для Каждого ТекСтрокаКИ Из МассивКИ Цикл
					РезультатСтруктура.ПочтаОтветственного  = РезультатСтруктура.ПочтаОтветственного + 
					?(ЗначениеЗаполнено(РезультатСтруктура.ПочтаОтветственного), "; ", "") + ТекСтрокаКИ;
				КонецЦикла;
			КонецЕсли;
			СоответвиеЗаказ.Вставить(ЗаказСсылка, РезультатСтруктура);
		КонецЦикла;
		Результат.Вставить(МаршрутныйЛистСсылка, СоответвиеЗаказ);
	КонецЦикла;

	Возврат Результат;

КонецФункции

Функция ЗаполнитьКИМЛFTL(ВыборкаКИ, Выборка) Экспорт
	
	РезультатСтруктура = Новый Структура();
	РезультатСтруктура.Вставить("ТелефонКонтрагента",     "");
	РезультатСтруктура.Вставить("ПочтаКонтрагента",       "");
		
	СтрокиКИ = ВыборкаКИ.НайтиСтроки(Новый Структура("КонтрагентСсылка,КонтактноеЛицоСсылка,НомерСтроки",
	Выборка.КонтрагентСсылка, Выборка.КонтактноеЛицоСсылка, Выборка.НомерСтроки));
	
	СоответсвиеКИ = Новый Соответствие();
	Для Каждого ТекСтрокаКИ Из СтрокиКИ Цикл
		ЗаполнитьВидКИМЛ("ТелефонКонтрагента", ТекСтрокаКИ.ТелефонКонтрагента, СоответсвиеКИ);
		ЗаполнитьВидКИМЛ("ПочтаКонтрагента", ТекСтрокаКИ.ПочтаКонтрагента, СоответсвиеКИ);
	КонецЦикла;
	
	МассивКИ = СоответсвиеКИ.Получить("ТелефонКонтрагента");
	Если ТипЗнч(МассивКИ) = Тип("Массив") Тогда
		Для Каждого ТекСтрокаКИ Из МассивКИ Цикл
			 РезультатСтруктура.ТелефонКонтрагента  = РезультатСтруктура.ТелефонКонтрагента + 
			 	?(ЗначениеЗаполнено(РезультатСтруктура.ТелефонКонтрагента), "; ", "") + ТекСтрокаКИ;
		КонецЦикла;
	КонецЕсли;
	
	МассивКИ = СоответсвиеКИ.Получить("ПочтаКонтрагента");
	Если ТипЗнч(МассивКИ) = Тип("Массив") Тогда
		Для Каждого ТекСтрокаКИ Из МассивКИ Цикл
			 РезультатСтруктура.ПочтаКонтрагента  = РезультатСтруктура.ПочтаКонтрагента + 
			 	?(ЗначениеЗаполнено(РезультатСтруктура.ПочтаКонтрагента), "; ", "") + ТекСтрокаКИ;
		КонецЦикла;
	КонецЕсли;

	Возврат РезультатСтруктура;

КонецФункции

Процедура ЗаполнитьВидКИМЛ(ВидКИ, ДанныеСтроки, СоответсвиеКИ)
	
	МассивКИ = СоответсвиеКИ.Получить(ВидКИ);
	Если МассивКИ = Неопределено Тогда
		МассивКИ = Новый Массив();
		МассивКИ.Добавить(ДанныеСтроки);
	ИначеЕсли МассивКИ.Найти(ДанныеСтроки) = Неопределено Тогда
		МассивКИ.Добавить(ДанныеСтроки);
	КонецЕсли;
	СоответсвиеКИ.Вставить(ВидКИ, МассивКИ);
	
КонецПроцедуры

// Функция предназначена для отражения изменений по заказам маршрутных листов с мобильного приложения
//
// Параметры:
//  requestData       - строка    - строка XML, входные данные, содержимое определяется контекстом выполняемого метода
//  responseData      - строка    - строка XML, выходные данные, содержимое определяется контекстом выполняемого метода
//  resultCode        - число     - код результата выполнения
//  ДанныеАвторизации - структура - данные об авторизованном пользователе (ФизическоеЛицо и ТС)
//
// Возвращаемое значение:
//   Булево      - истина - метод выполнен успешно;
//               - ложь   - при выполнении метода возникла ошибка
//
Функция ОбработатьМетодUpdateOrders(Знач requestData, responseData, resultCode, 
	Знач ДанныеАвторизации, СпособРеализацииВебСервиса, ТекстОшибкиЗаполнения = "")
	
	responseData = ПолучитьПустыеВыходныеДанные(СпособРеализацииВебСервиса);
	
	флОшибка = Ложь;
	ТабСД    = Новый ТаблицаЗначений;
	ДанныеМодификацииМЛ = ДесериализоватьUpdateOrders(requestData, флОшибка, ТабСД, СпособРеализацииВебСервиса);
	
	Если флОшибка Тогда 
		resultCode = 65;
		
		Возврат Ложь;
	КонецЕсли;
	
	стрНастроек = уатМобильноеПриложениеВодителяСерверПовтИсп.ПолучитьНастройкиМобильногоПриложения();
	
	ВидыГрузов = Новый Массив;
	ВидыГрузов.Добавить(Тип("СправочникСсылка.Номенклатура"));
	ВидыГрузов.Добавить(Тип("СправочникСсылка.уатГрузовыеМеста_уэ"));
	ВидыЕдиницИзмерения = Новый Массив;
	ВидыЕдиницИзмерения.Добавить(Тип("СправочникСсылка.уатВидыУпаковки_уэ"));
	ВидыЕдиницИзмерения.Добавить(Тип("СправочникСсылка.ЕдиницыИзмерения"));
	ВидыОпераций = Новый Массив;
	ВидыОпераций.Добавить(Тип("ПеречислениеСсылка.уатВидыОперацийАктОтгрузки_уэ"));
	ВидыОпераций.Добавить(Тип("ПеречислениеСсылка.уатВидыОперацийАктПриемки_уэ"));

	тблСкладскиеДанные = Новый ТаблицаЗначений;
	тблСкладскиеДанные.Колонки.Добавить("Количество",         Новый ОписаниеТипов("Число"));
	тблСкладскиеДанные.Колонки.Добавить("КоличествоПлан",     Новый ОписаниеТипов("Число"));
	тблСкладскиеДанные.Колонки.Добавить("КоличествоМест",     Новый ОписаниеТипов("Число"));
	тблСкладскиеДанные.Колонки.Добавить("КоличествоМестПлан", Новый ОписаниеТипов("Число"));
	тблСкладскиеДанные.Колонки.Добавить("ВесБрутто",          Новый ОписаниеТипов("Число"));
	тблСкладскиеДанные.Колонки.Добавить("ВесБруттоПлан",      Новый ОписаниеТипов("Число"));
	тблСкладскиеДанные.Колонки.Добавить("Объем",              Новый ОписаниеТипов("Число"));
	тблСкладскиеДанные.Колонки.Добавить("ОбъемПлан",          Новый ОписаниеТипов("Число"));
	тблСкладскиеДанные.Колонки.Добавить("ЕстьРасхождения",    Новый ОписаниеТипов("Булево"));
	тблСкладскиеДанные.Колонки.Добавить("Состояние",          Новый ОписаниеТипов("Строка"));
	тблСкладскиеДанные.Колонки.Добавить("НачалоОперации",     Новый ОписаниеТипов("Дата"));
	тблСкладскиеДанные.Колонки.Добавить("ОкончаниеОперации",  Новый ОписаниеТипов("Дата"));
	тблСкладскиеДанные.Колонки.Добавить("Пункт",              Новый ОписаниеТипов("СправочникСсылка.уатПунктыНазначения"));
	тблСкладскиеДанные.Колонки.Добавить("Статус",             Новый ОписаниеТипов("СправочникСсылка.уатСтатусы_уэ"));
	тблСкладскиеДанные.Колонки.Добавить("Заказ",              Новый ОписаниеТипов("ДокументСсылка.уатЗаказГрузоотправителя"));
	тблСкладскиеДанные.Колонки.Добавить("МаршрутныйЛист",     Новый ОписаниеТипов("ДокументСсылка.уатМаршрутныйЛист"));
	тблСкладскиеДанные.Колонки.Добавить("ГрузовоеМесто",      Новый ОписаниеТипов(ВидыГрузов));
	тблСкладскиеДанные.Колонки.Добавить("ЕдиницаИзмерения",   Новый ОписаниеТипов(ВидыЕдиницИзмерения));
	тблСкладскиеДанные.Колонки.Добавить("ВидОперации",        Новый ОписаниеТипов(ВидыОпераций));
	
	мЗапрос = Новый Запрос;
	мЗапрос.УстановитьПараметр("ИзмененныеМЛ", ДанныеМодификацииМЛ);
	мЗапрос.УстановитьПараметр("Водитель",     ДанныеАвторизации.ФизическоеЛицо);
	мЗапрос.УстановитьПараметр("ТС",           ДанныеАвторизации.ТС);
	
	мЗапрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИзмененныеМЛ.routeListRef КАК МаршрутныйЛист,
	|	ИзмененныеМЛ.lineID КАК GUIDСтроки,
	|	ИзмененныеМЛ.isDone КАК Выполнен,
	|	ИзмененныеМЛ.arrivalFact КАК ПрибытиеФакт,
	|	ИзмененныеМЛ.departureFact КАК УбытиеФакт,
	|	ИзмененныеМЛ.arrivalFactUTC КАК ПрибытиеФактUTC,
	|	ИзмененныеМЛ.departureFactUTC КАК УбытиеФактUTC,
	|	ИзмененныеМЛ.fact_accepted КАК ГрузОбработан,
	|	ИзмененныеМЛ.fact_amount КАК КоличествоФакт,
	|	ИзмененныеМЛ.fact_amountPlace КАК КоличествоМестФакт,
	|	ИзмененныеМЛ.fact_weight КАК ВесФакт,
	|	ИзмененныеМЛ.fact_volume КАК ОбъемФакт,
	|	ИзмененныеМЛ.fact_reason КАК ПричинаРасхожденийФакт,
	|	ИзмененныеМЛ.signature КАК Подпись,
	|	ИзмененныеМЛ.mark КАК ОценкаСервиса
	|ПОМЕСТИТЬ ИзмененныеМЛ
	|ИЗ
	|	&ИзмененныеМЛ КАК ИзмененныеМЛ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.МаршрутныйЛист КАК МаршрутныйЛист,
	|	ВложенныйЗапрос.GUIDСтроки КАК GUIDСтроки,
	|	ВложенныйЗапрос.Выполнен КАК Выполнен,
	|	ВложенныйЗапрос.ПрибытиеФакт КАК ПрибытиеФакт,
	|	ВложенныйЗапрос.УбытиеФакт КАК УбытиеФакт,
	|	ВложенныйЗапрос.ПрибытиеФактUTC КАК ПрибытиеФактUTC,
	|	ВложенныйЗапрос.УбытиеФактUTC КАК УбытиеФактUTC,
	|	ВЫБОР
	|		КОГДА (ВложенныйЗапрос.Водитель1 = &Водитель
	|				ИЛИ ВложенныйЗапрос.Водитель2 = &Водитель)
	|				И ВложенныйЗапрос.ТС = &ТС
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Валидирован,
	|	ВложенныйЗапрос.ГрузОбработан КАК ГрузОбработан,
	|	ВложенныйЗапрос.КоличествоФакт КАК КоличествоФакт,
	|	ВложенныйЗапрос.КоличествоМестФакт КАК КоличествоМестФакт,
	|	ВложенныйЗапрос.ВесФакт КАК ВесФакт,
	|	ВложенныйЗапрос.ОбъемФакт КАК ОбъемФакт,
	|	ВложенныйЗапрос.ПричинаРасхожденийФакт КАК ПричинаРасхожденийФакт,
	|	ВложенныйЗапрос.ОценкаСервиса КАК ОценкаСервиса,
	|	ВложенныйЗапрос.Подпись КАК Подпись
	|ИЗ
	|	(ВЫБРАТЬ
	|		ИзмененныеМЛ.МаршрутныйЛист КАК МаршрутныйЛист,
	|		ИзмененныеМЛ.GUIDСтроки КАК GUIDСтроки,
	|		ИзмененныеМЛ.Выполнен КАК Выполнен,
	|		ИзмененныеМЛ.ПрибытиеФакт КАК ПрибытиеФакт,
	|		ИзмененныеМЛ.УбытиеФакт КАК УбытиеФакт,
	|		ИзмененныеМЛ.ПрибытиеФактUTC КАК ПрибытиеФактUTC,
	|		ИзмененныеМЛ.УбытиеФактUTC КАК УбытиеФактUTC,
	|		ИзмененныеМЛ.ГрузОбработан КАК ГрузОбработан,
	|		ИзмененныеМЛ.КоличествоФакт КАК КоличествоФакт,
	|		ИзмененныеМЛ.КоличествоМестФакт КАК КоличествоМестФакт,
	|		ИзмененныеМЛ.ВесФакт КАК ВесФакт,
	|		ИзмененныеМЛ.ОбъемФакт КАК ОбъемФакт,
	|		ИзмененныеМЛ.ПричинаРасхожденийФакт КАК ПричинаРасхожденийФакт,
	|		ВЫБОР
	|			КОГДА ТИПЗНАЧЕНИЯ(уатМаршрутныйЛист.Водитель1) = ТИП(Справочник.Сотрудники)
	|				ТОГДА уатМаршрутныйЛист.Водитель1.ФизическоеЛицо
	|			ИНАЧЕ уатМаршрутныйЛист.Водитель1
	|		КОНЕЦ КАК Водитель1,
	|		ВЫБОР
	|			КОГДА ТИПЗНАЧЕНИЯ(уатМаршрутныйЛист.Водитель2) = ТИП(Справочник.Сотрудники)
	|				ТОГДА уатМаршрутныйЛист.Водитель2.ФизическоеЛицо
	|			ИНАЧЕ уатМаршрутныйЛист.Водитель2
	|		КОНЕЦ КАК Водитель2,
	|		уатМаршрутныйЛист.ТС КАК ТС,
	|		ИзмененныеМЛ.ОценкаСервиса КАК ОценкаСервиса,
	|		ИзмененныеМЛ.Подпись КАК Подпись
	|	ИЗ
	|		ИзмененныеМЛ КАК ИзмененныеМЛ
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.уатМаршрутныйЛист КАК уатМаршрутныйЛист
	|			ПО ИзмененныеМЛ.МаршрутныйЛист = уатМаршрутныйЛист.Ссылка
	|				И (уатМаршрутныйЛист.Ссылка В
	|					(ВЫБРАТЬ
	|						ИзмененныеМЛ.МаршрутныйЛист
	|					ИЗ
	|						ИзмененныеМЛ КАК ИзмененныеМЛ))) КАК ВложенныйЗапрос
	|
	|УПОРЯДОЧИТЬ ПО
	|	Валидирован
	|ИТОГИ ПО
	|	Валидирован,
	|	МаршрутныйЛист";
	
	Попытка
		мВыборкаВалидность = мЗапрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Исключение
		ЗаписатьСообщениеОбОшибке("UpdateOrders", ОписаниеОшибки());
		resultCode = 65;
		
		Возврат Ложь;
	КонецПопытки;
	
	ЗаказыСРасхождениями = Новый Массив;
	
	Пока мВыборкаВалидность.Следующий() Цикл 
		Если мВыборкаВалидность.Валидирован = Ложь Тогда 
			ТекстНСТР = НСтр("en='Routing list assigned to another driver or vehicle.';ru='Маршрутный лист назначен другому водителю или ТС.'");
			ЗаписатьСообщениеОбОшибке("UpdateOrders", ТекстНСТР);
			resultCode = 66;
			
			Возврат Ложь;
		КонецЕсли;
		
		мВыборкаМЛ = мВыборкаВалидность.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока мВыборкаМЛ.Следующий() Цикл
			ЗаполнитьФактическоеПосещениеПунктов = Ложь;
			МаршЛистОб  = мВыборкаМЛ.МаршрутныйЛист.ПолучитьОбъект();
			
			флДокументМодифицирован = Ложь;
			ЕстьРасхожденияПоМаршрутномуЛисту = Ложь;
			
			мВыборкаЗаказы = мВыборкаМЛ.Выбрать();
			
			Пока мВыборкаЗаказы.Следующий() Цикл 
				НайдСтр = МаршЛистОб.Заказы.Найти(Новый УникальныйИдентификатор(мВыборкаЗаказы.GUIDСтроки), "GUIDСтроки");
				Если НайдСтр = Неопределено Тогда 
					ТекстНСТР = НСтр("en='Order is not found in specified routing list.';ru='Заказ не найден в указанном маршрутном листе.'");
					ЗаписатьСообщениеОбОшибке("UpdateOrders", ТекстНСТР);
					resultCode = 67;
					
					Возврат Ложь;
				КонецЕсли;
				НайдСтр.ОценкаСервиса = мВыборкаЗаказы.ОценкаСервиса;
					
				ЕстьРасхожденияПоГрузу = НайдСтр.Количество <> мВыборкаЗаказы.КоличествоФакт
					Или НайдСтр.КоличествоМест <> мВыборкаЗаказы.КоличествоМестФакт
					Или НайдСтр.Объем <> мВыборкаЗаказы.ОбъемФакт
					Или НайдСтр.ВесБрутто <> мВыборкаЗаказы.ВесФакт;
				ЕстьРасхожденияПоГрузу = ЕстьРасхожденияПоГрузу И мВыборкаЗаказы.ГрузОбработан = 1;
					
				ЕстьРасхожденияПоМаршрутномуЛисту = ЕстьРасхожденияПоМаршрутномуЛисту Или ЕстьРасхожденияПоГрузу;
				Если ЕстьРасхожденияПоГрузу Тогда
					ЗаказыСРасхождениями.Добавить(НайдСтр.ЗаказГрузоотправителя);
				КонецЕсли;
				
				НайдСтр.ПрибытиеФакт = ?(мВыборкаЗаказы.ПрибытиеФакт='19700101', '00010101', мВыборкаЗаказы.ПрибытиеФакт);
				НайдСтр.УбытиеФакт   = ?(мВыборкаЗаказы.УбытиеФакт='19700101', '00010101', мВыборкаЗаказы.УбытиеФакт); 
				
				НайдСтр.ПрибытиеФактUTC = ?(мВыборкаЗаказы.ПрибытиеФакт='19700101', '00010101', мВыборкаЗаказы.ПрибытиеФактUTC);
				НайдСтр.УбытиеФактUTC   = ?(мВыборкаЗаказы.УбытиеФакт='19700101', '00010101', мВыборкаЗаказы.УбытиеФактUTC);

				ПредПричинаЗакрытия = НайдСтр.ПричинаЗакрытияЗаказа;
				
				УстановитьПараметрыТЛЭ(МаршЛистОб, НайдСтр, мВыборкаЗаказы, ДанныеМодификацииМЛ);
				
				флВыполнен = Ложь;
				
				Если ЗначениеЗаполнено(НайдСтр.ПрибытиеФакт) И ЗначениеЗаполнено(НайдСтр.УбытиеФакт) Тогда 
					флВыполнен = Истина;
				ИначеЕсли ЗначениеЗаполнено(НайдСтр.ПричинаЗакрытияЗаказа) И НайдСтр.ПричинаЗакрытияЗаказа.ЗакрытУспешно Тогда 
					флВыполнен = Истина;
				ИначеЕсли ЗначениеЗаполнено(НайдСтр.ПрибытиеФакт) И НайдСтр.Пункт.Гараж Тогда  
					флВыполнен = Истина;
				КонецЕсли;
				
				Если Не НайдСтр.Выполнен И флВыполнен Тогда 
					НайдСтр.Выполнен = Истина;
					флДокументМодифицирован              = Истина; 
					ЗаполнитьФактическоеПосещениеПунктов = Истина;
				КонецЕсли;
				
				Если ПредПричинаЗакрытия <> НайдСтр.ПричинаЗакрытияЗаказа
					Или (МаршЛистОб.ЕстьРасхождения = Ложь И ЕстьРасхожденияПоМаршрутномуЛисту = Истина) Тогда 
				КонецЕсли;
				
				// Запись плановых и фактических данных о грузах для складских актов
				// Складские акты создаются автоматически только у клиента, на складах не создаются
				// Также учитываются флаги создания актов из настроек мобильного приложения
				Если НайдСтр.ТипТочкиМаршрута = Перечисления.уатТипыТочекМаршрута.Погрузка 
					И стрНастроек.СоздаватьАктОтгрузкиВРейсПриПогрузке 
					И НайдСтр.ЗаказГрузоотправителя.ВидДоставки <> Перечисления.уатВидыДоставки_уэ.СкладСклад
					И НайдСтр.ЗаказГрузоотправителя.ВидДоставки <> Перечисления.уатВидыДоставки_уэ.СкладДверь Тогда
					ВидСкладскойОперации = Перечисления.уатВидыОперацийАктОтгрузки_уэ.ВРейсВПункте;
					СтатусГруза = Справочники.уатСтатусы_уэ.ВыданВРейс;
				ИначеЕсли НайдСтр.ТипТочкиМаршрута = Перечисления.уатТипыТочекМаршрута.Разгрузка
					И стрНастроек.СоздаватьАктПриемкиИзРейсаПриРазгрузке 
					И НайдСтр.ЗаказГрузоотправителя.ВидДоставки <> Перечисления.уатВидыДоставки_уэ.СкладСклад
					И НайдСтр.ЗаказГрузоотправителя.ВидДоставки <> Перечисления.уатВидыДоставки_уэ.ДверьСклад Тогда
					ВидСкладскойОперации = Перечисления.уатВидыОперацийАктПриемки_уэ.ИзРейсаВПункте;
					СтатусГруза = Справочники.уатСтатусы_уэ.ПринятИзРейса;
				Иначе
					ВидСкладскойОперации = Неопределено;
				КонецЕсли;
				Если ЗначениеЗаполнено(ВидСкладскойОперации) И мВыборкаЗаказы.ГрузОбработан Тогда
					НоваяСтрока = тблСкладскиеДанные.Добавить();
					НоваяСтрока.КоличествоПлан     = НайдСтр.Количество;
					НоваяСтрока.КоличествоМестПлан = НайдСтр.КоличествоМест;
					НоваяСтрока.ВесБруттоПлан      = НайдСтр.ВесБрутто;
					НоваяСтрока.ОбъемПлан          = НайдСтр.Объем;
					НоваяСтрока.ЕстьРасхождения    = ЕстьРасхожденияПоГрузу;
					НоваяСтрока.Количество         = мВыборкаЗаказы.КоличествоФакт;
					НоваяСтрока.КоличествоМест     = мВыборкаЗаказы.КоличествоМестФакт;
					НоваяСтрока.ВесБрутто          = мВыборкаЗаказы.ВесФакт;
					НоваяСтрока.Объем              = мВыборкаЗаказы.ОбъемФакт;
					НоваяСтрока.Состояние          = мВыборкаЗаказы.ПричинаРасхожденийФакт;
					НоваяСтрока.Пункт              = НайдСтр.Пункт;
					НоваяСтрока.Заказ              = НайдСтр.ЗаказГрузоотправителя;
					НоваяСтрока.МаршрутныйЛист     = мВыборкаЗаказы.МаршрутныйЛист;
					НоваяСтрока.ГрузовоеМесто      = НайдСтр.Номенклатура;
					НоваяСтрока.ЕдиницаИзмерения   = НайдСтр.ЕдиницаИзмерения;
					НоваяСтрока.ВидОперации        = ВидСкладскойОперации;
					НоваяСтрока.Статус             = СтатусГруза;
					НоваяСтрока.НачалоОперации     = НайдСтр.ПрибытиеФакт;
					НоваяСтрока.ОкончаниеОперации  = НайдСтр.УбытиеФакт;
				КонецЕсли;
				
				
				Если ЗначениеЗаполнено(мВыборкаЗаказы.Подпись) 
					И СтрЗаменить(мВыборкаЗаказы.Подпись, Символы.ПС, "") <> СтрЗаменить(НайдСтр.Подпись, Символы.ПС, "") Тогда 
					ДанныеФайла = Base64Значение(мВыборкаЗаказы.Подпись);
					
					НайдСтр.Подпись = мВыборкаЗаказы.Подпись;
					
					ТекДата      = ТекущаяДата();
					ТекУниврДата = ТекущаяУниверсальнаяДата();
					GUIDКартинки = Новый УникальныйИдентификатор();
					ИмяФайла     = "Строка " + Формат(НайдСтр.НомерСтроки, "ЧГ=0") + " - "
					+ Формат(ТекДата, "ДФ='dd.MM.yyyy HH-mm-ss'; ДП='Нет даты'")
					+ " " + "Подпись";
					
					СведенияОФайле = РаботаСФайламиКлиентСервер.СведенияОФайле("ФайлСВерсией");
					СведенияОФайле.ИмяБезРасширения               = ИмяФайла;
					СведенияОФайле.РасширениеБезТочки             = "jpg";
					СведенияОФайле.ВремяИзменения                 = ТекДата;
					СведенияОФайле.ВремяИзмененияУниверсальное    = ТекУниврДата;
					СведенияОФайле.Размер                         = ДанныеФайла.Размер();
					СведенияОФайле.АдресВременногоХранилищаФайла  = ПоместитьВоВременноеХранилище(ДанныеФайла);
					СведенияОФайле.АдресВременногоХранилищаТекста = "";
					
					Попытка
						ФайлСсылка = РаботаСФайламиСлужебныйВызовСервера.СоздатьФайлСВерсией(мВыборкаМЛ.МаршрутныйЛист, СведенияОФайле);
					Исключение
						ТекстНСТР = НСтр("en='An error occurred while writing the file to the database.';ru='Возникла ошибка при записи файла в базу.'");
						ЗаписатьСообщениеОбОшибке("SendImage", ТекстНСТР);
						resultCode = 85;
						Возврат Ложь;
					КонецПопытки;
					
					НовПрисоедФайл = МаршЛистОб.ПрисоединенныеФайлы.Добавить();
					НовПрисоедФайл.GUIDФайла          = GUIDКартинки;
					НовПрисоедФайл.GUIDСтрокиЗаказа   = Новый УникальныйИдентификатор(мВыборкаЗаказы.GUIDСтроки);
					НовПрисоедФайл.ПрисоединенныйФайл = ФайлСсылка;
				КонецЕсли;
			КонецЦикла;
			
			Если ЗаполнитьФактическоеПосещениеПунктов Тогда
				ЗаполнитьФактическоеПосещениеПунктовМЛ(МаршЛистОб);
			КонецЕсли;
			
			Если флДокументМодифицирован Тогда 
				счВсего = 0;
				счВыполнено = 0;
				
				Для Каждого ТекСтрока Из МаршЛистОб.Заказы Цикл 
					Если ТекСтрока.Выполнен
						ИЛИ ЗначениеЗаполнено(ТекСтрока.ПричинаЗакрытияЗаказа)
						ИЛИ (НЕ ЗначениеЗаполнено(ТекСтрока.ЗаказГрузоотправителя) 
						И ТипЗнч(ТекСтрока.Пункт) = Тип("СправочникСсылка.уатПунктыНазначения")
						И ТекСтрока.Пункт.ТипПункта.Служебный) Тогда
						счВыполнено = счВыполнено + 1;
					КонецЕсли;
					счВсего = счВсего + 1;
				КонецЦикла;
				
				Если счВсего <> 0 И счВсего = счВыполнено Тогда 
					МаршЛистОб.ЗакрытВодителем = Истина;
				КонецЕсли;
				МаршЛистОб.ЕстьРасхождения = МаршЛистОб.ЕстьРасхождения Или ЕстьРасхожденияПоМаршрутномуЛисту;
				
				СоздатьСкладскиеАкты(тблСкладскиеДанные, МаршЛистОб);
			КонецЕсли;
			
			ОшибкаПриПроведении = Ложь;
			Попытка   
				МаршЛистОб.ДополнительныеСвойства.Вставить("НеУстановливатьПризнакОбновленияМобильногоПриложения", Истина);
				МаршЛистОб.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				МассивОшибок = ПолучитьСообщенияПользователю(Истина);
				ОшибкаПриПроведении = Истина; 
			КонецПопытки;

			Если ОшибкаПриПроведении Тогда
				Попытка  
					МаршЛистОб.ДополнительныеСвойства.Вставить("НеУстановливатьПризнакОбновленияМобильногоПриложения", Истина);
					МаршЛистОб.Записать();
				Исключение
					ЗаписатьСообщениеОбОшибке("UpdateOrders", ОписаниеОшибки());
					resultCode = 125;
					ТекстОшибкиЗаполнения = "";

					МассивОшибок = ПолучитьСообщенияПользователю(Истина);
					Для Каждого ТекОшибка Из МассивОшибок Цикл 
						ТекстОшибкиЗаполнения = ТекстОшибкиЗаполнения + ?(ТекстОшибкиЗаполнения="","","; ") + ТекОшибка.Текст;
					КонецЦикла;
					Возврат Ложь;
				КонецПопытки;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	уатОбщегоНазначения_уэ.УстановитьФлагЕстьРасхожденияВЗаказахНаТС(ЗаказыСРасхождениями);
	
	Для Каждого ТекДокумент Из ТабСД Цикл 
		Если ТекДокумент.new Тогда  
			НоваяСсылка              = Справочники.уатСопроводительныеДокументы.ПолучитьСсылку(ТекДокумент.documentID); 
			СопроводительныйДокумент = НоваяСсылка.ПолучитьОбъект();
			Если СопроводительныйДокумент = Неопределено Тогда 
				СопроводительныйДокумент = Справочники.уатСопроводительныеДокументы.СоздатьЭлемент();  
				СопроводительныйДокумент.Заполнить(Неопределено);
				СопроводительныйДокумент.УстановитьСсылкуНового(НоваяСсылка);
				СопроводительныйДокумент.ИспользоватьВМобильномПриложении           = Истина; 
				СопроводительныйДокумент.ВидДокумента                               = ТекДокумент.typeRef;
				СопроводительныйДокумент.Основание                                  = ТекДокумент.ownerRef;
				СопроводительныйДокумент.Комментарий                                = ТекДокумент.comment;
				СопроводительныйДокумент.НомерДокумента                             = ТекДокумент.number;
				СопроводительныйДокумент.ДатаДокумента                              = ТекДокумент.date; 
				СопроводительныйДокумент.ПунктНазначения                            = ТекДокумент.pointRef;
				СопроводительныйДокумент.ДатаОбработкиВодителемВМобильномПриложении = ТекДокумент.processingDate;
				СопроводительныйДокумент.ВладелецДокумента                          = НайтиКонтрагента(ТекДокумент.partner);
				Если НЕ ЗначениеЗаполнено(ТекДокумент.name) Тогда
					СопроводительныйДокумент.Наименование = уатНастройкиШаблонов.СформироватьНаименованиеПоШаблону("Справочник_уатСопроводительныеДокументы", СопроводительныйДокумент);
				Иначе	
					СопроводительныйДокумент.Наименование = ТекДокумент.name; 
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(СопроводительныйДокумент.Наименование) Тогда
					СопроводительныйДокумент.Наименование = Строка(СопроводительныйДокумент.ВидДокумента) + " от " + Строка(СопроводительныйДокумент.ДатаДокумента);
				КонецЕсли;
				СопроводительныйДокумент.СозданВодителем = Истина;
				Попытка   
					СопроводительныйДокумент.ДополнительныеСвойства.Вставить("СозданИзМобильногоПриложения", Истина);
					СопроводительныйДокумент.Записать();
				Исключение
					ЗаписатьСообщениеОбОшибке("UpdateOrders", ОписаниеОшибки());
					resultCode = 125;
					
					ТекстОшибкиЗаполнения = "";

					МассивОшибок = ПолучитьСообщенияПользователю(Истина);
					Для Каждого ТекОшибка Из МассивОшибок Цикл 
						ТекстОшибкиЗаполнения = ТекстОшибкиЗаполнения + ?(ТекстОшибкиЗаполнения="","","; ") + ТекОшибка.Текст;
					КонецЦикла;
					
					Возврат Ложь;
				КонецПопытки;
				
				Организация = СопроводительныйДокумент.Основание.Организация;
				Если ЗначениеЗаполнено(ТекДокумент.processingDate) Тогда   
					Комментарий = Нстр("ru = 'Установлен водителем в мобильном приложении'; en = 'Installed by the driver in the mobile application'");
					Справочники.уатСопроводительныеДокументы.УстановитьСтатусДокумента(СопроводительныйДокумент.Ссылка,
					Справочники.уатСтатусы_уэ.ОбработанВодителем, ТекДокумент.processingDate, Организация, Комментарий); 
				Иначе
					Комментарий = Нстр("ru = 'Установлен водителем в мобильном приложении'; en = 'Installed by the driver in the mobile application'");
					Справочники.уатСопроводительныеДокументы.УстановитьСтатусДокумента(СопроводительныйДокумент.Ссылка,
					Справочники.уатСтатусы_уэ.Новый,, Организация, Комментарий);
				КонецЕсли;

			Иначе
				Если НЕ ЗначениеЗаполнено(СопроводительныйДокумент.ДатаОбработкиВодителемВМобильномПриложении)
					И ЗначениеЗаполнено(ТекДокумент.processingDate) Тогда
					СопроводительныйДокумент.ДатаОбработкиВодителемВМобильномПриложении = ТекДокумент.processingDate;
					Попытка
						СопроводительныйДокумент.Записать();
					Исключение
						ЗаписатьСообщениеОбОшибке("UpdateOrders", ОписаниеОшибки());
						resultCode = 125;
						
						ТекстОшибкиЗаполнения = "";
						
						МассивОшибок = ПолучитьСообщенияПользователю(Истина);
						Для Каждого ТекОшибка Из МассивОшибок Цикл 
							ТекстОшибкиЗаполнения = ТекстОшибкиЗаполнения + ?(ТекстОшибкиЗаполнения="","","; ") + ТекОшибка.Текст;
						КонецЦикла;
					
						Возврат Ложь;
					КонецПопытки;  
					
					Комментарий = Нстр("ru = 'Установлен водителем в мобильном приложении'; en = 'Installed by the driver in the mobile application'");
					Организация = СопроводительныйДокумент.Основание.Организация;
					Справочники.уатСопроводительныеДокументы.УстановитьСтатусДокумента(СопроводительныйДокумент.Ссылка,
						Справочники.уатСтатусы_уэ.ОбработанВодителем, ТекДокумент.processingDate, Организация, Комментарий);
				КонецЕсли;
			КонецЕсли;
		Иначе 
			Если НЕ ЗначениеЗаполнено(ТекДокумент.documentRef.ДатаОбработкиВодителемВМобильномПриложении) 
				И ЗначениеЗаполнено(ТекДокумент.processingDate) Тогда
				СопроводительныйДокумент = ТекДокумент.documentRef.ПолучитьОбъект();
				СопроводительныйДокумент.ДатаОбработкиВодителемВМобильномПриложении = ТекДокумент.processingDate;
				Попытка
					СопроводительныйДокумент.Записать();
				Исключение
					ЗаписатьСообщениеОбОшибке("UpdateOrders", ОписаниеОшибки());
					resultCode = 125;
					
					ТекстОшибкиЗаполнения = "";

					МассивОшибок = ПолучитьСообщенияПользователю(Истина);
					Для Каждого ТекОшибка Из МассивОшибок Цикл 
						ТекстОшибкиЗаполнения = ТекстОшибкиЗаполнения + ?(ТекстОшибкиЗаполнения="","","; ") + ТекОшибка.Текст;
					КонецЦикла;
					
					Возврат Ложь;
				КонецПопытки; 
				
				Комментарий = Нстр("ru = 'Установлен водителем в мобильном приложении'; en = 'Installed by the driver in the mobile application'"); 
				Организация = СопроводительныйДокумент.Основание.Организация;
				Справочники.уатСопроводительныеДокументы.УстановитьСтатусДокумента(СопроводительныйДокумент.Ссылка,
						Справочники.уатСтатусы_уэ.ОбработанВодителем, ТекДокумент.processingDate, Организация, Комментарий);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	resultCode = 0;
	
	Возврат Истина; 
	
КонецФункции // ОбработатьМетодUpdateOrders()

// Функция предназначена для создания сообщения об опоздании от водителя
//
// Параметры:
//  requestData       - строка    - строка XML, входные данные, содержимое определяется контекстом выполняемого метода
//  responseData      - строка    - строка XML, выходные данные, содержимое определяется контекстом выполняемого метода
//  resultCode        - число     - код результата выполнения
//  ДанныеАвторизации - структура - данные об авторизованном пользователе (ФизическоеЛицо и ТС)
//
// Возвращаемое значение:
//   Булево      - истина - метод выполнен успешно;
//               - ложь   - при выполнении метода возникла ошибка
//
Функция ОбработатьМетодSendLateArrival(Знач requestData, responseData, resultCode, Знач ДанныеАвторизации, СпособРеализацииВебСервиса)
	
	responseData = ПолучитьПустыеВыходныеДанные(СпособРеализацииВебСервиса);;
	
	флОшибка = Ложь;
	
	стрДанныеОбОпоздании = ДесериализоватьLateArrival(requestData, флОшибка, СпособРеализацииВебСервиса); //pointName, lateArrival, comment
	
	Если флОшибка Тогда 
		resultCode = 75;
		
		Возврат Ложь;
	КонецЕсли;
	
	// время опоздания.
	тСодержание = "" + НСтр("en='time of lateness:';ru='время опоздания:'") +" " + стрДанныеОбОпоздании.lateArrival + " " + НСтр("en='min.';ru='мин.'") + ";";
	// пункт опоздания.
	тСодержание = тСодержание + Символы.ПС + НСтр("en='point:';ru='пункт:'") +" " + стрДанныеОбОпоздании.pointName;
	// причина опоздания, если указана.
	Если Не стрДанныеОбОпоздании.comment = "" Тогда 
		тСодержание = тСодержание + ";" + Символы.ПС + НСтр("en='reason:';ru='причина:'") +" " + стрДанныеОбОпоздании.comment;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(стрДанныеОбОпоздании.orderRef) Тогда
		ДокСсылка   = стрДанныеОбОпоздании.orderRef; 	
		ЗаказОбъект = ДокСсылка.ПолучитьОбъект();
		ЗаказОбъект.КоличествоМинутОпоздания = стрДанныеОбОпоздании.lateArrival;
		ЗаказОбъект.Опоздание                = Истина;
		Попытка   
			ЗаказОбъект.ДополнительныеСвойства.Вставить("НеУстановливатьПризнакОбновленияМобильногоПриложения", Истина);
			ЗаказОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	ТекстОшибки = "";
	Чат = Справочники.уатЧаты.ПолучитьТекущийЧатВодителя(ДанныеАвторизации.ФизическоеЛицо);

	СообщениеСоздано = РегистрыСведений.уатЧатыСВодителями.СоздатьСообщениеМобильногоПриложения(
			Чат,
			тСодержание,
			Чат,
			ДанныеАвторизации.ФизическоеЛицо,
			Перечисления.уатВидыСообщенийМобильногоПриложения.Опоздание,
			ТекущаяДатаСеанса(),
			Истина,
			Истина,
			ТекущаяДатаСеанса(),
			,,
			,
			ТекстОшибки
			);

	Если НЕ СообщениеСоздано Тогда
		ЗаписатьСообщениеОбОшибке("SendLateArrival", ТекстОшибки);
		resultCode = 75;
		
		Возврат Ложь;
	КонецЕсли;

	Попытка
		НаименованиеСообщения = НСтр("en='Message about late from driver';ru='Сообщение об опоздании от водителя'")
		+ " " + ДанныеАвторизации.ФизическоеЛицо.Наименование + ", " + НСтр("en = 'Vehicle'; ru = 'ТС'") + " " + ДанныеАвторизации.ТС.Наименование;
		
		ТекстСообщения = Новый ФорматированнаяСтрока(
		НаименованиеСообщения + Символы.ПС + тСодержание,
		Символы.ПС,
		Новый ФорматированнаяСтрока("Ответить",,,, "e1cib/command/Обработка.уатСообщенияМобильногоПриложения.Команда.СообщенияМобильногоПриложения"));
		
		
		ГруппаДиспетчеров = Чат.ГруппаДиспетчеров;
		Попытка
			Справочники.уатГруппыДиспетчеров.ОтправитьСообщениеВСлужебноеОбсуждение(ГруппаДиспетчеров, ТекстСообщения); 
		Исключение
		КонецПопытки;
		ОтправитьСообщениеВСлужебноеОбсуждение();
	Исключение
	КонецПопытки;
	resultCode = 0;
	
	Возврат Истина;
	
КонецФункции // ОбработатьМетодSendLateArrival()

// Функция предназначена для сохранения картинки по маршрутному листу, полученной с мобильного устройства.
//
// Параметры:
//  requestData       - строка    - строка XML, входные данные, содержимое определяется контекстом выполняемого метода
//  responseData      - строка    - строка XML, выходные данные, содержимое определяется контекстом выполняемого метода
//  resultCode        - число     - код результата выполнения
//  ДанныеАвторизации - структура - данные об авторизованном пользователе (ФизическоеЛицо и ТС)
//
// Возвращаемое значение:
//   Булево      - истина - метод выполнен успешно;
//               - ложь   - при выполнении метода возникла ошибка
//
Функция ОбработатьМетодSendImage(Знач requestData, responseData, resultCode, Знач ДанныеАвторизации, СпособРеализацииВебСервиса)
	
	// Значение по-умолчанию в случае ошибки.
	Если СпособРеализацииВебСервиса = Перечисления.уатСпособыРеализацииВебСервиса.REST Тогда 
		
		responseData = Новый Соответствие(); 
		responseData.Вставить("image", "00000000-0000-0000-0000-000000000000");
		ЗначениеJSON = Новый Соответствие();  
		ЗначениеJSON.Вставить("responseData" , responseData);
	Иначе
		responseData = "<response><image>00000000-0000-0000-0000-000000000000</image></response>"; // Значение по-умолчанию в случае ошибки.
	КонецЕсли;

	флОшибка = Ложь;
	
	ТабФайлов = ДесериализоватьImage(requestData, флОшибка, СпособРеализацииВебСервиса);
	
	Если флОшибка Тогда 
		resultCode = 85;
		
		Возврат Ложь;
	КонецЕсли;
	
	СозданныеФайлы = Новый Массив();
	
	Для Каждого ТекФайл Из ТабФайлов Цикл
		ТекДата      = ТекущаяДатаСеанса();
		ТекУниврДата = ТекущаяУниверсальнаяДата();
		GUIDКартинки = Новый УникальныйИдентификатор();
		
		// Маршрутный лист есть всегда
		Если ТипЗнч(ТекФайл.ДокументСсылка) = Тип("ДокументСсылка.уатМаршрутныйЛист") Тогда
			ДокументОбъект = ТекФайл.ДокументСсылка.ПолучитьОбъект(); 
			Если ДокументОбъект = Неопределено Тогда 
				ТекстНСТР = НСтр("en='Document is not in database.';ru='Документ отсутствует в базе.'");
				ЗаписатьСообщениеОбОшибке("SendImage", ТекстНСТР);
				resultCode = 85;
				Возврат Ложь;
			КонецЕсли;
			
			СтрокиТЧ = ДокументОбъект.Заказы.НайтиСтроки(Новый Структура("GUIDСтроки", ТекФайл.GUIDСтроки));
			Если СтрокиТЧ.Количество() = 0 Тогда 
				ТекстНСТР = НСтр("en='Required line of document is not in database.';ru='Требуемая строка документа отсутствует в базе.'");
				ЗаписатьСообщениеОбОшибке("SendImage", ТекстНСТР);
				resultCode = 85;
				Возврат Ложь;
			КонецЕсли;
			
			ИмяФайла = "Строка " + Формат(СтрокиТЧ[0].НомерСтроки, "ЧГ=0") + " - " + Формат(ТекДата, "ДФ='dd.MM.yyyy HH-mm-ss'; ДП='Нет даты'");
		Иначе
			ИмяФайла = "Изображение" + " - " + Формат(ТекДата, "ДФ='dd.MM.yyyy HH-mm-ss'; ДП='Нет даты'");
		КонецЕсли;
		
		СведенияОФайле = РаботаСФайламиКлиентСервер.СведенияОФайле("ФайлСВерсией");
		СведенияОФайле.ИмяБезРасширения               = ИмяФайла;
		СведенияОФайле.РасширениеБезТочки             = ТекФайл.РасширениеФайла;
		СведенияОФайле.ВремяИзменения                 = ТекДата;
		СведенияОФайле.ВремяИзмененияУниверсальное    = ТекУниврДата;
		СведенияОФайле.Размер                         = ТекФайл.ДанныеФайла.Размер();
		СведенияОФайле.АдресВременногоХранилищаФайла  = ПоместитьВоВременноеХранилище(ТекФайл.ДанныеФайла);
		СведенияОФайле.АдресВременногоХранилищаТекста = "";
		
		Попытка
			ФайлСсылка = РаботаСФайламиСлужебныйВызовСервера.СоздатьФайлСВерсией(ТекФайл.ДокументСсылка, СведенияОФайле);
		Исключение
			ТекстНСТР = НСтр("en='An error occurred while writing the file to the database.';ru='Возникла ошибка при записи файла в базу.'");
			ЗаписатьСообщениеОбОшибке("SendImage", ТекстНСТР);
			resultCode = 85;
			Возврат Ложь;
		КонецПопытки;
		СозданныеФайлы.Добавить(GUIDКартинки);
		
		Если ТипЗнч(ТекФайл.ДокументСсылка) = Тип("ДокументСсылка.уатМаршрутныйЛист") Тогда
			НовПрисоедФайл = ДокументОбъект.ПрисоединенныеФайлы.Добавить();
			НовПрисоедФайл.GUIDФайла          = GUIDКартинки;
			НовПрисоедФайл.GUIDСтрокиЗаказа   = Новый УникальныйИдентификатор(ТекФайл.GUIDСтроки);
			НовПрисоедФайл.ПрисоединенныйФайл = ФайлСсылка;
			
			Попытка 
				ДокументОбъект.ДополнительныеСвойства.Вставить("НеУстановливатьПризнакОбновленияМобильногоПриложения", Истина);
				ДокументОбъект.Записать();
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	responseData = СериализоватьSendImage(СозданныеФайлы, СпособРеализацииВебСервиса);
	resultCode = 0;
	
	Возврат Истина;
	
КонецФункции // ОбработатьМетодSendLateArrival()

// Функция предназначена для сохранения картинки по маршрутному листу, полученной с мобильного устройства.
//
// Параметры:
//  requestData       - строка    - строка XML, входные данные, содержимое определяется контекстом выполняемого метода
//  responseData      - строка    - строка XML, выходные данные, содержимое определяется контекстом выполняемого метода
//  resultCode        - число     - код результата выполнения
//  ДанныеАвторизации - структура - данные об авторизованном пользователе (ФизическоеЛицо и ТС)
//
// Возвращаемое значение:
//   Булево      - истина - метод выполнен успешно;
//               - ложь   - при выполнении метода возникла ошибка
//
Функция ОбработатьМетодsendImageRepair(Знач requestData, responseData, resultCode, Знач ДанныеАвторизации, СпособРеализацииВебСервиса)
	
	// Значение по-умолчанию в случае ошибки.
	Если СпособРеализацииВебСервиса = Перечисления.уатСпособыРеализацииВебСервиса.REST Тогда 
		
		responseData = Новый Соответствие(); 
		responseData.Вставить("image", "00000000-0000-0000-0000-000000000000");
		ЗначениеJSON = Новый Соответствие();  
		ЗначениеJSON.Вставить("responseData" , responseData);  
		
	Иначе
		responseData = "<response><image>00000000-0000-0000-0000-000000000000</image></response>";
	КонецЕсли;

	флОшибка = Ложь;
	
	ТабФайлов = ДесериализоватьImageRepair(requestData, флОшибка, СпособРеализацииВебСервиса);
	
	Если флОшибка Тогда 
		resultCode = 85;
		
		Возврат Ложь;
	КонецЕсли;
	
	СозданныеФайлы = Новый Массив();
	
	Для Каждого ТекФайл Из ТабФайлов Цикл 		

		ТекДата      = ТекущаяДатаСеанса();
		ТекУниврДата = ТекущаяУниверсальнаяДата();
		GUIDКартинки = Новый УникальныйИдентификатор();
		ИмяФайла     = "Изображение" + " - " + Формат(ТекДата, "ДФ='dd.MM.yyyy HH-mm-ss'; ДП='Нет даты'");
		
		СведенияОФайле = РаботаСФайламиКлиентСервер.СведенияОФайле("ФайлСВерсией");
		СведенияОФайле.ИмяБезРасширения               = ИмяФайла;
		СведенияОФайле.РасширениеБезТочки             = ТекФайл.РасширениеФайла;
		СведенияОФайле.ВремяИзменения                 = ТекДата;
		СведенияОФайле.ВремяИзмененияУниверсальное    = ТекУниврДата;
		СведенияОФайле.Размер                         = ТекФайл.ДанныеФайла.Размер();
		СведенияОФайле.АдресВременногоХранилищаФайла  = ПоместитьВоВременноеХранилище(ТекФайл.ДанныеФайла);
		СведенияОФайле.АдресВременногоХранилищаТекста = "";
		
		Попытка
			ФайлСсылка = РаботаСФайламиСлужебныйВызовСервера.СоздатьФайлСВерсией(ТекФайл.ЗаявкаНаРемонт, СведенияОФайле);
		Исключение
			ТекстНСТР = НСтр("en='An error occurred while writing the file to the database.';ru='Возникла ошибка при записи файла в базу.'");
			ЗаписатьСообщениеОбОшибке("SendImage", ТекстНСТР);
			resultCode = 85;
			Возврат Ложь;
		КонецПопытки;
		
		СозданныеФайлы.Добавить(GUIDКартинки);
	КонецЦикла;
	
	responseData = СериализоватьSendImage(СозданныеФайлы, СпособРеализацииВебСервиса);
	resultCode = 0;
	
	Возврат Истина;
	
КонецФункции // ОбработатьМетодSendLateArrival()

// Функция предназначена для удаления картинки по маршрутному листу, полученной с мобильного устройства.
//
// Параметры:
//  requestData       - строка    - строка XML, входные данные, содержимое определяется контекстом выполняемого метода
//  responseData      - строка    - строка XML, выходные данные, содержимое определяется контекстом выполняемого метода
//  resultCode        - число     - код результата выполнения
//  ДанныеАвторизации - структура - данные об авторизованном пользователе (ФизическоеЛицо и ТС)
//
// Возвращаемое значение:
//   Булево      - истина - метод выполнен успешно;
//               - ложь   - при выполнении метода возникла ошибка
//
Функция ОбработатьМетодDeleteImages(Знач requestData, responseData, resultCode, Знач ДанныеАвторизации, СпособРеализацииВебСервиса)
	
	responseData = ПолучитьПустыеВыходныеДанные(СпособРеализацииВебСервиса);
	
	флОшибка = Ложь;
	
	мсвУдаляемыхФайлов = ДесериализоватьDeleteImages(requestData, флОшибка, СпособРеализацииВебСервиса);
	
	Если флОшибка Тогда 
		resultCode = 90;
		
		Возврат Ложь;
	КонецЕсли;
	
	мЗапрос = Новый Запрос();
	мЗапрос.УстановитьПараметр("ФизическоеЛицо",     ДанныеАвторизации.ФизическоеЛицо);
	мЗапрос.УстановитьПараметр("ТС",                 ДанныеАвторизации.ТС);
	мЗапрос.УстановитьПараметр("мсвУдаляемыхФайлов", мсвУдаляемыхФайлов);
	
	мЗапрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатМаршрутныйЛистПрисоединенныеФайлы.Ссылка КАК Ссылка,
	|	уатМаршрутныйЛистПрисоединенныеФайлы.GUIDФайла КАК GUIDФайла,
	|	уатМаршрутныйЛистПрисоединенныеФайлы.ПрисоединенныйФайл КАК ПрисоединенныйФайл
	|ИЗ
	|	Документ.уатМаршрутныйЛист.ПрисоединенныеФайлы КАК уатМаршрутныйЛистПрисоединенныеФайлы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.уатМаршрутныйЛист КАК уатМаршрутныйЛист
	|		ПО уатМаршрутныйЛистПрисоединенныеФайлы.Ссылка = уатМаршрутныйЛист.Ссылка
	|			И (ВЫБОР
	|					КОГДА ТИПЗНАЧЕНИЯ(уатМаршрутныйЛист.Водитель1) = ТИП(Справочник.Сотрудники)
	|						ТОГДА уатМаршрутныйЛист.Водитель1.ФизическоеЛицо = &ФизическоеЛицо
	|					ИНАЧЕ уатМаршрутныйЛист.Водитель1 = &ФизическоеЛицо
	|				КОНЕЦ
	|				ИЛИ ВЫБОР
	|					КОГДА ТИПЗНАЧЕНИЯ(уатМаршрутныйЛист.Водитель2) = ТИП(Справочник.Сотрудники)
	|						ТОГДА уатМаршрутныйЛист.Водитель2.ФизическоеЛицо = &ФизическоеЛицо
	|					ИНАЧЕ уатМаршрутныйЛист.Водитель2 = &ФизическоеЛицо
	|				КОНЕЦ)
	|			И (уатМаршрутныйЛист.ТС = &ТС)
	|ГДЕ
	|	уатМаршрутныйЛистПрисоединенныеФайлы.GUIDФайла В(&мсвУдаляемыхФайлов)
	|ИТОГИ ПО
	|	Ссылка";
	
	мВыборкаМЛ = мЗапрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока мВыборкаМЛ.Следующий() Цикл 
		ДокМЛ = мВыборкаМЛ.Ссылка.ПолучитьОбъект(); 
		
		мВыборкаДетально = мВыборкаМЛ.Выбрать();
		Пока мВыборкаДетально.Следующий() Цикл 
			НайдСтроки = ДокМЛ.ПрисоединенныеФайлы.НайтиСтроки(Новый Структура("GUIDФайла", мВыборкаДетально.GUIDФайла));
			Если НайдСтроки.Количество() = 0 Тогда 
				Продолжить;
			КонецЕсли;
			ДокМЛ.ПрисоединенныеФайлы.Удалить(НайдСтроки[0]);
			
			СпрФайлОбъект = мВыборкаДетально.ПрисоединенныйФайл.ПолучитьОбъект();
			Попытка
				УстановитьПривилегированныйРежим(Истина);
				СпрФайлОбъект.УстановитьПометкуУдаления(Истина);
			Исключение
				ЗаписатьСообщениеОбОшибке("DeleteImages", ОписаниеОшибки());
				resultCode = 90;
				Возврат Ложь;
			КонецПопытки;
			УстановитьПривилегированныйРежим(Ложь);
		КонецЦикла;
		
		ДокМЛ.ДополнительныеСвойства.Вставить("НеУстановливатьПризнакОбновленияМобильногоПриложения", Истина);
		ДокМЛ.Записать();
	КонецЦикла;
	
	resultCode = 0;
	
	Возврат Истина;
	
КонецФункции // ОбработатьМетодSendLateArrival()

// Функция предназначена для получения QR кода.
//
// Параметры:
//  requestData       - строка    - строка XML, входные данные, содержимое определяется контекстом выполняемого метода
//  responseData      - строка    - строка XML, выходные данные, содержимое определяется контекстом выполняемого метода
//  resultCode        - число     - код результата выполнения
//  ДанныеАвторизации - структура - данные об авторизованном пользователе (ФизическоеЛицо и ТС)
//
// Возвращаемое значение:
//   Булево      - истина - метод выполнен успешно;
//               - ложь   - при выполнении метода возникла ошибка
//
Функция ОбработатьМетодGetQRcode(Знач requestData, responseData, resultCode, Знач ДанныеАвторизации, СпособРеализацииВебСервиса)
	
	флОшибка = Ложь;
	
	ДокументСсылка = ДесериализоватьGetQRcode(requestData, флОшибка, СпособРеализацииВебСервиса);
	Если флОшибка Тогда 
		resultCode = 145;
		Возврат Ложь;
	КонецЕсли;  
	
	СостоянияПодписейПЛ = Новый Соответствие();
	СоответвиеПЛЭД      = Новый Соответствие();
	
	мсвПутевыеЛисты     = Новый Массив();
	мсвПутевыеЛисты.Добавить(ДокументСсылка);
	уатОбменСГИСЭПД.ЗаполнитьСостоянияПЛ(мсвПутевыеЛисты, СостоянияПодписейПЛ, СоответвиеПЛЭД);
	
	ТекЭПЛ = СоответвиеПЛЭД.Получить(ДокументСсылка);
	Если ТекЭПЛ <> Неопределено Тогда
		ЭПЛ  = ТекЭПЛ.ЭПЛ;
		ЭПЛ_Титул4Подписан = ТекЭПЛ.Титул4Подписан; 
	Иначе
		resultCode = 146;
		Возврат Ложь; 
	КонецЕсли;

	Картинка = "";
	Если ЭПЛ_Титул4Подписан Тогда
		Картинка = уатОбменСГИСЭПД.ПолучитьQRЭПЛ(ЭПЛ, ЭПЛ.ИдентификаторОформителя, ЭПЛ.УИДМинтранс);
	КонецЕсли; 
	
	Если Картинка = "" Тогда 
		resultCode = 146;
		Возврат Ложь; 
	КонецЕсли;
	
	responseData = СериализоватьGetQRcode(Картинка, СпособРеализацииВебСервиса);
	
	resultCode = 0;
	
	Возврат Истина;
	
КонецФункции

// Функция предназначена для получения списка возможных вариантов закрытия заказов.
//
// Параметры:
//  requestData       - строка    - строка XML, входные данные, содержимое определяется контекстом выполняемого метода
//  responseData      - строка    - строка XML, выходные данные, содержимое определяется контекстом выполняемого метода
//  resultCode        - число     - код результата выполнения
//  ДанныеАвторизации - структура - данные об авторизованном пользователе (ФизическоеЛицо и ТС)
//
// Возвращаемое значение:
//   Булево      - истина - метод выполнен успешно;
//               - ложь   - при выполнении метода возникла ошибка
//
Функция ОбработатьМетодGetOrderResults(Знач requestData, responseData, resultCode, Знач ДанныеАвторизации, СпособРеализацииВебСервиса)
	
	мЗапрос = Новый Запрос();
	мЗапрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатПричиныЗакрытияЗаказов.Ссылка,
	|	уатПричиныЗакрытияЗаказов.Наименование
	|ИЗ
	|	Справочник.уатПричиныЗакрытияЗаказов КАК уатПричиныЗакрытияЗаказов
	|ГДЕ
	|	НЕ уатПричиныЗакрытияЗаказов.ПометкаУдаления
	|	И уатПричиныЗакрытияЗаказов.ИспользоватьВМобильномПриложении";
	
	Попытка
		ТабПричинЗакрытия = мЗапрос.Выполнить().Выгрузить();
		
		responseData = СериализоватьGetOrderResults(ТабПричинЗакрытия, СпособРеализацииВебСервиса);
		
	Исключение
		ЗаписатьСообщениеОбОшибке("GetOrderResults", ОписаниеОшибки());
		resultCode = 120;
		
		responseData = ПолучитьПустыеВыходныеДанные(СпособРеализацииВебСервиса);
		
		Возврат Ложь;
	КонецПопытки;
	
	resultCode = 0;
	
	Возврат Истина;
	
КонецФункции

// Функция предназначена для получения статуса активности приложения.
//
// Параметры:
//  requestData       - строка    - строка XML, входные данные, содержимое определяется контекстом выполняемого метода
//  responseData      - строка    - строка XML, выходные данные, содержимое определяется контекстом выполняемого метода
//  resultCode        - число     - код результата выполнения
//  ДанныеАвторизации - структура - данные об авторизованном пользователе (ФизическоеЛицо и ТС)
//
// Возвращаемое значение:
//   Булево      - истина - метод выполнен успешно;
//               - ложь   - при выполнении метода возникла ошибка
//
Функция ОбработатьМетодSendAppStatus(Знач requestData, responseData, resultCode, Знач ДанныеАвторизации, СпособРеализацииВебСервиса)
	
	ЗапросТерминал = Новый Запрос();
	
	Если ЗначениеЗаполнено(ДанныеАвторизации.trackerID) Тогда 
		ЗапросТерминал.УстановитьПараметр("IDУстройства", ДанныеАвторизации.trackerID);
	Иначе 
		responseData = ПолучитьПустыеВыходныеДанные(СпособРеализацииВебСервиса);
		resultCode   = 4;
		
		Возврат Ложь;
	КонецЕсли;
	
	ЗапросТерминал.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатМобильныеУстройства.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.уатМобильныеУстройства КАК уатМобильныеУстройства
	|ГДЕ
	|	уатМобильныеУстройства.IDУстройства = &IDУстройства";
	
	РезультатЗапросаПоТерминалам = ЗапросТерминал.Выполнить();
	ВыборкаТерминал = РезультатЗапросаПоТерминалам.Выбрать();
	
	Если ВыборкаТерминал.Следующий() Тогда 
		
		Терминал = ВыборкаТерминал.Ссылка;
		
	Иначе 
		responseData = ПолучитьПустыеВыходныеДанные(СпособРеализацииВебСервиса);
		resultCode   = 6;
		
		Возврат Ложь;
	КонецЕсли;
	
	флОшибка = Ложь;
	
	ТабСообщений = ДесериализоватьMessages(requestData, флОшибка, СпособРеализацииВебСервиса);
	
	Если флОшибка Тогда 
		resultCode = 50;
		
		Возврат Ложь;
	КонецЕсли;
	
	Попытка
		Для Каждого ТекСтрока Из ТабСообщений Цикл
			resultDescription	 = уатМобильноеПриложениеВодителяСерверПовтИсп.ПолучитьОписаниеСтатусаМобильногоПриложения(ТекСтрока.Текст, "ru");
			НаборЗаписей  = РегистрыСведений.уатСтатусыМобильногоПриложения.СоздатьНаборЗаписей();
			НаборЗаписей.Заполнить(Неопределено);
			НаборЗаписей.Отбор.Водитель.Установить(ДанныеАвторизации.ФизическоеЛицо);
			НаборЗаписей.Отбор.ТС.Установить(ДанныеАвторизации.ТС);
			НаборЗаписей.Отбор.МобильноеУстройство.Установить(Терминал);
			НаборЗаписей.Отбор.Дата.Установить(ТекСтрока.Дата);
			НаборЗаписей.Отбор.Статус.Установить(resultDescription);
			
			НоваяЗапись = НаборЗаписей.Добавить();
			
			НоваяЗапись.Водитель = ДанныеАвторизации.ФизическоеЛицо;
			НоваяЗапись.ТС					 = ДанныеАвторизации.ТС;
			НоваяЗапись.МобильноеУстройство	 = Терминал;
			НоваяЗапись.Дата				 = ТекСтрока.Дата;
			НоваяЗапись.Статус				 = resultDescription;
			
			НаборЗаписей.Записать(Истина);
		КонецЦикла;
	Исключение
		ЗаписатьСообщениеОбОшибке("SendAppStatus", ОписаниеОшибки());
		resultCode = 120;
		
		responseData = ПолучитьПустыеВыходныеДанные(СпособРеализацииВебСервиса);
		
		Возврат Ложь;
	КонецПопытки;
	
	resultCode = 0;
	
	Возврат Истина;
	
КонецФункции

#Область ЗаявкиНаРемонт

// Функция предназначена для получения видов ремонтов для работы мобильного приложения
//
// Параметры:
//  responseData - строка - строка XML, выходные данные, содержимое определяется контекстом выполняемого метода
//  resultCode   - число  - код результата выполнения
//
// Возвращаемое значение:
//   Булево      - истина - метод выполнен успешно;
//               - ложь   - при выполнении метода возникла ошибка
//
Функция ОбработатьМетодGetRepairTypes(responseData, resultCode, СпособРеализацииВебСервиса)
	
	мЗапрос = Новый Запрос;
	мЗапрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатВидыОбслуживанияТС.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.уатВидыОбслуживанияТС КАК уатВидыОбслуживанияТС
	|ГДЕ
	|	НЕ уатВидыОбслуживанияТС.ПометкаУдаления
	|	И уатВидыОбслуживанияТС.ДоступенДляВыбораВМобильномПриложении";
	
	Попытка
		responseData = СериализоватьRepairTypes(мЗапрос.Выполнить().Выгрузить(), СпособРеализацииВебСервиса);
		
	Исключение
		ЗаписатьСообщениеОбОшибке("GetRepairTypes", ОписаниеОшибки());
		responseData = ПолучитьПустыеВыходныеДанные(СпособРеализацииВебСервиса);
		resultCode = 25;
		
		Возврат Ложь;
	КонецПопытки;
	
	resultCode = 0;
	
	Возврат Истина;
КонецФункции

// Функция предназначена для получения видов ремонтов для работы мобильного приложения
//
// Параметры:
//  responseData - строка - строка XML, выходные данные, содержимое определяется контекстом выполняемого метода
//  resultCode   - число  - код результата выполнения
//
// Возвращаемое значение:
//   Булево      - истина - метод выполнен успешно;
//               - ложь   - при выполнении метода возникла ошибка
//
Функция ОбработатьМетодGetStatus(responseData, resultCode, СпособРеализацииВебСервиса)
	
	мЗапрос = Новый Запрос;
	мЗапрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатСтатусы_уэ.Ссылка КАК Ссылка,
	|	уатСтатусы_уэ.ЦветФонаПоУмолчанию КАК ЦветФонаПоУмолчанию
	|ИЗ
	|	Справочник.уатСтатусы_уэ КАК уатСтатусы_уэ
	|ГДЕ
	|	уатСтатусы_уэ.ДоступенДляВыбораВМобильномПриложении = ИСТИНА
	|	И НЕ уатСтатусы_уэ.ПометкаУдаления";
	
	Попытка
		responseData = СериализоватьGetStatus(мЗапрос.Выполнить().Выгрузить(), СпособРеализацииВебСервиса);
		
	Исключение
		ЗаписатьСообщениеОбОшибке("GetStatus", ОписаниеОшибки());
		responseData = ПолучитьПустыеВыходныеДанные(СпособРеализацииВебСервиса);
		resultCode = 25;
		
		Возврат Ложь;
	КонецПопытки;
	
	resultCode = 0;
	
	Возврат Истина;
КонецФункции

// Функция предназначена для получения заявок на ремонт по ТС для работы мобильного приложения
//
// Параметры:
//  responseData - строка - строка XML, выходные данные, содержимое определяется контекстом выполняемого метода
//  resultCode   - число  - код результата выполнения
//
// Возвращаемое значение:
//   Булево      - истина - метод выполнен успешно;
//               - ложь   - при выполнении метода возникла ошибка
//
Функция ОбработатьМетодGetOrdersForRepair(responseData, resultCode, Знач ДанныеАвторизации, СпособРеализацииВебСервиса)
	
	мЗапрос = Новый Запрос;
	мЗапрос.УстановитьПараметр("ТС", ДанныеАвторизации.ТС);
	мЗапрос.УстановитьПараметр("ТекВодитель", ДанныеАвторизации.ФизическоеЛицо);
	мЗапрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатЗаявкаНаРемонт.Ссылка КАК Ссылка,
	|	уатЗаявкаНаРемонт.Представление КАК Представление,
	|	уатЗаявкаНаРемонт.СтатусВыполнения КАК СтатусВыполнения,
	|	уатЗаявкаНаРемонт.СтатусВыполнения.ИмяПредопределенныхДанных КАК СтатусВыполненияИмяПредопределенныхДанных,
	|	уатЗаявкаНаРемонт.Номер КАК Номер,
	|	уатЗаявкаНаРемонт.ДатаНачала КАК ДатаНачала,
	|	уатЗаявкаНаРемонт.ДатаОкончания КАК ДатаОкончания,
	|	ВЫБОР
	|		КОГДА уатЗаявкаНаРемонт.ТС.ГосударственныйНомер <> """"
	|			ТОГДА уатЗаявкаНаРемонт.ТС.ГосударственныйНомер
	|		ИНАЧЕ уатЗаявкаНаРемонт.ТС.Наименование
	|	КОНЕЦ КАК ТСНаименование,
	|	уатЗаявкаНаРемонт.СпособРемонта КАК СпособРемонта,
	|	уатЗаявкаНаРемонт.Контрагент КАК Контрагент,
	|	уатЗаявкаНаРемонт.МестоРемонта КАК МестоРемонта,
	|	уатЗаявкаНаРемонт.ПричинаОбращения КАК ПричинаОбращения,
	|	уатЗаявкаНаРемонт.ВидОбслуживания КАК ВидОбслуживания,
	|	уатЗаявкаНаРемонт.Работы.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Неисправность КАК Неисправность,
	|		Работа КАК Работа,
	|		Количество КАК Количество
	|	) КАК Работы,
	|	уатЗаявкаНаРемонт.Материалы.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Номенклатура КАК Номенклатура,
	|		Количество КАК Количество,
	|		ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|	) КАК Материалы,
	|	уатЗаявкаНаРемонт.ТС КАК ТС,
	|	ВЫБОР
	|		КОГДА уатЗаявкаНаРемонт.Водитель <> &ТекВодитель
	|				И уатЗаявкаНаРемонт.Водитель <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ДругойВодитель,
	|	уатЗаявкаНаРемонт.Водитель КАК Водитель,
	|	уатЗаявкаНаРемонт.КомментарийВодителя КАК КомментарийВодителя,
	|	уатЗаявкаНаРемонт.СтатусПодтвержденияВодителем КАК СтатусПодтвержденияВодителем
	|ИЗ
	|	Документ.уатЗаявкаНаРемонт КАК уатЗаявкаНаРемонт
	|ГДЕ
	|	НЕ уатЗаявкаНаРемонт.ПометкаУдаления
	|	И уатЗаявкаНаРемонт.ТС = &ТС";
	
	Попытка
		responseData = СериализоватьOrdersForRepair(мЗапрос.Выполнить().Выгрузить(), СпособРеализацииВебСервиса);
		
	Исключение
		ЗаписатьСообщениеОбОшибке("GetOrdersForRepair", ОписаниеОшибки());
		responseData = ПолучитьПустыеВыходныеДанные(СпособРеализацииВебСервиса);;
		resultCode = 25;
		
		Возврат Ложь;
	КонецПопытки;
	
	Если НЕ СпособРеализацииВебСервиса = Перечисления.уатСпособыРеализацииВебСервиса.REST Тогда
		УстановитьПризнакОтправлено(ДанныеАвторизации.ФизическоеЛицо, ДанныеАвторизации.ТС,,,,,Истина);
	КонецЕсли;
	resultCode = 0;
	
	Возврат Истина;
КонецФункции

Функция ОбработатьМетодGetVehicles(Знач loginData, responseData, requestData, resultCode, ДанныеАвторизации, СпособРеализацииВебСервиса)
	
	стрДанныеАвторизации = Неопределено;
	
	Если Не ДесериализоватьLoginData(loginData, resultCode, стрДанныеАвторизации, СпособРеализацииВебСервиса) Тогда 
		responseData = ПолучитьПустыеВыходныеДанные(СпособРеализацииВебСервиса);
		Возврат Ложь;
	КонецЕсли;
	
	ВыборкаТерминал = ПолучитьGetVehicles(ДанныеАвторизации.ФизическоеЛицо);
	
	Попытка
		responseData = СериализоватьVehicles(ВыборкаТерминал, СпособРеализацииВебСервиса);
		
	Исключение
		
		ЗаписатьСообщениеОбОшибке("GetVehicles", ОписаниеОшибки());
		responseData = ПолучитьПустыеВыходныеДанные(СпособРеализацииВебСервиса);
		resultCode = 25;
		
		Возврат Ложь;
	КонецПопытки;
	
	resultCode = 0;
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьGetVehicles(Пользователь, ПолучатьПрицепы = Истина)
	ЗапросТерминал = Новый Запрос();
	ЗапросТерминал.УстановитьПараметр("Пользователь", Пользователь);
	
	ЗапросТерминал.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатПользователиМобильногоПриложения_ТС.ТС КАК ТС,
	|	ЛОЖЬ КАК Прицеп,
	|	уатПользователиМобильногоПриложения_ТС.ТС.Модель.НаличиеТопливногоБака КАК НаличиеТопливногоБака,
	|	уатПользователиМобильногоПриложения_ТС.Пользователь КАК Пользователь
	|ПОМЕСТИТЬ втТС
	|ИЗ
	|	РегистрСведений.уатПользователиМобильногоПриложения_ТС КАК уатПользователиМобильногоПриложения_ТС
	|ГДЕ
	|	уатПользователиМобильногоПриложения_ТС.Пользователь = &Пользователь
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	втТС.ТС КАК ТС,
	|	ЛОЖЬ КАК Прицеп,
	|	втТС.ТС.Модель.НаличиеТопливногоБака КАК НаличиеТопливногоБака,
	|	ВЫБОР
	|		КОГДА втТС.ТС.ГосударственныйНомер <> """"
	|			ТОГДА втТС.ТС.ГосударственныйНомер
	|		ИНАЧЕ втТС.ТС.Наименование
	|	КОНЕЦ КАК Наименование,
	|	Неопределено КАК ТСРодитель
	|ИЗ
	|	втТС КАК втТС";

	Если ПолучатьПрицепы Тогда
		ЗапросТерминал.Текст = ЗапросТерминал.Текст +"
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	уатСоставТС.ТС,
		|	ИСТИНА КАК Прицеп,
		|	уатСоставТС.ТС.Модель.НаличиеТопливногоБака,
		|	ВЫБОР
		|		КОГДА уатСоставТС.ТС.ГосударственныйНомер <> """"
		|			ТОГДА уатСоставТС.ТС.ГосударственныйНомер
		|		ИНАЧЕ уатСоставТС.ТС.Наименование
		|	КОНЕЦ,
		|	втТС.ТС
		|ИЗ
		|	втТС КАК втТС
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уатСоставТС КАК уатСоставТС
		|		ПО втТС.ТС = уатСоставТС.ВСоставе
		|			И (НЕ уатСоставТС.ТС.ПометкаУдаления)
		|ГДЕ
		|	(уатСоставТС.ТС.ВидМоделиТС = ЗНАЧЕНИЕ(Перечисление.уатВидыМоделейТС.Прицеп)
		|			ИЛИ уатСоставТС.ТС.ВидМоделиТС = ЗНАЧЕНИЕ(Перечисление.уатВидыМоделейТС.Оборудование))
		|	И ВЫБОР
		|			КОГДА уатСоставТС.ТС.ПринадлежностьТС = ЗНАЧЕНИЕ(Перечисление.уатПринадлежностьТС.Привлеченное)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ уатСоставТС.ТС.ДатаВыбытия = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					И НЕ уатСоставТС.ТС.ДатаВводаВЭксплуатацию = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|		КОНЕЦ";
	КонецЕсли;

	ВыборкаТерминал = ЗапросТерминал.Выполнить().Выгрузить();
	Возврат ВыборкаТерминал;
КонецФункции

Функция ОбработатьМетодGetTaxiOrders(responseData, resultCode, Знач ДанныеАвторизации, СпособРеализацииВебСервиса)
	
	стрНастроек = уатМобильноеПриложениеВодителяСерверПовтИсп.ПолучитьНастройкиМобильногоПриложения();

	ОграничениеЧислаЗаказовДнейВперед = стрНастроек.такОграничениеЧислаЗаказовДнейВперед;
	ОграничениеЧислаЗаказовДнейНазад  = стрНастроек.такОграничениеЧислаЗаказовДнейНазад;

	ОграничениеЧислаЗаказовЧасовВперед = стрНастроек.такОграничениеЧислаЗаказовЧасовВперед;
	ОграничениеЧислаЗаказовЧасовНазад  = стрНастроек.такОграничениеЧислаЗаказовЧасовНазад;

	ТекущаяДатаСеанса = ТекущаяДатаСеанса();
	ДатаОт = НачалоДня(ТекущаяДатаСеанса) - ОграничениеЧислаЗаказовДнейНазад * (60 * 60 * 24);
	ДатаПо = КонецДня(ТекущаяДатаСеанса) + ОграничениеЧислаЗаказовДнейВперед * (60 * 60 * 24);
	
	ВремяОт = ТекущаяДатаСеанса - ОграничениеЧислаЗаказовЧасовНазад * 60 * 60;
	ВремяПо = ТекущаяДатаСеанса + ОграничениеЧислаЗаказовЧасовВперед * 60 * 60;
	
	СписокСтатусов = Новый Массив;
	
	ВодительНеЗаполнен = Новый Массив();
	ВодительНеЗаполнен.Добавить(ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка"));
	ВодительНеЗаполнен.Добавить(ПредопределенноеЗначение("Справочник.ФизическиеЛица.ПустаяСсылка"));
	ВодительНеЗаполнен.Добавить(Неопределено);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТС",           ДанныеАвторизации.ТС);
	Запрос.УстановитьПараметр("Водитель",     ДанныеАвторизации.ФизическоеЛицо); 
	Запрос.УстановитьПараметр("ДатаОт",       ДатаОт);
	Запрос.УстановитьПараметр("ДатаПо",       ДатаПо);
	Запрос.УстановитьПараметр("ВремяОт",      ВремяОт);
	Запрос.УстановитьПараметр("ВремяПо",      ВремяПо);
	Запрос.УстановитьПараметр("СписокСтатусов",        СписокСтатусов);
	Запрос.УстановитьПараметр("СтатусОткрытогоЗаказа", Справочники.уатСтатусы_уэ.Отклонен);
	Запрос.УстановитьПараметр("ТекДата",               ТекущаяДатаСеанса); 
	Запрос.УстановитьПараметр("ВодительНеЗаполнен",    ВодительНеЗаполнен); 
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	такЗаказТакси.Ссылка КАК Ссылка,
	               |	такЗаказТакси.Номер КАК Номер,
	               |	такЗаказТакси.АдресНазначения КАК АдресНазначения,
	               |	такЗаказТакси.АдресПодачи КАК АдресПодачи,
	               |	такЗаказТакси.ВремяПодачи КАК ВремяПодачи,
	               |	такЗаказТакси.Заказчик КАК Заказчик,
	               |	такЗаказТакси.Заказчик.Наименование КАК ЗаказчикНаименование,
	               |	такЗаказТакси.Заказчик.ЮридическоеФизическоеЛицо КАК ЗаказчикЮрФизЛицо,
	               |	такЗаказТакси.Пассажир КАК Пассажир,
	               |	такЗаказТакси.КонтактноеЛицо КАК КонтактноеЛицо,
	               |	такЗаказТакси.КонтактноеЛицо.Наименование КАК КонтактноеЛицоНаименование,
	               |	такЗаказТакси.Статус КАК Статус,
	               |	такЗаказТакси.ТипТС КАК ТипТС,
	               |	такЗаказТакси.Водитель КАК Водитель,
	               |	такЗаказТакси.БонуснаяСкидка КАК БонуснаяСкидка,
	               |	такЗаказТакси.ПроцентАвтоматическойСкидки КАК ПроцентАвтоматическойСкидки,
	               |	такЗаказТакси.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
	               |	такЗаказТакси.АдресПодачи.Лат КАК ЛатПодачи,
	               |	такЗаказТакси.АдресПодачи.Лон КАК ЛонПодачи,
	               |	такЗаказТакси.АдресНазначения.Лат КАК ЛатНазначения,
	               |	такЗаказТакси.АдресНазначения.Лон КАК ЛонНазначения,
	               |	такЗаказТакси.СуммаДокумента КАК СуммаДокумента,
	               |	такЗаказТакси.Организация КАК Организация,
	               |	ВЫРАЗИТЬ(такЗаказТакси.ПримечаниеДиспетчеру КАК СТРОКА(254)) КАК ПримечаниеДиспетчеру,
	               |	такЗаказТакси.КоличествоМинФакт КАК КоличествоМинФакт,
	               |	такЗаказТакси.КоличествоКмФакт КАК КоличествоКмФакт,
	               |	такЗаказТакси.ВремяПодачиФактическое КАК ВремяПодачиФактическое,
	               |	такЗаказТакси.ВремяОкончанияФактическое КАК ВремяОкончанияФактическое,
	               |	такЗаказТакси.ВремяОжиданияОбщее КАК ВремяОжиданияОбщее,
	               |	такЗаказТакси.Оплачено КАК Оплачено,
	               |	такЗаказТакси.КоличествоМин КАК КоличествоМин,
	               |	такЗаказТакси.КоличествоКм КАК КоличествоКм,
	               |	ВЫБОР
	               |		КОГДА (такЗаказТакси.Водитель В (&ВодительНеЗаполнен)
	               |				ИЛИ такЗаказТакси.Водитель ЕСТЬ NULL)
	               |				И такЗаказТакси.ВидЗакрытия = ЗНАЧЕНИЕ(Справочник.уатПричиныЗакрытияЗаказов.ПустаяСсылка)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК openOrder,
	               |	такЗаказТакси.ФормаОплаты КАК ФормаОплаты,
	               |	такЗаказТакси.КомментарийНазначения КАК КомментарийНазначения,
	               |	такЗаказТакси.КомментарийПодачи КАК КомментарийПодачи,
	               |	уатДанныеТаксометра.ПробегПоПоездке КАК ТаксометрПробегПоПоездке,
	               |	уатДанныеТаксометра.ВремяПоПоездке КАК ТаксометрВремяПоПоездке,
	               |	уатДанныеТаксометра.ВремяОжидания КАК ТаксометрВремяОжидания,
	               |	уатДанныеТаксометра.ПробегПодачи КАК ТаксометрПробегПодачи,
	               |	уатДанныеТаксометра.ВремяПодачи КАК ТаксометрВремяПодачи,
	               |	уатДанныеТаксометра.ДатаНачалаНаПодачу КАК ТаксометрДатаНачалаНаПодачу,
	               |	уатДанныеТаксометра.ДатаНачалаОжидания КАК ТаксометрДатаНачалаОжидания,
	               |	уатДанныеТаксометра.ДатаНачалаПоездки КАК ТаксометрДатаНачалаПоездки,
	               |	ВЫБОР
	               |		КОГДА уатДанныеТаксометра.ТекущийДокумент ЕСТЬ NULL
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК ЕстьТаксометр
	               |ИЗ
	               |	Документ.такЗаказТакси КАК такЗаказТакси
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.такЧерныйСписок КАК такЧерныйСписок
	               |		ПО такЗаказТакси.Заказчик = такЧерныйСписок.Заказчик
	               |			И (ВЫБОР
	               |				КОГДА ТИПЗНАЧЕНИЯ(такЗаказТакси.Водитель) = ТИП(Справочник.Сотрудники)
	               |					ТОГДА такЗаказТакси.Водитель.ФизическоеЛицо = такЧерныйСписок.Объект
	               |				ИНАЧЕ такЗаказТакси.Водитель = такЧерныйСписок.Объект
	               |			КОНЕЦ)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уатДанныеТаксометра КАК уатДанныеТаксометра
	               |		ПО (такЗаказТакси.Ссылка = уатДанныеТаксометра.ТекущийДокумент)
	               |			И такЗаказТакси.ТС = уатДанныеТаксометра.ТС
	               |ГДЕ
	               |	такЗаказТакси.Проведен
	               |	И (такЗаказТакси.ТС = &ТС
	               |				И ВЫБОР
	               |					КОГДА ТИПЗНАЧЕНИЯ(такЗаказТакси.Водитель) = ТИП(Справочник.Сотрудники)
	               |						ТОГДА такЗаказТакси.Водитель.ФизическоеЛицо = &Водитель
	               |					ИНАЧЕ такЗаказТакси.Водитель = &Водитель
	               |				КОНЕЦ
	               |				И НЕ такЗаказТакси.Статус В (&СписокСтатусов)
	               |				И (такЗаказТакси.ВремяПодачи МЕЖДУ &ДатаОт И &ДатаПо)
	               |			ИЛИ (такЗаказТакси.Водитель В (&ВодительНеЗаполнен)
	               |				ИЛИ такЗаказТакси.Водитель ЕСТЬ NULL)
	               |				И такЗаказТакси.ВидЗакрытия = ЗНАЧЕНИЕ(Справочник.уатПричиныЗакрытияЗаказов.ПустаяСсылка)
	               |				И такЗаказТакси.Статус <> &СтатусОткрытогоЗаказа
	               |				И (такЗаказТакси.ВремяПодачи МЕЖДУ &ВремяОт И &ВремяПо
	               |					И (такЧерныйСписок.ДатаЗанесения ЕСТЬ NULL
	               |						ИЛИ такЧерныйСписок.Навсегда = ЛОЖЬ
	               |							И такЧерныйСписок.ПериодЧерногоСписка < &ТекДата)))
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	такЗаказТакси.Ссылка,
	               |	такЗаказТакси.Номер,
	               |	такЗаказТакси.АдресНазначения,
	               |	такЗаказТакси.АдресПодачи,
	               |	такЗаказТакси.ВремяПодачи,
	               |	такЗаказТакси.Заказчик.Наименование,
	               |	такЗаказТакси.Пассажир,
	               |	такЗаказТакси.КонтактноеЛицо.Наименование,
	               |	такЗаказТакси.Статус,
	               |	такЗаказТакси.ТипТС,
	               |	такЗаказТакси.Водитель,
	               |	такЗаказТакси.БонуснаяСкидка,
	               |	такЗаказТакси.ПроцентАвтоматическойСкидки,
	               |	такЗаказТакси.СуммаАвтоматическойСкидки,
	               |	такЗаказТакси.Заказчик.ЮридическоеФизическоеЛицо,
	               |	такЗаказТакси.АдресПодачи.Лат,
	               |	такЗаказТакси.АдресПодачи.Лон,
	               |	такЗаказТакси.АдресНазначения.Лат,
	               |	такЗаказТакси.АдресНазначения.Лон,
	               |	такЗаказТакси.СуммаДокумента,
	               |	такЗаказТакси.Организация,
	               |	ВЫРАЗИТЬ(такЗаказТакси.ПримечаниеДиспетчеру КАК СТРОКА(254)),
	               |	такЗаказТакси.КоличествоМинФакт,
	               |	такЗаказТакси.КоличествоКмФакт,
	               |	такЗаказТакси.ВремяПодачиФактическое,
	               |	такЗаказТакси.ВремяОкончанияФактическое,
	               |	такЗаказТакси.ВремяОжиданияОбщее,
	               |	такЗаказТакси.Оплачено,
	               |	такЗаказТакси.КоличествоМин,
	               |	такЗаказТакси.КоличествоКм,
	               |	ВЫБОР
	               |		КОГДА (такЗаказТакси.Водитель В (&ВодительНеЗаполнен)
	               |				ИЛИ такЗаказТакси.Водитель ЕСТЬ NULL)
	               |				И такЗаказТакси.ВидЗакрытия = ЗНАЧЕНИЕ(Справочник.уатПричиныЗакрытияЗаказов.ПустаяСсылка)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ,
	               |	такЗаказТакси.ФормаОплаты,
	               |	такЗаказТакси.КомментарийНазначения,
	               |	такЗаказТакси.КомментарийПодачи,
	               |	такЗаказТакси.Заказчик,
	               |	такЗаказТакси.КонтактноеЛицо,
	               |	уатДанныеТаксометра.ПробегПоПоездке,
	               |	уатДанныеТаксометра.ВремяПоПоездке,
	               |	уатДанныеТаксометра.ВремяОжидания,
	               |	уатДанныеТаксометра.ПробегПодачи,
	               |	уатДанныеТаксометра.ВремяПодачи,
	               |	уатДанныеТаксометра.ДатаНачалаНаПодачу,
	               |	уатДанныеТаксометра.ДатаНачалаОжидания,
	               |	уатДанныеТаксометра.ДатаНачалаПоездки,
	               |	ВЫБОР
	               |		КОГДА уатДанныеТаксометра.ТекущийДокумент ЕСТЬ NULL
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВремяПодачи,
	               |	Номер";
		
	Попытка 
		responseData = СериализоватьTaxiOrders(Запрос.Выполнить().Выбрать(), стрНастроек.такОтправлятьАдресНазначенияВОткрытыхЗаказах,, СпособРеализацииВебСервиса);
		
	Исключение
		ЗаписатьСообщениеОбОшибке("GetTaxiOrders", ОписаниеОшибки());
		responseData = ПолучитьПустыеВыходныеДанные(СпособРеализацииВебСервиса);;
		resultCode = 150; 
		
		Возврат Ложь;
	КонецПопытки;
	
	Если НЕ СпособРеализацииВебСервиса = Перечисления.уатСпособыРеализацииВебСервиса.REST Тогда
		УстановитьПризнакОтправлено(ДанныеАвторизации.ФизическоеЛицо, ДанныеАвторизации.ТС,,,Истина);
	КонецЕсли;
	resultCode = 0;
	
	Возврат Истина;
	
КонецФункции

Функция СериализоватьTaxiOrders(Знач TaxiOrders, ОтправлятьАдресНазначенияВОткрытыхЗаказах, ОдинЗаказ = Ложь, СпособРеализацииВебСервиса)
	
	Если СпособРеализацииВебСервиса = Перечисления.уатСпособыРеализацииВебСервиса.REST Тогда 
		Возврат уатМобильноеПриложениеВодителяСерверREST.СериализоватьTaxiOrders(TaxiOrders, ОтправлятьАдресНазначенияВОткрытыхЗаказах, ОдинЗаказ);
	Иначе
		Возврат уатМобильноеПриложениеВодителяСерверSOAP.СериализоватьTaxiOrders(TaxiOrders, ОтправлятьАдресНазначенияВОткрытыхЗаказах, ОдинЗаказ);
	КонецЕсли;

КонецФункции // СериализоватьCarServices()

Функция ОбработатьМетодUpdateTaxiOrder(Знач requestData, responseData, resultCode, Знач ДанныеАвторизации, СпособРеализацииВебСервиса)
	responseData = ПолучитьПустыеВыходныеДанные(СпособРеализацииВебСервиса);
	
	флОшибка = Ложь;
	
	ДанныеМодификации = ДесериализоватьUpdateTaxiOrder(requestData, флОшибка, СпособРеализацииВебСервиса);

	Если флОшибка 
		ИЛИ ДанныеМодификации.Количество() = 0 Тогда 
		resultCode = 160;
		
		Возврат Ложь;
	КонецЕсли;
	
	СтруктураЗаказа = ДанныеМодификации[0];

	ДокСсылка   = СтруктураЗаказа.orderRef; 	
	ЗаказОбъект = ДокСсылка.ПолучитьОбъект();
	
	Если ЗаказОбъект.ПометкаУдаления Тогда
		resultCode = 161;
		Возврат Ложь;
	КонецЕсли;  
	
	
	Таксометр = Новый Структура("ДокументСсылка,transportingDistance,transportingDuration,waitingTime,pickupDistance,pickupDuration,pickupStartDate,waitingStartDate,factStartTime");
	ЗаполнитьЗначенияСвойств(Таксометр, СтруктураЗаказа.taximeter);
	Таксометр.ДокументСсылка = ЗаказОбъект.Ссылка; 
	ЗаписатьДанныеТаксометра(ДанныеАвторизации, Таксометр, 0);
	

	ЕстьИзмененияПоЗаказу = Ложь;
	Если СтруктураЗаказа.services.Количество() Тогда
		Для Каждого ТекУслуга Из СтруктураЗаказа.services Цикл 
			НомерСтроки = 1;
			Для Каждого ТекУслугаЗаказа Из ЗаказОбъект.Услуги Цикл
				Если ТекУслуга.serviceNumber = НомерСтроки
					И ТекУслуга.serviceRef = ТекУслугаЗаказа.Номенклатура Тогда
					ТекУслугаЗаказа.Количество = ТекУслуга.serviceAmount; 
					ТекУслугаЗаказа.РучнойВвод = Истина; 
					ТекУслугаЗаказа.СуммаСкидки =
					ТекУслугаЗаказа.Количество * ТекУслугаЗаказа.Цена * ТекУслугаЗаказа.ПроцентСкидки / 100;
					ТекУслугаЗаказа.Сумма = ТекУслугаЗаказа.Количество * ТекУслугаЗаказа.Цена;
					Если ЗначениеЗаполнено(ТекУслугаЗаказа.СуммаСкидки) Тогда
						ТекУслугаЗаказа.Сумма = ТекУслугаЗаказа.Сумма - ТекУслугаЗаказа.СуммаСкидки;
					КонецЕсли; 
					
					СтавкаНДС = уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеСтавкиНДС(ТекУслугаЗаказа.СтавкаНДС);
					
					Попытка
						СуммаВклНДС = ТекУслугаЗаказа.СуммаВключаетНДС;
					Исключение
						СуммаВклНДС = ЗаказОбъект.СуммаВключаетНДС;
					КонецПопытки;
					
					ТекУслугаЗаказа.СуммаНДС = ?(СуммаВклНДС, 
					ТекУслугаЗаказа.Сумма - (ТекУслугаЗаказа.Сумма) / ((СтавкаНДС + 100) / 100),
					ТекУслугаЗаказа.Сумма * СтавкаНДС / 100);

					Прервать;
				КонецЕсли;
				НомерСтроки = НомерСтроки + 1;
			КонецЦикла;
		КонецЦикла;
		СтруктураДокумента  = уатОбщегоНазначенияКлиентСервер.СтруктураДокумента(ЗаказОбъект, "такЗаказТакси");
		ЗаказОбъект.СуммаДокумента  = уатОбщегоНазначенияТиповые.уатПолучитьСуммуДокументаСНДС(СтруктураДокумента, "Услуги");  
		
		ЕстьИзмененияПоЗаказу = Истина;
	КонецЕсли;
	
	НовыйСтатус = ПолучитьСтатусЗаказаТакси(СтруктураЗаказа.currentStatus); 
	Если ЗаказОбъект.Статус <> НовыйСтатус Тогда
		ЗаказОбъект.Статус    = НовыйСтатус;
		ЕстьИзмененияПоЗаказу = Истина;
	КонецЕсли;
	
	Если СтруктураЗаказа.isPaid <> Неопределено
		И ЗаказОбъект.Оплачено <> СтруктураЗаказа.isPaid Тогда 
		ЗаказОбъект.Оплачено  = СтруктураЗаказа.isPaid;
		ЕстьИзмененияПоЗаказу = Истина;
	КонецЕсли; 

	Если ЕстьИзмененияПоЗаказу Тогда
		ЗаказОбъект.ВремяПодачиФактическое    	= Таксометр.factStartTime;
		ЗаказОбъект.ВремяОкончанияФактическое 	= Таксометр.factStartTime + Таксометр.transportingDuration; 
		ЗаказОбъект.ВремяОжиданияОбщее       	= Таксометр.waitingTime / 60;
	КонецЕсли;
	ПересчетИтогов = Ложь;
	Если ЕстьИзмененияПоЗаказу
		И ЗаказОбъект.Статус = ПредопределенноеЗначение("Справочник.уатСтатусы_уэ.Закрыт")
		ИЛИ ЗаказОбъект.Статус = ПредопределенноеЗначение("Справочник.уатСтатусы_уэ.Сорван") Тогда
		ЗаказОбъект.КоличествоКмФакт	= Таксометр.transportingDistance;
		ЗаказОбъект.КоличествоМинФакт   = Таксометр.transportingDuration / 60;
		
		СтруктураОбъектовНастроек = Новый Структура;
		СтруктураОбъектовНастроек.Вставить("Организация",   ЗаказОбъект.Организация);
		СтруктураОбъектовНастроек.Вставить("Подразделение", ЗаказОбъект.Подразделение);

		changeMainServices = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(СтруктураОбъектовНастроек, ПланыВидовХарактеристик.уатПраваИНастройки.ИспользоватьДанныеТаксометраВодительУАТДляПересчетаУслуг); 
	
		ПересчетИтогов = changeMainServices;
	КонецЕсли;	

	Если ЗаказОбъект.Статус = ПредопределенноеЗначение("Справочник.уатСтатусы_уэ.Сорван")
		ИЛИ ЗаказОбъект.Статус = ПредопределенноеЗначение("Справочник.уатСтатусы_уэ.Отклонен") Тогда
		ЗаказОбъект.ВидЗакрытия = Справочники.уатПричиныЗакрытияЗаказов.Отклонен;
	ИначеЕсли ЗаказОбъект.Статус = ПредопределенноеЗначение("Справочник.уатСтатусы_уэ.Закрыт") Тогда
		ЗаказОбъект.ВидЗакрытия = Справочники.уатПричиныЗакрытияЗаказов.ЗакрытУспешно;
	КонецЕсли;
	
	Если ЕстьИзмененияПоЗаказу
		И ЗначениеЗаполнено(НовыйСтатус) Тогда
		
		ЗаписатьСтатус = Истина;
		
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("ЗаказТакси", ДокСсылка);
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	такСтатусыЗаказовТаксиСрезПоследних.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.такСтатусыЗаказовТакси.СрезПоследних КАК такСтатусыЗаказовТаксиСрезПоследних
		|ГДЕ
		|	такСтатусыЗаказовТаксиСрезПоследних.ЗаказТакси = &ЗаказТакси";
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если Выборка.Статус = НовыйСтатус Тогда
				ЗаписатьСтатус = Ложь;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗаписатьСтатус Тогда
			МенеджерЗаписи = РегистрыСведений.такСтатусыЗаказовТакси.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Заполнить(Неопределено);
			МенеджерЗаписи.ЗаказТакси = ДокСсылка;
			МенеджерЗаписи.Статус     = НовыйСтатус;
			МенеджерЗаписи.Период     = ТекущаяДатаСеанса();
			Попытка
				МенеджерЗаписи.Записать();
			Исключение
			КонецПопытки;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЕстьИзмененияПоЗаказу Тогда
		Попытка
			ЗаказОбъект.флСеансФоновогоЗадания = Истина;
			ЗаказОбъект.ДополнительныеСвойства.Вставить("НеУстановливатьПризнакОбновленияМобильногоПриложения", Истина);  
			ЗаказОбъект.ДополнительныеСвойства.Вставить("ПересчетИтогов", ПересчетИтогов);
			ЗаказОбъект.Записать(РежимЗаписиДокумента.Проведение); 
		Исключение
			resultCode = 160;
			Возврат Ложь;
		КонецПопытки;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТС",       ДанныеАвторизации.ТС);  
	Запрос.УстановитьПараметр("Водитель", ДанныеАвторизации.ФизическоеЛицо); 
	Запрос.УстановитьПараметр("Ссылка",   ЗаказОбъект.Ссылка);
	
	ВодительНеЗаполнен = Новый Массив();
	ВодительНеЗаполнен.Добавить(ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка"));
	ВодительНеЗаполнен.Добавить(ПредопределенноеЗначение("Справочник.ФизическиеЛица.ПустаяСсылка"));
	ВодительНеЗаполнен.Добавить(Неопределено);
	ВодительНеЗаполнен.Добавить(Неопределено);
	Запрос.УстановитьПараметр("ВодительНеЗаполнен",    ВодительНеЗаполнен);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	такЗаказТакси.Ссылка КАК Ссылка,
	               |	такЗаказТакси.Номер КАК Номер,
	               |	такЗаказТакси.АдресНазначения КАК АдресНазначения,
	               |	такЗаказТакси.АдресПодачи КАК АдресПодачи,
	               |	такЗаказТакси.ВремяПодачи КАК ВремяПодачи,
	               |	такЗаказТакси.Заказчик КАК Заказчик,
	               |	такЗаказТакси.Заказчик.Наименование КАК ЗаказчикНаименование,
	               |	такЗаказТакси.Заказчик.ЮридическоеФизическоеЛицо КАК ЗаказчикЮрФизЛицо,
	               |	такЗаказТакси.Пассажир КАК Пассажир,
	               |	такЗаказТакси.КонтактноеЛицо КАК КонтактноеЛицо,
	               |	такЗаказТакси.КонтактноеЛицо.Наименование КАК КонтактноеЛицоНаименование,
	               |	такЗаказТакси.Статус КАК Статус,
	               |	такЗаказТакси.ТипТС КАК ТипТС,
	               |	такЗаказТакси.Водитель КАК Водитель,
	               |	такЗаказТакси.БонуснаяСкидка КАК БонуснаяСкидка,
	               |	такЗаказТакси.ПроцентАвтоматическойСкидки КАК ПроцентАвтоматическойСкидки,
	               |	такЗаказТакси.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
	               |	такЗаказТакси.АдресПодачи.Лат КАК ЛатПодачи,
	               |	такЗаказТакси.АдресПодачи.Лон КАК ЛонПодачи,
	               |	такЗаказТакси.АдресНазначения.Лат КАК ЛатНазначения,
	               |	такЗаказТакси.АдресНазначения.Лон КАК ЛонНазначения,
	               |	такЗаказТакси.СуммаДокумента КАК СуммаДокумента,
	               |	такЗаказТакси.Организация КАК Организация,
	               |	ВЫРАЗИТЬ(такЗаказТакси.ПримечаниеДиспетчеру КАК СТРОКА(254)) КАК ПримечаниеДиспетчеру,
	               |	такЗаказТакси.КоличествоМинФакт КАК КоличествоМинФакт,
	               |	такЗаказТакси.КоличествоКмФакт КАК КоличествоКмФакт,
	               |	такЗаказТакси.ВремяПодачиФактическое КАК ВремяПодачиФактическое,
	               |	такЗаказТакси.ВремяОкончанияФактическое КАК ВремяОкончанияФактическое,
	               |	такЗаказТакси.ВремяОжиданияОбщее КАК ВремяОжиданияОбщее,
	               |	такЗаказТакси.Оплачено КАК Оплачено,
	               |	такЗаказТакси.КоличествоМин КАК КоличествоМин,
	               |	такЗаказТакси.КоличествоКм КАК КоличествоКм,
	               |	ВЫБОР
	               |		КОГДА (такЗаказТакси.Водитель В (&ВодительНеЗаполнен)
	               |				ИЛИ такЗаказТакси.Водитель ЕСТЬ NULL)
	               |				И такЗаказТакси.ВидЗакрытия = ЗНАЧЕНИЕ(Справочник.уатПричиныЗакрытияЗаказов.ПустаяСсылка)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК openOrder,
	               |	такЗаказТакси.ФормаОплаты КАК ФормаОплаты,
	               |	такЗаказТакси.КомментарийНазначения КАК КомментарийНазначения,
	               |	такЗаказТакси.КомментарийПодачи КАК КомментарийПодачи,
	               |	уатДанныеТаксометра.ПробегПоПоездке КАК ТаксометрПробегПоПоездке,
	               |	уатДанныеТаксометра.ВремяПоПоездке КАК ТаксометрВремяПоПоездке,
	               |	уатДанныеТаксометра.ВремяОжидания КАК ТаксометрВремяОжидания,
	               |	уатДанныеТаксометра.ПробегПодачи КАК ТаксометрПробегПодачи,
	               |	уатДанныеТаксометра.ВремяПодачи КАК ТаксометрВремяПодачи,
	               |	уатДанныеТаксометра.ДатаНачалаНаПодачу КАК ТаксометрДатаНачалаНаПодачу,
	               |	уатДанныеТаксометра.ДатаНачалаОжидания КАК ТаксометрДатаНачалаОжидания,
	               |	уатДанныеТаксометра.ДатаНачалаПоездки КАК ТаксометрДатаНачалаПоездки,
	               |	ВЫБОР
	               |		КОГДА уатДанныеТаксометра.ТекущийДокумент ЕСТЬ NULL
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК ЕстьТаксометр
	               |ИЗ
	               |	Документ.такЗаказТакси КАК такЗаказТакси
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.такЧерныйСписок КАК такЧерныйСписок
	               |		ПО такЗаказТакси.Заказчик = такЧерныйСписок.Заказчик
	               |			И (ВЫБОР
	               |				КОГДА ТИПЗНАЧЕНИЯ(такЗаказТакси.Водитель) = ТИП(Справочник.Сотрудники)
	               |					ТОГДА такЗаказТакси.Водитель.ФизическоеЛицо = такЧерныйСписок.Объект
	               |				ИНАЧЕ такЗаказТакси.Водитель = такЧерныйСписок.Объект
	               |			КОНЕЦ)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уатДанныеТаксометра КАК уатДанныеТаксометра
	               |		ПО такЗаказТакси.Ссылка = уатДанныеТаксометра.ТекущийДокумент
	               |			И такЗаказТакси.ТС = уатДанныеТаксометра.ТС
	               |ГДЕ
	               |	такЗаказТакси.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	такЗаказТакси.Ссылка,
	               |	такЗаказТакси.Номер,
	               |	такЗаказТакси.АдресНазначения,
	               |	такЗаказТакси.АдресПодачи,
	               |	такЗаказТакси.ВремяПодачи,
	               |	такЗаказТакси.Заказчик.Наименование,
	               |	такЗаказТакси.Пассажир,
	               |	такЗаказТакси.КонтактноеЛицо.Наименование,
	               |	такЗаказТакси.Статус,
	               |	такЗаказТакси.ТипТС,
	               |	такЗаказТакси.Водитель,
	               |	такЗаказТакси.БонуснаяСкидка,
	               |	такЗаказТакси.ПроцентАвтоматическойСкидки,
	               |	такЗаказТакси.СуммаАвтоматическойСкидки,
	               |	такЗаказТакси.Заказчик.ЮридическоеФизическоеЛицо,
	               |	такЗаказТакси.АдресПодачи.Лат,
	               |	такЗаказТакси.АдресПодачи.Лон,
	               |	такЗаказТакси.АдресНазначения.Лат,
	               |	такЗаказТакси.АдресНазначения.Лон,
	               |	такЗаказТакси.СуммаДокумента,
	               |	такЗаказТакси.Организация,
	               |	ВЫРАЗИТЬ(такЗаказТакси.ПримечаниеДиспетчеру КАК СТРОКА(254)),
	               |	такЗаказТакси.КоличествоМинФакт,
	               |	такЗаказТакси.КоличествоКмФакт,
	               |	такЗаказТакси.ВремяПодачиФактическое,
	               |	такЗаказТакси.ВремяОкончанияФактическое,
	               |	такЗаказТакси.ВремяОжиданияОбщее,
	               |	такЗаказТакси.Оплачено,
	               |	такЗаказТакси.КоличествоМин,
	               |	такЗаказТакси.КоличествоКм,
	               |	ВЫБОР
	               |		КОГДА (такЗаказТакси.Водитель В (&ВодительНеЗаполнен)
	               |				ИЛИ такЗаказТакси.Водитель ЕСТЬ NULL)
	               |				И такЗаказТакси.ВидЗакрытия = ЗНАЧЕНИЕ(Справочник.уатПричиныЗакрытияЗаказов.ПустаяСсылка)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ,
	               |	такЗаказТакси.ФормаОплаты,
	               |	такЗаказТакси.КомментарийНазначения,
	               |	такЗаказТакси.КомментарийПодачи,
	               |	такЗаказТакси.Заказчик,
	               |	такЗаказТакси.КонтактноеЛицо,
	               |	уатДанныеТаксометра.ПробегПоПоездке,
	               |	уатДанныеТаксометра.ВремяПоПоездке,
	               |	уатДанныеТаксометра.ВремяОжидания,
	               |	уатДанныеТаксометра.ПробегПодачи,
	               |	уатДанныеТаксометра.ВремяПодачи,
	               |	уатДанныеТаксометра.ДатаНачалаНаПодачу,
	               |	уатДанныеТаксометра.ДатаНачалаОжидания,
	               |	уатДанныеТаксометра.ДатаНачалаПоездки,
	               |	ВЫБОР
	               |		КОГДА уатДанныеТаксометра.ТекущийДокумент ЕСТЬ NULL
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВремяПодачи,
	               |	Номер";
	
	responseData = СериализоватьTaxiOrders(Запрос.Выполнить().Выбрать(), Ложь, Истина, СпособРеализацииВебСервиса);
	
	resultCode   = 0;
	
	Возврат Истина;
	
КонецФункции

Функция ДесериализоватьUpdateTaxiOrder(Знач requestData, флОшибка, СпособРеализацииВебСервиса)
	
	Если СпособРеализацииВебСервиса = Перечисления.уатСпособыРеализацииВебСервиса.REST Тогда 
		Возврат уатМобильноеПриложениеВодителяСерверREST.ДесериализоватьUpdateTaxiOrder(requestData, флОшибка);
	Иначе
		Возврат уатМобильноеПриложениеВодителяСерверSOAP.ДесериализоватьUpdateTaxiOrder(requestData, флОшибка);
	КонецЕсли;
	
КонецФункции // ДесериализоватьUpdateTaxiOrder()

Функция ОбработатьМетодSendRequestForOrder(Знач requestData, responseData, resultCode, Знач ДанныеАвторизации, СпособРеализацииВебСервиса)
	
	responseData = ПолучитьПустыеВыходныеДанные(СпособРеализацииВебСервиса);
	ГУИД = "" + requestData; 
	Попытка 
		ДокСсылка = Документы.такЗаказТакси.ПолучитьСсылку(Новый УникальныйИдентификатор(ГУИД));	
	Исключение
		resultCode = 170;
		
		Возврат Ложь;
	КонецПопытки;
	
	Если ДокСсылка.ПолучитьОбъект() = Неопределено Тогда 
		resultCode = 170;
		
		Возврат Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокСсылка.Водитель) тогда
		// Заказ уже распределен, дальше можно ничего не проверять
		resultCode = 171;
		Возврат Ложь;
	КонецЕсли;

	// Проверим границу распределения заказов
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	такГраницыРаспределенияЗаказов.ДатаОкончания КАК ДатаОкончания
	|ИЗ
	|	РегистрСведений.такГраницыРаспределенияЗаказов КАК такГраницыРаспределенияЗаказов
	|ГДЕ
	|	такГраницыРаспределенияЗаказов.Заказ = &Заказ");
	Запрос.УстановитьПараметр("Заказ", ДокСсылка);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	Если ТЗ.Количество() Тогда
		Если ТекущаяДата() >= ТЗ[0].ДатаОкончания Тогда
			// Время приема заявок истекло
			resultCode = 172;
			Возврат Ложь;
		КонецЕсли;
	Иначе
		// Первая заявка на данный заказ
		МенЗаписи = РегистрыСведений.такГраницыРаспределенияЗаказов.СоздатьМенеджерЗаписи(); 
		МенЗаписи.Заполнить(Неопределено);
		МенЗаписи.Заказ = ДокСсылка;
		Если Константы.такСпособОграниченияПриемаЗаявок.Получить() = Перечисления.такСпособыОграниченияПриемаЗаявокНаАвтоматическоеРаспределение.ВремяДоВремениПодачи тогда
			менЗаписи.ДатаОкончания = ДокСсылка.ВремяПодачи - Константы.такВремяОграниченияПриемаЗаявок.Получить();
		Иначе
			менЗаписи.ДатаОкончания = ТекущаяДатаСеанса() + Константы.такВремяОграниченияПриемаЗаявок.Получить();
		КонецЕсли;
		Попытка
			МенЗаписи.Записать();
		Исключение   
			resultCode = 170;
			Возврат Ложь;	
		КонецПопытки;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Сотрудники.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.ФизическоеЛицо = &Водитель");
	
	Запрос.УстановитьПараметр("Водитель", ДанныеАвторизации.ФизическоеЛицо);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Водитель = Выборка.Ссылка;
	Иначе 
		Водитель = ДанныеАвторизации.ФизическоеЛицо;
	КонецЕсли;
	ТС = ДанныеАвторизации.ТС;	
	
	// Подадим заявку на заказ, если уже подана ранее, то ничего не делаем
	ЗаказКРаспределению = РегистрыСведений.такЗаказыКРаспределению.СоздатьМенеджерЗаписи();  
	ЗаказКРаспределению.Заполнить(Неопределено);
	ЗаказКРаспределению.Заказ    = ДокСсылка;
	ЗаказКРаспределению.Водитель = Водитель;
	ЗаказКРаспределению.Прочитать();
	Если НЕ ЗаказКРаспределению.Выбран() Тогда
		ЗаказКРаспределению.Заказ    		 = ДокСсылка;
		ЗаказКРаспределению.Водитель		 = Водитель;
		ЗаказКРаспределению.ТС 				 = ТС;
		ЗаказКРаспределению.ДатаПодачиЗаявки = ТекущаяДатаСеанса();
		ЗаказКРаспределению.Записать();
	КонецЕсли;
		
	Возврат Истина;
	
КонецФункции // ОбработатьМетодSendLateArrival()

Функция ПолучитьИмяСтатусаЗаказаТакси(текСтатус) Экспорт
	
	СоответствиеСтатусов = Новый Соответствие;
	СоответствиеСтатусов.Вставить(Справочники.уатСтатусы_уэ.ВПути, "transportation");
	СоответствиеСтатусов.Вставить(Справочники.уатСтатусы_уэ.Закрыт, "closed");
	СоответствиеСтатусов.Вставить(Справочники.уатСтатусы_уэ.Нераспределенный, "unassigned");
	СоответствиеСтатусов.Вставить(Справочники.уатСтатусы_уэ.ОжиданиеКлиента, "waiting");
	СоответствиеСтатусов.Вставить(Справочники.уатСтатусы_уэ.Отклонен, "cancelled");
	СоответствиеСтатусов.Вставить(Справочники.уатСтатусы_уэ.ПереданВАренду, "");
	СоответствиеСтатусов.Вставить(Справочники.уатСтатусы_уэ.ПодачаПоАдресу, "driving");
	СоответствиеСтатусов.Вставить(Справочники.уатСтатусы_уэ.Предварительный, "preorder");
	СоответствиеСтатусов.Вставить(Справочники.уатСтатусы_уэ.Распределенный, "assigned");
	СоответствиеСтатусов.Вставить(Справочники.уатСтатусы_уэ.Сорван, "failed");

	НайденныйСтатус = СоответствиеСтатусов[текСтатус];
	Если НайденныйСтатус = Неопределено Тогда
		НайденныйСтатус = Строка(текСтатус);
	КонецЕсли;
	
	Возврат НайденныйСтатус;
	
КонецФункции

Функция ПолучитьСтатусЗаказаТакси(текСтатус)
	
	СоответствиеСтатусов = Новый Соответствие;
	СоответствиеСтатусов.Вставить("transportation", Справочники.уатСтатусы_уэ.ВПути);
	СоответствиеСтатусов.Вставить("closed",         Справочники.уатСтатусы_уэ.Закрыт);
	СоответствиеСтатусов.Вставить("unassigned",     Справочники.уатСтатусы_уэ.Нераспределенный);
	СоответствиеСтатусов.Вставить("waiting",        Справочники.уатСтатусы_уэ.ОжиданиеКлиента);
	СоответствиеСтатусов.Вставить("cancelled",      Справочники.уатСтатусы_уэ.Отклонен);
	СоответствиеСтатусов.Вставить("driving",        Справочники.уатСтатусы_уэ.ПодачаПоАдресу);
	СоответствиеСтатусов.Вставить("preorder",       Справочники.уатСтатусы_уэ.Предварительный);
	СоответствиеСтатусов.Вставить("assigned",       Справочники.уатСтатусы_уэ.Распределенный);
	СоответствиеСтатусов.Вставить("failed",         Справочники.уатСтатусы_уэ.Сорван);
	
	НайденныйСтатус = СоответствиеСтатусов[текСтатус];
	Если НайденныйСтатус = Неопределено Тогда
		НайденныйСтатус = Строка(текСтатус);
	КонецЕсли;
	
	Возврат НайденныйСтатус;
	
КонецФункции

// Функция предназначена для отражения изменений по закявкам на ремонт с мобильного приложения
//
// Параметры:
//  requestData       - строка    - строка XML, входные данные, содержимое определяется контекстом выполняемого метода
//  responseData      - строка    - строка XML, выходные данные, содержимое определяется контекстом выполняемого метода
//  resultCode        - число     - код результата выполнения
//  ДанныеАвторизации - структура - данные об авторизованном пользователе (ФизическоеЛицо и ТС)
//
// Возвращаемое значение:
//   Булево      - истина - метод выполнен успешно;
//               - ложь   - при выполнении метода возникла ошибка
//
Функция ОбработатьМетодUpdateOrderForRepair(Знач requestData, responseData, resultCode, Знач ДанныеАвторизации, СпособРеализацииВебСервиса)
	
	responseData = ПолучитьПустыеВыходныеДанные(СпособРеализацииВебСервиса);
	
	флОшибка = Ложь;
	
	ДанныеЗР = ДесериализоватьUpdateOrderForRepair(requestData, флОшибка, СпособРеализацииВебСервиса);
	
	Если флОшибка Тогда 
		resultCode = 29999;
		Возврат Ложь;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	Попытка
		НовыйДокумент              = ДанныеЗР.Ссылка.ПолучитьОбъект();
	Исключение
		ЗаписатьСообщениеОбОшибке(НСтр("en='ОбработатьМетодUpdateOrderForRepair';ru='ОбработатьМетодUpdateOrderForRepair'"), ОписаниеОшибки());
		resultCode = 29999;
		Возврат Ложь;
	КонецПопытки;
	
	НовыйДокумент.ДатаНачала       = ДанныеЗР.ДатаНачала;
	НовыйДокумент.ДатаОкончания    = ДанныеЗР.ДатаОкончания;
	НовыйДокумент.ПричинаОбращения = ДанныеЗР.ПричинаОбращения;
	НовыйДокумент.ТС               = ДанныеЗР.ТС;
	НовыйДокумент.ВидОбслуживания  = ДанныеЗР.ВидРемонта;
	НовыйДокумент.СтатусПодтвержденияВодителем = ДанныеЗР.СтатусПодтвержденияВодителем;
	НовыйДокумент.КомментарийВодителя          = ДанныеЗР.КомментарийВодителя;
	
	Попытка 
		НовыйДокумент.ДополнительныеСвойства.Вставить("НеУстановливатьПризнакОбновленияМобильногоПриложения", Истина);
		НовыйДокумент.Записать();
	Исключение
		ЗаписатьСообщениеОбОшибке(НСтр("en='ОбработатьМетодUpdateOrderForRepair';ru='ОбработатьМетодUpdateOrderForRepair'"), ОписаниеОшибки());
		resultCode = 29999;
		Возврат Ложь;
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);
	
	resultCode = 0;
	Возврат Истина;
	
КонецФункции // ОбработатьМетодUpdateOrderForRepair()

// Функция предназначена для отражения изменений по закявкам на ремонт с мобильного приложения
//
// Параметры:
//  requestData       - строка    - строка XML, входные данные, содержимое определяется контекстом выполняемого метода
//  responseData      - строка    - строка XML, выходные данные, содержимое определяется контекстом выполняемого метода
//  resultCode        - число     - код результата выполнения
//  ДанныеАвторизации - структура - данные об авторизованном пользователе (ФизическоеЛицо и ТС)
//
// Возвращаемое значение:
//   Булево      - истина - метод выполнен успешно;
//               - ложь   - при выполнении метода возникла ошибка
//
Функция ОбработатьМетодAddOrderForRepair(Знач requestData, responseData, resultCode, Знач ДанныеАвторизации, СпособРеализацииВебСервиса)
	
	responseData = ПолучитьПустыеВыходныеДанные(СпособРеализацииВебСервиса);
	
	флОшибка = Ложь;
	
	ДанныеЗР = ДесериализоватьAddOrderForRepair(requestData, флОшибка, СпособРеализацииВебСервиса);
	
	Если флОшибка Тогда 
		resultCode = 29999;
		Возврат Ложь;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ЗначениеЗаполнено(ДанныеЗР.Ссылка) Тогда
		Попытка
			НовыйДокумент = ДанныеЗР.Ссылка.ПолучитьОбъект();
		Исключение
			ЗаписатьСообщениеОбОшибке(НСтр("en='ОбработатьМетодAddOrderForRepair';ru='ОбработатьМетодAddOrderForRepair'"), ОписаниеОшибки());
			resultCode = 125;
			Возврат Ложь;
		КонецПопытки;
		Если НовыйДокумент = Неопределено Тогда
			НовыйДокумент  = Документы.уатЗаявкаНаРемонт.СоздатьДокумент();  
			НовыйДокумент.Заполнить(Неопределено);
			НовыйДокумент.УстановитьСсылкуНового(ДанныеЗР.Ссылка); 
			НовыйДокумент.Дата = ДанныеЗР.Дата; 
		КонецЕсли; 
	Иначе
		НовыйДокумент  = Документы.уатЗаявкаНаРемонт.СоздатьДокумент();
		НовыйДокумент.Заполнить(Неопределено);
		НовыйДокумент.УстановитьСсылкуНового(ДанныеЗР.Ссылка); 
		НовыйДокумент.Дата = ДанныеЗР.Дата; 
	КонецЕсли;
	
	НовыйДокумент.ДатаНачала       = ДанныеЗР.ДатаНачала;
	НовыйДокумент.ДатаОкончания    = ДанныеЗР.ДатаОкончания;
	НовыйДокумент.ПричинаОбращения = ДанныеЗР.ПричинаОбращения;
	НовыйДокумент.ТС               = ДанныеЗР.ТС;
	НовыйДокумент.ВидОбслуживания  = ДанныеЗР.ВидРемонта;
	НовыйДокумент.СтатусПодтвержденияВодителем  = ДанныеЗР.СтатусПодтвержденияВодителем;
	НовыйДокумент.КомментарийВодителя           = ДанныеЗР.КомментарийВодителя;
	
	МестоТС      = уатОбщегоНазначения.МестонахождениеТС(НовыйДокумент.ТС, НовыйДокумент.Дата);
	Пользователь = ПользователиКлиентСервер.АвторизованныйПользователь();
	Если НЕ ЗначениеЗаполнено(МестоТС.Организация) Тогда
		ОсновнаяОрганизация = уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь, 
		"ОсновнаяОрганизация");
	Иначе
		ОсновнаяОрганизация = МестоТС.Организация;
	КонецЕсли;
	
	НовыйДокумент.Организация      = ОсновнаяОрганизация;
	НовыйДокумент.Ответственный    = Пользователь;
	НовыйДокумент.СпособРемонта    = Перечисления.уатСпособыРемонта.Автосервис;
	НовыйДокумент.СозданВодителем  = Истина;
	НовыйДокумент.Водитель         = ДанныеАвторизации.ФизическоеЛицо;
	НовыйДокумент.СтатусВыполнения = Справочники.уатСтатусы_уэ.Новый;
		
	Попытка
		НовыйДокумент.ДополнительныеСвойства.Вставить("НеУстановливатьПризнакОбновленияМобильногоПриложения", Истина);
		НовыйДокумент.Записать();
	Исключение
		ЗаписатьСообщениеОбОшибке(НСтр("en='ОбработатьМетодAddOrderForRepair';ru='ОбработатьМетодAddOrderForRepair'"), ОписаниеОшибки());
		resultCode = 125;
		Возврат Ложь;
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);
	
	resultCode = 0;
	Возврат Истина;
	
КонецФункции // ОбработатьМетодUpdateOrderForRepair()

#КонецОбласти

#Область ПутевыеЛисты

// Функция предназначена для получения типов заправок для работы мобильного приложения
//
// Параметры:
//  responseData - строка - строка XML, выходные данные, содержимое определяется контекстом выполняемого метода
//  resultCode   - число  - код результата выполнения
//
// Возвращаемое значение:
//   Булево      - истина - метод выполнен успешно;
//               - ложь   - при выполнении метода возникла ошибка
//
Функция ОбработатьМетодGetFuellingTypes(responseData, resultCode, СпособРеализацииВебСервиса)
	
	мЗапрос = Новый Запрос;
	мЗапрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатВидыДвиженияГСМ.Ссылка КАК Ссылка
	|ИЗ
	|	Перечисление.уатВидыДвиженияГСМ КАК уатВидыДвиженияГСМ
	|ГДЕ
	|	(уатВидыДвиженияГСМ.Ссылка = ЗНАЧЕНИЕ(Перечисление.уатВидыДвиженияГСМ.ЗаправкаНаличные)
	|			ИЛИ уатВидыДвиженияГСМ.Ссылка = ЗНАЧЕНИЕ(Перечисление.уатВидыДвиженияГСМ.ЗаправкаПластиковаяКарта)
	|			ИЛИ уатВидыДвиженияГСМ.Ссылка = ЗНАЧЕНИЕ(Перечисление.уатВидыДвиженияГСМ.ЗаправкаСклад))";
	
	Попытка
		responseData = СериализоватьFuellingTypes(мЗапрос.Выполнить().Выгрузить(), СпособРеализацииВебСервиса);
		
	Исключение
		ЗаписатьСообщениеОбОшибке("GetFuellingTypes", ОписаниеОшибки());
		responseData = ПолучитьПустыеВыходныеДанные(СпособРеализацииВебСервиса);
		resultCode = 25;
		
		Возврат Ложь;
	КонецПопытки;
	
	resultCode = 0;
	
	Возврат Истина;
КонецФункции

// Функция предназначена для получения ГСМ для работы мобильного приложения
//
// Параметры:
//  responseData - строка - строка XML, выходные данные, содержимое определяется контекстом выполняемого метода
//  resultCode   - число  - код результата выполнения
//
// Возвращаемое значение:
//   Булево      - истина - метод выполнен успешно;
//               - ложь   - при выполнении метода возникла ошибка
//
Функция ОбработатьМетодGetFuels(Знач requestData, responseData, resultCode, Знач ДанныеАвторизации)
	
	ВидДвиженияГСМ = "";
	
	Если ЗначениеЗаполнено(requestData) Тогда
		ЧтениеXML  = Новый ЧтениеXML;
		Попытка
			ЧтениеXML.УстановитьСтроку(requestData);
			
			Пока ЧтениеXML.Прочитать() Цикл
				Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И НРег(ЧтениеXML.Имя) = НРег("fuellingTypeID") Тогда 
					ЧтениеXML.Прочитать();
					ВидДвиженияГСМ = Строка(ЧтениеXML.Значение);
				КонецЕсли;
			КонецЦикла;
			
		Исключение
			ТекстНСТР = НСтр("en='Error occurred while parsing structures ""requestData"".';ru='Возникла ошибка при разборе структуры ""requestData"".'");
			ЗаписатьСообщениеОбОшибке(НСтр("en='GetFuels';ru='GetFuels'"), ТекстНСТР);
			responseData = "<response/>";
			resultCode = 25;
			
			Возврат Ложь;
		КонецПопытки;
	КонецЕсли;
	
	мсвГруппДляОтбора = Новый Массив;
	Если ВидДвиженияГСМ = "ЗаправкаТалоны" Тогда
		ТекГруппаГСМ = ПредопределенноеЗначение("Перечисление.уатГруппыГСМ.Талон");
		мУчитыватьТЖ = Ложь;
	Иначе	
		ТекГруппаГСМ = ПредопределенноеЗначение("Перечисление.уатГруппыГСМ.Топливо");
		мУчитыватьТЖ = Истина;
	КонецЕсли;
	
	тблВыборка = Новый ТаблицаЗначений;
	тблВыборка.Колонки.Добавить("Номенклатура");
	тблВыборка.Колонки.Добавить("Наименование");
	тблВыборка.Колонки.Добавить("ОсновноеТопливо");
	ТекмсвГСМ = уатЗащищенныеФункцииСервер.СписокГСМдляТССервер(Неопределено, ДанныеАвторизации.ТС, ТекГруппаГСМ, Истина);
	Для Каждого ТекГСМ Из ТекмсвГСМ Цикл
		НоваяСтрока = тблВыборка.Добавить();
		НоваяСтрока.Номенклатура = ТекГСМ.ГСМ;
		НоваяСтрока.Наименование = НоваяСтрока.Номенклатура.Наименование;
		Если ДанныеАвторизации.ТС.Модель.ОсновноеТопливо = НоваяСтрока.Номенклатура Тогда
			НоваяСтрока.ОсновноеТопливо = Истина;
		Иначе
			НоваяСтрока.ОсновноеТопливо = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Если мУчитыватьТЖ Тогда
		Запрос = Новый Запрос("
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	уатНоменклатураГСМ.Номенклатура
		|ИЗ
		|	РегистрСведений.уатНоменклатураГСМ КАК уатНоменклатураГСМ
		|ГДЕ
		|	уатНоменклатураГСМ.ВестиУчетОстатковТЖ");
		тблТЖ = Запрос.Выполнить().Выгрузить();
		Для Каждого ТекСтрока Из тблТЖ Цикл
			Если тблВыборка.Найти(ТекСтрока.Номенклатура, "Номенклатура") = Неопределено Тогда
				НоваяСтрока = тблВыборка.Добавить();
				НоваяСтрока.Номенклатура = ТекСтрока.Номенклатура;
				НоваяСтрока.Наименование = ТекСтрока.Номенклатура.Наименование;
				НоваяСтрока.ОсновноеТопливо = Ложь;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Попытка
		responseData = СериализоватьFuels(тблВыборка);
		
	Исключение
		ЗаписатьСообщениеОбОшибке("GetFuels", ОписаниеОшибки());
		responseData = "<response/>";
		resultCode = 25;
		
		Возврат Ложь;
	КонецПопытки;
	
	resultCode = 0;
	
	Возврат Истина;
КонецФункции

// Функция предназначена для получения ГСМ для работы мобильного приложения
//
// Параметры:
//  responseData - строка - строка XML, выходные данные, содержимое определяется контекстом выполняемого метода
//  resultCode   - число  - код результата выполнения
//
// Возвращаемое значение:
//   Булево      - истина - метод выполнен успешно;
//               - ложь   - при выполнении метода возникла ошибка
//
Функция ОбработатьМетодGetAllFuels(Знач requestData, responseData, resultCode, Знач ДанныеАвторизации, СпособРеализацииВебСервиса)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТС",            ДанныеАвторизации.ТС);
	Запрос.УстановитьПараметр("ТСМодель",      ДанныеАвторизации.ТС.Модель);
	Запрос.УстановитьПараметр("Водитель",      ДанныеАвторизации.ФизическоеЛицо); 
	Запрос.УстановитьПараметр("ГруппаТалон",   ПредопределенноеЗначение("Перечисление.уатГруппыГСМ.Талон"));
	Запрос.УстановитьПараметр("ГруппаТопливо", ПредопределенноеЗначение("Перечисление.уатГруппыГСМ.Топливо"));
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатПользователиМобильногоПриложения_ТС.ТС КАК ТС
	|ПОМЕСТИТЬ втОсновныеТС
	|ИЗ
	|	РегистрСведений.уатПользователиМобильногоПриложения_ТС КАК уатПользователиМобильногоПриложения_ТС
	|ГДЕ
	|	уатПользователиМобильногоПриложения_ТС.Пользователь = &Водитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	уатПутевойЛистПрицепы.ТС.Модель КАК ТСМодель,
	|	уатПутевойЛистПрицепы.ТС КАК ТС
	|ПОМЕСТИТЬ втТС
	|ИЗ
	|	Документ.уатПутевойЛист.Прицепы КАК уатПутевойЛистПрицепы
	|ГДЕ
	|	уатПутевойЛистПрицепы.Ссылка.ТранспортноеСредство = &ТС
	|	И (ВЫБОР
	|				КОГДА ТИПЗНАЧЕНИЯ(уатПутевойЛистПрицепы.Ссылка.Водитель1) = ТИП(Справочник.Сотрудники)
	|					ТОГДА уатПутевойЛистПрицепы.Ссылка.Водитель1.ФизическоеЛицо = &Водитель
	|				ИНАЧЕ уатПутевойЛистПрицепы.Ссылка.Водитель1 = &Водитель
	|			КОНЕЦ
	|			ИЛИ ВЫБОР
	|				КОГДА ТИПЗНАЧЕНИЯ(уатПутевойЛистПрицепы.Ссылка.Водитель2) = ТИП(Справочник.Сотрудники)
	|					ТОГДА уатПутевойЛистПрицепы.Ссылка.Водитель2.ФизическоеЛицо = &Водитель
	|				ИНАЧЕ уатПутевойЛистПрицепы.Ссылка.Водитель2 = &Водитель
	|			КОНЕЦ)
	|	И НЕ уатПутевойЛистПрицепы.Ссылка.ПометкаУдаления
	|	И уатПутевойЛистПрицепы.Ссылка.Проведен
	|	И НЕ уатПутевойЛистПрицепы.Ссылка.Рассчитан
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втОсновныеТС.ТС.Модель,
	|	втОсновныеТС.ТС
	|ИЗ
	|	втОсновныеТС КАК втОсновныеТС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатНоменклатураГСМ.Номенклатура КАК ГСМ,
	|	уатНоменклатураГСМ.ГСМТалона КАК ГСМТалона,
	|	уатНоменклатураГСМ.ЛитровыйТалон КАК Литровый,
	|	уатНоменклатураГСМ.НоминалТалона КАК Номинал,
	|	&ГруппаТалон КАК Группа,
	|	ВсеГСММоделиТС.ТС КАК ТС
	|ИЗ
	|	РегистрСведений.уатНоменклатураГСМ КАК уатНоменклатураГСМ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			уатМоделиТС.ОсновноеТопливо КАК МодельОсновноеТопливо,
	|			уатМоделиТС.ДополнительноеТопливо КАК МодельДополнительноеТопливо,
	|			уатАналогиГСМ.Аналог КАК Аналог,
	|			втТС.ТС КАК ТС
	|		ИЗ
	|			втТС КАК втТС
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.уатМоделиТС КАК уатМоделиТС
	|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уатАналогиГСМ КАК уатАналогиГСМ
	|					ПО (уатМоделиТС.ОсновноеТопливо = уатАналогиГСМ.ГСМ.Ссылка
	|							ИЛИ уатМоделиТС.ДополнительноеТопливо = уатАналогиГСМ.ГСМ.Ссылка)
	|				ПО втТС.ТСМодель = уатМоделиТС.Ссылка) КАК ВсеГСММоделиТС
	|		ПО (уатНоменклатураГСМ.ГСМТалона = ВсеГСММоделиТС.МодельОсновноеТопливо
	|				ИЛИ уатНоменклатураГСМ.ГСМТалона = ВсеГСММоделиТС.МодельДополнительноеТопливо
	|				ИЛИ уатНоменклатураГСМ.ГСМТалона = ВсеГСММоделиТС.Аналог)
	|ГДЕ
	|	уатНоменклатураГСМ.ГруппаГСМ = &ГруппаТалон
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	уатНоменклатураГСМ.Номенклатура,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	&ГруппаТопливо,
	|	ВложенныйЗапрос.ТС
	|ИЗ
	|	РегистрСведений.уатНоменклатураГСМ КАК уатНоменклатураГСМ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			уатМоделиТС.ОсновноеТопливо КАК МодельОсновноеТопливо,
	|			уатМоделиТС.ДополнительноеТопливо КАК МодельДополнительноеТопливо,
	|			втТС.ТС КАК ТС
	|		ИЗ
	|			втТС КАК втТС
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.уатМоделиТС КАК уатМоделиТС
	|				ПО втТС.ТСМодель = уатМоделиТС.Ссылка) КАК ВложенныйЗапрос
	|		ПО (уатНоменклатураГСМ.Номенклатура = ВложенныйЗапрос.МодельОсновноеТопливо
	|				ИЛИ уатНоменклатураГСМ.Номенклатура = ВложенныйЗапрос.МодельДополнительноеТопливо)
	|ГДЕ
	|	уатНоменклатураГСМ.ГруппаГСМ = &ГруппаТопливо";
	
	РезультатТаблица = Запрос.Выполнить().Выгрузить();
	ТабАналогов = уатОбщегоНазначения.уатПолучитьАналогиГСМ(РезультатТаблица, ПредопределенноеЗначение("Перечисление.уатГруппыГСМ.Топливо"));
	
	Для Каждого ТекСтрока Из ТабАналогов Цикл
		Если РезультатТаблица.НайтиСтроки(Новый Структура("ТС, ГСМ", ТекСтрока.ТС, ТекСтрока.Аналог)).Количество() <> 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = РезультатТаблица.Добавить();
		НоваяСтрока.ГСМ       = ТекСтрока.Аналог;
		НоваяСтрока.ТС        = ТекСтрока.ТС;
	КонецЦикла;

	тблВыборка = Новый ТаблицаЗначений;
	тблВыборка.Колонки.Добавить("ТипЗаправки");
	тблВыборка.Колонки.Добавить("ТС");
	тблВыборка.Колонки.Добавить("Номенклатура");
	тблВыборка.Колонки.Добавить("Наименование");
	тблВыборка.Колонки.Добавить("ОсновноеТопливо");

	Для Каждого ТекГСМ Из РезультатТаблица Цикл
		НоваяСтрока = тблВыборка.Добавить();
		НоваяСтрока.ТС           = ТекГСМ.ТС;
		НоваяСтрока.ТипЗаправки  = ?(ТекГСМ.Группа = ПредопределенноеЗначение("Перечисление.уатГруппыГСМ.Талон"),
			Перечисления.уатВидыДвиженияГСМ.ЗаправкаТалоны, Перечисления.уатВидыДвиженияГСМ.ПустаяСсылка());
		НоваяСтрока.Номенклатура = ТекГСМ.ГСМ;
		НоваяСтрока.Наименование = НоваяСтрока.Номенклатура.Наименование;
		Если ТекГСМ.ТС.Модель.ОсновноеТопливо = НоваяСтрока.Номенклатура Тогда
			НоваяСтрока.ОсновноеТопливо = Истина;
		Иначе
			НоваяСтрока.ОсновноеТопливо = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Попытка
		responseData = СериализоватьAllFuels(тблВыборка, СпособРеализацииВебСервиса);
		
	Исключение
		ЗаписатьСообщениеОбОшибке("GetAllFuels", ОписаниеОшибки());
		responseData = ПолучитьПустыеВыходныеДанные(СпособРеализацииВебСервиса);
		resultCode = 25;
		
		Возврат Ложь;
	КонецПопытки;
	
	resultCode = 0;
	
	Возврат Истина;
КонецФункции

// Функция предназначена для получения ГСМ для работы мобильного приложения
//
// Параметры:
//  responseData - строка - строка XML, выходные данные, содержимое определяется контекстом выполняемого метода
//  resultCode   - число  - код результата выполнения
//
// Возвращаемое значение:
//   Булево      - истина - метод выполнен успешно;
//               - ложь   - при выполнении метода возникла ошибка
//
Функция ОбработатьМетодGetFuelCards(Знач requestData, responseData, resultCode, Знач ДанныеАвторизации)
	
	КемВыдана = Неопределено;
	Дата      = Неопределено;
	
	Если ЗначениеЗаполнено(requestData) Тогда
		ЧтениеXML  = Новый ЧтениеXML;
		флОшибка   = Ложь;
		Попытка
			ЧтениеXML.УстановитьСтроку(requestData);
			
			Пока ЧтениеXML.Прочитать() Цикл
				Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И НРег(ЧтениеXML.Имя) = НРег("IssuedBy") Тогда 
					ЧтениеXML.Прочитать();
					КемВыдана = Строка(ЧтениеXML.Значение);
				ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И НРег(ЧтениеXML.Имя) = НРег("Date") Тогда 
					ЧтениеXML.Прочитать();
					Дата = ДесериализоватьДатаВремя(ЧтениеXML.Значение, флОшибка);
					Если флОшибка Тогда 
						ВызватьИсключение НСтр("en='Error deserializing a Date field';ru='Ошибка десериализации поля Date'");
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
		Исключение
			ТекстНСТР = НСтр("en='Error occurred while parsing structures ""requestData"".';ru='Возникла ошибка при разборе структуры ""requestData"".'");
			ЗаписатьСообщениеОбОшибке(НСтр("en='GetFuels';ru='GetFuels'"), ТекстНСТР);
			responseData = "<response/>";
			resultCode = 25;
			
			Возврат Ложь;
		КонецПопытки;
	КонецЕсли;
	
	ВладельцыКарт = Новый Массив();
	ВладельцыКарт.Добавить(ДанныеАвторизации.ТС);
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Сотрудники.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Сотрудники КАК Сотрудники
	               |ГДЕ
	               |	Сотрудники.ФизическоеЛицо = &ФизическоеЛицо
	               |	И НЕ Сотрудники.ПометкаУдаления";
	Запрос.УстановитьПараметр("ФизическоеЛицо", ДанныеАвторизации.ФизическоеЛицо);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ВладельцыКарт.Добавить(Выборка.Ссылка);
	КонецЦикла;

	КемВыданаСсылка = Неопределено;
	Попытка
		КемВыданаСсылка = Справочники.уатАЗС.ПолучитьСсылку(КемВыдана);
	Исключение
		Попытка
			КемВыданаСсылка = Справочники.Контрагенты.ПолучитьСсылку(КемВыдана);
		Исключение
			КемВыданаСсылка = Неопределено;
		КонецПопытки;
	КонецПопытки;
	
	СписокТК = уатОбщегоНазначения.уатСписокТопливныхКарт(ВладельцыКарт,Дата, КемВыданаСсылка);
	Попытка
		responseData = СериализоватьFuelCards(СписокТК);
		
	Исключение
		ЗаписатьСообщениеОбОшибке("GetFuelCards", ОписаниеОшибки());
		responseData = "<response/>";
		resultCode = 25;
		
		Возврат Ложь;
	КонецПопытки;
	
	resultCode = 0;
	
	Возврат Истина;
КонецФункции

// Функция предназначена для получения ГСМ для работы мобильного приложения
//
// Параметры:
//  responseData - строка - строка XML, выходные данные, содержимое определяется контекстом выполняемого метода
//  resultCode   - число  - код результата выполнения
//
// Возвращаемое значение:
//   Булево      - истина - метод выполнен успешно;
//               - ложь   - при выполнении метода возникла ошибка
//
Функция ОбработатьМетодGetAllFuelCards(Знач requestData, responseData, resultCode, Знач ДанныеАвторизации, СпособРеализацииВебСервиса)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТС",            ДанныеАвторизации.ТС);
	Запрос.УстановитьПараметр("Водитель",      ДанныеАвторизации.ФизическоеЛицо); 
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатПользователиМобильногоПриложения_ТС.ТС КАК ТС
	|ПОМЕСТИТЬ втОсновныеТС
	|ИЗ
	|	РегистрСведений.уатПользователиМобильногоПриложения_ТС КАК уатПользователиМобильногоПриложения_ТС
	|ГДЕ
	|	уатПользователиМобильногоПриложения_ТС.Пользователь = &Водитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	уатПутевойЛистПрицепы.ТС КАК ТС
	|ИЗ
	|	Документ.уатПутевойЛист.Прицепы КАК уатПутевойЛистПрицепы
	|ГДЕ
	|	уатПутевойЛистПрицепы.Ссылка.ТранспортноеСредство = &ТС
	|	И (ВЫБОР
	|				КОГДА ТИПЗНАЧЕНИЯ(уатПутевойЛистПрицепы.Ссылка.Водитель1) = ТИП(Справочник.Сотрудники)
	|					ТОГДА уатПутевойЛистПрицепы.Ссылка.Водитель1.ФизическоеЛицо = &Водитель
	|				ИНАЧЕ уатПутевойЛистПрицепы.Ссылка.Водитель1 = &Водитель
	|			КОНЕЦ
	|			ИЛИ ВЫБОР
	|				КОГДА ТИПЗНАЧЕНИЯ(уатПутевойЛистПрицепы.Ссылка.Водитель2) = ТИП(Справочник.Сотрудники)
	|					ТОГДА уатПутевойЛистПрицепы.Ссылка.Водитель2.ФизическоеЛицо = &Водитель
	|				ИНАЧЕ уатПутевойЛистПрицепы.Ссылка.Водитель2 = &Водитель
	|			КОНЕЦ)
	|	И НЕ уатПутевойЛистПрицепы.Ссылка.ПометкаУдаления
	|	И уатПутевойЛистПрицепы.Ссылка.Проведен
	|	И НЕ уатПутевойЛистПрицепы.Ссылка.Рассчитан
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втОсновныеТС.ТС
	|ИЗ
	|	втОсновныеТС КАК втОсновныеТС
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	уатСоставТС.ТС
	|ИЗ
	|	втОсновныеТС КАК втОсновныеТС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уатСоставТС КАК уатСоставТС
	|		ПО (втОсновныеТС.ТС = уатСоставТС.ВСоставе
	|				И НЕ уатСоставТС.ТС.ПометкаУдаления)
	|ГДЕ
	|	(уатСоставТС.ТС.ВидМоделиТС = ЗНАЧЕНИЕ(Перечисление.уатВидыМоделейТС.Прицеп)
	|			ИЛИ уатСоставТС.ТС.ВидМоделиТС = ЗНАЧЕНИЕ(Перечисление.уатВидыМоделейТС.Оборудование))
	|	И ВЫБОР
	|			КОГДА уатСоставТС.ТС.ПринадлежностьТС = ЗНАЧЕНИЕ(Перечисление.уатПринадлежностьТС.Привлеченное)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ уатСоставТС.ТС.ДатаВыбытия = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|					И НЕ уатСоставТС.ТС.ДатаВводаВЭксплуатацию = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|		КОНЕЦ";
	
	ВладельцыКарт = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ТС");
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Сотрудники.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Сотрудники КАК Сотрудники
	               |ГДЕ
	               |	Сотрудники.ФизическоеЛицо = &ФизическоеЛицо
	               |	И НЕ Сотрудники.ПометкаУдаления";
	Запрос.УстановитьПараметр("ФизическоеЛицо", ДанныеАвторизации.ФизическоеЛицо);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ВладельцыКарт.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	СписокТК = уатОбщегоНазначения.уатСписокТопливныхКарт(ВладельцыКарт);
	Попытка
		responseData = СериализоватьAllFuelCards(СписокТК, ДанныеАвторизации.ТС, СпособРеализацииВебСервиса);
		
	Исключение
		ЗаписатьСообщениеОбОшибке("GetAllFuelCards", ОписаниеОшибки());
		responseData = ПолучитьПустыеВыходныеДанные(СпособРеализацииВебСервиса);
		resultCode = 25;
		
		Возврат Ложь;
	КонецПопытки;
	
	resultCode = 0;
	
	Возврат Истина;
КонецФункции

// Функция предназначена для получения АЗС для работы мобильного приложения
//
// Параметры:
//  responseData - строка - строка XML, выходные данные, содержимое определяется контекстом выполняемого метода
//  resultCode   - число  - код результата выполнения
//
// Возвращаемое значение:
//   Булево      - истина - метод выполнен успешно;
//               - ложь   - при выполнении метода возникла ошибка
//
Функция ОбработатьМетодGetGasStations(Знач requestData, responseData, resultCode, Знач ДанныеАвторизации, СпособРеализацииВебСервиса)
	
	Если СпособРеализацииВебСервиса = Перечисления.уатСпособыРеализацииВебСервиса.REST Тогда
		ВидДвиженияГСМ = уатМобильноеПриложениеВодителяСерверREST.ДесериализоватьGetGasStations(requestData);
	Иначе
		ВидДвиженияГСМ = уатМобильноеПриложениеВодителяСерверSOAP.ДесериализоватьGetGasStations(requestData);
	КонецЕсли;
	
	Если ВидДвиженияГСМ = "ЗаправкаСклад"
		ИЛИ ВидДвиженияГСМ = "ЗаправкаПластиковаяКартаСклад"
		ИЛИ ВидДвиженияГСМ = "ЗаправкаТалоны" Тогда
		ЭтоАЗССклад = Истина;
	Иначе
		ЭтоАЗССклад = Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ЭтоАЗССклад", ЭтоАЗССклад);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	уатАЗС.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.уатАЗС КАК уатАЗС
	               |ГДЕ
	               |	уатАЗС.ЭтоАЗССклад = &ЭтоАЗССклад
	               |	И НЕ уатАЗС.ПометкаУдаления";
	
	Попытка
		responseData = СериализоватьGasStations(Запрос.Выполнить().Выгрузить(), СпособРеализацииВебСервиса);
		
	Исключение
		ЗаписатьСообщениеОбОшибке("GetGasStations", ОписаниеОшибки());
		responseData = ПолучитьПустыеВыходныеДанные(СпособРеализацииВебСервиса);
		resultCode = 25;
		
		Возврат Ложь;
	КонецПопытки;
	
	resultCode = 0;
	
	Возврат Истина;
КонецФункции

// Функция предназначена для получения путевых листов для работы мобильного приложения
//
// Параметры:
//  responseData - строка - строка XML, выходные данные, содержимое определяется контекстом выполняемого метода
//  resultCode   - число  - код результата выполнения
//
// Возвращаемое значение:
//   Булево      - истина - метод выполнен успешно;
//               - ложь   - при выполнении метода возникла ошибка
//
Функция ОбработатьМетодGetWaybills(responseData, resultCode, Знач ДанныеАвторизации, СпособРеализацииВебСервиса)
	
	мЗапрос = Новый Запрос;
	мЗапрос.УстановитьПараметр("ТС",              ДанныеАвторизации.ТС);
	мЗапрос.УстановитьПараметр("Водитель",        ДанныеАвторизации.ФизическоеЛицо);
	
	флЭД  = ПолучитьФункциональнуюОпцию("ИспользоватьОбменЭД");
	Если флЭД Тогда
		мЗапрос.УстановитьПараметр("ЭПЛ_Титул1",  Перечисления.ТипыЭлементовРегламентаЭДО.ЭПЛ_Титул1); 
	Иначе
		мЗапрос.УстановитьПараметр("ЭПЛ_Титул1",  "");
	КонецЕсли;
	мЗапрос.УстановитьПараметр("ЭПЛ_НомерВерсии", 0);
	мЗапрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатПутевойЛист.Ссылка КАК Ссылка,
	|	уатПутевойЛист.ЗакрытВодителем КАК ЗакрытВодителем,
	|	уатПутевойЛист.Номер КАК Номер,
	|	уатПутевойЛист.ДатаВыезда КАК ДатаВыезда,
	|	уатПутевойЛист.ДатаВозвращения КАК ДатаВозвращения,
	|	ВЫБОР
	|		КОГДА уатПутевойЛист.ТранспортноеСредство.ГосударственныйНомер <> """"
	|			ТОГДА уатПутевойЛист.ТранспортноеСредство.ГосударственныйНомер
	|		ИНАЧЕ уатПутевойЛист.ТранспортноеСредство.Наименование
	|	КОНЕЦ КАК ТСНаименование,
	|	уатПутевойЛист.ВидПЛ КАК ВидПЛ,
	|	уатПутевойЛист.СпидометрВыезда КАК СпидометрВыезда,
	|	уатПутевойЛист.СпидометрВозвращения КАК СпидометрВозвращения,
	|	уатПутевойЛист.ТранспортноеСредство.Модель КАК ТранспортноеСредствоМодель,
	|	уатПутевойЛист.ТранспортноеСредство.Модель.ОсновноеТопливо КАК ТранспортноеСредствоМодельОсновноеТопливо,
	|	ЕСТЬNULL(уатЗаправкаГСМЗаправки.Ссылка, ЗНАЧЕНИЕ(Документ.уатЗаправкаГСМ.ПустаяСсылка)) КАК Заправка,
	|	ЕСТЬNULL(уатЗаправкаГСМЗаправки.ТС, ЗНАЧЕНИЕ(Справочник.уатТС.ПустаяСсылка)) КАК ЗаправкаТС,
	|	ВЫБОР
	|		КОГДА уатЗаправкаГСМЗаправки.ТС.ГосударственныйНомер <> """"
	|			ТОГДА уатЗаправкаГСМЗаправки.ТС.ГосударственныйНомер
	|		ИНАЧЕ уатЗаправкаГСМЗаправки.ТС.Наименование
	|	КОНЕЦ КАК ЗаправкаТСНаименование,
	|	ЕСТЬNULL(уатЗаправкаГСМЗаправки.Ссылка.АЗС, ЗНАЧЕНИЕ(Справочник.уатАЗС.ПустаяСсылка)) КАК АЗС,
	|	ЕСТЬNULL(уатЗаправкаГСМЗаправки.Ссылка.ВидДвиженияГСМ, """") КАК ВидДвиженияГСМ,
	|	ЕСТЬNULL(уатЗаправкаГСМЗаправки.ГСМ, """") КАК ГСМ,
	|	ЕСТЬNULL(уатЗаправкаГСМЗаправки.Дата, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаЗаправки,
	|	ЕСТЬNULL(уатЗаправкаГСМЗаправки.ПластиковаяКарта, """") КАК ПластиковаяКарта,
	|	ЕСТЬNULL(уатЗаправкаГСМЗаправки.Количество, 0) КАК Количество,
	|	ЕСТЬNULL(уатЗаправкаГСМЗаправки.Сумма, 0) КАК Сумма,
	|	ЕСТЬNULL(уатЗаправкаГСМЗаправки.СтавкаНДС, 0) КАК СтавкаНДС,
	|	ЕСТЬNULL(уатЗаправкаГСМЗаправки.СуммаНДС, 0) КАК СуммаНДС,
	|	ЕСТЬNULL(уатЗаправкаГСМЗаправки.Ссылка.УчитыватьНДС, ЛОЖЬ) КАК УчитыватьНДС,
	|	ЕСТЬNULL(уатЗаправкаГСМЗаправки.Ссылка.СуммаВключаетНДС, ЛОЖЬ) КАК СуммаВключаетНДС,
	|	&Водитель КАК Водитель,
	|	ЕСТЬNULL(уатЗаправкаГСМЗаправки.НомерСтроки, 0) КАК НомерСтроки,
	|	уатПутевойЛист.ВыдатьКоличествоГорючего КАК ВыдатьКоличествоГорючего,
	|	уатПутевойЛист.ТранспортноеСредство КАК ТС,
	|	ВложенныйЗапрос.ЭПД КАК ЭПД,
	|	ЕСТЬNULL(уатСвязанныеДокументыЭПД.QR, """") КАК QR,
	|	ЗначенияРеквизитовДокументовЭПД.ЗначениеРеквизита КАК ТитулОформлениеДатаОкончанияСрокаИспользованияПутевогоЛиста,
	|	ЗначенияРеквизитовДокументовЭПД1.ЗначениеРеквизита КАК ТитулОформлениеДатаВТечениеКоторойПутевойЛистМожетБытьИспользован,
	|	уатПутевойЛист.ОбязательныйПослерейсовыйМедосмотр КАК ОбязательныйПослерейсовыйМедосмотр
	|ИЗ
	|	Документ.уатПутевойЛист КАК уатПутевойЛист
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уатЗаправкаГСМ.Заправки КАК уатЗаправкаГСМЗаправки
	|		ПО уатПутевойЛист.Ссылка = уатЗаправкаГСМЗаправки.ПутевойЛист
	|			И (НЕ уатЗаправкаГСМЗаправки.Ссылка.ПометкаУдаления)
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			МАКСИМУМ(уатСвязанныеДокументыЭПД.ЭПД) КАК ЭПД,
	|			уатСвязанныеДокументыЭПД.Рейс КАК Рейс
	|		ИЗ
	|			РегистрСведений.уатСвязанныеДокументыЭПД КАК уатСвязанныеДокументыЭПД
	|		ГДЕ
	|			ТИПЗНАЧЕНИЯ(уатСвязанныеДокументыЭПД.ЭПД) = ТИП(Документ.ЭлектронныйПутевойЛист)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			уатСвязанныеДокументыЭПД.Рейс) КАК ВложенныйЗапрос
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уатСвязанныеДокументыЭПД КАК уатСвязанныеДокументыЭПД
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияРеквизитовДокументовЭПД КАК ЗначенияРеквизитовДокументовЭПД
	|				ПО уатСвязанныеДокументыЭПД.ЭПД = ЗначенияРеквизитовДокументовЭПД.Документ
	|					И (ЗначенияРеквизитовДокументовЭПД.Титул = &ЭПЛ_Титул1)
	|					И (ЗначенияРеквизитовДокументовЭПД.НомерВерсии = &ЭПЛ_НомерВерсии)
	|					И (ЗначенияРеквизитовДокументовЭПД.ИмяРеквизита = ""ТитулОформлениеДатаОкончанияСрокаИспользованияПутевогоЛиста"")
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияРеквизитовДокументовЭПД КАК ЗначенияРеквизитовДокументовЭПД1
	|				ПО уатСвязанныеДокументыЭПД.ЭПД = ЗначенияРеквизитовДокументовЭПД1.Документ
	|					И (ЗначенияРеквизитовДокументовЭПД1.Титул = &ЭПЛ_Титул1)
	|					И (ЗначенияРеквизитовДокументовЭПД1.НомерВерсии = &ЭПЛ_НомерВерсии)
	|					И (ЗначенияРеквизитовДокументовЭПД1.ИмяРеквизита = ""ТитулОформлениеДатаВТечениеКоторойПутевойЛистМожетБытьИспользован"")
	|			ПО ВложенныйЗапрос.ЭПД = уатСвязанныеДокументыЭПД.ЭПД
	|				И ВложенныйЗапрос.Рейс = уатСвязанныеДокументыЭПД.Рейс
	|		ПО уатПутевойЛист.Ссылка = ВложенныйЗапрос.Рейс
	|ГДЕ
	|	уатПутевойЛист.ТранспортноеСредство = &ТС
	|	И (ВЫБОР
	|				КОГДА ТИПЗНАЧЕНИЯ(уатПутевойЛист.Водитель1) = ТИП(Справочник.Сотрудники)
	|					ТОГДА уатПутевойЛист.Водитель1.ФизическоеЛицо = &Водитель
	|				ИНАЧЕ уатПутевойЛист.Водитель1 = &Водитель
	|			КОНЕЦ
	|			ИЛИ ВЫБОР
	|				КОГДА ТИПЗНАЧЕНИЯ(уатПутевойЛист.Водитель2) = ТИП(Справочник.Сотрудники)
	|					ТОГДА уатПутевойЛист.Водитель2.ФизическоеЛицо = &Водитель
	|				ИНАЧЕ уатПутевойЛист.Водитель2 = &Водитель
	|			КОНЕЦ)
	|	И НЕ уатПутевойЛист.ПометкаУдаления
	|	И уатПутевойЛист.Проведен
	|	И НЕ уатПутевойЛист.Рассчитан
	|	И НЕ уатПутевойЛист.ОтменаРейса = ИСТИНА
	|ИТОГИ
	|	МАКСИМУМ(ЗакрытВодителем),
	|	МАКСИМУМ(Номер),
	|	МАКСИМУМ(ДатаВыезда),
	|	МАКСИМУМ(ДатаВозвращения),
	|	МАКСИМУМ(ВидПЛ),
	|	МАКСИМУМ(СпидометрВыезда),
	|	МАКСИМУМ(СпидометрВозвращения),
	|	МАКСИМУМ(ТранспортноеСредствоМодель),
	|	МАКСИМУМ(Водитель),
	|	МАКСИМУМ(ВыдатьКоличествоГорючего),
	|	МАКСИМУМ(ЭПД),
	|	МАКСИМУМ(ТитулОформлениеДатаОкончанияСрокаИспользованияПутевогоЛиста),
	|	МАКСИМУМ(ТитулОформлениеДатаВТечениеКоторойПутевойЛистМожетБытьИспользован)
	|ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	уатПутевойЛистПрицепы.Ссылка КАК Ссылка,
	|	уатПутевойЛистПрицепы.ТС КАК ТС,
	|	уатПутевойЛистПрицепы.ТС.Модель.НаличиеТопливногоБака КАК НаличиеТопливногоБака,
	|	ВЫБОР
	|		КОГДА уатПутевойЛистПрицепы.ТС.ГосударственныйНомер <> """"
	|			ТОГДА уатПутевойЛистПрицепы.ТС.ГосударственныйНомер
	|		ИНАЧЕ уатПутевойЛистПрицепы.ТС.Наименование
	|	КОНЕЦ КАК ТСНаименование
	|ИЗ
	|	Документ.уатПутевойЛист.Прицепы КАК уатПутевойЛистПрицепы
	|ГДЕ
	|	уатПутевойЛистПрицепы.Ссылка.ТранспортноеСредство = &ТС
	|	И (ВЫБОР
	|				КОГДА ТИПЗНАЧЕНИЯ(уатПутевойЛистПрицепы.Ссылка.Водитель1) = ТИП(Справочник.Сотрудники)
	|					ТОГДА уатПутевойЛистПрицепы.Ссылка.Водитель1.ФизическоеЛицо = &Водитель
	|				ИНАЧЕ уатПутевойЛистПрицепы.Ссылка.Водитель1 = &Водитель
	|			КОНЕЦ
	|			ИЛИ ВЫБОР
	|				КОГДА ТИПЗНАЧЕНИЯ(уатПутевойЛистПрицепы.Ссылка.Водитель2) = ТИП(Справочник.Сотрудники)
	|					ТОГДА уатПутевойЛистПрицепы.Ссылка.Водитель2.ФизическоеЛицо = &Водитель
	|				ИНАЧЕ уатПутевойЛистПрицепы.Ссылка.Водитель2 = &Водитель
	|			КОНЕЦ)
	|	И НЕ уатПутевойЛистПрицепы.Ссылка.ПометкаУдаления
	|	И уатПутевойЛистПрицепы.Ссылка.Проведен
	|	И НЕ уатПутевойЛистПрицепы.Ссылка.Рассчитан
	|	И НЕ уатПутевойЛистПрицепы.Ссылка.ОтменаРейса = ИСТИНА";
	
	Попытка 
		МассивРезультатов  = мЗапрос.ВыполнитьПакет();
		ВыборкаПрицепов    = МассивРезультатов[1].Выбрать();
		СоответвиеПрицепов = Новый Соответствие();
		Пока ВыборкаПрицепов.Следующий() Цикл 
			МассивПрицепов  = Новый Массив();
			СтруктураДанных = Новый Структура("ТС, ТСНаименование, НаличиеТопливногоБака");
			ЗаполнитьЗначенияСвойств(СтруктураДанных, ВыборкаПрицепов);
			МассивПрицепов.Добавить(СтруктураДанных);
			
			ТекМассивПрицепов = СоответвиеПрицепов.Получить(ВыборкаПрицепов.Ссылка);
			Если ТекМассивПрицепов = Неопределено Тогда
				СоответвиеПрицепов.Вставить(ВыборкаПрицепов.Ссылка, МассивПрицепов);
			Иначе
				ТекМассивПрицепов.Добавить(СтруктураДанных);  
				СоответвиеПрицепов.Вставить(ВыборкаПрицепов.Ссылка, ТекМассивПрицепов);
			КонецЕсли;
			
		КонецЦикла;
		
		responseData = СериализоватьWaybills(МассивРезультатов[0].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам), СоответвиеПрицепов, СпособРеализацииВебСервиса);
	Исключение
		ЗаписатьСообщениеОбОшибке("GetWaybills", ОписаниеОшибки());
		responseData = ПолучитьПустыеВыходныеДанные(СпособРеализацииВебСервиса);
		resultCode = 25;
		
		Возврат Ложь;
	КонецПопытки;
	
	Если НЕ СпособРеализацииВебСервиса = Перечисления.уатСпособыРеализацииВебСервиса.REST Тогда
		УстановитьПризнакОтправлено(ДанныеАвторизации.ФизическоеЛицо, ДанныеАвторизации.ТС,, Истина);
	КонецЕсли;
	resultCode = 0;
	
	Возврат Истина;
КонецФункции

// Функция предназначена для получения путевых листов для работы мобильного приложения
//
// Параметры:
//  responseData - строка - строка XML, выходные данные, содержимое определяется контекстом выполняемого метода
//  resultCode   - число  - код результата выполнения
//
// Возвращаемое значение:
//   Булево      - истина - метод выполнен успешно;
//               - ложь   - при выполнении метода возникла ошибка
//
Функция ОбработатьМетодUpdateWaybill(Знач requestData, responseData, resultCode, Знач ДанныеАвторизации, СпособРеализацииВебСервиса)
	
	responseData = ПолучитьПустыеВыходныеДанные(СпособРеализацииВебСервиса);
	
	флОшибка = Ложь;
	
	ДанныеПЛ = ДесериализоватьUpdateWaybill(requestData, флОшибка, СпособРеализацииВебСервиса);
	
	Если флОшибка Тогда 
		resultCode = 29999;
		Возврат Ложь;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	Попытка
		ДокОбъект  = ДанныеПЛ.Ссылка.ПолучитьОбъект();
	Исключение
		ЗаписатьСообщениеОбОшибке(НСтр("en='ОбработатьМетодUpdateWaybill';ru='ОбработатьМетодUpdateWaybill'"), ОписаниеОшибки());
		resultCode = 29999;
		Возврат Ложь;
	КонецПопытки;
	
	Если ДокОбъект = Неопределено Тогда 
		ЗаписатьСообщениеОбОшибке(НСтр("en='ОбработатьМетодUpdateWaybill';ru='ОбработатьМетодUpdateWaybill'"), ОписаниеОшибки());
		resultCode = 126;
		Возврат Ложь;
	КонецЕсли;
	
	Если ДокОбъект.ЗакрытВодителем 
		ИЛИ ДокОбъект.ОтменаРейса Тогда
		resultCode = 0;
		Возврат Истина;
	КонецЕсли;

	ДокОбъект.ДатаВыезда           = ДанныеПЛ.ДатаВыезда;
	ДокОбъект.ДатаВозвращения      = ДанныеПЛ.ДатаВозвращения;
	ДокОбъект.СпидометрВозвращения = ДанныеПЛ.СпидометрВозвращения;
	ДокОбъект.ЗакрытВодителем      = ДанныеПЛ.ЗакрытВодителем;
	
	ДокОбъект.ДатаЗакрытия = ?(ДокОбъект.ДатаВозвращения > ДокОбъект.ДатаВыезда, ДокОбъект.ДатаВозвращения - 1, ДокОбъект.ДатаВозвращения);
	
	ОснТопливо = ДокОбъект.ТранспортноеСредство.Модель.ОсновноеТопливо;
	Для Каждого ТекСтрока Из ДокОбъект.РасходГСМ Цикл
		Если ДокОбъект.ТранспортноеСредство = ТекСтрока.ТС И ОснТопливо = ТекСтрока.ГСМ Тогда
			ТекСтрока.ОстатокПриВозвращении	 = ДанныеПЛ.ОстатокТопливаВозврат;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	НомерПрицепа = 0;
	Для Каждого ТекПрицеп Из ДанныеПЛ.Прицепы Цикл
		Если ДокОбъект.Прицепы.НайтиСтроки(Новый Структура("ТС", ТекПрицеп.vehicle)).Количество() <> 0 Тогда
			НомерПрицепа = НомерПрицепа + 1;
			Продолжить;
		КонецЕсли;
		НоваяСтрока    = ДокОбъект.Прицепы.Добавить();
		НоваяСтрока.ТС = ТекПрицеп.vehicle;  
		
		ИнициализацияДанныхПрицепа(ДокОбъект, НоваяСтрока.ТС, НомерПрицепа);
        НомерПрицепа = НомерПрицепа + 1;
	КонецЦикла;
	
	Для Каждого ТекЗаправка Из ДанныеПЛ.Заправки Цикл
		Если ЗначениеЗаполнено(ТекЗаправка.fuellingNewID)
			ИЛИ ЗначениеЗаполнено(ТекЗаправка.fuellingID) Тогда 
			Если ЗначениеЗаполнено(ТекЗаправка.fuellingNewID) Тогда
				fuellingID = ТекЗаправка.fuellingNewID;
			Иначе
				fuellingID = ТекЗаправка.fuellingID;
			КонецЕсли;
			Попытка
				Заправка = fuellingID.ПолучитьОбъект();
			Исключение
				ЗаписатьСообщениеОбОшибке(НСтр("en='ОбработатьМетодUpdateWaybill';ru='ОбработатьМетодUpdateWaybill'"), ОписаниеОшибки());
				resultCode = 29999;
				Возврат Ложь;
			КонецПопытки;
			Если Заправка = Неопределено Тогда 
				Заправка = Документы.уатЗаправкаГСМ.СоздатьДокумент(); 
				Заправка.Заполнить(Неопределено);
				Заправка.УстановитьСсылкуНового(fuellingID);
				Заправка.Дата = ТекЗаправка.fuellingDate;
			КонецЕсли;
		Иначе
			Заправка = Документы.уатЗаправкаГСМ.СоздатьДокумент(); 
			Заправка.Заполнить(Неопределено);
			Заправка.Дата = ТекЗаправка.fuellingDate;
		КонецЕсли;
		
		Заправка.АЗС = ТекЗаправка.gasStationID;
		
		Контрагент_Склад = уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Заправка.АЗС, "Контрагент_Склад");
		Если ТипЗнч(Контрагент_Склад) = Тип("СправочникСсылка.Контрагенты") Тогда
			Если Заправка.ДоговорКонтрагента.Владелец <> Контрагент_Склад Тогда
				Заправка.ДоговорКонтрагента = уатЗаполнениеДокументов.ПолучитьОсновнойДоговорКонтрагента(Контрагент_Склад, "СПоставщиком", ДокОбъект.Организация);
			КонецЕсли;
		КонецЕсли;
		
		Заправка.ВидДвиженияГСМ	 = ТекЗаправка.fuellingTypeID;
		Заправка.ПризнакРедактированияИзПутевогоЛиста = Истина;
		Заправка.ПризнакРедактированияИзПутевогоЛистаСсылка = ДокОбъект.Ссылка;
		Заправка.Организация = ДокОбъект.Организация;
		Если ЗначениеЗаполнено(ДокОбъект.ТранспортноеСредство) Тогда
			Колонна = уатОбщегоНазначения.МестонахождениеТС(ДокОбъект.ТранспортноеСредство, ДокОбъект.ДатаВыезда).Колонна;
		КонецЕсли;
		Заправка.Ответственный = ПользователиКлиентСервер.АвторизованныйПользователь();
		
		Заправка.ПодразделениеОрганизации = ДокОбъект.Подразделение;
			
		Заправка.УчитыватьНДС = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(Заправка.Организация,
		ПланыВидовХарактеристик.уатПраваИНастройки.УчитыватьНДС);
		Заправка.СуммаВключаетНДС = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(Заправка.Организация,
		ПланыВидовХарактеристик.уатПраваИНастройки.СуммаВключаетНДС);
		
		Если ЗначениеЗаполнено(Заправка.Ссылка) Тогда
			НайдЗаправки = Заправка.Заправки.НайтиСтроки(Новый Структура("ПутевойЛист, НомерСтроки", ДокОбъект.Ссылка, ТекЗаправка.lineNumber));
			Если НайдЗаправки.Количество() <> 0 Тогда
				НайдЗаправки[0].ТС				 = ДокОбъект.ТранспортноеСредство;
				Если ДокОбъект.Водитель1.ФизическоеЛицо = ДанныеАвторизации.ФизическоеЛицо Тогда
					НайдЗаправки[0].Водитель = ДокОбъект.Водитель1;
				Иначе
					НайдЗаправки[0].Водитель = ДокОбъект.Водитель2;
				КонецЕсли;
				НайдЗаправки[0].ТС				 = ?(ЗначениеЗаполнено(ТекЗаправка.vehicle),
					ТекЗаправка.vehicle, ДокОбъект.ТранспортноеСредство);
				НайдЗаправки[0].Дата			 = ТекЗаправка.fuellingDate;
				НайдЗаправки[0].ГСМ				 = ТекЗаправка.fuelsID;
				НайдЗаправки[0].ПластиковаяКарта = ТекЗаправка.fuelCardID;
				НайдЗаправки[0].Количество		 = ТекЗаправка.quantity;
				НайдЗаправки[0].Сумма			 = ТекЗаправка.sum;
				Если НайдЗаправки[0].Количество = 0 Тогда
					НайдЗаправки[0].Цена = 0;
				Иначе	
					НайдЗаправки[0].Цена = НайдЗаправки[0].Сумма / НайдЗаправки[0].Количество;
				КонецЕсли;
				НайдЗаправки[0].Валюта    = уатОбщегоНазначенияТиповые.ВалютаРегламентированногоУчета(Заправка.Организация);
				НайдЗаправки[0].СтавкаНДС = НайдЗаправки[0].ГСМ.СтавкаНДС;
				НайдЗаправки[0].СуммаНДС  = уатОбщегоНазначенияТиповые.уатРассчитатьСуммуНДС(НайдЗаправки[0].Сумма,
					Заправка.УчитыватьНДС, Заправка.СуммаВключаетНДС,
					уатОбщегоНазначенияТиповые.уатПолучитьСтавкуНДС(НайдЗаправки[0].СтавкаНДС));
			КонецЕсли;
		Иначе
			НоваяСтрока = Заправка.Заправки.Добавить();
			НоваяСтрока.ПутевойЛист	 = ДокОбъект.Ссылка;
			НоваяСтрока.ТС				 = ?(ЗначениеЗаполнено(ТекЗаправка.vehicle),
				ТекЗаправка.vehicle, ДокОбъект.ТранспортноеСредство);
			Если ДокОбъект.Водитель1.ФизическоеЛицо = ДанныеАвторизации.ФизическоеЛицо Тогда
				НоваяСтрока.Водитель	 = ДокОбъект.Водитель1;
			Иначе
				НоваяСтрока.Водитель	 = ДокОбъект.Водитель2;
			КонецЕсли;
			
			НоваяСтрока.Дата			 = ТекЗаправка.fuellingDate;
			НоваяСтрока.ГСМ				 = ТекЗаправка.fuelsID;
			НоваяСтрока.ПластиковаяКарта = ТекЗаправка.fuelCardID;
			НоваяСтрока.Количество		 = ТекЗаправка.quantity;
			НоваяСтрока.Сумма			 = ТекЗаправка.sum;
			Если НоваяСтрока.Количество = 0 Тогда
				НоваяСтрока.Цена = 0;
			Иначе	
				НоваяСтрока.Цена = НоваяСтрока.Сумма / НоваяСтрока.Количество;
			КонецЕсли;
			НоваяСтрока.Валюта    = уатОбщегоНазначенияТиповые.ВалютаРегламентированногоУчета(Заправка.Организация);
			НоваяСтрока.СтавкаНДС = НоваяСтрока.ГСМ.СтавкаНДС;
			НоваяСтрока.СуммаНДС  = уатОбщегоНазначенияТиповые.уатРассчитатьСуммуНДС(НоваяСтрока.Сумма,
				Заправка.УчитыватьНДС, Заправка.СуммаВключаетНДС,
				уатОбщегоНазначенияТиповые.уатПолучитьСтавкуНДС(НоваяСтрока.СтавкаНДС));
		КонецЕсли; 
		
		Заправка.ПометкаУдаления = ТекЗаправка.ПометкаНаУдаление;
		Если Заправка.ПометкаУдаления Тогда
			Заправка.Проведен = Ложь;
		Конецесли;
		Попытка
			Заправка.Записать();
		Исключение
			ЗаписатьСообщениеОбОшибке(НСтр("en='ОбработатьМетодUpdateWaybill';ru='ОбработатьМетодUpdateWaybill'"), ОписаниеОшибки());
			resultCode = 125;
			Возврат Ложь; 
		КонецПопытки;
	КонецЦикла;
	
	Попытка  
		ДокОбъект.ДополнительныеСвойства.Вставить("НеУстановливатьПризнакОбновленияМобильногоПриложения", Истина);
		ДокОбъект.Записать();
	Исключение
		ЗаписатьСообщениеОбОшибке(НСтр("en='ОбработатьМетодUpdateWaybill';ru='ОбработатьМетодUpdateWaybill'"), ОписаниеОшибки());
		resultCode = 125;
		Возврат Ложь;
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);
	
	resultCode = 0;
	Возврат Истина;

КонецФункции

// Функция предназначена для получения путевых листов для работы мобильного приложения
//
// Параметры:
//  responseData - строка - строка XML, выходные данные, содержимое определяется контекстом выполняемого метода
//  resultCode   - число  - код результата выполнения
//
// Возвращаемое значение:
//   Булево      - истина - метод выполнен успешно;
//               - ложь   - при выполнении метода возникла ошибка
//
Функция ОбработатьМетодAddWaybill(Знач requestData, responseData, resultCode, Знач ДанныеАвторизации, СпособРеализацииВебСервиса)
	
	responseData = ПолучитьПустыеВыходныеДанные(СпособРеализацииВебСервиса);
	
	флОшибка = Ложь;
	
	ДанныеПЛ = ДесериализоватьAddWaybill(requestData, флОшибка, СпособРеализацииВебСервиса);
	
	Если флОшибка Тогда 
		resultCode = 29999;
		Возврат Ложь;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ЗначениеЗаполнено(ДанныеПЛ.Ссылка) Тогда
		Попытка
			ДокОбъект = ДанныеПЛ.Ссылка.ПолучитьОбъект();
		Исключение
			ЗаписатьСообщениеОбОшибке(НСтр("en='ОбработатьМетодAddWaybill';ru='ОбработатьМетодAddWaybill'"), ОписаниеОшибки());
			resultCode = 125;
			Возврат Ложь;
		КонецПопытки;
		Если ДокОбъект = Неопределено Тогда
			ДокОбъект = Документы.уатПутевойЛист.СоздатьДокумент();
			ДокОбъект.Заполнить(Неопределено);
			ДокОбъект.УстановитьСсылкуНового(ДанныеПЛ.Ссылка);
			ДокОбъект.Дата              = ДанныеПЛ.Дата; 
			ДокОбъект.ВидПЛ             = ДанныеПЛ.ВидПЛ;
		КонецЕсли; 
	Иначе
		ДокОбъект = Документы.уатПутевойЛист.СоздатьДокумент();
		ДокОбъект.Заполнить(Неопределено);
		Попытка
			ДокОбъект.УстановитьСсылкуНового(ДанныеПЛ.Ссылка); 
		Исключение
		КонецПопытки;
		ДокОбъект.Дата                  = ДанныеПЛ.Дата;
		ДокОбъект.ВидПЛ                 = ДанныеПЛ.ВидПЛ;
	КонецЕсли;

	ДокОбъект.ДатаВыезда            = ДанныеПЛ.ДатаВыезда;
	ДокОбъект.ДатаВозвращения       = ДанныеПЛ.ДатаВозвращения;
	ДокОбъект.ЗакрытВодителем       = ДанныеПЛ.ЗакрытВодителем;
	
	ДокОбъект.ДатаЗакрытия = ?(ДокОбъект.ДатаВозвращения > ДокОбъект.ДатаВыезда, ДокОбъект.ДатаВозвращения - 1, ДокОбъект.ДатаВозвращения);
	
	ДокОбъект.ТранспортноеСредство  = ?(ЗначениеЗаполнено(ДанныеПЛ.ТранспортноеСредство), ДанныеПЛ.ТранспортноеСредство, ДанныеАвторизации.ТС);
	Сотрудники = СотрудникиФормы.СотрудникиФизическогоЛица(ДанныеАвторизации.ФизическоеЛицо);
	Если Сотрудники.Количество() <> 0 Тогда
		ДокОбъект.Водитель1          = Сотрудники[0].Сотрудник;
	КонецЕсли;
	
	МестоТС      = уатОбщегоНазначения.МестонахождениеТС(ДокОбъект.ТранспортноеСредство, ДокОбъект.Дата);
	Пользователь = ПользователиКлиентСервер.АвторизованныйПользователь();
	Если НЕ ЗначениеЗаполнено(МестоТС.Организация) Тогда
		ОсновнаяОрганизация = уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь, 
		"ОсновнаяОрганизация");
	Иначе
		ОсновнаяОрганизация = МестоТС.Организация;
	КонецЕсли;
	
	ДокОбъект.Организация      = ОсновнаяОрганизация;
	ПодразделениеТС = ДокОбъект.ТранспортноеСредство.Подразделение;
	ДокОбъект.Подразделение = ПодразделениеТС;
	
	СрокДействияПЛПоТС = ДокОбъект.ТранспортноеСредство.СрокДействияПутевогоЛиста;
	
	Если ЗначениеЗаполнено(СрокДействияПЛПоТС) Тогда
		мСрокДействияПутевогоЛиста = СрокДействияПЛПоТС;
	Иначе
		СтруктураОбъектовНастроек = Новый Структура;
		СтруктураОбъектовНастроек.Вставить("Организация",   ДокОбъект.Организация);
		СтруктураОбъектовНастроек.Вставить("Подразделение", ДокОбъект.Подразделение);
		мСрокДействияПутевогоЛиста = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(СтруктураОбъектовНастроек, ПланыВидовХарактеристик.уатПраваИНастройки.СрокДействияПутевогоЛиста);
		мСрокДействияПутевогоЛиста = ?(мСрокДействияПутевогоЛиста <> Неопределено, мСрокДействияПутевогоЛиста, 0);
	КонецЕсли;
	
	ДокОбъект.ДействителенДо = КонецДня(ДокОбъект.Дата + мСрокДействияПутевогоЛиста * 3600 * 24 + 1);
	
	ДокОбъект.Ответственный    = Пользователь;
	
	ДокОбъект.ИнициализацияДанныхАвтомобиля(0, Новый Массив, Ложь);
	
	Если ПолучитьФункциональнуюОпцию("уатИспользоватьУчетДоходовИРасходов") Тогда
		ПланЗатратНайден = уатОбщегоНазначения.уатНайтиПланЗатрат(ДокОбъект.ПланЗатрат, ДокОбъект.Организация, ДокОбъект.ТранспортноеСредство,
			ДокОбъект.ТранспортноеСредство.Колонна);
	КонецЕсли;
		
	ДокОбъект.ВидСообщения = ДокОбъект.ТранспортноеСредство.ОсновнойВидСообщения;
	ДокОбъект.ВидПеревозки = ДокОбъект.ТранспортноеСредство.ОсновнойВидПеревозки;
	ДокОбъект.Гараж        = ДокОбъект.ТранспортноеСредство.Гараж;

	ДокОбъект.СпидометрВозвращения  = ДанныеПЛ.СпидометрВозвращения;
	ДокОбъект.СпидометрВыезда       = ДанныеПЛ.СпидометрВыезда;
	
	ОснРежРаботыТС = ДокОбъект.ТранспортноеСредство.ОсновнойРежимРаботы;
	Если ЗначениеЗаполнено(ОснРежРаботыТС) Тогда
		ДокОбъект.РежимРаботыТС = ОснРежРаботыТС;
	КонецЕсли;
	
	СтруктураОбъектовНастроек = Новый Структура;
	СтруктураОбъектовНастроек.Вставить("Организация", ОсновнаяОрганизация);
	СтруктураОбъектовНастроек.Вставить("Подразделение", уатОбщегоНазначения.МестонахождениеТС(ДокОбъект.ТранспортноеСредство).Подразделение);
	СтруктураОбъектовНастроек.Вставить("Пользователь", Пользователь);
	
	СтруктураОбъектовНастроек = Новый Структура;
	СтруктураОбъектовНастроек.Вставить("Организация", ДокОбъект.Организация);
	СтруктураОбъектовНастроек.Вставить("Подразделение", уатОбщегоНазначения.МестонахождениеТС(ДокОбъект.ТранспортноеСредство).Подразделение);
	СтруктураОбъектовНастроек.Вставить("Пользователь", Пользователь);
	
	ОтветствЛица = уатПутевыеЛисты.ОтветственныеЛицаПоУмолчанию(СтруктураОбъектовНастроек, ДокОбъект.Дата);
	ЗаполнитьЗначенияСвойств(ДокОбъект, ОтветствЛица);
	
	ДокОбъект.РежимРасчетаВыработки = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(СтруктураОбъектовНастроек, "ОсновнойРежимРасчетаВыработкиПЛ");
	ДокОбъект.РасчетФактРасходаГСМ  = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(СтруктураОбъектовНастроек, "РасчетФактРасходаГСМ");
	ДокОбъект.Смена                 = 1;

	Если НЕ ЗначениеЗаполнено(ДокОбъект.ВидПЛ) Тогда
		ОсновнойВидПЛТС = ДокОбъект.ТранспортноеСредство.ОсновнойВидПЛ;
		Если ЗначениеЗаполнено(ОсновнойВидПЛТС) Тогда
			ДокОбъект.ВидПЛ = ОсновнойВидПЛТС;
		Иначе
			ДокОбъект.ВидПЛ = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(СтруктураОбъектовНастроек, ПланыВидовХарактеристик.уатПраваИНастройки.ОсновнойВидПЛ);
		КонецЕсли;
	КонецЕсли; 
	
	НомерПрицепа = 0;
	Для Каждого ТекПрицеп Из ДанныеПЛ.Прицепы Цикл 
		НоваяСтрока    = ДокОбъект.Прицепы.Добавить();
		НоваяСтрока.ТС = ТекПрицеп.vehicle;   
		ИнициализацияДанныхПрицепа(ДокОбъект, НоваяСтрока.ТС, НомерПрицепа);
        НомерПрицепа = НомерПрицепа + 1;
	КонецЦикла;
	
	ОснТопливо = ДокОбъект.ТранспортноеСредство.Модель.ОсновноеТопливо;
	Для Каждого ТекСтрока Из ДокОбъект.РасходГСМ Цикл
		Если ДокОбъект.ТранспортноеСредство = ТекСтрока.ТС И ОснТопливо = ТекСтрока.ГСМ Тогда
			ТекСтрока.ОстатокПриВозвращении	 = ДанныеПЛ.ОстатокТопливаВозврат;
			ТекСтрока.ОстатокПриВыезде		 = ДанныеПЛ.ОстатокТопливаВыезд;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Попытка 
		ДокОбъект.ДополнительныеСвойства.Вставить("НеУстановливатьПризнакОбновленияМобильногоПриложения", Истина);
		ДокОбъект.Записать();
	Исключение
		ЗаписатьСообщениеОбОшибке(НСтр("en='ОбработатьМетодAddWaybill';ru='ОбработатьМетодAddWaybill'"), ОписаниеОшибки());
		resultCode = 125;
		Возврат Ложь;
	КонецПопытки;

	Для Каждого ТекЗаправка Из ДанныеПЛ.Заправки Цикл
		Если ЗначениеЗаполнено(ТекЗаправка.fuellingNewID) 
			ИЛИ ЗначениеЗаполнено(ТекЗаправка.fuellingID) Тогда   
			Если ЗначениеЗаполнено(ТекЗаправка.fuellingNewID) Тогда
				fuellingID = ТекЗаправка.fuellingNewID;
			Иначе
				fuellingID = ТекЗаправка.fuellingID;
			КонецЕсли;
			Попытка
				Заправка = fuellingID.ПолучитьОбъект();
			Исключение
				ЗаписатьСообщениеОбОшибке(НСтр("en='ОбработатьМетодAddWaybill';ru='ОбработатьМетодAddWaybill'"), ОписаниеОшибки());
				resultCode = 125;
				Возврат Ложь;
			КонецПопытки;
			Если Заправка = Неопределено Тогда 
				Заправка = Документы.уатЗаправкаГСМ.СоздатьДокумент();
				Заправка.Заполнить(Неопределено);
				Заправка.УстановитьСсылкуНового(fuellingID);
				Заправка.Дата = ТекЗаправка.fuellingDate;
			КонецЕсли;
		Иначе
			Заправка = Документы.уатЗаправкаГСМ.СоздатьДокумент(); 
			Заправка.Заполнить(Неопределено);
			Заправка.Дата = ТекЗаправка.fuellingDate;
		КонецЕсли;
		
		Заправка.АЗС = ТекЗаправка.gasStationID;
		
		Контрагент_Склад = уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Заправка.АЗС, "Контрагент_Склад");
		Если ТипЗнч(Контрагент_Склад) = Тип("СправочникСсылка.Контрагенты") Тогда
			Если Заправка.ДоговорКонтрагента.Владелец <> Контрагент_Склад Тогда
				Заправка.ДоговорКонтрагента = уатЗаполнениеДокументов.ПолучитьОсновнойДоговорКонтрагента(Контрагент_Склад, "СПоставщиком", ДокОбъект.Организация);
			КонецЕсли;
		КонецЕсли;
		
		Заправка.ВидДвиженияГСМ	 = ТекЗаправка.fuellingTypeID;
		Заправка.ПризнакРедактированияИзПутевогоЛиста = Истина;
		Заправка.ПризнакРедактированияИзПутевогоЛистаСсылка = ДокОбъект.Ссылка;
		Заправка.Организация = ДокОбъект.Организация;
		Если ЗначениеЗаполнено(ДокОбъект.ТранспортноеСредство) Тогда
			Колонна = уатОбщегоНазначения.МестонахождениеТС(ДокОбъект.ТранспортноеСредство, ДокОбъект.ДатаВыезда).Колонна;
		КонецЕсли;
		Заправка.Ответственный = ПользователиКлиентСервер.АвторизованныйПользователь();
		
		Заправка.ПодразделениеОрганизации = ДокОбъект.Подразделение;
			
		Заправка.УчитыватьНДС = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(Заправка.Организация,
		ПланыВидовХарактеристик.уатПраваИНастройки.УчитыватьНДС);
		Заправка.СуммаВключаетНДС = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(Заправка.Организация,
		ПланыВидовХарактеристик.уатПраваИНастройки.СуммаВключаетНДС);
		
		Если ЗначениеЗаполнено(Заправка.Ссылка) Тогда
			НайдЗаправки = Заправка.Заправки.НайтиСтроки(Новый Структура("ПутевойЛист, НомерСтроки", ДокОбъект.Ссылка, ТекЗаправка.lineNumber));
			Если НайдЗаправки.Количество() <> 0 Тогда
				НайдЗаправки[0].ТС				 = ?(ЗначениеЗаполнено(ТекЗаправка.vehicle),
					ТекЗаправка.vehicle, ДокОбъект.ТранспортноеСредство);
				Если ДокОбъект.Водитель1.ФизическоеЛицо = ДанныеАвторизации.ФизическоеЛицо Тогда
					НайдЗаправки[0].Водитель = ДокОбъект.Водитель1;
				Иначе
					НайдЗаправки[0].Водитель = ДокОбъект.Водитель2;
				КонецЕсли;
				
				НайдЗаправки[0].Дата			 = ТекЗаправка.fuellingDate;
				НайдЗаправки[0].ГСМ				 = ТекЗаправка.fuelsID;
				НайдЗаправки[0].ПластиковаяКарта = ТекЗаправка.fuelCardID;
				НайдЗаправки[0].Количество		 = ТекЗаправка.quantity;
				НайдЗаправки[0].Сумма			 = ТекЗаправка.sum;
				Если НайдЗаправки[0].Количество = 0 Тогда
					НайдЗаправки[0].Цена = 0;
				Иначе	
					НайдЗаправки[0].Цена = НайдЗаправки[0].Сумма / НайдЗаправки[0].Количество;
				КонецЕсли;
				НайдЗаправки[0].Валюта = уатОбщегоНазначенияТиповые.ВалютаРегламентированногоУчета(Заправка.Организация);
				НайдЗаправки[0].СтавкаНДС =НайдЗаправки[0].ГСМ.СтавкаНДС;
				НайдЗаправки[0].СуммаНДС = уатОбщегоНазначенияТиповые.уатРассчитатьСуммуНДС(НайдЗаправки[0].Сумма,
				Заправка.УчитыватьНДС, Заправка.СуммаВключаетНДС,
				уатОбщегоНазначенияТиповые.уатПолучитьСтавкуНДС(НайдЗаправки[0].СтавкаНДС));
			КонецЕсли;
		Иначе
			НоваяСтрока = Заправка.Заправки.Добавить();
			НоваяСтрока.ПутевойЛист	 = ДокОбъект.Ссылка;
			НоваяСтрока.ТС				 = ?(ЗначениеЗаполнено(ТекЗаправка.vehicle),
					ТекЗаправка.vehicle, ДокОбъект.ТранспортноеСредство);;
			Если ДокОбъект.Водитель1.ФизическоеЛицо = ДанныеАвторизации.ФизическоеЛицо Тогда
				НоваяСтрока.Водитель	 = ДокОбъект.Водитель1;
			Иначе
				НоваяСтрока.Водитель	 = ДокОбъект.Водитель2;
			КонецЕсли;
			
			НоваяСтрока.Дата			 = ТекЗаправка.fuellingDate;
			НоваяСтрока.ГСМ				 = ТекЗаправка.fuelsID;
			НоваяСтрока.ПластиковаяКарта = ТекЗаправка.fuelCardID;
			НоваяСтрока.Количество		 = ТекЗаправка.quantity;
			НоваяСтрока.Сумма			 = ТекЗаправка.sum;
			Если НоваяСтрока.Количество = 0 Тогда
				НоваяСтрока.Цена = 0;
			Иначе	
				НоваяСтрока.Цена = НоваяСтрока.Сумма / НоваяСтрока.Количество;
			КонецЕсли;
			НоваяСтрока.Валюта = уатОбщегоНазначенияТиповые.ВалютаРегламентированногоУчета(Заправка.Организация);
			НоваяСтрока.СтавкаНДС =НоваяСтрока.ГСМ.СтавкаНДС;
			НоваяСтрока.СуммаНДС = уатОбщегоНазначенияТиповые.уатРассчитатьСуммуНДС(НоваяСтрока.Сумма,
			Заправка.УчитыватьНДС, Заправка.СуммаВключаетНДС,
			уатОбщегоНазначенияТиповые.уатПолучитьСтавкуНДС(НоваяСтрока.СтавкаНДС));
		КонецЕсли;  
		
		Заправка.ПометкаУдаления = ТекЗаправка.ПометкаНаУдаление;
		Если Заправка.ПометкаУдаления Тогда 
			Заправка.Проведен = Ложь;
		Конецесли;
		Попытка
			Заправка.Записать();
		Исключение
			ЗаписатьСообщениеОбОшибке(НСтр("en='ОбработатьМетодAddWaybill';ru='ОбработатьМетодAddWaybill'"), ОписаниеОшибки());
			resultCode = 125;
			Возврат Ложь; 
		КонецПопытки;
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	resultCode = 0;
	Возврат Истина;

КонецФункции

// Функция предназначена для получения пробега и расхода по мониторингу
//
// Параметры:
//  responseData - строка - строка XML, выходные данные, содержимое определяется контекстом выполняемого метода
//  resultCode   - число  - код результата выполнения
//
// Возвращаемое значение:
//   Булево      - истина - метод выполнен успешно;
//               - ложь   - при выполнении метода возникла ошибка
//
Функция ОбработатьМетодGetMileageConsumptionMonitoring(Знач requestData, responseData, resultCode , Знач ДанныеАвторизации, СпособРеализацииВебСервиса)
	responseData = ПолучитьПустыеВыходныеДанные(СпособРеализацииВебСервиса);
	
	флОшибка = Ложь;
	
	ТС = ДанныеАвторизации.ТС;
	СтруктураДанных = ДесериализоватьGetMileageConsumptionMonitoring(requestData, флОшибка, СпособРеализацииВебСервиса);
	
	ДатаВыезда		 = СтруктураДанных.ДатаВыезда;
	ПЛ				 = СтруктураДанных.ПЛ;

	Если флОшибка ИЛИ НЕ ЗначениеЗаполнено(ТС)
		ИЛИ НЕ ЗначениеЗаполнено(ДатаВыезда) Тогда
		responseData = ПолучитьПустыеВыходныеДанные(СпособРеализацииВебСервиса);;
		resultCode = 25;
		
		Возврат Ложь;
	КонецЕсли;
	
	МодельТС = ТС.Модель;
	
	odometerDeparture		 = 0;
	remainOfFuelDeparture	 = 0;
	
	МестоТС      = уатОбщегоНазначения.МестонахождениеТС(ТС, ДатаВыезда);
	Пользователь = ПользователиКлиентСервер.АвторизованныйПользователь();
	Если НЕ ЗначениеЗаполнено(МестоТС.Организация) Тогда
		ОсновнаяОрганизация = уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь, 
		"ОсновнаяОрганизация");
	Иначе
		ОсновнаяОрганизация = МестоТС.Организация;
	КонецЕсли;
	
	ВидКонтроля = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(ОсновнаяОрганизация, "ЗапретПроведенияПЛеслиПредыдущийПЛнеРассчитан");
	
	ПредПЛ_номер = Неопределено;
	ПредПЛ_дата  = Неопределено;

	Если ВидКонтроля = Перечисления.уатВидыКонтроля.Разрешать 
		ИЛИ НЕ ЗначениеЗаполнено(ПЛ) 
		ИЛИ (ЗначениеЗаполнено(ПЛ)
			И НЕ уатОбщегоНазначения.ПредыдущийПЛНеРассчитан(ТС, ДатаВыезда, ПредПЛ_номер, ПредПЛ_дата, ПЛ)) Тогда
			
		remainOfFuelDeparture = уатОбщегоНазначения.уатОстатокГСМнаТС(ДатаВыезда, ТС,
		МодельТС.ОсновноеТопливо);
		Если МодельТС.НаличиеСпидометра = Истина Тогда
			odometerDeparture = уатОбщегоНазначения.уатТекущийСпидометр(ТС, ДатаВыезда);
		Иначе
			odometerDeparture = уатОбщегоНазначения.уатТекущийСчетчикМЧ(ТС, ДатаВыезда);
		КонецЕсли;
	Иначе
		
		odometerDeparture     = 0;
		remainOfFuelDeparture = 0;
		
	КонецЕсли;
		
	Попытка  
		responseData = СериализоватьGetMileageConsumptionMonitoring(odometerDeparture, remainOfFuelDeparture, СпособРеализацииВебСервиса);
		
	Исключение
		ЗаписатьСообщениеОбОшибке("GetMileageConsumptionMonitoring", ОписаниеОшибки());
		responseData = ПолучитьПустыеВыходныеДанные(СпособРеализацииВебСервиса);
		resultCode = 25;
		
		Возврат Ложь;
	КонецПопытки;
	
	resultCode = 0;
	
	Возврат Истина;

КонецФункции

// Функция предназначена для получения печатной формы ПЛ
//
// Параметры:
//  responseData - строка - строка XML, выходные данные, содержимое определяется контекстом выполняемого метода
//  resultCode   - число  - код результата выполнения
//
// Возвращаемое значение:
//   Булево      - истина - метод выполнен успешно;
//               - ложь   - при выполнении метода возникла ошибка
//
Функция ОбработатьМетодGetWaybillPDF(Знач requestData, responseData, resultCode , Знач ДанныеАвторизации, СпособРеализацииВебСервиса)
	responseData = ПолучитьПустыеВыходныеДанные(СпособРеализацииВебСервиса);
		
	флОшибка = Ложь;
	ПЛ = ДесериализоватьGetWaybillPDF(requestData, флОшибка, СпособРеализацииВебСервиса);
	
	Если флОшибка Тогда
		responseData = ПолучитьПустыеВыходныеДанные(СпособРеализацииВебСервиса);;
		resultCode = 25;
		
		Возврат Ложь;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	МассивОбъектов = Новый Массив();
	МассивОбъектов.Добавить(ПЛ);
	ТабличныйДокумент = Документы.уатПутевойЛист.ПечатьВесьДокумент(МассивОбъектов, Новый СписокЗначений);
	ВремФайл = ПолучитьИмяВременногоФайла("pdf");
	
	ЗначениеБР = БезопасныйРежим();
	Если ТипЗнч(ЗначениеБР) = Тип("Булево")
		И ЗначениеБР = Истина тогда
		УстановитьОтключениеБезопасногоРежима(Истина);
		
		ТабличныйДокумент.Вывод = ИспользованиеВывода.Разрешить;
		ТабличныйДокумент.Записать(ВремФайл,ТипФайлаТабличногоДокумента.PDF);
	Иначе
		ТабличныйДокумент.Записать(ВремФайл,ТипФайлаТабличногоДокумента.PDF);
	КОнецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	
	ФайлДляПередачи = Новый ДвоичныеДанные(ВремФайл);
	
	Попытка 
		responseData = СериализоватьGetWaybillPDF(ФайлДляПередачи, СпособРеализацииВебСервиса);
	Исключение
		ЗаписатьСообщениеОбОшибке("GetMileageConsumptionMonitoring", ОписаниеОшибки());
		responseData = ПолучитьПустыеВыходныеДанные(СпособРеализацииВебСервиса);
		resultCode = 25;
		
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;

КонецФункции

// Функция предназначена для получения видов сопроводительных документов
//
// Параметры:
//  responseData - строка - строка XML, выходные данные, содержимое определяется контекстом выполняемого метода
//  resultCode   - число  - код результата выполнения
//
// Возвращаемое значение:
//   Булево      - истина - метод выполнен успешно;
//               - ложь   - при выполнении метода возникла ошибка
//
Функция ОбработатьМетодGetShippingDocumentTypes(Знач requestData, responseData, resultCode , Знач ДанныеАвторизации, СпособРеализацииВебСервиса)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатВидыСопроводительныхДокументов.Ссылка КАК Ссылка,
	|	уатВидыСопроводительныхДокументов.Наименование КАК Наименование
	|ИЗ
	|	Справочник.уатВидыСопроводительныхДокументов КАК уатВидыСопроводительныхДокументов
	|ГДЕ
	|	НЕ уатВидыСопроводительныхДокументов.ПометкаУдаления
	|	И НЕ уатВидыСопроводительныхДокументов.ЭтоГруппа
	|	И уатВидыСопроводительныхДокументов.ИспользоватьВМобильномПриложении";
	
	Попытка
		responseData = СериализоватьShippingDocumentTypes(Запрос.Выполнить().Выгрузить(), СпособРеализацииВебСервиса);
		
	Исключение
		ЗаписатьСообщениеОбОшибке("GetShippingDocumentTypes", ОписаниеОшибки());
		responseData = ПолучитьПустыеВыходныеДанные(СпособРеализацииВебСервиса);
		resultCode = 180;
		
		Возврат Ложь;
	КонецПопытки;
	
	resultCode = 0;
	
	Возврат Истина;

КонецФункции


#КонецОбласти

#КонецОбласти

#Область АвторизацияПользователя

// Функция предназначена для авторизации пользователя.
//
// Параметры:
//  loginData            - строка    - строка XML, содержащая структуру логина пользователя мобильного приложения.
//  responseData         - строка    - строка XML, выходные данные, содержимое определяется контекстом выполняемого метода.
//  resultCode           - число     - код результата выполнения.
//  РезультатАвторизации - структура - при успешной авторизации содержит физическое лицо и транспортное средство.
//  requestData          - строка    - строка XML, содержащая структуру (только для метода login).
//  БезОпределенияТС     - булево    - признак выполнения "быстрой" авторизации,
//                                     при этом сопоставление ТС выполнено не будет(при успешной авторизации
//                                     параметр "РезультатАвторизации" будет заполнен только физическим лицом).
//
// Возвращаемое значение:
//   Булево      - Истина - метод выполнен успешно;
//               - Ложь   - при выполнении метода возникла ошибка.
//
Функция АвторизоватьПользователя(Знач loginData, responseData, resultCode, РезультатАвторизации,
	requestData=Неопределено, БезОпределенияТС=Ложь, Авторизация = Ложь, СпособРеализацииВебСервиса = Неопределено)
	
	стрДанныеАвторизации = Неопределено;
	
	РезультатАвторизации = Новый Структура("ФизическоеЛицо, ТС, trackerID, Логин", 
		Справочники.ФизическиеЛица.ПустаяСсылка(),   
		Справочники.уатТС.ПустаяСсылка(),
		"",
		""
	);
	Если Не ДесериализоватьLoginData(loginData, resultCode, стрДанныеАвторизации, СпособРеализацииВебСервиса) Тогда 
		responseData = ПолучитьПустыеВыходныеДанные(СпособРеализацииВебСервиса);
		
		Возврат Ложь;
	КонецЕсли;

	стрДанныеrequestData = ДесериализоватьrequestData(requestData, СпособРеализацииВебСервиса);
	
	флПользовательСуществует = Ложь;
	Попытка
		ТекущийПользователь = Пользователи.АвторизованныйПользователь();
		Если Не ТекущийПользователь = Неопределено И (ТипЗнч(ТекущийПользователь) = Тип("СправочникСсылка.Пользователи") 
			Или ТипЗнч(ТекущийПользователь) = Тип("СправочникСсылка.ВнешниеПользователи")) Тогда 
				флПользовательСуществует = Истина;
		Иначе 
			флПользовательСуществует = Ложь;
			ВызватьИсключение "";
		КонецЕсли;
	Исключение
		responseData = ПолучитьПустыеВыходныеДанные(СпособРеализацииВебСервиса);;
		resultCode   = 8;
		
		Возврат Ложь;
	КонецПопытки;
	
	ЗапросФизическоеЛицо = Новый Запрос;
	ЗапросФизическоеЛицо.УстановитьПараметр("Логин",  стрДанныеАвторизации.login);
	ЗапросФизическоеЛицо.УстановитьПараметр("Пароль", стрДанныеАвторизации.pass); // нужно установить ХЭШ
	
	РезультатАвторизации.Логин = стрДанныеАвторизации.login;
	
	ЗапросФизическоеЛицо.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатПользователиМобильногоПриложения.Пользователь КАК Пользователь,
	|	уатПользователиМобильногоПриложения.РаботаРазрешена КАК РаботаРазрешена
	|ИЗ
	|	РегистрСведений.уатПользователиМобильногоПриложения КАК уатПользователиМобильногоПриложения
	|ГДЕ
	|	уатПользователиМобильногоПриложения.Логин = &Логин
	|	И уатПользователиМобильногоПриложения.Пароль = &Пароль";
	
	ВыборкаФизическоеЛицо = ЗапросФизическоеЛицо.Выполнить().Выбрать();
	
	Если ВыборкаФизическоеЛицо.Следующий() Тогда 
		Если НЕ ВыборкаФизическоеЛицо.РаботаРазрешена Тогда
			// Снимаем водителя с линии
			НаборЗаписей = РегистрыСведений.уатВодителиНаЛинии.СоздатьНаборЗаписей(); 
			НаборЗаписей.Заполнить(Неопределено);
			НаборЗаписей.Отбор.ФизическоеЛицо.Установить(ВыборкаФизическоеЛицо.Пользователь);
			Попытка
				НаборЗаписей.Записать(Истина);
			Исключение
			КонецПопытки;
		
			responseData = ПолучитьПустыеВыходныеДанные(СпособРеализацииВебСервиса);;
			resultCode   = 2;
			
			Возврат Ложь;
		КонецЕсли;
		
		Если БезОпределенияТС Тогда 
			РезультатАвторизации.ФизическоеЛицо = ВыборкаФизическоеЛицо.Пользователь;
			
			resultCode = 0;
			
			Возврат Истина;
		КонецЕсли;
		
		ЗапросТерминал = Новый Запрос();
		
		Если ЗначениеЗаполнено(стрДанныеАвторизации.trackerID) Тогда 
			РезультатАвторизации.trackerID = стрДанныеАвторизации.trackerID;
			ЗапросТерминал.УстановитьПараметр("IDУстройства", стрДанныеАвторизации.trackerID);
		Иначе 
			responseData = ПолучитьПустыеВыходныеДанные(СпособРеализацииВебСервиса);;
			resultCode   = 4;
			
			Возврат Ложь;
		КонецЕсли;
		
		ЗапросТерминал.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	уатМобильныеУстройства.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.уатМобильныеУстройства КАК уатМобильныеУстройства
		|ГДЕ
		|	уатМобильныеУстройства.IDУстройства = &IDУстройства";
		
		РезультатЗапросаПоТерминалам = ЗапросТерминал.Выполнить();
		
		Если РезультатЗапросаПоТерминалам.Пустой() Тогда 
			// Создадим новый терминал
			Попытка
				НовыйТерминал = Справочники.уатМобильныеУстройства.СоздатьЭлемент(); 
				НовыйТерминал.Заполнить(Неопределено);
			Исключение
				responseData = ПолучитьПустыеВыходныеДанные(СпособРеализацииВебСервиса);;
				resultCode   = -1;
				
				ТекстНСТР = НСтр("en='AuthorizeUser';ru='АвторизоватьПользователя'");
				ЗаписатьСообщениеОбОшибке(ТекстНСТР, ОписаниеОшибки());
				
				Возврат Ложь;
			КонецПопытки;
			
			НовыйТерминал.Наименование = стрДанныеАвторизации.login;
			НовыйТерминал.IDУстройства = стрДанныеАвторизации.trackerID;
			
			Попытка
				НовыйТерминал.Записать();
			Исключение
				responseData = ПолучитьПустыеВыходныеДанные(СпособРеализацииВебСервиса);;
				resultCode   = -1;
				
				ТекстНСТР = НСтр("en='AuthorizeUser';ru='АвторизоватьПользователя'");
				ЗаписатьСообщениеОбОшибке(ТекстНСТР, ОписаниеОшибки());
				
				Возврат Ложь;
			КонецПопытки;
			
			ТекТерминал = НовыйТерминал.Ссылка;
			ОбновитьМодельИВерсиюОСМобильногоУстройства(ТекТерминал, стрДанныеrequestData.DeviceModel, стрДанныеrequestData.OSVersion);
		Иначе
			ВыборкаТерминал = РезультатЗапросаПоТерминалам.Выбрать(); 
			Если ВыборкаТерминал.Следующий() Тогда
				ТекТерминал = ВыборкаТерминал.Ссылка; 
				ОбновитьМодельИВерсиюОСМобильногоУстройства(ТекТерминал, стрДанныеrequestData.DeviceModel, стрДанныеrequestData.OSVersion); 
			КонецЕсли;
		КонецЕсли;
			
		ЗапросТС = Новый Запрос();
		ЗапросТС.УстановитьПараметр("Пользователь", ВыборкаФизическоеЛицо.Пользователь);
		ЗапросТС.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	уатПользователиМобильногоПриложения_ТС.ТС КАК ТС
		|ИЗ
		|	РегистрСведений.уатПользователиМобильногоПриложения_ТС КАК уатПользователиМобильногоПриложения_ТС
		|ГДЕ
		|	уатПользователиМобильногоПриложения_ТС.Пользователь = &Пользователь";
		
		ВыборкаТС = ЗапросТС.Выполнить().Выбрать();
		
		Если requestData = Неопределено Тогда 
			Если стрДанныеАвторизации.car = Справочники.уатТС.ПустаяСсылка() Тогда 
				responseData = ПолучитьПустыеВыходныеДанные(СпособРеализацииВебСервиса);;
				resultCode   = 6;
				
				Возврат Ложь;
			КонецЕсли;
			
			стрОтборТС = Новый Структура("ТС", стрДанныеАвторизации.car);
			
			Если ВыборкаТС.НайтиСледующий(стрОтборТС) Тогда 
				РезультатАвторизации.ФизическоеЛицо = ВыборкаФизическоеЛицо.Пользователь;
				РезультатАвторизации.ТС             = ВыборкаТС.ТС;
				
				resultCode = 0;
				
			Иначе 
				responseData = ПолучитьПустыеВыходныеДанные(СпособРеализацииВебСервиса);
				resultCode   = 6;
				
				Возврат Ложь;
			КонецЕсли;
			
		Иначе 
			КоличествоТС = 0;
			мсвПодобранныхТС = Новый Массив;
			
			Если НЕ ЗначениеЗаполнено(стрДанныеrequestData.carNum) Тогда 
				// Все ТС трекера
				ВыборкаТС.Сбросить();
				
				Пока ВыборкаТС.Следующий() Цикл 
					мсвПодобранныхТС.Добавить(ВыборкаТС.ТС);
				КонецЦикла;
				
			Иначе 
				мсвЗапрошенныхТС = ДесериализоватьТСпоГосНомеру(стрДанныеrequestData.carNum);
				
				Для Каждого текЗапрошенноеТС Из мсвЗапрошенныхТС Цикл 
					ВыборкаТС.Сбросить();
					
					стрОтборТС = Новый Структура("ТС", текЗапрошенноеТС);
					
					Если ВыборкаТС.НайтиСледующий(стрОтборТС) Тогда
						мсвПодобранныхТС.Добавить(текЗапрошенноеТС);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			
			КоличествоТС = мсвПодобранныхТС.Количество();
			
			Если КоличествоТС = 0 Тогда
				responseData = ПолучитьПустыеВыходныеДанные(СпособРеализацииВебСервиса);;
				resultCode   = 7;
				
				Возврат Ложь;
				
			ИначеЕсли КоличествоТС = 1 Тогда 
				responseData = СериализоватьLoginResponse(ВыборкаФизическоеЛицо.Пользователь,, мсвПодобранныхТС[0], СпособРеализацииВебСервиса);
				
				РезультатАвторизации.ФизическоеЛицо = ВыборкаФизическоеЛицо.Пользователь;
				РезультатАвторизации.ТС             = мсвПодобранныхТС[0];
				
				resultCode = 0;
				
			Иначе 
				responseData = СериализоватьLoginResponse(ВыборкаФизическоеЛицо.Пользователь, мсвПодобранныхТС,, СпособРеализацииВебСервиса);
				resultCode   = 5;
				
				Возврат Ложь;
				
			КонецЕсли;
		КонецЕсли;
		
		Если Не resultCode = 0 Тогда 
			Возврат Ложь;
		КонецЕсли;
		
		Если НЕ Авторизация Тогда
			
			ЗапросВодителиНаЛинии = Новый Запрос();
			ЗапросВодителиНаЛинии.УстановитьПараметр("ФизическоеЛицо",      РезультатАвторизации.ФизическоеЛицо);
			ЗапросВодителиНаЛинии.УстановитьПараметр("ТС",                  РезультатАвторизации.ТС);
			ЗапросВодителиНаЛинии.УстановитьПараметр("МобильноеУстройство", ПолучитьТерминалПоID(РезультатАвторизации.trackerID));
			
			ЗапросВодителиНаЛинии.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	уатВодителиНаЛинии.ФизическоеЛицо КАК ФизическоеЛицо,
			|	уатВодителиНаЛинии.ТС КАК ТС,
			|	уатВодителиНаЛинии.МобильноеУстройство КАК МобильноеУстройство,
			|	уатВодителиНаЛинии.ВремяВыхода КАК ВремяВыхода
			|ИЗ
			|	РегистрСведений.уатВодителиНаЛинии КАК уатВодителиНаЛинии
			|ГДЕ
			|	уатВодителиНаЛинии.ФизическоеЛицо = &ФизическоеЛицо
			|	И уатВодителиНаЛинии.ТС = &ТС
			|	И уатВодителиНаЛинии.МобильноеУстройство = &МобильноеУстройство";
			
			ВыборкаВодителиНаЛинии = ЗапросВодителиНаЛинии.Выполнить();
			Если ВыборкаВодителиНаЛинии.Пустой() Тогда 
				responseData = "<response/>";
				resultCode   = 100;
				
				Возврат Ложь;
			КонецЕсли;
			
		КонецЕсли;
		
		Возврат Истина;
		
	Иначе 
		responseData = ПолучитьПустыеВыходныеДанные(СпособРеализацииВебСервиса);;
		resultCode   = 1;
		
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции // АвторизоватьПользователя()

#КонецОбласти

#Область Десериализаторы

// Функция предназначена для преобразования строки с уникальным идентификатором в тип "УникальныйИдентификатор"
//
// Параметры:
//  стрGUID  - строка - уникальный идентификатор в виде строки "xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx"
//  флОшибка - булево - признак наличия ошибки при десериализации
//
// Возвращаемое значение:
//   УникальныйИдентификатор - уникальный идентификатор, сформированный по переданной строке
//
Функция ДесериализоватьGUID(Знач стрGUID, флОшибка) Экспорт
	
	СтрокаGUID = СокрЛП(стрGUID);
	
	Если СтрДлина(СтрокаGUID) = 36 И СтрЧислоВхождений(СтрокаGUID, "-") = 4 Тогда 
		Попытка
			GUID = Новый УникальныйИдентификатор(СтрокаGUID);
			флОшибка = Ложь;
			
			Возврат GUID;
		Исключение
			флОшибка = Истина;
			ТекстНСТР = НСтр("en='Error occurred when creating unique identifier per line.';ru='Ошибка при создании уникального идентификатора по строке.'");
			ЗаписатьСообщениеОбОшибке(НСтр("en='ДесериализоватьGUID';ru='ДесериализоватьGUID'"), ТекстНСТР);
			
			Возврат Неопределено;
		КонецПопытки;
	Иначе 
		флОшибка = Истина;
		ТекстНСТР = НСтр("en='Invalid format of GUID fields.';ru='Неверный формат поля GUID.'");
		ЗаписатьСообщениеОбОшибке(НСтр("en='ДесериализоватьGUID';ru='ДесериализоватьGUID'"), ТекстНСТР);
		
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции // ДесериализоватьGUID()

// Функция предназначена для преобразования строки true/false в тип булево 1С
//
// Параметры:
//  стрБулево - строка - сроковое значение булево "true" или "false"
//
// Возвращаемое значение:
//   Булево   - Истина - если передано "true"
//              Ложь   - если передано "false"
//
Функция ДесериализоватьБулево(Знач стрБулево, флОшибка) Экспорт
	
	строкаБулево = СокрЛП(стрБулево);
	
	Если НРег(строкаБулево) = НРег("true") Тогда 
		флОшибка = Ложь;
		
		Возврат Истина;
		
	ИначеЕсли НРег(строкаБулево) = НРег("false") Тогда 
		флОшибка = Ложь;
		
		Возврат Ложь;
		
	Иначе 
		флОшибка = Истина;
		
		ТекстНСТР = НСтр("en='Error when converting to a boolean type.';ru='Ошибка при преобразовании типа булево.'");
		ЗаписатьСообщениеОбОшибке(НСтр("en='ДесериализоватьБулево';ru='ДесериализоватьБулево'"), ТекстНСТР);
		
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции // ДесериализоватьБулево()

// Функция предназначена для преобразования даты в формате W3C в дату 1С
//
// Параметры:
//  ДатаВремяW3C - строка - дата в формате W3C (YYYY-MM-DDThh:mm:ss или YYYY-MM-DD)
//  флОшибка     - булево - признак наличия ошибки при десериализации
//
// Возвращаемое значение:
//   Дата        - преобразованная во внутренний формат 1С дата W3C
//
Функция ДесериализоватьДатаВремя(Знач ДатаВремяW3C, флОшибка) Экспорт
	
	флОшибка = Ложь;
	
	мГод    = "1";
	мМесяц  = "1";
	мДень   = "1";
	мЧас    = "0";
	мМинут  = "0";
	мСекунд = "0";
	
	Если СтрДлина(ДатаВремяW3C) > 18 И Не Найти(ДатаВремяW3C, "T") = 0 Тогда // дата + время
		мГод    = Лев(ДатаВремяW3C, 4);
		мМесяц  = Сред(ДатаВремяW3C, 6, 2);
		мДень   = Сред(ДатаВремяW3C, 9, 2);
		мЧас    = Сред(ДатаВремяW3C, 12, 2);
		мМинут  = Сред(ДатаВремяW3C, 15, 2);
		мСекунд = Сред(ДатаВремяW3C, 18, 2);
		
	ИначеЕсли СтрДлина(ДатаВремяW3C) > 9 И Найти(ДатаВремяW3C, "T") = 0 Тогда // только дата
		мГод    = Лев(ДатаВремяW3C, 4);
		мМесяц  = Сред(ДатаВремяW3C, 6, 2);
		мДень   = Сред(ДатаВремяW3C, 9, 2);
		
	Иначе // Ошибка формата
		флОшибка = Истина;
	КонецЕсли;
	
	Попытка
		Возврат Дата(Число(мГод), Число(мМесяц), Число(мДень), Число(мЧас), Число(мМинут), Число(мСекунд));
	Исключение
		флОшибка = Истина;
		Возврат '00010101000000';
	КонецПопытки;
	
КонецФункции // ДесериализоватьДатаВремя()

// Функция предназначена для разбора строки логина и формирования на её основе структуры
//
// Параметры:
//  loginData            - строка    - строка XML, содержащая структуру логина пользователя мобильного приложения
//  resultCode           - число     - код результата выполнения метода
//  стрДанныеАвторизации - структура - структура, полученная на основе параметра "loginData"
//
// Возвращаемое значение:
//   Булево - истина - метод выполнен успешно;
//          - ложь   - при выполнении метода возникла ошибка
//
Функция ДесериализоватьLoginData(Знач loginData, resultCode, стрДанныеАвторизации, СпособРеализацииВебСервиса = Неопределено)
	
	Если СпособРеализацииВебСервиса = Перечисления.уатСпособыРеализацииВебСервиса.REST Тогда
		Возврат уатМобильноеПриложениеВодителяСерверREST.ДесериализоватьLoginData(loginData, resultCode, стрДанныеАвторизации);
	Иначе
		Возврат уатМобильноеПриложениеВодителяСерверSOAP.ДесериализоватьLoginData(loginData, resultCode, стрДанныеАвторизации);
	КонецЕсли;
	
КонецФункции // ДесериализоватьLoginData()

Функция ДесериализоватьrequestData(requestData, СпособРеализацииВебСервиса)
	
	Если СпособРеализацииВебСервиса = Перечисления.уатСпособыРеализацииВебСервиса.REST Тогда
		Возврат уатМобильноеПриложениеВодителяСерверREST.ДесериализоватьrequestData(requestData);
	Иначе
		Возврат уатМобильноеПриложениеВодителяСерверSOAP.ДесериализоватьrequestData(requestData);
	КонецЕсли;
	
КонецФункции

// Функция предназначена для преобразования xml-строки с координатами положения мобильного устройства
// в таблицу значений 1С
//
// Параметры:
//  VehiclePositions - строка - строка XML, содержащая данные о местоположении мобильного устройства
//  флОшибка         - булево - признак наличия ошибки при десериализации
//
// Возвращаемое значение:
//   Таблица значений - таблица местоположений, полученная на основе параметра "VehiclePositions"
//
Функция ДесериализоватьVehiclePositions(Знач VehiclePositions, флОшибка, СпособРеализацииВебСервиса)
	
	Если СпособРеализацииВебСервиса = Перечисления.уатСпособыРеализацииВебСервиса.REST Тогда 
		Возврат уатМобильноеПриложениеВодителяСерверREST.ДесериализоватьVehiclePositions(VehiclePositions, флОшибка);
	Иначе
		Возврат уатМобильноеПриложениеВодителяСерверSOAP.ДесериализоватьVehiclePositions(VehiclePositions, флОшибка);
	КонецЕсли;  
	
КонецФункции // ДесериализоватьVehiclePositions()

// Функция предназначена для преобразования xml-строки с сообщениями водителя в таблицу значений 1С
//
// Параметры:
//  Messages - строка - строка XML, содержащая данные о сообщениях водителя с мобильного устройства
//  флОшибка - булево - признак наличия ошибки при десериализации
//
// Возвращаемое значение:
//   Таблица значений - таблица сообщений, полученная на основе параметра "Messages"
//
Функция ДесериализоватьMessages(Знач Messages, флОшибка, СпособРеализацииВебСервиса)
	
	Если СпособРеализацииВебСервиса = Перечисления.уатСпособыРеализацииВебСервиса.REST Тогда 
		Возврат уатМобильноеПриложениеВодителяСерверREST.ДесериализоватьMessages(Messages, флОшибка);
	Иначе
		Возврат уатМобильноеПриложениеВодителяСерверSOAP.ДесериализоватьMessages(Messages, флОшибка);
	КонецЕсли; 
	
КонецФункции // ДесериализоватьMessages()

// Функция предназначена для преобразования xml-строки с сообщениями водителя в таблицу значений 1С
//
// Параметры:
//  Messages - строка - строка XML, содержащая данные о сообщениях водителя с мобильного устройства
//  флОшибка - булево - признак наличия ошибки при десериализации
//
// Возвращаемое значение:
//   Таблица значений - таблица сообщений, полученная на основе параметра "Messages"
//
Функция ДесериализоватьStatusMessages(Знач Messages, флОшибка, СпособРеализацииВебСервиса)
	
	Если СпособРеализацииВебСервиса = Перечисления.уатСпособыРеализацииВебСервиса.REST Тогда 
		Возврат уатМобильноеПриложениеВодителяСерверREST.ДесериализоватьStatusMessages(Messages, флОшибка);
	Иначе
		Возврат уатМобильноеПриложениеВодителяСерверSOAP.ДесериализоватьStatusMessages(Messages, флОшибка);
	КонецЕсли;
	
КонецФункции // ДесериализоватьStatusMessages()

Функция ДесериализоватьAcceptStatus(Знач Messages, флОшибка, СпособРеализацииВебСервиса)
	
	Если СпособРеализацииВебСервиса = Перечисления.уатСпособыРеализацииВебСервиса.REST Тогда 
		Возврат уатМобильноеПриложениеВодителяСерверREST.ДесериализоватьAcceptStatus(Messages, флОшибка);
	Иначе
		Возврат уатМобильноеПриложениеВодителяСерверSOAP.ДесериализоватьAcceptStatus(Messages, флОшибка);
	КонецЕсли;

КонецФункции

Функция ДесериализоватьNextPoint(Знач Messages, флОшибка, СпособРеализацииВебСервиса)
	
	Если СпособРеализацииВебСервиса = Перечисления.уатСпособыРеализацииВебСервиса.REST Тогда 
		Возврат уатМобильноеПриложениеВодителяСерверREST.ДесериализоватьNextPoint(Messages, флОшибка);
	Иначе
		Возврат уатМобильноеПриложениеВодителяСерверSOAP.ДесериализоватьNextPoint(Messages, флОшибка);
	КонецЕсли; 
	
КонецФункции

// Функция предназначена для преобразования xml-строки с параметрами отбора сообщений водителей и диспетчеров.
//
// Параметры:
//  Filter   - строка - строка XML, содержащая данные для отбора сообщений
//  флОшибка - булево - признак наличия ошибки при десериализации
//
// Возвращаемое значение:
//   Структура - параметры отбора, полученные на основе параметра "Filter"
//
Функция ДесериализоватьGetMessages(Знач Filter, флОшибка, СпособРеализацииВебСервиса)
	
	Если СпособРеализацииВебСервиса = Перечисления.уатСпособыРеализацииВебСервиса.REST Тогда 
		Возврат уатМобильноеПриложениеВодителяСерверREST.ДесериализоватьGetMessages(Filter, флОшибка);
	Иначе
		Возврат уатМобильноеПриложениеВодителяСерверSOAP.ДесериализоватьGetMessages(Filter, флОшибка);
	КонецЕсли; 
	
КонецФункции

// Функция предназначена для преобразования xml-строки с параметрами отбора.
//
// Параметры:
//  requestData   - строка - строка XML, содержащая данные для отбора сообщений
//  флОшибка - булево - признак наличия ошибки при десериализации
//
// Возвращаемое значение:
//   Структура - параметры отбора, полученные на основе параметра "requestData"
//
Функция ДесериализоватьGetMileageConsumptionMonitoring(Знач requestData, флОшибка, СпособРеализацииВебСервиса)
	
	Если СпособРеализацииВебСервиса = Перечисления.уатСпособыРеализацииВебСервиса.REST Тогда
		Возврат уатМобильноеПриложениеВодителяСерверREST.ДесериализоватьGetMileageConsumptionMonitoring(requestData, флОшибка);
	Иначе
		Возврат уатМобильноеПриложениеВодителяСерверSOAP.ДесериализоватьGetMileageConsumptionMonitoring(requestData, флОшибка);
	КонецЕсли; 
	
КонецФункции

// Функция предназначена для преобразования xml-строки с параметрами отбора.
//
// Параметры:
//  requestData   - строка - строка XML, содержащая данные для отбора сообщений
//  флОшибка - булево - признак наличия ошибки при десериализации
//
// Возвращаемое значение:
//   Структура - параметры отбора, полученные на основе параметра "requestData"
//
Функция ДесериализоватьGetWaybillPDF(Знач requestData, флОшибка, СпособРеализацииВебСервиса)
	
	Если СпособРеализацииВебСервиса = Перечисления.уатСпособыРеализацииВебСервиса.REST Тогда
		Возврат уатМобильноеПриложениеВодителяСерверREST.ДесериализоватьGetWaybillPDF(requestData, флОшибка);
	Иначе
		Возврат уатМобильноеПриложениеВодителяСерверSOAP.ДесериализоватьGetWaybillPDF(requestData, флОшибка);
	КонецЕсли; 
	
КонецФункции

// Функция предназначена для поиска транспортного (-ых) средства по государственному номеру
//
// Параметры:
//  carNum - строка - государственный номер или его часть, по которому необходимо получить массив транспортных средств
//
// Возвращаемое значение:
//   Массив - массив найденных транспортных средств
//
Функция ДесериализоватьТСпоГосНомеру(Знач carNum)
	
	НайденыеТС = Новый Массив;
	
	ГосНомер = carNum;
	
	ЗапросТС = Новый Запрос;
	
	// заменим спецсимволы
	ГосНомер = СтрЗаменить(ГосНомер, "~", "~~");
	ГосНомер = СтрЗаменить(ГосНомер, "%", "~%");
	ГосНомер = СтрЗаменить(ГосНомер, "_", "~_");
	ГосНомер = СтрЗаменить(ГосНомер, "[", "~[");
	ГосНомер = СтрЗаменить(ГосНомер, "-", "~-");
	ГосНомер = "%"+сокрЛП(ГосНомер)+"%";
	
	ЗапросТС.УстановитьПараметр("ГосударственныйНомер", ГосНомер);
	
	ЗапросТС.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатТС.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.уатТС КАК уатТС
	|ГДЕ
	|	ВЫБОР
	|			КОГДА уатТС.ГосударственныйНомер = """"
	|				ТОГДА уатТС.Наименование ПОДОБНО &ГосударственныйНомер СПЕЦСИМВОЛ ""~""
	|			ИНАЧЕ уатТС.ГосударственныйНомер ПОДОБНО &ГосударственныйНомер СПЕЦСИМВОЛ ""~""
	|		КОНЕЦ
	|	И НЕ уатТС.ПометкаУдаления";
	
	Попытка
		Возврат ЗапросТС.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		
	Исключение
		ТекстНСТР = НСтр("en='ДесериализоватьТСпоГосНомеру';ru='ДесериализоватьТСпоГосНомеру'");
		ЗаписатьСообщениеОбОшибке(ТекстНСТР, ОписаниеОшибки());
		Возврат НайденыеТС;
	КонецПопытки;
	
КонецФункции // ДесериализоватьТСпоГосНомеру()

// Функция предназначена для преобразования xml-строки с данными о изменяемых строках заданий по 
// маршрутным листам
//
// Параметры:
//  requestData - строка - строка XML, содержащая данные о изменяемых заданиях
//  флОшибка    - булево - признак наличия ошибки при десериализации
//
// Возвращаемое значение:
//   Таблица значений - таблица данных, содержащая ссылку на маршрутные листы, строки заданий и изменяемые данные
//
Функция ДесериализоватьUpdateOrders(Знач requestData, флОшибка, ТабСД = Неопределено, СпособРеализацииВебСервиса)
	
	Если СпособРеализацииВебСервиса = Перечисления.уатСпособыРеализацииВебСервиса.REST Тогда 
		Возврат уатМобильноеПриложениеВодителяСерверREST.ДесериализоватьUpdateOrders(requestData, флОшибка, ТабСД);
	Иначе
		Возврат уатМобильноеПриложениеВодителяСерверSOAP.ДесериализоватьUpdateOrders(requestData, флОшибка, ТабСД);
	КонецЕсли; 
	
КонецФункции // ДесериализоватьUpdateOrders()

// Функция предназначена для преобразования xml-строки с сообщениями об опоздании от водителя в структуру 1С
//
// Параметры:
//  LateArrival - строка - строка XML, содержащая данные о сообщениях об опоздании от водителя с мобильного устройства
//  флОшибка    - булево - признак наличия ошибки при десериализации
//
// Возвращаемое значение:
//   структура - структура, полученная на основе параметра "LateArrival", содержащая ключи:
//               - pointName   - имя пункта;
//               - lateArrival - время опоздания, минут;
//               - comment     - текст пояснения.
//
Функция ДесериализоватьLateArrival(Знач LateArrival, флОшибка, СпособРеализацииВебСервиса)
	
	Если СпособРеализацииВебСервиса = Перечисления.уатСпособыРеализацииВебСервиса.REST Тогда 
		Возврат уатМобильноеПриложениеВодителяСерверREST.ДесериализоватьLateArrival(LateArrival, флОшибка);
	Иначе
		Возврат уатМобильноеПриложениеВодителяСерверSOAP.ДесериализоватьLateArrival(LateArrival, флОшибка);
	КонецЕсли; 

КонецФункции // ДесериализоватьLateArrival()

// Функция предназначена для преобразования xml-строки с данными о картинках по 
// маршрутным листам
//
// Параметры:
//  requestData - строка - строка XML, содержащая данные о картинках
//  флОшибка    - булево - признак наличия ошибки при десериализации
//
// Возвращаемое значение:
//   Таблица значений - таблица данных
//
Функция ДесериализоватьImage(Знач requestData, флОшибка, СпособРеализацииВебСервиса)
	
	Если СпособРеализацииВебСервиса = Перечисления.уатСпособыРеализацииВебСервиса.REST Тогда 
		Возврат уатМобильноеПриложениеВодителяСерверREST.ДесериализоватьImage(requestData, флОшибка);
	Иначе
		Возврат уатМобильноеПриложениеВодителяСерверSOAP.ДесериализоватьImage(requestData, флОшибка);
	КонецЕсли; 

КонецФункции

// Функция предназначена для преобразования xml-строки с данными о картинках по 
// маршрутным листам
//
// Параметры:
//  requestData - строка - строка XML, содержащая данные о картинках
//  флОшибка    - булево - признак наличия ошибки при десериализации
//
// Возвращаемое значение:
//   Таблица значений - таблица данных
//
Функция ДесериализоватьImageRepair(Знач requestData, флОшибка, СпособРеализацииВебСервиса)
	
	Если СпособРеализацииВебСервиса = Перечисления.уатСпособыРеализацииВебСервиса.REST Тогда 
		Возврат уатМобильноеПриложениеВодителяСерверREST.ДесериализоватьImageRepair(requestData, флОшибка);
	Иначе
		Возврат уатМобильноеПриложениеВодителяСерверSOAP.ДесериализоватьImageRepair(requestData, флОшибка); 
	КонецЕсли;
	
КонецФункции

// Функция предназначена для преобразования xml-строки с данными о удаляемых картинках по 
// маршрутным листам
//
// Параметры:
//  requestData - строка - строка XML, содержащая данные о удаляемых картинках
//  флОшибка    - булево - признак наличия ошибки при десериализации
//
// Возвращаемое значение:
//   массив - массив GUID удаляемых картинок
//
Функция ДесериализоватьDeleteImages(Знач requestData, флОшибка, СпособРеализацииВебСервиса)
	
	Если СпособРеализацииВебСервиса = Перечисления.уатСпособыРеализацииВебСервиса.REST Тогда 
		Возврат уатМобильноеПриложениеВодителяСерверREST.ДесериализоватьDeleteImages(requestData, флОшибка);
	Иначе
		Возврат уатМобильноеПриложениеВодителяСерверSOAP.ДесериализоватьDeleteImages(requestData, флОшибка); 
	КонецЕсли;
	
КонецФункции

// Функция предназначена для преобразования xml-строки с параметрами отбора.
//
// Параметры:
//  requestData   - строка - строка XML, содержащая данные для отбора сообщений
//  флОшибка - булево - признак наличия ошибки при десериализации
//
// Возвращаемое значение:
//   Структура - параметры отбора, полученные на основе параметра "requestData"
//
Функция ДесериализоватьGetQRcode(Знач requestData, флОшибка, СпособРеализацииВебСервиса)
	
	Если СпособРеализацииВебСервиса = Перечисления.уатСпособыРеализацииВебСервиса.REST Тогда 
		Возврат уатМобильноеПриложениеВодителяСерверREST.ДесериализоватьGetQRcode(requestData, флОшибка);
	Иначе
		Возврат уатМобильноеПриложениеВодителяСерверSOAP.ДесериализоватьGetQRcode(requestData, флОшибка);
	КонецЕсли;
	
КонецФункции

// Функция предназначена для преобразования xml-строки с данными о изменяемых строках заданий по 
// заявкам на ремонт
//
// Параметры:
//  requestData - строка - строка XML, содержащая данные о изменяемых заданиях
//  флОшибка    - булево - признак наличия ошибки при десериализации
//
// Возвращаемое значение:
//   Таблица значений - таблица данных, содержащая ссылку на маршрутные листы, строки заданий и изменяемые данные
//
Функция ДесериализоватьUpdateOrderForRepair(Знач requestData, флОшибка, СпособРеализацииВебСервиса)
	
	Если СпособРеализацииВебСервиса = Перечисления.уатСпособыРеализацииВебСервиса.REST Тогда 
		Возврат уатМобильноеПриложениеВодителяСерверREST.ДесериализоватьUpdateOrderForRepair(requestData, флОшибка);
	Иначе
		Возврат уатМобильноеПриложениеВодителяСерверSOAP.ДесериализоватьUpdateOrderForRepair(requestData, флОшибка);
	КонецЕсли;
  	
КонецФункции // ДесериализоватьUpdateOrders()

// Функция предназначена для преобразования xml-строки с данными о изменяемых строках заданий по 
// путевым листам
//
// Параметры:
//  requestData - строка - строка XML, содержащая данные о изменяемых заданиях
//  флОшибка    - булево - признак наличия ошибки при десериализации
//
// Возвращаемое значение:
//   Таблица значений - таблица данных, содержащая ссылку на маршрутные листы, строки заданий и изменяемые данные
//
Функция ДесериализоватьUpdateWaybill(Знач requestData, флОшибка, СпособРеализацииВебСервиса)
	
	Если СпособРеализацииВебСервиса = Перечисления.уатСпособыРеализацииВебСервиса.REST Тогда 
		Возврат уатМобильноеПриложениеВодителяСерверREST.ДесериализоватьUpdateWaybill(requestData, флОшибка);
	Иначе
		Возврат уатМобильноеПриложениеВодителяСерверSOAP.ДесериализоватьUpdateWaybill(requestData, флОшибка);
	КонецЕсли;
	
КонецФункции // ДесериализоватьUpdateOrders()

// Функция предназначена для преобразования xml-строки с данными о изменяемых строках заданий по 
// путевым листам
//
// Параметры:
//  requestData - строка - строка XML, содержащая данные о изменяемых заданиях
//  флОшибка    - булево - признак наличия ошибки при десериализации
//
// Возвращаемое значение:
//   Таблица значений - таблица данных, содержащая ссылку на маршрутные листы, строки заданий и изменяемые данные
//
Функция ДесериализоватьAddWaybill(Знач requestData, флОшибка, СпособРеализацииВебСервиса)
	
	Если СпособРеализацииВебСервиса = Перечисления.уатСпособыРеализацииВебСервиса.REST Тогда 
		Возврат уатМобильноеПриложениеВодителяСерверREST.ДесериализоватьAddWaybill(requestData, флОшибка);
	Иначе
		Возврат уатМобильноеПриложениеВодителяСерверSOAP.ДесериализоватьAddWaybill(requestData, флОшибка);
	КонецЕсли;
	
КонецФункции // ДесериализоватьAddWaybill()

// Функция предназначена для преобразования xml-строки с данными о изменяемых строках заданий по 
// заказам на ремонт
//
// Параметры:
//  requestData - строка - строка XML, содержащая данные о изменяемых заданиях
//  флОшибка    - булево - признак наличия ошибки при десериализации
//
// Возвращаемое значение:
//   Таблица значений - таблица данных, содержащая ссылку на маршрутные листы, строки заданий и изменяемые данные
//
Функция ДесериализоватьAddOrderForRepair(Знач requestData, флОшибка, СпособРеализацииВебСервиса)
	
	Если СпособРеализацииВебСервиса = Перечисления.уатСпособыРеализацииВебСервиса.REST Тогда 
		Возврат уатМобильноеПриложениеВодителяСерверREST.ДесериализоватьAddOrderForRepair(requestData, флОшибка);
	Иначе
		Возврат уатМобильноеПриложениеВодителяСерверSOAP.ДесериализоватьAddOrderForRepair(requestData, флОшибка);
	КонецЕсли;  
	
КонецФункции // ДесериализоватьAddOrderForRepair()

#КонецОбласти

#Область Сериализаторы

// Функция предназначена для преобразования даты 1С в строку даты по стандарту W3C
//
// Параметры:
//  ДатаВремя1С  - дата   - дата во внутреннем формате 1С
//  ТолькоДата   - булево - если истина, будет сформирована строка даты W3C в формате "YYYY-MM-DD" (только дата);
//                          если ложь - в формате "YYYY-MM-DDThh:mm:ss" (дата и время)
//
// Возвращаемое значение:
//   Строка      - дата в формате W3C, сформированная из даты 1С
//
Функция СериализоватьДатаВремя(Знач ДатаВремя1С, Знач ТолькоДата=Ложь) Экспорт
	
	стрДатаВремяW3C = "";
	
	// Год
	стрДатаВремяW3C = стрДатаВремяW3C + Формат(ДатаВремя1С, "ДФ=yyyy; ДП=0001");
	
	// Месяц
	стрДатаВремяW3C = стрДатаВремяW3C + "-" + Формат(ДатаВремя1С, "ДФ=MM; ДП=01");
	
	// День
	стрДатаВремяW3C = стрДатаВремяW3C + "-" + Формат(ДатаВремя1С, "ДФ=dd; ДП=01");
	
	Если ТолькоДата Тогда 
		Возврат стрДатаВремяW3C;
	КонецЕсли;
	
	// Часы
	стрДатаВремяW3C = стрДатаВремяW3C + "T" + Формат(ДатаВремя1С, "ДФ=HH; ДП=00");
	
	// Минуты
	стрДатаВремяW3C = стрДатаВремяW3C + ":" + Формат(ДатаВремя1С, "ДФ=mm; ДП=00");
	
	// Секунды
	стрДатаВремяW3C = стрДатаВремяW3C + ":" + Формат(ДатаВремя1С, "ДФ=ss; ДП=00");
	
	Возврат стрДатаВремяW3C;
	
КонецФункции // СериализоватьДатаВремя()

// Функция предназначена для преобразования типа булево 1С в строку true/false
//
// Параметры:
//  Булево1С  - булево - значение булево
//
// Возвращаемое значение:
//   Строка   - "true"  - если Булево1С = истина;
//              "false" - если Булево1С = ложь
//
Функция СериализоватьБулево(Знач Булево1С) Экспорт
	
	Если Булево1С Тогда 
		Возврат "true";
	Иначе 
		Возврат "false";
	КонецЕсли;
	
КонецФункции // СериализоватьБулево()

// Функция предназначена для преобразования значения перечисления "Типы точек маршрута" в строковое значение
//
// Параметры:
//  ТипТочки  - ПеречислениеСсылка.уатТипыТочекМаршрута - тип точки маршрута
//
// Возвращаемое значение:
//   Строка   - "load"        - если ТипТочки = Погрузка
//              "unload"      - если ТипТочки = Разгрузка
//              "transit"     - если ТипТочки = ПромежуточныйПункт
//              пустая строка - если ТипТочки не указан
//
Функция СериализоватьТипТочкиМаршрута(Знач ТипТочки, Знач ЭтоГараж) Экспорт
	
	Если ТипТочки = Перечисления.уатТипыТочекМаршрута.Погрузка Тогда 
		Возврат "load";
		
	ИначеЕсли ТипТочки = Перечисления.уатТипыТочекМаршрута.Разгрузка Тогда
		Возврат "unload";
		
	ИначеЕсли ТипТочки = Перечисления.уатТипыТочекМаршрута.ПромежуточныйПункт Тогда  
		Если ЭтоГараж Тогда 
			Возврат "garage";
			
		Иначе 
			Возврат "transit";
		КонецЕсли;
		
	Иначе 
		Возврат "";
	КонецЕсли;
	
КонецФункции // СериализоватьТипТочкиМаршрута()

// Функция предназначена для преобразования таблицы пользователей мобильного приложения в xml-структуру
//
// Параметры:
//  ТабUsers - таблица значений - таблица, содержащая данные о пользователях мобильного приложения
//
// Возвращаемое значение:
//   Строка  - xml-структура, сформированная на основе параметра "ТабUsers"
//
Функция СериализоватьUsers(Знач ТабUsers, СпособРеализацииВебСервиса)
	
	Если СпособРеализацииВебСервиса = Перечисления.уатСпособыРеализацииВебСервиса.REST Тогда 
		Возврат уатМобильноеПриложениеВодителяСерверREST.СериализоватьUsers(ТабUsers);
	Иначе
		Возврат уатМобильноеПриложениеВодителяСерверSOAP.СериализоватьUsers(ТабUsers);
	КонецЕсли;
	
КонецФункции // СериализоватьUsers()

// Функция предназначена для преобразования таблицы пользователей мобильного приложения в JSON
//
// Параметры:
//  ТабUsers - таблица значений - таблица, содержащая данные о пользователях мобильного приложения
//
// Возвращаемое значение:
//   Строка  - JSON, сформированная на основе параметра "ТабUsers"
//
Функция СериализоватьUsersToUpdate(Знач ВыборкаЛогин, ЕстьДанные, СпособРеализацииВебСервиса)
	
	Если СпособРеализацииВебСервиса = Перечисления.уатСпособыРеализацииВебСервиса.REST Тогда 
		Возврат уатМобильноеПриложениеВодителяСерверREST.СериализоватьUsersToUpdate(ВыборкаЛогин, ЕстьДанные);
	Иначе
		Возврат уатМобильноеПриложениеВодителяСерверSOAP.СериализоватьUsersToUpdate(ВыборкаЛогин, ЕстьДанные);
	КонецЕсли;

КонецФункции

// Функция предназначена для преобразования таблицы с сообщениями водителям мобильного приложения в xml-структуру
//
// Параметры:
//  ТабСообщений - таблица значений - таблица, содержащая сообщения пользователю мобильного приложения
//
// Возвращаемое значение:
//   Строка      - xml-структура, сформированная на основе параметра "ТабСообщений"
//
Функция СериализоватьMessages(Знач ТабСообщений, СпособРеализацииВебСервиса)
	
	Если СпособРеализацииВебСервиса = Перечисления.уатСпособыРеализацииВебСервиса.REST Тогда 
		Возврат уатМобильноеПриложениеВодителяСерверREST.СериализоватьMessages(ТабСообщений);
	Иначе
		Возврат уатМобильноеПриложениеВодителяСерверSOAP.СериализоватьMessages(ТабСообщений);
	КонецЕсли;
	
КонецФункции // СериализоватьMessages()

// Функция предназначена для формирования ответа web-сервера на выполнение метода "login". Формирует xml-структуру,
// содержащую массив подходящих ТС и/или GUID подобранного (единственно возможного) ТС
//
// Параметры:
//  мсвТС       - массив                 - массив подобранных ТС
//  ВыбранноеТС - СправочникСсылка.уатТС - подобранное транспортное средство
//
// Возвращаемое значение:
//   Строка      - xml-структура, сформированная на основе параметров "мсвТС" и/или "ВыбранноеТС"
//
Функция СериализоватьLoginResponse(Водитель, Знач мсвТС=Неопределено, Знач ВыбранноеТС=Неопределено, СпособРеализацииВебСервиса) Экспорт
	
	Если СпособРеализацииВебСервиса = Перечисления.уатСпособыРеализацииВебСервиса.REST Тогда 
		Возврат уатМобильноеПриложениеВодителяСерверREST.СериализоватьLoginResponse(Водитель, мсвТС, ВыбранноеТС);
	Иначе
		Возврат уатМобильноеПриложениеВодителяСерверSOAP.СериализоватьLoginResponse(Водитель, мсвТС, ВыбранноеТС);
	КонецЕсли;
	
КонецФункции // СериализоватьLoginResponse()

// Функция предназначена для формирования ответа web-сервера на выполнение метода "getRouteList". Формирует xml-структуру,
// содержащую данные о маршрутных листах и выполняемых по ним заданиям
//
// Параметры:
//  МаршрутныеЛисты - РезультатЗапроса - результат выполнения запроса, содержащий данные по отправляемым маршрутным листам
//
// Возвращаемое значение:
//   Строка      - xml-структура, сформированная на основе параметра "МаршрутныеЛисты"
//
Функция СериализоватьRouteList(Знач МаршрутныеЛисты, СпособРеализацииВебСервиса)
	
	Если СпособРеализацииВебСервиса = Перечисления.уатСпособыРеализацииВебСервиса.REST Тогда 
		Возврат уатМобильноеПриложениеВодителяСерверREST.СериализоватьRouteList(МаршрутныеЛисты);
	Иначе
		Возврат уатМобильноеПриложениеВодителяСерверSOAP.СериализоватьRouteList(МаршрутныеЛисты);
	КонецЕсли;

КонецФункции // СериализоватьRouteList()

// Функция предназначена для формирования ответа web-сервера на выполнение метода "SendImage". Формирует xml-структуру,
// содержащую данные о созданных картинках
//
// Параметры:
//  СозданныеФайлы - массив - массив уникальных идентификаторов
//
// Возвращаемое значение:
//   Строка      - xml-структура, сформированная на основе параметра "СозданныеФайлы"
//
Функция СериализоватьSendImage(Знач СозданныеФайлы, СпособРеализацииВебСервиса)
	
	Если СпособРеализацииВебСервиса = Перечисления.уатСпособыРеализацииВебСервиса.REST Тогда 
		Возврат уатМобильноеПриложениеВодителяСерверREST.СериализоватьSendImage(СозданныеФайлы);
	Иначе
		Возврат уатМобильноеПриложениеВодителяСерверSOAP.СериализоватьSendImage(СозданныеФайлы);
	КонецЕсли;

КонецФункции 

// Функция предназначена для формирования ответа web-сервера на выполнение метода "SendImage". Формирует xml-структуру,
// содержащую данные о созданных картинках
//
// Параметры:
//  СозданныеФайлы - массив - массив уникальных идентификаторов
//
// Возвращаемое значение:
//   Строка      - xml-структура, сформированная на основе параметра "СозданныеФайлы"
//
Функция СериализоватьGetQRcode(Знач Картинка, СпособРеализацииВебСервиса)
	
	Если СпособРеализацииВебСервиса = Перечисления.уатСпособыРеализацииВебСервиса.REST Тогда 
		Возврат уатМобильноеПриложениеВодителяСерверREST.СериализоватьGetQRcode(Картинка);
	Иначе
		Возврат уатМобильноеПриложениеВодителяСерверSOAP.СериализоватьGetQRcode(Картинка);
	КонецЕсли;

КонецФункции

Функция СериализоватьGetMileageConsumptionMonitoring(odometerDeparture, remainOfFuelDeparture, СпособРеализацииВебСервиса)
	
	Если СпособРеализацииВебСервиса = Перечисления.уатСпособыРеализацииВебСервиса.REST Тогда 
		Возврат уатМобильноеПриложениеВодителяСерверREST.СериализоватьGetMileageConsumptionMonitoring(odometerDeparture, remainOfFuelDeparture);
	Иначе
		Возврат уатМобильноеПриложениеВодителяСерверSOAP.СериализоватьGetMileageConsumptionMonitoring(odometerDeparture, remainOfFuelDeparture);
	КонецЕсли;
	
КонецФункции

// Функция предназначена для преобразования таблицы с причинами закрытия заказов в xml-структуру
//
// Параметры:
//  ТабПричинЗакрытия - таблица значений - таблица, содержащая причины закрытия заказов
//
// Возвращаемое значение:
//   Строка      - xml-структура, сформированная на основе параметра "ТабПричинЗакрытия"
//
Функция СериализоватьGetOrderResults(Знач ТабПричинЗакрытия, СпособРеализацииВебСервиса)
	
	Если СпособРеализацииВебСервиса = Перечисления.уатСпособыРеализацииВебСервиса.REST Тогда 
		Возврат уатМобильноеПриложениеВодителяСерверREST.СериализоватьGetOrderResults(ТабПричинЗакрытия);
	Иначе
		Возврат уатМобильноеПриложениеВодителяСерверSOAP.СериализоватьGetOrderResults(ТабПричинЗакрытия);
	КонецЕсли;
	
КонецФункции // СериализоватьGetOrderResults()

// Функция предназначена для получение списка закрепленных ТС
//
// Параметры:
//  ТабVehicles - таблица значений - таблица, содержащая данные об автосервисах
//
// Возвращаемое значение:
//   Строка  - xml-структура, сформированная на основе параметра "ТабVehicles"
//
Функция СериализоватьVehicles(Знач ТабVehicles, СпособРеализацииВебСервиса)
	
	Если СпособРеализацииВебСервиса = Перечисления.уатСпособыРеализацииВебСервиса.REST Тогда 
		Возврат уатМобильноеПриложениеВодителяСерверREST.СериализоватьVehicles(ТабVehicles);
	Иначе
		Возврат уатМобильноеПриложениеВодителяСерверSOAP.СериализоватьVehicles(ТабVehicles);
	КонецЕсли;
	
КонецФункции // СериализоватьCarServices()

// Функция предназначена для получение списка закрепленных ТС
//
// Параметры:
//  ТабVehicles - таблица значений - таблица, содержащая данные об автосервисах
//
// Возвращаемое значение:
//   Строка  - xml-структура, сформированная на основе параметра "ТабVehicles"
//
Функция СериализоватьRepairTypes(Знач ТабRepairTypes, СпособРеализацииВебСервиса)
	
	Если СпособРеализацииВебСервиса = Перечисления.уатСпособыРеализацииВебСервиса.REST Тогда 
		Возврат уатМобильноеПриложениеВодителяСерверREST.СериализоватьRepairTypes(ТабRepairTypes);
	Иначе
		Возврат уатМобильноеПриложениеВодителяСерверSOAP.СериализоватьRepairTypes(ТабRepairTypes);
	КонецЕсли;

КонецФункции // СериализоватьRepairTypes()

// Функция предназначена для получение списка закрепленных ТС
//
// Параметры:
//  ТабVehicles - таблица значений - таблица, содержащая данные об автосервисах
//
// Возвращаемое значение:
//   Строка  - xml-структура, сформированная на основе параметра "ТабVehicles"
//
Функция СериализоватьGetStatus(Знач ТабStatus, СпособРеализацииВебСервиса)
	
	Если СпособРеализацииВебСервиса = Перечисления.уатСпособыРеализацииВебСервиса.REST Тогда 
		Возврат уатМобильноеПриложениеВодителяСерверREST.СериализоватьGetStatus(ТабStatus);
	Иначе
		Возврат уатМобильноеПриложениеВодителяСерверSOAP.СериализоватьGetStatus(ТабStatus);
	КонецЕсли;
	
КонецФункции // СериализоватьCarServices()

// Функция предназначена для получение заявок на ремонт по ТС
//
// Параметры:
//  ТабVehicles - таблица значений - таблица, содержащая данные об автосервисах
//
// Возвращаемое значение:
//   Строка  - xml-структура, сформированная на основе параметра "ТабVehicles"
//
Функция СериализоватьOrdersForRepair(Знач OrdersForRepair, СпособРеализацииВебСервиса)
	
	Если СпособРеализацииВебСервиса = Перечисления.уатСпособыРеализацииВебСервиса.REST Тогда 
		Возврат уатМобильноеПриложениеВодителяСерверREST.СериализоватьOrdersForRepair(OrdersForRepair);
	Иначе
		Возврат уатМобильноеПриложениеВодителяСерверSOAP.СериализоватьOrdersForRepair(OrdersForRepair);
	КонецЕсли;

КонецФункции // СериализоватьCarServices()

// Функция предназначена для получение списка закрепленных ТС
//
// Параметры:
//  ТабVehicles - таблица значений - таблица, содержащая данные об автосервисах
//
// Возвращаемое значение:
//   Строка  - xml-структура, сформированная на основе параметра "ТабVehicles"
//
Функция СериализоватьFuellingTypes(Знач ТабFuellingTypes, СпособРеализацииВебСервиса)
	
	Если СпособРеализацииВебСервиса = Перечисления.уатСпособыРеализацииВебСервиса.REST Тогда 
		Возврат уатМобильноеПриложениеВодителяСерверREST.СериализоватьFuellingTypes(ТабFuellingTypes);
	Иначе
		Возврат уатМобильноеПриложениеВодителяСерверSOAP.СериализоватьFuellingTypes(ТабFuellingTypes);
	КонецЕсли;

КонецФункции // СериализоватьFuellingTypes()

Функция СериализоватьGetWaybillPDF(Знач ФайлДляПередачи, СпособРеализацииВебСервиса)
	
	Если СпособРеализацииВебСервиса = Перечисления.уатСпособыРеализацииВебСервиса.REST Тогда 
		Возврат уатМобильноеПриложениеВодителяСерверREST.СериализоватьGetWaybillPDF(ФайлДляПередачи);
	Иначе
		Возврат уатМобильноеПриложениеВодителяСерверSOAP.СериализоватьGetWaybillPDF(ФайлДляПередачи);
	КонецЕсли;

КонецФункции

// Функция предназначена для получение видов сопроводительных документов
//
// Параметры:
//  ТабShippingDocumentTypes - таблица значений - таблица, содержащая данные о видов сопроводительных документов
//
// Возвращаемое значение:
//   Строка  - xml-структура, сформированная на основе параметра "ТабShippingDocumentTypes"
//
Функция СериализоватьShippingDocumentTypes(Знач ТабShippingDocumentTypes, СпособРеализацииВебСервиса)
	
	Если СпособРеализацииВебСервиса = Перечисления.уатСпособыРеализацииВебСервиса.REST Тогда 
		Возврат уатМобильноеПриложениеВодителяСерверREST.СериализоватьShippingDocumentTypes(ТабShippingDocumentTypes);
	Иначе
		Возврат уатМобильноеПриложениеВодителяСерверSOAP.СериализоватьShippingDocumentTypes(ТабShippingDocumentTypes);
	КонецЕсли;
	
КонецФункции // СериализоватьCarServices()

// Функция предназначена для получение списка топливных карт
//
// Параметры:
//  ТабVehicles - таблица значений - таблица, содержащая данные об автосервисах
//
// Возвращаемое значение:
//   Строка  - xml-структура, сформированная на основе параметра "ТабVehicles"
//
Функция СериализоватьFuelCards(Знач FuelCards)
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку("UTF-8");
	
	// Начало "response"
	ЗаписьXML.ЗаписатьНачалоЭлемента("response");
	
	// Начало "FuelCards"
	ЗаписьXML.ЗаписатьНачалоЭлемента("FuelCards");
	
	Для Каждого ТекСтр Из FuelCards Цикл
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("FuelCard");
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("fuelCardID");
		ЗаписьXML.ЗаписатьТекст(Строка(ТекСтр.Значение.УникальныйИдентификатор()));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("fuelCardName");
		ЗаписьXML.ЗаписатьТекст(СокрЛП(Строка(ТекСтр.Значение)));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
	КонецЦикла;
	
	// Конец "FuelCards"
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	// Конец "response"
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Возврат ЗаписьXML.Закрыть();
	
КонецФункции // СериализоватьCarServices()

// Функция предназначена для получение списка топливных карт
//
// Параметры:
//  ТабVehicles - таблица значений - таблица, содержащая данные об автосервисах
//
// Возвращаемое значение:
//   Строка  - xml-структура, сформированная на основе параметра "ТабVehicles"
//
Функция СериализоватьAllFuelCards(Знач FuelCards, ТС, СпособРеализацииВебСервиса)
	
	Если СпособРеализацииВебСервиса = Перечисления.уатСпособыРеализацииВебСервиса.REST Тогда 
		Возврат уатМобильноеПриложениеВодителяСерверREST.СериализоватьAllFuelCards(FuelCards, ТС);
	Иначе
		Возврат уатМобильноеПриложениеВодителяСерверSOAP.СериализоватьAllFuelCards(FuelCards, ТС);
	КонецЕсли;

КонецФункции // СериализоватьCarServices()

// Функция предназначена для получение АЗС
//
// Параметры:
//  ТабVehicles - таблица значений - таблица, содержащая данные об автосервисах
//
// Возвращаемое значение:
//   Строка  - xml-структура, сформированная на основе параметра "ТабVehicles"
//
Функция СериализоватьGasStations(Знач GasStations, СпособРеализацииВебСервиса)
	
	Если СпособРеализацииВебСервиса = Перечисления.уатСпособыРеализацииВебСервиса.REST Тогда 
		Возврат уатМобильноеПриложениеВодителяСерверREST.СериализоватьGasStations(GasStations);
	Иначе
		Возврат уатМобильноеПриложениеВодителяСерверSOAP.СериализоватьGasStations(GasStations);
	КонецЕсли;
	
КонецФункции

// Функция предназначена для получение списка закрепленных ТС
//
// Параметры:
//  ТабVehicles - таблица значений - таблица, содержащая данные об автосервисах
//
// Возвращаемое значение:
//   Строка  - xml-структура, сформированная на основе параметра "ТабVehicles"
//
Функция СериализоватьFuels(Знач Fuels)
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку("UTF-8");
	
	// Начало "response"
	ЗаписьXML.ЗаписатьНачалоЭлемента("response");
	
	// Начало "Fuels"
	ЗаписьXML.ЗаписатьНачалоЭлемента("Fuels");
	
	Для Каждого ТекСтр Из Fuels Цикл
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Fuel");

		ЗаписьXML.ЗаписатьНачалоЭлемента("fuelID");
		ЗаписьXML.ЗаписатьТекст(Строка(ТекСтр.Номенклатура.УникальныйИдентификатор()));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("fuelName");
		ЗаписьXML.ЗаписатьТекст(Строка(ТекСтр.Наименование));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("mainFuel");
		ЗаписьXML.ЗаписатьТекст(СериализоватьБулево(ТекСтр.ОсновноеТопливо));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
	КонецЦикла;
	
	// Конец "Fuels"
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	// Конец "response"
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Возврат ЗаписьXML.Закрыть();
	
КонецФункции // СериализоватьCarServices()

Функция СериализоватьAllFuels(Знач Fuels, СпособРеализацииВебСервиса)
	
	Если СпособРеализацииВебСервиса = Перечисления.уатСпособыРеализацииВебСервиса.REST Тогда 
		Возврат уатМобильноеПриложениеВодителяСерверREST.СериализоватьAllFuels(Fuels);
	Иначе
		Возврат уатМобильноеПриложениеВодителяСерверSOAP.СериализоватьAllFuels(Fuels);
	КонецЕсли;
	
КонецФункции // СериализоватьAllFuels()

// Функция предназначена для получение путевых листов
//
// Параметры:
//  ТабVehicles - таблица значений - таблица, содержащая данные об автосервисах
//
// Возвращаемое значение:
//   Строка  - xml-структура, сформированная на основе параметра "ТабVehicles"
//
Функция СериализоватьWaybills(Знач Waybill, СоответвиеПрицепов, СпособРеализацииВебСервиса)
	
	Если СпособРеализацииВебСервиса = Перечисления.уатСпособыРеализацииВебСервиса.REST Тогда 
		Возврат уатМобильноеПриложениеВодителяСерверREST.СериализоватьWaybills(Waybill, СоответвиеПрицепов);
	Иначе
		Возврат уатМобильноеПриложениеВодителяСерверSOAP.СериализоватьWaybills(Waybill, СоответвиеПрицепов);
	КонецЕсли;   
	
КонецФункции // СериализоватьCarServices()

#КонецОбласти

#Область ОбработчикиРегламентныхЗаданийИПодписокНаСобытия

Процедура ПередЗаписьюМаршрутногоЛистаУстановкаПризнакаОбновления(Источник, ЗарегистрироватьВодителей)
	
	Если ТипЗнч(Источник.Водитель1) = Тип("СправочникСсылка.Сотрудники") Тогда 
		ЗарегистрироватьВодителей.Добавить(Источник.Водитель1.ФизическоеЛицо);
	Иначе 
		ЗарегистрироватьВодителей.Добавить(Источник.Водитель1);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Источник.Водитель2) Тогда
		Если ТипЗнч(Источник.Водитель2) = Тип("СправочникСсылка.Сотрудники") Тогда 
			ЗарегистрироватьВодителей.Добавить(Источник.Водитель2.ФизическоеЛицо);
		Иначе 
			ЗарегистрироватьВодителей.Добавить(Источник.Водитель2);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписьюПутевогоЛистаУстановкаПризнакаОбновления(Источник, ЗарегистрироватьВодителей)
	
	Если ТипЗнч(Источник.Водитель1) = Тип("СправочникСсылка.Сотрудники") Тогда 
		ЗарегистрироватьВодителей.Добавить(Источник.Водитель1.ФизическоеЛицо);
	Иначе 
		ЗарегистрироватьВодителей.Добавить(Источник.Водитель1);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Источник.Водитель2) Тогда
		Если ТипЗнч(Источник.Водитель2) = Тип("СправочникСсылка.Сотрудники") Тогда 
			ЗарегистрироватьВодителей.Добавить(Источник.Водитель2.ФизическоеЛицо);
		Иначе 
			ЗарегистрироватьВодителей.Добавить(Источник.Водитель2);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписьюЗаказаТаксиУстановкаПризнакаОбновления(Источник, ЗарегистрироватьВодителей)
	
	Если НЕ ЗначениеЗаполнено(Источник.Водитель) Тогда
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	уатВодителиНаЛинии.ФизическоеЛицо КАК ФизическоеЛицо
		|ИЗ
		|	РегистрСведений.уатВодителиНаЛинии КАК уатВодителиНаЛинии
		|ГДЕ
		|	уатВодителиНаЛинии.ТС = &ТС";
		Запрос.УстановитьПараметр("ТС", Источник.ТС);
		
		ЗарегистрироватьВодителей = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ФизическоеЛицо");
	Иначе
		Если ТипЗнч(Источник.Водитель) = Тип("СправочникСсылка.Сотрудники") Тогда 
			ЗарегистрироватьВодителей.Добавить(Источник.Водитель.ФизическоеЛицо);
		Иначе 
			ЗарегистрироватьВодителей.Добавить(Источник.Водитель);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписьюЗаявкиНаРемонтУстановкаПризнакаОбновления(Источник, ЗарегистрироватьВодителей)
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	уатВодителиНаЛинии.ФизическоеЛицо КАК ФизическоеЛицо
	|ИЗ
	|	РегистрСведений.уатВодителиНаЛинии КАК уатВодителиНаЛинии
	|ГДЕ
	|	уатВодителиНаЛинии.ТС = &ТС";
	Запрос.УстановитьПараметр("ТС", Источник.ТС);
	
	ЗарегистрироватьВодителей = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ФизическоеЛицо");
	
КонецПроцедуры

Процедура ЗарегистрироватьНеобходимостьОбновленияОбъекта(Источник, ЗарегистрироватьВодителей, ТС)
	
	Запрос = Новый Запрос();

	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	уатВодителиНаЛинии.ФизическоеЛицо КАК ФизическоеЛицо,
	               |	уатВодителиНаЛинии.ТС КАК ТС
	               |ИЗ
	               |	РегистрСведений.уатВодителиНаЛинии КАК уатВодителиНаЛинии
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уатПользователиМобильногоПриложения КАК уатПользователиМобильногоПриложения
	               |		ПО уатВодителиНаЛинии.ФизическоеЛицо = уатПользователиМобильногоПриложения.Пользователь
	               |ГДЕ
	               |	уатВодителиНаЛинии.ФизическоеЛицо В(&массивВодителей)
	               |	И уатВодителиНаЛинии.ТС = &ТС
	               |	И ВЫБОР
	               |			КОГДА ТИПЗНАЧЕНИЯ(&Источник) = ТИП(Документ.уатМаршрутныйЛист)
	               |				ТОГДА ВЫБОР
	               |						КОГДА &ИспользоватьМаршрутныеЛисты И уатПользователиМобильногоПриложения.ИспользоватьМаршрутныеЛисты
	               |							ТОГДА ИСТИНА
	               |						ИНАЧЕ ЛОЖЬ
	               |					КОНЕЦ
	               |			ИНАЧЕ ВЫБОР
	               |					КОГДА ТИПЗНАЧЕНИЯ(&Источник) = ТИП(Документ.уатПутевойЛист)
	               |						ТОГДА ВЫБОР
	               |								КОГДА &ИспользоватьПутевыеЛисты И уатПользователиМобильногоПриложения.ИспользоватьПутевыеЛисты
	               |									ТОГДА ИСТИНА
	               |								ИНАЧЕ ЛОЖЬ
	               |							КОНЕЦ
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА ТИПЗНАЧЕНИЯ(&Источник) = ТИП(Справочник.уатЧаты)
	               |								ТОГДА ВЫБОР
	               |										КОГДА &ИспользоватьЧат И уатПользователиМобильногоПриложения.ИспользоватьЧат
	               |											ТОГДА ИСТИНА
	               |										ИНАЧЕ ЛОЖЬ
	               |									КОНЕЦ
	               |							ИНАЧЕ ВЫБОР
	               |									КОГДА ТИПЗНАЧЕНИЯ(&Источник) = ТИП(Документ.уатЗаявкаНаРемонт)
	               |										ТОГДА ВЫБОР
	               |												КОГДА &ИспользоватьЗаявкиНаРемонт И уатПользователиМобильногоПриложения.ИспользоватьЗаявкиНаРемонт
	               |													ТОГДА ИСТИНА
	               |												ИНАЧЕ ЛОЖЬ
	               |											КОНЕЦ
	               |									ИНАЧЕ ВЫБОР
	               |											КОГДА &ИспользоватьЗаказыТакси И уатПользователиМобильногоПриложения.ИспользоватьЗаказыТакси
	               |												ТОГДА ИСТИНА
	               |											ИНАЧЕ ЛОЖЬ
	               |										КОНЕЦ
	               |								КОНЕЦ
	               |						КОНЕЦ
	               |				КОНЕЦ
	               |		КОНЕЦ
	               |	И уатПользователиМобильногоПриложения.РаботаРазрешена";
	Запрос.УстановитьПараметр("массивВодителей", ЗарегистрироватьВодителей); 
	Запрос.УстановитьПараметр("ТС", ТС);
	Запрос.УстановитьПараметр("Источник", Источник);
	стрНастройкиМобильногоПриложения = уатМобильноеПриложениеВодителяСерверПовтИсп.ПолучитьНастройкиМобильногоПриложения(); 
	Запрос.УстановитьПараметр("ИспользоватьМаршрутныеЛисты", ?(стрНастройкиМобильногоПриложения.useRouteLists, Истина, Ложь));
	Запрос.УстановитьПараметр("ИспользоватьПутевыеЛисты", ?(стрНастройкиМобильногоПриложения.useWaybills, Истина, Ложь));
	Запрос.УстановитьПараметр("ИспользоватьЧат", ?(стрНастройкиМобильногоПриложения.useChat, Истина, Ложь));
	Запрос.УстановитьПараметр("ИспользоватьЗаявкиНаРемонт", ?(стрНастройкиМобильногоПриложения.useOrdersForRepair, Истина, Ложь));
	Запрос.УстановитьПараметр("ИспользоватьЗаказыТакси", ?(стрНастройкиМобильногоПриложения.useTaxiOrders, Истина, Ложь));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.уатОбъектыДляОбновленияМобильногоПриложения.СоздатьНаборЗаписей(); 
		НаборЗаписей.Заполнить(Неопределено);
		НаборЗаписей.Отбор.ФизическоеЛицо.Установить(Выборка.ФизическоеЛицо);
		НаборЗаписей.Отбор.ТС.Установить(Выборка.ТС);
		НаборЗаписей.Отбор.Объект.Установить(Источник);

		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() = 0 Тогда 
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.ФизическоеЛицо = Выборка.ФизическоеЛицо;
			НоваяЗапись.ТС             = Выборка.ТС;
			НоваяЗапись.Объект         = Источник;
			НоваяЗапись.ДатаЗанесения  = ТекущаяДатаСеанса();
			НаборЗаписей.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьПризнакОтправлено(ФизическоеЛицо, ТС = Неопределено, ОтправкаМЛ = Ложь, ОтправкаПЛ = Ложь, ОтправкаЗаказТакси = Ложь, ОтправкаСообщений = Ложь, ОтправкаЗР = Ложь)
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ФизическоеЛицо",     ФизическоеЛицо);
	Запрос.УстановитьПараметр("ОтправкаМЛ",         ОтправкаМЛ);
	Запрос.УстановитьПараметр("ОтправкаПЛ",         ОтправкаПЛ);
	Запрос.УстановитьПараметр("ОтправкаЗаказТакси", ОтправкаЗаказТакси);
	Запрос.УстановитьПараметр("ОтправкаСообщений",  ОтправкаСообщений);
	Запрос.УстановитьПараметр("ОтправкаЗР",         ОтправкаЗР);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатОбъектыДляОбновленияМобильногоПриложения.ФизическоеЛицо КАК ФизическоеЛицо,
	|	уатОбъектыДляОбновленияМобильногоПриложения.Объект КАК Объект,
	|	уатОбъектыДляОбновленияМобильногоПриложения.ТС КАК ТС
	|ИЗ
	|	РегистрСведений.уатОбъектыДляОбновленияМобильногоПриложения КАК уатОбъектыДляОбновленияМобильногоПриложения
	|ГДЕ
	|	уатОбъектыДляОбновленияМобильногоПриложения.ФизическоеЛицо = &ФизическоеЛицо
	|	И ВЫБОР
	|			КОГДА &ОтправкаМЛ
	|					И ТИПЗНАЧЕНИЯ(уатОбъектыДляОбновленияМобильногоПриложения.Объект) = ТИП(Документ.уатМаршрутныйЛист)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ВЫБОР
	|					КОГДА &ОтправкаПЛ
	|							И ТИПЗНАЧЕНИЯ(уатОбъектыДляОбновленияМобильногоПриложения.Объект) = ТИП(Документ.уатПутевойЛист)
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ОтправкаСообщений
	|									И ТИПЗНАЧЕНИЯ(уатОбъектыДляОбновленияМобильногоПриложения.Объект) = ТИП(Справочник.уатЧаты)
	|								ТОГДА ИСТИНА
	|							ИНАЧЕ ВЫБОР
	|									КОГДА &ОтправкаЗР
	|											И ТИПЗНАЧЕНИЯ(уатОбъектыДляОбновленияМобильногоПриложения.Объект) = ТИП(Документ.уатЗаявкаНаРемонт)
	|										ТОГДА ИСТИНА
	|									ИНАЧЕ ВЫБОР
	|											КОГДА &ОтправкаЗаказТакси
	|												ТОГДА ИСТИНА
	|											ИНАЧЕ ЛОЖЬ
	|										КОНЕЦ
	|								КОНЕЦ
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ";
	Если ЗначениеЗаполнено(ТС) Тогда
		Запрос.УстановитьПараметр("ТС", ТС);
		Запрос.Текст = Запрос.Текст + "
		|	И уатОбъектыДляОбновленияМобильногоПриложения.ТС = &ТС";
	КонецЕсли;

	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НаборЗаписи = РегистрыСведений.уатОбъектыДляОбновленияМобильногоПриложения.СоздатьНаборЗаписей(); 
		НаборЗаписи.Заполнить(Неопределено);
		НаборЗаписи.Отбор.ФизическоеЛицо.Установить(Выборка.ФизическоеЛицо);
		НаборЗаписи.Отбор.Объект.Установить(Выборка.Объект);
		Если ЗначениеЗаполнено(ТС) Тогда
			НаборЗаписи.Отбор.ТС.Установить(Выборка.ТС);
		КонецЕсли;
		НаборЗаписи.Записать();
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

// Возвращает объект, полученный в результате конвертации со строки JSON.
//
// Параметры:
//  СтрокаJSON - Строка
//
// Возвращаемое значение:
//  Произвольный
//
Функция СтрокуJSONВЗначение(СтрокаJSON) Экспорт
	
	ЧтениеJSON = Новый ЧтениеJSON();
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	
	Результат = ПрочитатьJSON(ЧтениеJSON, Истина);
	
	ЧтениеJSON.Закрыть();
	
	Возврат Результат;
	
КонецФункции

Функция ЗаполнитьРеквизитыЭПЛ(Waybill) Экспорт 
	
	СоответвиеРеквизитовЭПЛ = Новый Соответствие();

	флЭД  = ПолучитьФункциональнуюОпцию("ИспользоватьОбменЭД");
	
	мсвПутевыеЛисты        = Новый Массив();
	мсвДанныеПутевыхЛистов = Новый Массив();
	СоответвиеПЛЭД         = Новый Соответствие();
	СостоянияПодписейПЛ    = Новый Соответствие();
	
	Если флЭД Тогда
		Пока Waybill.Следующий() Цикл
			Если ЗначениеЗаполнено(Waybill.ЭПД) 
				И мсвПутевыеЛисты.Найти(Waybill.Ссылка) = Неопределено Тогда
				мсвПутевыеЛисты.Добавить(Waybill.Ссылка); 
				
				ДанныеПутевыхЛистов = Новый Структура("ЭПД,Ссылка,ОбязательныйПослерейсовыйМедосмотр,
				|ТитулОформлениеДатаВТечениеКоторойПутевойЛистМожетБытьИспользован,ТитулОформлениеДатаОкончанияСрокаИспользованияПутевогоЛиста");   
				ЗаполнитьЗначенияСвойств(ДанныеПутевыхЛистов, Waybill);
				мсвДанныеПутевыхЛистов.Добавить(ДанныеПутевыхЛистов);
			КонецЕсли;
		КонецЦикла;
		Waybill.Сбросить();
		Если мсвПутевыеЛисты.Количество() <> 0 Тогда
			уатОбменСГИСЭПД.ЗаполнитьСостоянияПЛ(мсвПутевыеЛисты, СостоянияПодписейПЛ, СоответвиеПЛЭД);
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого ТекПЛ Из мсвДанныеПутевыхЛистов Цикл
		РезультатСтруктара = Новый Структура();
		РезультатСтруктара.Вставить("QR", ?(НЕ флЭД, Ложь, Истина)); 
		
		// Сформирован электронный документ
		// 0 - не используется (отключено использование ЭПД на уровне базы или ЭПД используется, но ЭПЛ не создан)
		// 1 - используется, не оформлен (создан в базе и не подписан диспетчером)
		// 2 - используется, оформлен
		SignedT1 = 0;
		SignedT2 = 0;
		SignedT3 = 0;
		SignedT4 = 0;
		SignedT5 = 0;
		SignedT6 = 0;
		ElectronicWaybillCreated = 0;
		Если ЗначениеЗаполнено(ТекПЛ.ЭПД)
			И флЭД Тогда 
			ТекЭПЛ = СоответвиеПЛЭД.Получить(ТекПЛ.Ссылка);
			Если ТекЭПЛ <> Неопределено Тогда
				ElectronicWaybillCreated = ?(ТекЭПЛ.Титул1Подписан, 2, 1);
				
				SignedT1 = ?(ТекЭПЛ.Титул1Подписан, 2, 1);
				SignedT2 = ?(ТекЭПЛ.Титул2Подписан, 2, 1);
				SignedT3 = ?(ТекЭПЛ.Титул3Подписан, 2, 1);
				SignedT4 = ?(ТекЭПЛ.Титул4Подписан, 2, 1);
				SignedT5 = ?(ТекЭПЛ.Титул5Подписан, 2, 1);
				SignedT6 = ?(ТекЭПЛ.Титул6Подписан, 2, ?(ТекПЛ.ОбязательныйПослерейсовыйМедосмотр, 1, 0));
			Иначе 
				ElectronicWaybillCreated = 1;
			КонецЕсли;
		КонецЕсли;
		
		РезультатСтруктара.Вставить("ElectronicWaybillCreated", ElectronicWaybillCreated);
		РезультатСтруктара.Вставить("SignedT1", SignedT1);
		РезультатСтруктара.Вставить("SignedT2", SignedT2);
		РезультатСтруктара.Вставить("SignedT3", SignedT3);
		РезультатСтруктара.Вставить("SignedT4", SignedT4);
		РезультатСтруктара.Вставить("SignedT5", SignedT5);
		РезультатСтруктара.Вставить("SignedT6", SignedT6);

		Если SignedT4 = 2 Тогда
			Если ЗначениеЗаполнено(ТекПЛ.ТитулОформлениеДатаВТечениеКоторойПутевойЛистМожетБытьИспользован) Тогда
				
				QRCodeValidUntil = КонецДня(ТекПЛ.ТитулОформлениеДатаВТечениеКоторойПутевойЛистМожетБытьИспользован);
				
				Если ТекущаяДатаСеанса() <= QRCodeValidUntil Тогда
					РезультатСтруктара.Вставить("QRCodeValidFrom",  уатМобильноеПриложениеВодителяСервер.СериализоватьДатаВремя(НачалоДня(ТекПЛ.ТитулОформлениеДатаВТечениеКоторойПутевойЛистМожетБытьИспользован)));
					РезультатСтруктара.Вставить("QRCodeValidUntil", уатМобильноеПриложениеВодителяСервер.СериализоватьДатаВремя(QRCodeValidUntil));
				КонецЕсли;
			ИначеЕсли ЗначениеЗаполнено(ТекПЛ.ТитулОформлениеДатаОкончанияСрокаИспользованияПутевогоЛиста) Тогда
				QRCodeValidUntil = КонецДня(ТекПЛ.ТитулОформлениеДатаОкончанияСрокаИспользованияПутевогоЛиста);
				Если ТекущаяДатаСеанса() <= QRCodeValidUntil Тогда
					РезультатСтруктара.Вставить("QRCodeValidUntil", уатМобильноеПриложениеВодителяСервер.СериализоватьДатаВремя(QRCodeValidUntil));
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		СоответвиеРеквизитовЭПЛ.Вставить(ТекПЛ.Ссылка, РезультатСтруктара);
	КонецЦикла;
	
	Возврат СоответвиеРеквизитовЭПЛ;
КонецФункции

Процедура УстановитьПараметрыТЛЭ(МаршЛистОб, НайдСтр, мВыборкаЗаказы, ДанныеМодификацииМЛ)
	
	СтрокиМодификации = ДанныеМодификацииМЛ.НайтиСтроки(Новый Структура("routeListRef, lineID", мВыборкаЗаказы.МаршрутныйЛист, Строка(мВыборкаЗаказы.GUIDСтроки)));
	Если СтрокиМодификации.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокиМодификации[0].orderResultRef) Тогда 
		НайдСтр.ПричинаЗакрытияЗаказа = СтрокиМодификации[0].orderResultRef;
	КонецЕсли;
	
	Если уатЗащищенныеФункцииСервер.ВариантПоставкиКОРП() Тогда 
		ПараметрВыработки1 = НайдСтр.ПараметрВыработки1;
		ПараметрВыработки2 = НайдСтр.ПараметрВыработки2;
		
		Если ЗначениеЗаполнено(СтрокиМодификации[0].productivityRef1) Тогда 
			Если ПараметрВыработки1 = СтрокиМодификации[0].productivityRef1 Тогда 
				НайдСтр.Выработка1 = СтрокиМодификации[0].productivityVal1;
			ИначеЕсли ПараметрВыработки2 = СтрокиМодификации[0].productivityRef1 Тогда 
				НайдСтр.Выработка2 = СтрокиМодификации[0].productivityVal1;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокиМодификации[0].productivityRef2) Тогда 
			Если ПараметрВыработки1 = СтрокиМодификации[0].productivityRef2 Тогда 
				НайдСтр.Выработка1 = СтрокиМодификации[0].productivityVal2;
			ИначеЕсли ПараметрВыработки2 = СтрокиМодификации[0].productivityRef2 Тогда 
				НайдСтр.Выработка2 = СтрокиМодификации[0].productivityVal2;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ЗаписатьКоординатыВРегистрТекущегоМестоположения(Знач ДанныеАвторизации, Знач ТабКоординат, resultCode)
	
	// Текущее местоположение
	ТабКоординат.Сортировать("Дата УБЫВ");
	
	Попытка
		МенЗаписи = РегистрыСведений.уатТекущиеКоординатыМП.СоздатьМенеджерЗаписи();
		МенЗаписи.Заполнить(Неопределено);
		
	Исключение
		ЗаписатьСообщениеОбОшибке("SetVehiclePositions", ОписаниеОшибки());
		resultCode = 35;
		
		Возврат Ложь;
	КонецПопытки;
	
	МенЗаписи.ТС           = ДанныеАвторизации.ТС;
	МенЗаписи.Дата         = ТабКоординат[0].Дата;
	МенЗаписи.ДатаВремяUTC = ТабКоординат[0].ДатаВремяUTC;
	МенЗаписи.Лат          = ТабКоординат[0].Лат;
	МенЗаписи.Лон          = ТабКоординат[0].Лон;
	МенЗаписи.Алт          = ТабКоординат[0].Алт;
	МенЗаписи.Скорость     = ТабКоординат[0].Скорость;
	МенЗаписи.Направление  = ТабКоординат[0].Направление;
	МенЗаписи.ЧасовойПояс  = ТабКоординат[0].ЧасовойПояс; 
	
	Попытка
		МенЗаписи.Записать(Истина);
	Исключение
		ЗаписатьСообщениеОбОшибке("SetVehiclePositions", ОписаниеОшибки());
		resultCode = 35;
		
		Возврат Ложь;
	КонецПопытки;
	
	resultCode = 0;
	
	Возврат Истина;
	
КонецФункции // ЗаписатьКоординатыВРегистрТекущегоМестоположения()

Функция ЗаписатьДанныеТаксометра(Знач ДанныеАвторизации, Знач Таксометр, resultCode)
	
	Если НЕ ЗначениеЗАполнено(Таксометр.ДокументСсылка) Тогда  
		resultCode = 0;
		Возврат Истина;
	КонецЕсли;
	Попытка
		МенЗаписи = РегистрыСведений.уатДанныеТаксометра.СоздатьМенеджерЗаписи();
		МенЗаписи.Заполнить(Неопределено);
		
	Исключение
		ЗаписатьСообщениеОбОшибке("SetVehiclePositions", ОписаниеОшибки());
		resultCode = 35;
		
		Возврат Ложь;
	КонецПопытки;
	
	МенЗаписи.ТС              = ДанныеАвторизации.ТС;
	МенЗаписи.ТекущийДокумент = Таксометр.ДокументСсылка;
	МенЗаписи.ПробегПоПоездке = Таксометр.transportingDistance;
	МенЗаписи.ВремяПоПоездке  = Таксометр.transportingDuration / 60;
	МенЗаписи.ВремяОжидания   = Таксометр.waitingTime / 60;
	МенЗаписи.ПробегПодачи    = Таксометр.pickupDistance;
	МенЗаписи.ВремяПодачи     = Таксометр.pickupDuration / 60;
	МенЗаписи.ДатаНачалаНаПодачу = Таксометр.pickupStartDate;
	МенЗаписи.ДатаНачалаОжидания = Таксометр.waitingStartDate;
	МенЗаписи.ДатаНачалаПоездки  = Таксометр.factStartTime;
	
	Попытка
		МенЗаписи.Записать(Истина);
	Исключение
		ЗаписатьСообщениеОбОшибке("SetVehiclePositions", ОписаниеОшибки());
		resultCode = 35;
		
		Возврат Ложь;
	КонецПопытки;
	
	resultCode = 0;
	
	Возврат Истина;
	
КонецФункции

Функция ЗаписатьКоординатыВРегистрИсторииМестоположения(Знач ДанныеАвторизации, Знач ТабКоординат, resultCode)
	
	Для Каждого ТекКоординаты Из ТабКоординат Цикл 
		Попытка
			МенЗаписи = РегистрыСведений.уатИсторияКоординатМП.СоздатьМенеджерЗаписи();
			МенЗаписи.Заполнить(Неопределено);

		Исключение
			ЗаписатьСообщениеОбОшибке("SetVehiclePositions", ОписаниеОшибки());
			resultCode = 35;
			
			Возврат Ложь;
		КонецПопытки;
		
		МенЗаписи.Дата         = ТекКоординаты.Дата;
		МенЗаписи.Время        = ТекКоординаты.Дата; 
		МенЗаписи.ДатаВремяUTC = ТекКоординаты.ДатаВремяUTC;
		МенЗаписи.ТС           = ДанныеАвторизации.ТС;
		МенЗаписи.Лат          = ТекКоординаты.Лат;
		МенЗаписи.Лон          = ТекКоординаты.Лон;
		МенЗаписи.Алт          = ТекКоординаты.Алт;
		МенЗаписи.Скорость     = ТекКоординаты.Скорость;
		МенЗаписи.Направление  = ТекКоординаты.Направление;
		МенЗаписи.ЧасовойПояс  = ТекКоординаты.ЧасовойПояс;
		
		Попытка
			МенЗаписи.Записать(Истина);
		Исключение
			ЗаписатьСообщениеОбОшибке("SetVehiclePositions", ОписаниеОшибки());
			resultCode = 35;
			
			Возврат Ложь;
		КонецПопытки;
	КонецЦикла;
	
	resultCode = 0;
	
	Возврат Истина;
	
КонецФункции // ЗаписатьКоординатыВРегистрИсторииМестоположения()

Функция ЗаписатьКоординатыВоВнешнююБазу(Знач ДанныеАвторизации, Знач ТабКоординат, Знач ДанныеПодключения, resultCode)
	
	Connection = Новый COMОбъект("ADODB.Connection");
	СтрокаПодключения = "Provider=SQLOLEDB.1;Password=" + ДанныеПодключения.Пароль 
	+ ";Persist Security Info=True;User ID=" + ДанныеПодключения.Логин 
	+ ";Initial Catalog=" + ДанныеПодключения.ИмяБазы 
	+ ";Data Source=" + ДанныеПодключения.АдресСервера;
	Connection.ConnectionString = СтрокаПодключения;
	
	Попытка
		Connection.Open();
	Исключение
		ТекстНСТР = НСтр("en='Error of opening connection to external DB.';ru='Ошибка открытия подключения к внешней БД.'") + Символы.ПС +" " + НСтр("en='Connection line:';ru='Строка подлючения:'") + " " +
					СтрокаПодключения + "." + Символы.ПС + " " + НСтр("en='Error description:';ru='Описание ошибки:'") + " " + ОписаниеОшибки();
		ЗаписатьСообщениеОбОшибке("SetVehiclePositions", ТекстНСТР);
		resultCode = 35;
		Возврат Ложь;
	КонецПопытки;
	
	Command = Новый COMОбъект("ADODB.Command");
	Command.ActiveConnection = Connection;
	Command.CommandType = 1;
	Command.CommandTimeout = 0;
	ТекстКомманды = "";
	
	Для Каждого ТекКоординаты Из ТабКоординат Цикл 
		СтрокаЛат         = СтрЗаменить(Строка(ТекКоординаты.Лат), ",", ".");
		СтрокаЛон         = СтрЗаменить(Строка(ТекКоординаты.Лон), ",", ".");
		СтрокаАлт         = СтрЗаменить(Строка(ТекКоординаты.Алт), ",", ".");
		СтрокаСкорость    = СтрЗаменить(Строка(ТекКоординаты.Скорость), ",", ".");
		СтрокаНаправление = СтрЗаменить(Строка(ТекКоординаты.Направление), ",", ".");
		
		ТекстКомманды = ТекстКомманды + "INSERT INTO " + ДанныеПодключения.ИмяБазы
			+ ".dbo.GPSData VALUES ('" + Формат(ТекКоординаты.Дата, "ДФ=yyyy-MM-ddTHH:mm:ss") + "', '" + ДанныеАвторизации.ТС
			+ "', " + СтрокаЛат + ", " + СтрокаЛон + ", " + СтрокаАлт + ", " + СтрокаСкорость + ", " + СтрокаНаправление + "); ";
	КонецЦикла;
	
	Command.CommandText = ТекстКомманды;
	
	Попытка
		Recordset = Command.Execute();
	Исключение
		Connection.Close();
		ТекстНСТР = НСтр("en='Error occurred while executing coordinate record in external DB.';ru='Ошибка при выполнении записии координат во внешнюю БД.'") + " " + Символы.ПС +" " + НСтр("en='Command text:';ru='Текст команды:'") + " " + 
					ТекстКомманды + "." + Символы.ПС + " " + НСтр("en='Error description:';ru='Описание ошибки:'") + " " + ОписаниеОшибки();
		ЗаписатьСообщениеОбОшибке("SetVehiclePositions", ТекстНСТР);
		resultCode = 35;
		Возврат Ложь;
	КонецПопытки;
	
	Connection.Close();
	
	resultCode = 0;
	
	Возврат Истина;
	
КонецФункции // ЗаписатьКоординатыВоВнешнююБазу()

Процедура ОбновитьВремяПоследнегоСобытия(Знач ДанныеАвторизации)
	
	НаборЗаписейРСВодители = РегистрыСведений.уатВодителиНаЛинии.СоздатьНаборЗаписей(); 
	НаборЗаписейРСВодители.Заполнить(Неопределено);
	НаборЗаписейРСВодители.Отбор.ФизическоеЛицо.Установить(ДанныеАвторизации.ФизическоеЛицо);
	НаборЗаписейРСВодители.Отбор.ТС.Установить(ДанныеАвторизации.ТС);
	НаборЗаписейРСВодители.Прочитать();
	
	Если НаборЗаписейРСВодители.Количество() Тогда 
		НаборЗаписейРСВодители[0].ДатаПоследнегоСобытия = ТекущаяДата();
		НаборЗаписейРСВодители.Записать(Истина);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьМодельИВерсиюОСМобильногоУстройства(МобильноеУстройство, Модель, ВерсияОС)
	
	Если НЕ ЗначениеЗаполнено(Модель)
		И НЕ ЗначениеЗаполнено(ВерсияОС) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Терминал", МобильноеУстройство);
	Запрос.УстановитьПараметр("Модель", Модель);
	Запрос.УстановитьПараметр("ВерсияОС", ВерсияОС);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатМобильныеУстройства.Модель КАК Модель,
	|	уатМобильныеУстройства.ВерсияОС КАК ВерсияОС,
	|	уатМобильныеУстройства.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.уатМобильныеУстройства КАК уатМобильныеУстройства
	|ГДЕ
	|	уатМобильныеУстройства.Ссылка = &Терминал
	|	И (уатМобильныеУстройства.Модель <> &Модель
	|			ИЛИ уатМобильныеУстройства.ВерсияОС <> &ВерсияОС)";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда 
		ТерминалОбъект          = МобильноеУстройство.ПолучитьОбъект();
		ТерминалОбъект.Модель   = Модель;
		ТерминалОбъект.ВерсияОС = ВерсияОС;
		
		ТерминалОбъект.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьЦвет(Знач Красный, Знач Зеленый, Знач Синий) Экспорт
	
	ЦветСтр = "#"+ДесятичноеВШестнадцатеричное(Красный)+ДесятичноеВШестнадцатеричное(Зеленый)+ДесятичноеВШестнадцатеричное(Синий);
	
	Возврат ЦветСтр;
	
КонецФункции // ПолучитьЦветLeaflet()

Функция ДесятичноеВШестнадцатеричное(Знач дЧисло)
	
	Если дЧисло = 0 Тогда 
		Возврат "00";
	КонецЕсли;
	
	База = 16;
	Результат = "";
	Пока дЧисло <> 0 Цикл
		Поз =дЧисло % База;
		Результат = Сред("0123456789ABCDEF", Поз + 1, 1) + Результат;
		дЧисло = Цел(дЧисло / База);
	КонецЦикла;
	
	Если СтрДлина(Результат) = 1 Тогда 
		Возврат "0" + Результат;
	Иначе 
		Возврат Результат;
	КонецЕсли;
	
КонецФункции

Процедура СоздатьСкладскиеАкты(тблСкладскиеДанные, МаршрутныйЛистОбъект)
	
	ДанныеСкладскихАктов = тблСкладскиеДанные.Скопировать(, "МаршрутныйЛист, ВидОперации, Пункт, НачалоОперации, ОкончаниеОперации");
	ДанныеСкладскихАктов.Свернуть("МаршрутныйЛист, ВидОперации, Пункт, НачалоОперации, ОкончаниеОперации");
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеСкладскихАктов.ВидОперации КАК ВидОперации,
	|	ДанныеСкладскихАктов.Пункт КАК Пункт,
	|	ДанныеСкладскихАктов.МаршрутныйЛист КАК МаршрутныйЛист,
	|	ДанныеСкладскихАктов.НачалоОперации КАК НачалоОперации,
	|	ДанныеСкладскихАктов.ОкончаниеОперации КАК ОкончаниеОперации
	|ПОМЕСТИТЬ ДанныеСкладскихАктов
	|ИЗ
	|	&ДанныеСкладскихАктов КАК ДанныеСкладскихАктов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(уатАктОтгрузки_уэ.Ссылка, ЗНАЧЕНИЕ(Документ.уатАктОтгрузки_уэ.ПустаяСсылка)) КАК Ссылка,
	|	ДанныеСкладскихАктов.ВидОперации КАК ВидОперации,
	|	ДанныеСкладскихАктов.Пункт КАК Пункт,
	|	ДанныеСкладскихАктов.МаршрутныйЛист КАК МаршрутныйЛист
	|ПОМЕСТИТЬ втСкладскиеАкты
	|ИЗ
	|	ДанныеСкладскихАктов КАК ДанныеСкладскихАктов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.уатАктОтгрузки_уэ КАК уатАктОтгрузки_уэ
	|		ПО ДанныеСкладскихАктов.ВидОперации = уатАктОтгрузки_уэ.ВидОперации
	|			И ДанныеСкладскихАктов.Пункт = уатАктОтгрузки_уэ.Пункт
	|			И ДанныеСкладскихАктов.МаршрутныйЛист = уатАктОтгрузки_уэ.МаршрутныйЛист
	|ГДЕ
	|	уатАктОтгрузки_уэ.ПометкаУдаления = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЕСТЬNULL(уатАктПриемки_уэ.Ссылка, ЗНАЧЕНИЕ(Документ.уатАктПриемки_уэ.ПустаяСсылка)),
	|	ДанныеСкладскихАктов.ВидОперации,
	|	ДанныеСкладскихАктов.Пункт,
	|	ДанныеСкладскихАктов.МаршрутныйЛист
	|ИЗ
	|	ДанныеСкладскихАктов КАК ДанныеСкладскихАктов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.уатАктПриемки_уэ КАК уатАктПриемки_уэ
	|		ПО ДанныеСкладскихАктов.ВидОперации = уатАктПриемки_уэ.ВидОперации
	|			И ДанныеСкладскихАктов.Пункт = уатАктПриемки_уэ.Пункт
	|			И ДанныеСкладскихАктов.МаршрутныйЛист = уатАктПриемки_уэ.МаршрутныйЛист
	|ГДЕ
	|	уатАктПриемки_уэ.ПометкаУдаления = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеСкладскихАктов.ВидОперации КАК ВидОперации,
	|	ДанныеСкладскихАктов.Пункт КАК Пункт,
	|	ДанныеСкладскихАктов.МаршрутныйЛист КАК МаршрутныйЛист,
	|	МИНИМУМ(ДанныеСкладскихАктов.НачалоОперации) КАК НачалоОперации,
	|	МАКСИМУМ(ДанныеСкладскихАктов.ОкончаниеОперации) КАК ОкончаниеОперации,
	|	ВЫБОР
	|		КОГДА НЕ втСкладскиеАкты.Ссылка ЕСТЬ NULL
	|			ТОГДА втСкладскиеАкты.Ссылка
	|		КОГДА ТИПЗНАЧЕНИЯ(ДанныеСкладскихАктов.ВидОперации) = ТИП(Перечисление.уатВидыОперацийАктОтгрузки_уэ)
	|			ТОГДА ЗНАЧЕНИЕ(Документ.уатАктОтгрузки_уэ.ПустаяСсылка)
	|		КОГДА ТИПЗНАЧЕНИЯ(ДанныеСкладскихАктов.ВидОперации) = ТИП(Перечисление.уатВидыОперацийАктПриемки_уэ)
	|			ТОГДА ЗНАЧЕНИЕ(Документ.уатАктПриемки_уэ.ПустаяСсылка)
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Ссылка
	|ИЗ
	|	ДанныеСкладскихАктов КАК ДанныеСкладскихАктов
	|		ЛЕВОЕ СОЕДИНЕНИЕ втСкладскиеАкты КАК втСкладскиеАкты
	|		ПО ДанныеСкладскихАктов.ВидОперации = втСкладскиеАкты.ВидОперации
	|			И ДанныеСкладскихАктов.Пункт = втСкладскиеАкты.Пункт
	|			И ДанныеСкладскихАктов.МаршрутныйЛист = втСкладскиеАкты.МаршрутныйЛист
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеСкладскихАктов.ВидОперации,
	|	ДанныеСкладскихАктов.Пункт,
	|	ДанныеСкладскихАктов.МаршрутныйЛист,
	|	ВЫБОР
	|		КОГДА НЕ втСкладскиеАкты.Ссылка ЕСТЬ NULL
	|			ТОГДА втСкладскиеАкты.Ссылка
	|		КОГДА ТИПЗНАЧЕНИЯ(ДанныеСкладскихАктов.ВидОперации) = ТИП(Перечисление.уатВидыОперацийАктОтгрузки_уэ)
	|			ТОГДА ЗНАЧЕНИЕ(Документ.уатАктОтгрузки_уэ.ПустаяСсылка)
	|		КОГДА ТИПЗНАЧЕНИЯ(ДанныеСкладскихАктов.ВидОперации) = ТИП(Перечисление.уатВидыОперацийАктПриемки_уэ)
	|			ТОГДА ЗНАЧЕНИЕ(Документ.уатАктПриемки_уэ.ПустаяСсылка)
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ");
	Запрос.УстановитьПараметр("ДанныеСкладскихАктов", ДанныеСкладскихАктов);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтруктураПоиска = Новый Структура("ВидОперации, Пункт, МаршрутныйЛист", Выборка.ВидОперации, Выборка.Пункт, Выборка.МаршрутныйЛист);
		НайденныеСтроки = тблСкладскиеДанные.НайтиСтроки(СтруктураПоиска);
		Если ЗначениеЗаполнено(Выборка.Ссылка) Тогда
			СкладскойАктОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ИначеЕсли Выборка.Ссылка = Документы.уатАктОтгрузки_уэ.ПустаяСсылка() Тогда
			СкладскойАктОбъект = Документы.уатАктОтгрузки_уэ.СоздатьДокумент(); 
			СкладскойАктОбъект.Заполнить(Неопределено);
			СкладскойАктОбъект.Водитель1         = МаршрутныйЛистОбъект.Водитель1;
			СкладскойАктОбъект.ПринадлежностьПеревозки = МаршрутныйЛистОбъект.ПринадлежностьПеревозки;
		ИначеЕсли Выборка.Ссылка = Документы.уатАктПриемки_уэ.ПустаяСсылка() Тогда
			СкладскойАктОбъект = Документы.уатАктПриемки_уэ.СоздатьДокумент(); 
			СкладскойАктОбъект.Заполнить(Неопределено);
		Иначе
			Продолжить;
		КонецЕсли;
		СкладскойАктОбъект.СтатусВыполнения  = Справочники.уатСтатусы_уэ.Выполнен;
		СкладскойАктОбъект.НачалоОперации    = Выборка.НачалоОперации;
		СкладскойАктОбъект.ОкончаниеОперации = Выборка.ОкончаниеОперации;
		СкладскойАктОбъект.ОперацияВыполнена = ЗначениеЗаполнено(Выборка.ОкончаниеОперации);
		Если СкладскойАктОбъект.ЭтоНовый() Тогда
			СкладскойАктОбъект.Дата              = ТекущаяДатаСеанса();
			СкладскойАктОбъект.ВидОперации       = Выборка.ВидОперации;
			СкладскойАктОбъект.Пункт             = Выборка.Пункт;
			СкладскойАктОбъект.МаршрутныйЛист    = Выборка.МаршрутныйЛист;
			СкладскойАктОбъект.Организация       = МаршрутныйЛистОбъект.Организация;
			СкладскойАктОбъект.Ответственный     = МаршрутныйЛистОбъект.Ответственный;
		Иначе
			// Перезаписывается таблица грузов для существующего складского акта.
			// Только по тем зазакам, данные по которым обновляются, 
			// т.к. из мобильного приложения могут приходить данные только по части заказов
			Для Каждого ТекСтрокаГруза Из НайденныеСтроки Цикл
				СтрокиПоЗаказу = СкладскойАктОбъект.Грузы.НайтиСтроки(Новый Структура("Заказ", ТекСтрокаГруза.Заказ));
				Для Каждого ТекСтрокаДокумента Из СтрокиПоЗаказу Цикл
					СкладскойАктОбъект.Грузы.Удалить(ТекСтрокаДокумента);
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
		ЕстьРасхожденияПоАкту = Ложь;
		Для Каждого ТекСтрокаГруза Из НайденныеСтроки Цикл
			НоваяСтрока = СкладскойАктОбъект.Грузы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаГруза);
			ЕстьРасхожденияПоАкту = ЕстьРасхожденияПоАкту Или ТекСтрокаГруза.ЕстьРасхождения;
		КонецЦикла;
		СкладскойАктОбъект.ЕстьРасхождения = ЕстьРасхожденияПоАкту;
		// Флаги в Заказах и Маршрутных листах устанавливаются отдельно, чтобы не перезаписывать один документ несколько раз.
		СкладскойАктОбъект.ДополнительныеСвойства.Вставить("НеУстанавливатьФлагЕстьРасхождения", Истина);
		
		ОшибкаПриПроведении = Ложь;
		Попытка
			СкладскойАктОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ОшибкаПриПроведении = Истина;
			ЗаписатьСообщениеОбОшибке("UpdateOrders", ОписаниеОшибки());
		КонецПопытки;
		
		Если ОшибкаПриПроведении Тогда
			Попытка
				СкладскойАктОбъект.Записать();
			Исключение
				ЗаписатьСообщениеОбОшибке("UpdateOrders", ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьВсехВодителейНаЛинии()
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатВодителиНаЛинии.ФизическоеЛицо КАК ФизическоеЛицо
	|ИЗ
	|	РегистрСведений.уатВодителиНаЛинии КАК уатВодителиНаЛинии";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ФизическоеЛицо");
	
КонецФункции // ПолучитьВсехВодителейНаЛинии()

Процедура ИнициализацияДанныхПрицепа(Объект, Прицеп, НомерПрицепа = 0)
	
	Если НомерПрицепа = 0 Тогда
		// удаление строк с прицепом из ТЧ РасходГСМ
		мсвСтрокУдаления = Новый Массив;
		Для Каждого ТекСтрока Из Объект.РасходГСМ Цикл
			Если ТекСтрока.ТС = Прицеп Тогда
				мсвСтрокУдаления.Добавить(ТекСтрока);
			КонецЕсли;
		КонецЦикла;
		Для Каждого ТекСтрокаУдалить Из мсвСтрокУдаления Цикл
			Объект.РасходГСМ.Удалить(ТекСтрокаУдалить);
		КонецЦикла;
		
		Если ЗначениеЗаполнено(Прицеп) Тогда
			Если ЗначениеЗаполнено(Прицеп.Модель.ОсновноеТопливо) И Прицеп.Модель.НаличиеТопливногоБака = Истина Тогда
				НоваяСтрокаГСМ = Объект.РасходГСМ.Добавить();
				НоваяСтрокаГСМ.Активен = Истина;
				НоваяСтрокаГСМ.ТС = Прицеп;
				НоваяСтрокаГСМ.ГСМ = Прицеп.Модель.ОсновноеТопливо;
				НоваяСтрокаГСМ.ОстатокПриВыезде = уатОбщегоНазначения.уатОстатокГСМнаТС(Объект.ДатаВыезда, Прицеп,
				Прицеп.Модель.ОсновноеТопливо, Объект.Ссылка);
				НоваяСтрокаГСМ.ОстатокПриВозвращении = 0;
			КонецЕсли;
			
			// добавляем остатки ТЖ при выезде
			тблОстаткиТЖнаТС = уатПутевыеЛисты.ОстаткиТЖнаТС(Прицеп, Объект.ДатаВыезда);
			Для Каждого ТекСтрокаТЖ Из тблОстаткиТЖнаТС Цикл
				НоваяСтрокаГСМ 					= Объект.РасходГСМ.Добавить();
				НоваяСтрокаГСМ.ТС 				= Прицеп;
				НоваяСтрокаГСМ.ГСМ 				= ТекСтрокаТЖ.ТЖ;
				НоваяСтрокаГСМ.ОстатокПриВыезде = ТекСтрокаТЖ.Количество;
				НоваяСтрокаГСМ.ОстатокПриВозвращении = 0;
			КонецЦикла;
		КонецЕсли;
	Иначе
		Если ЗначениеЗаполнено(Прицеп)
			И Объект.РасходГСМ.НайтиСтроки(Новый Структура("ТС", Прицеп)).Количество()=0 Тогда
			Если ЗначениеЗаполнено(Прицеп.Модель.ОсновноеТопливо) И Прицеп.Модель.НаличиеТопливногоБака = Истина Тогда
				НоваяСтрокаГСМ = Объект.РасходГСМ.Добавить();
				НоваяСтрокаГСМ.Активен = Истина;
				НоваяСтрокаГСМ.ТС = Прицеп;
				НоваяСтрокаГСМ.ГСМ = Прицеп.Модель.ОсновноеТопливо;
				НоваяСтрокаГСМ.ОстатокПриВыезде = уатОбщегоНазначения.уатОстатокГСМнаТС(Объект.ДатаВыезда, Прицеп,
				Прицеп.Модель.ОсновноеТопливо, Объект.Ссылка);
				НоваяСтрокаГСМ.ОстатокПриВозвращении = 0;
			КонецЕсли;
			
			// добавляем остатки ТЖ при выезде
			тблОстаткиТЖнаТС = уатПутевыеЛисты.ОстаткиТЖнаТС(Прицеп, Объект.ДатаВыезда);
			Для Каждого ТекСтрокаТЖ Из тблОстаткиТЖнаТС Цикл
				НоваяСтрокаГСМ 					= Объект.РасходГСМ.Добавить();
				НоваяСтрокаГСМ.ТС 				= Прицеп;
				НоваяСтрокаГСМ.ГСМ 				= ТекСтрокаТЖ.ТЖ;
				НоваяСтрокаГСМ.ОстатокПриВыезде = ТекСтрокаТЖ.Количество;
				НоваяСтрокаГСМ.ОстатокПриВозвращении = 0;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ОчиститьУстаревшиеСообщения(ИдентификаторОбсуждения) 
	Попытка 
		УстановитьПривилегированныйРежим(Истина);   
		ОтборСообщений = Новый ОтборСообщенийСистемыВзаимодействия;
		ОтборСообщений.Обсуждение            = ИдентификаторОбсуждения;
		ОтборСообщений.НаправлениеСортировки = НаправлениеСортировки.Возр;
		ОтборСообщений.Количество            = 100;
		
		Сообщения   = СистемаВзаимодействия.ПолучитьСообщения(ОтборСообщений);
		ТекущаяДата = ТекущаяДатаСеанса() - 3600;
		
		Для Каждого Сообщение Из Сообщения Цикл
			Если НЕ ЗначениеЗаполнено(Сообщение.Текст)
				И Сообщение.Дата < ТекущаяДата Тогда
				СистемаВзаимодействия.УдалитьСообщение(Сообщение.Идентификатор); 
			КонецЕсли;
		КонецЦикла;
		УстановитьПривилегированныйРежим(Ложь);
	Исключение
	КонецПопытки;
	
КонецПроцедуры

Функция НайтиКонтрагента(НаименованиеКонтрагента)
	
	Контрагент = Справочники.Контрагенты.ПустаяСсылка();
	Если Не ЗначениеЗаполнено(НаименованиеКонтрагента) Тогда
		Возврат Контрагент;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Наименование", НаименованиеКонтрагента);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Контрагенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Наименование = &Наименование
	|	И НЕ Контрагенты.ПометкаУдаления
	|	И НЕ Контрагенты.ЭтоГруппа";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Контрагент = Выборка.Ссылка;
	КонецЕсли;
	Возврат Контрагент;
	
КонецФункции

Процедура ЗаполнитьФактическоеПосещениеПунктовМЛ(МаршЛистОб)
	УстановитьПривилегированныйРежим(Истина); 
	УчетПланФакта = Константы.уатУчетПланФактаПоМаршрутуВМаршрутныхЛистах.Получить();
	
	Данные = Новый Массив();
	Для Каждого ТекСтрока Из МаршЛистОб.Заказы Цикл
		СтруктураДанных = Новый Структура("МаршрутныйДокумент, НомерЕздки, НомерСтроки, Выполнен, ПрибытиеФакт, УбытиеФакт,
		|АдресПрибытия, АдресУбытия, ПрибытиеПлан, УбытиеПлан");
		СтруктураДанных.МаршрутныйДокумент	 = МаршЛистОб.Ссылка;
		СтруктураДанных.НомерЕздки			 = 0;
		СтруктураДанных.НомерСтроки			 = ТекСтрока.GUIDСтроки;
		СтруктураДанных.Выполнен			 = ТекСтрока.Выполнен;  
		
		Если УчетПланФакта Тогда
			СтруктураДанных.ПрибытиеФакт		 = ТекСтрока.ПрибытиеФакт;
			СтруктураДанных.УбытиеФакт			 = ТекСтрока.УбытиеФакт;
		Иначе
			СтруктураДанных.ПрибытиеФакт		 = ТекСтрока.ПрибытиеПлан;
			СтруктураДанных.УбытиеФакт			 = ТекСтрока.УбытиеПлан;
		КонецЕсли;
		СтруктураДанных.АдресПрибытия		 = ТекСтрока.Пункт;
		СтруктураДанных.ПрибытиеПлан		 = ТекСтрока.ПрибытиеПлан;
		СтруктураДанных.УбытиеПлан			 = ТекСтрока.УбытиеПлан;
		Данные.Добавить(СтруктураДанных);
	КонецЦикла;
	
	уатЗащищенныеФункцииСервер_проф.ЗаполнитьФактическоеВремяИРасстояние(Данные, МаршЛистОб.ТС, УчетПланФакта);
	
	СуммарноеВремяСтоянкиЗаказов = 0; 
	КолВоЗаказов                 = 0;
	ТекПункт                     = Неопределено;
	МассивСтрок                  = Новый Массив();
	Для Каждого ТекСтрока Из Данные Цикл 
		Если ТекПункт = Неопределено Тогда
			ТекПункт = ТекСтрока.АдресПрибытия;
		ИначеЕсли ТекПункт <> ТекСтрока.АдресПрибытия Тогда
			ТекПункт = ТекСтрока.АдресПрибытия; 
			Если СуммарноеВремяСтоянкиЗаказов > 0 Тогда
				КолВоЗаказов    = ?(КолВоЗаказов > 0, КолВоЗаказов, 1);
				СтоянкаСек      = Цел(СуммарноеВремяСтоянкиЗаказов) * 60 * 60 + (СуммарноеВремяСтоянкиЗаказов - Цел(СуммарноеВремяСтоянкиЗаказов)) * 100 * 60;
				СтоянкаДобавить = СтоянкаСек / КолВоЗаказов;
				
				СтоянкаЧас = Цел(СтоянкаДобавить / 3600);
				СтоянкаМин = Цел((СтоянкаДобавить - СтоянкаЧас * 3600) / 60);
				Стоянка    = СтоянкаЧас + (СтоянкаМин / 100);
				СтоянкаДобавить = Стоянка;
				
 			Для Каждого ТекСтрокаЗаказ Из МассивСтрок Цикл 
					ТекСтрокаЗаказ.СтоянкаФакт = уатЗащищенныеФункцииСервер.СложитьВремя(ТекСтрокаЗаказ.СтоянкаФакт, СтоянкаДобавить);
				КонецЦикла;
			КонецЕсли;
			СуммарноеВремяСтоянкиЗаказов = 0;
			КолВоЗаказов                 = 0;
			МассивСтрок                  = Новый Массив();
		КонецЕсли;
		Если ТекСтрока.Свойство("СтоянкаФакт")
			И ЗначениеЗаполнено(ТекСтрока.СтоянкаФакт) Тогда 
			СуммарноеВремяСтоянкиЗаказов = уатЗащищенныеФункцииСервер.СложитьВремя(СуммарноеВремяСтоянкиЗаказов, ТекСтрока.СтоянкаФакт);
			ТекСтрока.СтоянкаФакт = 0;
		КонецЕсли;  
		МассивСтрок.Добавить(ТекСтрока);
		КолВоЗаказов = КолВоЗаказов +1;
	КонецЦикла;
	Если СуммарноеВремяСтоянкиЗаказов > 0 Тогда
		КолВоЗаказов    = ?(КолВоЗаказов > 0, КолВоЗаказов, 1);
		СтоянкаСек      = Цел(СуммарноеВремяСтоянкиЗаказов) * 60 * 60 + (СуммарноеВремяСтоянкиЗаказов - Цел(СуммарноеВремяСтоянкиЗаказов)) * 100 * 60;
		СтоянкаДобавить = СтоянкаСек / КолВоЗаказов;
		
		СтоянкаЧас = Цел(СтоянкаДобавить / 3600);
		СтоянкаМин = Цел((СтоянкаДобавить - СтоянкаЧас * 3600) / 60);
		Стоянка    = СтоянкаЧас + (СтоянкаМин / 100);
		СтоянкаДобавить = Стоянка;
		
		Для Каждого ТекСтрокаЗаказ Из МассивСтрок Цикл 
			ТекСтрокаЗаказ.СтоянкаФакт = уатЗащищенныеФункцииСервер.СложитьВремя(ТекСтрокаЗаказ.СтоянкаФакт, СтоянкаДобавить);
		КонецЦикла;
	КонецЕсли; 
	
	Для Каждого ТекСтрока Из Данные Цикл 
		НайдСтроки = МаршЛистОб.Заказы.НайтиСтроки(Новый Структура("GUIDСтроки", ТекСтрока.НомерСтроки));
		Для Каждого Строка Из НайдСтроки Цикл
			Если УчетПланФакта Тогда
				ДанныеЗаполнения = Новый Структура("РасстояниеФакт,СтоянкаФакт,ВремяФакт");
			Иначе
				ДанныеЗаполнения = Новый Структура("Расстояние,Стоянка,Время");
			КонецЕсли; 
			ЗаполнитьЗначенияСвойств(ДанныеЗаполнения, ТекСтрока);
			ЗаполнитьЗначенияСвойств(Строка, ДанныеЗаполнения);
		КонецЦикла;
	КонецЦикла;
		
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

#КонецОбласти