#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция НайтиСоздать(Наименование) Экспорт
	
	Ссылка = НайтиПоНаименованию(Наименование, Истина);
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Возврат Ссылка;
	КонецЕсли;
	
	ТочкаМаршрута = СоздатьЭлемент();
	ТочкаМаршрута.Заполнить(Неопределено);
	ТочкаМаршрута.Наименование = Наименование;
	Если ТочкаМаршрута.ПроверитьЗаполнение() Тогда
		ТочкаМаршрута.Записать();
		Возврат ТочкаМаршрута.Ссылка;
	КонецЕсли;
	
	Возврат ПустаяСсылка();
	
КонецФункции

#КонецОбласти

#КонецЕсли
