
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Автотест = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Автотест Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДекорацияОписаниеОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	Если Модифицированность Тогда 
		ТекстНСТР = НСтр("ru = 'Необходимо записать изменения.'; en = 'It is necessary to record the changes.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР);
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;

	Если НавигационнаяСсылкаФорматированнойСтроки = "e1cib/list/Справочник.уатПрофилиОбменаСВнешнимиСистемами" Тогда
		СтандартнаяОбработка = Ложь;
		ПараметрыВыбора      = Неопределено;
		
		ТекущаяСтраница = Элементы.ГруппаСтраницыСистемы.ТекущаяСтраница;
		Если ТекущаяСтраница = Элементы.ГруппаСтраницаПлатон Тогда
			ЗначениеОтбора  = Новый Структура("ВнешняяСистема",
				ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.Платон"));
			ПараметрыВыбора = Новый Структура("Отбор", ЗначениеОтбора);
		ИначеЕсли ТекущаяСтраница = Элементы.ГруппаСтраницаАвтодор Тогда
			ЗначениеОтбора  = Новый Структура("ВнешняяСистема",
				ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.Автодор"));
			ПараметрыВыбора = Новый Структура("Отбор", ЗначениеОтбора);
		КонецЕсли;
		ОткрытьФорму("Справочник.уатПрофилиОбменаСВнешнимиСистемами.Форма.ФормаСписка", ПараметрыВыбора); 
	КонецЕсли;

КонецПроцедуры


#КонецОбласти

