
////////////////////////////////////////////////////////////////////////////////
// Переопределяемые процедуры, вызываемые из обработчиков форм.
// 
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Функция СправочникУатТСФормаЭлементаВодительОбработкаВыбораНаСервере(Знач ДанныеВыбора) Экспорт
	
	Результат = Новый Структура();
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ФизЛицо", ДанныеВыбора.ФизЛицо); 
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	уатСотрудникиКонтрагентов.Контрагент
	|ИЗ
	|	РегистрСведений.уатСотрудникиКонтрагентов КАК уатСотрудникиКонтрагентов
	|ГДЕ
	|	уатСотрудникиКонтрагентов.ФизЛицо = &ФизЛицо";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат.Вставить("ВладелецТС", Выборка.Контрагент);
	КонецЕсли;
	
	Результат.Вставить("Водитель", ДанныеВыбора.ФизЛицо);
	
	Возврат Результат;
	
КонецФункции // СправочникУатТСФормаЭлементаВодительОбработкаВыбораНаСервере()

Функция ПолучитьЗначениеПоляРасшифровкиОтчетаАнализКластеровБезРасстояний(ОтчетДанныеРасшифровки, Расшифровка) Экспорт
	
	Попытка
		СсылкаДляРасшифровки = ПолучитьИзВременногоХранилища(ОтчетДанныеРасшифровки).Элементы[Расшифровка].ПолучитьПоля()[0].Значение;
	Исключение
		СсылкаДляРасшифровки = Неопределено;
	КонецПопытки;
	
	Возврат СсылкаДляРасшифровки;
	
КонецФункции

// Функция возвращает уникальный идентификатор предопределенного регламентного задания
Функция ПолучитьИдентификаторРегламентногоЗадания(ИмяРегламентногоЗадания) Экспорт
	
	РегламентноеЗадание = РегламентныеЗадания.НайтиПредопределенное(ИмяРегламентногоЗадания);
	Возврат РегламентноеЗадание.УникальныйИдентификатор;
	
КонецФункции

#КонецОбласти
