
#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиСобытийОбъекта

// См. уатСогласованиеДокументовСервер.СтатусСогласования
Функция СтатусСогласования(ДокументСсылка) Экспорт
	
	Возврат уатСогласованиеДокументовСервер.СтатусСогласования(ДокументСсылка);
	
КонецФункции

// См. уатСогласованиеДокументовСервер.СоздатьБизнесПроцессСогласования
Процедура СоздатьБизнесПроцессСогласования(ДокументСсылка) Экспорт
	
	уатСогласованиеДокументовСервер.СоздатьБизнесПроцессСогласования(ДокументСсылка);
	
КонецПроцедуры

// См. уатСогласованиеДокументовСервер.ДокументТребуетСогласования
Функция ДокументТребуетСогласования(ВидДокумента, СтруктураОбъектовНастроек) Экспорт
	
	уатСогласованиеДокументовСервер.ДокументТребуетСогласования(ВидДокумента, СтруктураОбъектовНастроек)
	
КонецФункции

#КонецОбласти

#КонецОбласти

