#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

	
#Область ПрограммныйИнтерфейс

// Задает настройки размещения вариантов отчетов в панели отчетов.
// См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//
// Параметры:
//   Настройки - Коллекция - Используется для описания настроек отчетов и вариантов
//       см. описание к ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//   НастройкиОтчета - СтрокаДереваЗначений - Настройки размещения всех вариантов отчета.
//       См. ""Реквизиты для изменения"" функции ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "Рентабельность по заказам");
	НастройкиВарианта.Описание = НСтр("en='Report is intended for analysis of income and expenses on orders.';ru='Отчет предназначен для анализа доходов и расходов по заказам.'");
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "Рентабельность по транспортным средствам");
	НастройкиВарианта.Описание = НСтр("en='Report is intended for the analysis of income and expenses on vehicles.';ru='Отчет предназначен для анализа доходов и расходов по транспортным средствам.'");
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "Рентабельность по сцепкам");
	НастройкиВарианта.Описание = НСтр("en='Report is intended for analysis of income and expenses for coupling of vehicles.';ru='Отчет предназначен для анализа доходов и расходов по сцепкам транспортных средств.'");
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "Рентабельность мультимодальных заказов");
	НастройкиВарианта.Описание = НСтр("en='Report is intended for analysis of income and expenses for multimodal orders.';ru='Отчет предназначен для анализа доходов и расходов по мультимодальным заказам.'");
	НастройкиВарианта.ФункциональныеОпции.Добавить("уатИспользоватьМультимодальныеПеревозки_уэ");
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	уатЗащищенныеФункцииСервер.уатОтчетОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьРентабельность(Знач СуммаДоходов, Знач СуммаЗатрат, Знач Прибыль) Экспорт
	
	Если СуммаДоходов = Null И СуммаЗатрат = Null И Прибыль = Null Тогда 
		Возврат "";
	КонецЕсли;
	
	Если СуммаДоходов = Null Тогда 
		СуммаДоходов = 0;
	КонецЕсли;
	Если СуммаЗатрат = Null Тогда 
		СуммаЗатрат = 0;
	КонецЕсли;
	Если Прибыль = Null Тогда 
		Прибыль = 0;
	КонецЕсли;
	
	//Если Прибыль = 0 Тогда 
	//	Возврат "0 %";
	//ИначеЕсли СуммаЗатрат = 0 И СуммаДоходов > 0 Тогда 
	//	Возврат "∞";
	//ИначеЕсли СуммаЗатрат = 0 Тогда 
	//	Возврат "0 %";
	//Иначе 
	//	Возврат Формат((Прибыль / СуммаЗатрат) * 100, "ЧДЦ=1; ЧН=0") + " %";
	//КонецЕсли;
	
	Если Прибыль = 0 Тогда 
		Возврат 0;
	ИначеЕсли СуммаЗатрат = 0 И СуммаДоходов > 0 Тогда 
		Возврат "∞";
	ИначеЕсли СуммаЗатрат = 0 Тогда 
		Возврат 0;
	Иначе 
		Возврат Окр((Прибыль / СуммаЗатрат) * 100, 1);
	КонецЕсли;
	
КонецФункции // ПолучитьРентабельность()

#КонецОбласти


#КонецЕсли