
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Обработчик = Новый ОписаниеОповещения("ЗагрузитьШтрафыЗавершение", ЭтотОбъект, ПараметрыВыполненияКоманды.Источник);
	ПараметрыОткрытияФормы = Новый Структура();
	ПараметрыОткрытияФормы.Вставить("Заголовок", Нстр("ru = 'Выберите учетную запись'; en = 'Select the account'"));
	ПараметрыОткрытияФормы.Вставить("ЗагрузкаПроездовВОтчетыСистемыАвтодор", Истина);
	ПараметрыОткрытияФормы.Вставить("Отбор", Новый Структура("ВнешняяСистема",
		ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.ШтрафовНет")));
	ОткрытьФорму("Справочник.уатУчетныеЗаписиСервисовШтрафов.ФормаВыбора", ПараметрыОткрытияФормы, ПараметрыВыполненияКоманды.Источник,,,,Обработчик);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗагрузитьШтрафыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийПериод = Новый СтандартныйПериод;
	
	Обработчик    = Новый ОписаниеОповещения("ЗагрузитьШтрафыЗавершениеПериод", ЭтотОбъект,
		Новый Структура("УчетнаяЗапись, ДополнительныеПараметры", Результат, ДополнительныеПараметры));
	Диалог        = Новый ДиалогРедактированияСтандартногоПериода;
	Диалог.Период = ТекущийПериод;
	Диалог.Показать(Обработчик);

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьШтрафыЗавершениеПериод(Результат, ДопПараметры) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	ДатаНачала    = НачалоДня(Результат.ДатаНачала);
	ДатаОкончания = НачалоДня(Результат.ДатаОкончания);
		
	Загружено   = 0;
	ЗагрузитьШтрафыЗавершениеСервер(ДопПараметры.УчетнаяЗапись, ДатаНачала, ДатаОкончания, Загружено, ДопПараметры.ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьШтрафыЗавершениеСервер(Результат, ДатаНачала, ДатаОкончания, Загружено = 0, ФормаВладелец)
	
	ТекстОшибки = "";

	ДлительнаяОперация = ЗагрузитьШтрафыЗавершениеДлительнаяОперацияСервер(Результат, ДатаНачала, ДатаОкончания, ТекстОшибки);
	
	НастройкиОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ФормаВладелец);
	НастройкиОжидания.ВыводитьОкноОжидания       = Истина;
	НастройкиОжидания.ВыводитьПрогрессВыполнения = Истина;
	
	Обработчик = Новый ОписаниеОповещения("ЗагрузитьШтрафыЗавершениеДлительнаяОперацияЗавершение", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Обработчик, НастройкиОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьШтрафыЗавершениеДлительнаяОперацияЗавершение(Операция, ДополнительныеПараметры) Экспорт
	
	Если Операция = Неопределено Тогда
		
	Иначе
		Если Операция.Статус = "Выполнено" Тогда
			Если ЭтоАдресВременногоХранилища(Операция.АдресРезультата) Тогда
				Данные = ПолучитьИзВременногоХранилища(Операция.АдресРезультата);
				Если ТипЗнч(Данные) = Тип("Структура") Тогда
					Если Данные.Свойство("ТекстОшибки") Тогда
						Если ЗначениеЗаполнено(Данные.ТекстОшибки) Тогда
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Данные.ТекстОшибки);
							Возврат;
						Иначе
							ОповеститьОбИзменении(Тип("ДокументСсылка.уатОтчетСистемыАвтодор"));
						КонецЕсли;
					КонецЕсли;
					
				КонецЕсли;
			КонецЕсли;
		Иначе
			ВызватьИсключение Операция.КраткоеПредставлениеОшибки;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьШтрафыЗавершениеДлительнаяОперацияСервер(УчетнаяЗапись, ДатаНачала, ДатаОкончания, ТекстОшибки)
	
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Загрузка информации о проездах по ЦКАД'; en = 'Loading information about travel along the Central Ring Road'");
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	
	ПараметрыПроцедуры = Новый Структура("УчетнаяЗапись, ДатаНачала, ДатаОкончания", УчетнаяЗапись, ДатаНачала, ДатаОкончания);
	Если УчетнаяЗапись.ЗагрузкаПроездовПоЦКАДвОтчетыСистемыАвтодор Тогда
		ПараметрыПроцедуры.Вставить("ЗагрузкаПроездовПоЦКАДвОтчетыСистемыАвтодор", Истина);
	Иначе
		ПараметрыПроцедуры.Вставить("ЗагрузкаПроездовПоПлатнымБезбарьернымДорогамВОтчетыСистемыАвтодор", Истина);
	КонецЕсли; 
	Возврат ДлительныеОперации.ВыполнитьВФоне(
	"уатИнтеграции_проф.ШтрафовНет_СписокШтрафовДлительнаяОперация",
	ПараметрыПроцедуры,
	ПараметрыВыполнения);
	
КонецФункции

#КонецОбласти