
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)   
	
	Обработчик = Новый ОписаниеОповещения("ЗагрузитьГеозоныЗавершение", ЭтотОбъект); 
	
	ПараметрыОткрытия = Новый Структура();
	ОткрытьФорму("Справочник.уатГеозоны_уэ.Форма.ФормаВыбораГеозоныЯндекс", ПараметрыОткрытия,,,,, Обработчик);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗагрузитьГеозоныЗавершение(мсвГеозон, ДополнительныеПараметры) Экспорт
	
	Если мсвГеозон = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Загружено   = 0;
	Обновлено   = 0;
	НеЗагружено = 0;
	ЗагрузитьГеозоныЗавершениеСервер(мсвГеозон, Загружено, Обновлено, НеЗагружено);
	
	Если Загружено = 0 Тогда
		ТекстСообщения = НСтр("ru='Загрузка геозон завершена.';en='Download is complete.'");
	Иначе
		ТекстСообщения = НСтр("ru = 'Загрузка геозон выполнена успешно.'; en = 'Geozones loaded successfully.'");
	КонецЕсли;
	Если Загружено > 0 
		ИЛИ НеЗагружено > 0 
		ИЛИ Обновлено > 0 Тогда   
		
		ТекстСообщения = ТекстСообщения + Символы.ПС + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='Загружено новых: %1';en='Imported new: %1'"), Загружено);  
		Если Обновлено > 0 Тогда
			ТекстСообщения = ТекстСообщения + Символы.ПС + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Обновлено: %1';en='Updated: %1'"), Обновлено);
		КонецЕсли;
		Если НеЗагружено > 0 Тогда
			ТекстСообщения = ТекстСообщения + Символы.ПС + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Не загружено: %1';en='Not uploaded: %1'"), НеЗагружено);
		КонецЕсли;
	Иначе
		ТекстСообщения = ТекстСообщения + Символы.ПС + НСтр("ru='Изменений нет.';en='There are no changes.'");
	КонецЕсли;
	ПоказатьПредупреждение(Неопределено, ТекстСообщения,,НСтр("ru = 'Загрузка геозон'; en = 'Loading geofences'"));
	ОповеститьОбИзменении(Тип("СправочникСсылка.уатГеозоны_уэ"));
	Оповестить("ЗаписьЭлементаЗоны");

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьГеозоныЗавершениеСервер(мсвГеозон, Загружено, Обновлено, НеЗагружено)
	
	Для Каждого ТекГеозона Из мсвГеозон Цикл
		СтрокаВБазе = Справочники.уатГеозоны_уэ.НайтиПоРеквизиту("НомерЯндекс", ТекГеозона.Номер);
		
		// Либо такой элемент в справочнике уже есть
		ФлагЗагружено = Ложь;
		ФлагОбновлено = Ложь;
		Если ЗначениеЗаполнено(СтрокаВБазе) Тогда
			НоваяГеозона = СтрокаВБазе.ПолучитьОбъект();
			НоваяГеозона.НомерЯндекс         = ТекГеозона.Номер;
			НоваяГеозона.ИдентификаторЯндекс = ТекГеозона.Идентификатор; 
			ФлагОбновлено = Истина;
		Иначе
			НоваяГеозона = Справочники.уатГеозоны_уэ.СоздатьЭлемент();
			НоваяГеозона.Наименование = ТекГеозона.Номер;
			НоваяГеозона.НомерЯндекс         = ТекГеозона.Номер;
			НоваяГеозона.ИдентификаторЯндекс = ТекГеозона.Идентификатор; 
			ФлагЗагружено = Истина;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ТекГеозона.Цвет) Тогда
			Красный = 0; 	
			Зеленый = 0;
			Синий   = 0;
		Иначе
			Красный = ЧислоИзШестнадцатеричнойСтроки("0x" + Сред(ТекГеозона.Цвет, 2, 2)); 	
			Зеленый = ЧислоИзШестнадцатеричнойСтроки("0x" + Сред(ТекГеозона.Цвет, 4, 2));
			Синий   = ЧислоИзШестнадцатеричнойСтроки("0x" + Сред(ТекГеозона.Цвет, 6, 2));
		КонецЕсли;
		ЦветФона = Новый Цвет(Красный, Зеленый, Синий);

		НоваяГеозона.ЦветЗоныХранилище = Новый ХранилищеЗначения(ЦветФона, Новый СжатиеДанных(9));
		
		ОМ_уатВнешнийМаршрутизаторСервер_уэ = ОбщегоНазначения.ОбщийМодуль("уатВнешнийМаршрутизаторСервер_уэ");
		НоваяГеозона.ЦветЯндекс = ОМ_уатВнешнийМаршрутизаторСервер_уэ.ПолучитьНомерЦветаГеозоныЯндекс(ЦветФона); 
		
		НоваяГеозона.Координаты.Очистить();
		Для Каждого ТекСтрока Из ТекГеозона.Координаты Цикл
			ТекКоординаты = НоваяГеозона.Координаты.Добавить();
			ТекКоординаты.Лат = ТекСтрока.Лат;
			ТекКоординаты.Лон = ТекСтрока.Лон;
		КонецЦикла;  
		Попытка
			НоваяГеозона.Записать();
			Если ФлагЗагружено Тогда
				Загружено = Загружено + 1;
			Иначе
				Обновлено = Обновлено + 1;
			КонецЕсли;
		Исключение  
			НеЗагружено = НеЗагружено + 1;
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти