
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Создать(Команда)
	Обработчик = Новый ОписаниеОповещения("СоздатьЗавершение", ЭтотОбъект); 
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора",,ЭтотОбъект,,,,Обработчик);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СоздатьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытияФормы = Новый Структура();
	ПараметрыОткрытияФормы.Вставить("Владелец", Результат);
	ОткрытьФорму("Справочник.ЕдиницыИзмерения.Форма.ФормаЭлемента",ПараметрыОткрытияФормы, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти
