#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("ВидСправочника") Тогда
		ВидСправочника = Параметры.ВидСправочника;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ВладелецФормы = Неопределено Тогда
		СтандартнаяОбработка = Ложь;
		Отказ = Истина;
		
		ТекстНСТР = НСтр("en='This processing is called from other procedures of configuration."
"It is forbidden to call it manually!';ru='Данная обработка вызывается из других процедур конфигурации."
"Вручную ее вызывать запрещено!'");
		ПоказатьПредупреждение(Неопределено, ТекстНСТР, 10);
		Возврат;
	КонецЕсли;
	
	НастройкаДереваГрупп();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДеревоВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
    Оповещение();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	Оповещение();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастройкаДереваГрупп()
	//// Спрячем элемент управления, дабы все действия проходили быстрее
	//Элементы.Дерево.Видимость = ЛОЖЬ;
	
	// Настроим элемент управления на нужный тип данных
	Дерево.ОсновнаяТаблица = "Справочник." + ВидСправочника;
	Элементы.Дерево.ТолькоПросмотр = Истина;
	
	// Установим все необходимые настройки
	//ЭлементыФормы.Дерево.Значение.Отбор.ЭтоГруппа.Значение		= ИСТИНА;
	//ЭлементыФормы.Дерево.Значение.Отбор.ЭтоГруппа.Использование	= ИСТИНА;
	Если Метаданные.Справочники[ВидСправочника].Иерархический Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Дерево.Отбор, "ЭтоГруппа", Истина);
	КонецЕсли;
	
	//// ... а теперь и для колонки
	//Колонка						= ЭлементыФормы.Дерево.Колонки.Добавить("Наименование");
	//Колонка.Данные				= "Наименование";
	//Колонка.ОтображатьИерархию	= ИСТИНА;
	//Колонка.УстановитьЭлементУправления(Тип("ПолеВвода"));
	
	//// Все готово, можно показывать
	//Элементы.Дерево.Видимость = ИСТИНА;
КонецПроцедуры

&НаКлиенте
Процедура Оповещение()
	Если Элементы.Дерево.ТекущиеДанные = Неопределено ИЛИ Элементы.Дерево.ТекущиеДанные.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли; 
	
	ВыбранноеЗначение = Новый Структура;
	ВыбранноеЗначение.Вставить("Значение", Элементы.Дерево.ТекущиеДанные.Ссылка);
	ВыбранноеЗначение.Вставить("УстанавливатьПометку", УстанавливатьПометку);
	ОповеститьОВыборе(ВыбранноеЗначение);
КонецПроцедуры

#КонецОбласти
