
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	уатЗащищенныеФункцииСервер.уатОтчетОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Настройки размещения в панели отчетов.
//
// Параметры:
//   Настройки – Коллекция – Используется для описания настроек отчетов и вариантов
//       см. описание к ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//   НастройкиОтчета – СтрокаДереваЗначений – Настройки размещения всех вариантов отчета.
//       См. "Реквизиты для изменения" функции ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//
// Описание:
//   См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//
// Вспомогательные методы:
//   НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "<ИмяВарианта>");
//   ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, НастройкиОтчета, Истина/Ложь); // Отчет
//   поддерживает только этот режим.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "Показатели выполнения Маршрутных листов (без группировок)");
	НастройкиВарианта.Описание = НСтр("en='Report provides information on statistics of routing list execution.';ru='Отчет предназначен для анализа отклонения факта от плана по маршрутным листам.'");
	НастройкиВарианта.ВидимостьПоУмолчанию = Истина;

	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "Показатели выполнения Маршрутных листов (по перевозчикам и водителям)");
	НастройкиВарианта.Описание = НСтр("en='Report provides information on statistics of routing list execution in context of carriers and drivers.';ru='Отчет предназначен для анализа отклонения факта от плана по маршрутным листам в разрезе перевозчиков и водителей.'");
	НастройкиВарианта.ВидимостьПоУмолчанию = Ложь;
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "Показатели выполнения Маршрутных листов (по пунктам назначения)");
	НастройкиВарианта.Описание = НСтр("en='Report provides information on statistics of routing list execution in context of points.';ru='Отчет предназначен для анализа отклонения факта от плана по маршрутным листам в разрезе пунктов назначения.'");
	НастройкиВарианта.ВидимостьПоУмолчанию = Ложь;
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "Показатели выполнения Маршрутных листов (по контрагентам и заказам на ТС)");
	НастройкиВарианта.Описание = НСтр("en='Report provides information on statistics of routing list execution in context of counterparties and trucking orders.';ru='Отчет предназначен для анализа отклонения факта от плана по маршрутным листам в разрезе контрагентов и Заказов на ТС.'");
	НастройкиВарианта.ВидимостьПоУмолчанию = Ложь;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
