////////////////////////////////////////////////////////////////////////////////
// Управление автотранспортом.
// 
// Защищенные функции клиенсткого контекста.
////////////////////////////////////////////////////////////////////////////////


#Область СлужебныйПрограммныйИнтерфейс

#Область ПроцедурыФункцииОткрытияОбъектов

// Процедура проверки защиты при событии "При открытии" формы списка справочника 
//
Процедура уатСправочникФормаСпискаПриОткрытии(Отказ, ДопПараметры) Экспорт
	
	уатФормаПриОткрытии(Отказ, Неопределено, ДопПараметры);
	
КонецПроцедуры

// Процедура проверки защиты при событии "При открытии" формы элемента справочника
//
Процедура уатСправочникФормаЭлементаПриОткрытии(Отказ, ДопПараметры = Неопределено) Экспорт
	
	уатФормаПриОткрытии(Отказ, Неопределено, ДопПараметры);
	
КонецПроцедуры

// Процедура проверки защиты при событии "При открытии" формы списка документа
//
Процедура уатДокументФормаСпискаПриОткрытии(Отказ, Форма, ДопПараметры = Неопределено) Экспорт
	
	уатФормаПриОткрытии(Отказ, Форма, ДопПараметры);
	
КонецПроцедуры

// Процедура проверки защиты при событии "При открытии" формы элемента документа
//
Процедура уатДокументФормаЭлементаПриОткрытии(Отказ, Форма, ДопПараметры = Неопределено) Экспорт
	
	уатФормаПриОткрытии(Отказ, Форма, ДопПараметры);
	
КонецПроцедуры

// Процедура проверки защиты при событии "При открытии" формы обработки
//
Процедура уатОбработкаФормаПриОткрытии(Отказ, ДопПараметры = Неопределено) Экспорт
	
	уатФормаПриОткрытии(Отказ, Неопределено, ДопПараметры);
	
	// Фиксация замера производительности
	ИмяФормы = Неопределено;
	ДопПараметры.Свойство("ИмяФормы",ИмяФормы);
	Если ИмяФормы <> Неопределено Тогда
		ИмяКлючевойОперации = "ОткрытиеФормы." + уатОбщегоНазначенияКлиентСервер.ОбрезатьИмяФормы(ИмяФормы);
		ОценкаПроизводительностиКлиент.ЗамерВремени(ИмяКлючевойОперации);
	КонецЕсли;	
	
КонецПроцедуры

// Процедура проверки защиты при событии "При открытии" формы списка регистра
//
Процедура уатРегистрФормаСпискаПриОткрытии(Отказ, ДопПараметры = Неопределено) Экспорт
	
	уатФормаПриОткрытии(Отказ, Неопределено, ДопПараметры);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыФункцииРаботыСГСМ

// Выбор номенклатуры из регистра сведений НоменклатураГСМ
// Параметры: ГруппаГСМ
// Возвращаемое значение: Справочник-ссылка Номенклатура
Процедура ВыбратьГСМ(ГруппаГСМ = Неопределено, ДополнительныеПараметры = Неопределено, ПроцедураОписаниеОповещения = Неопределено) ЭКСПОРТ
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВыборГСМ", Истина);
	
	Если ЗначениеЗаполнено(ГруппаГСМ) Тогда
		ПараметрыФормы.Вставить("ГруппаГСМ", ГруппаГСМ);
	Иначе
		ПараметрыФормы.Вставить("ГруппаГСМ", ПредопределенноеЗначение("Перечисление.уатГруппыГСМ.Топливо"));
	КонецЕсли;
	
	КлючУникальности = Неопределено;
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") Тогда
		Если ДополнительныеПараметры.Свойство("ЗначениеГСМДоИзменения") Тогда
			ПараметрыФормы.Вставить("НачальноеЗначениеВыбора", ДополнительныеПараметры.ЗначениеГСМДоИзменения);
		ИначеЕсли ДополнительныеПараметры.Свойство("НачальноеЗначениеВыбора") Тогда
			ПараметрыФормы.Вставить("НачальноеЗначениеВыбора", ДополнительныеПараметры.НачальноеЗначениеВыбора);
		КонецЕсли;
		Если ДополнительныеПараметры.Свойство("ТолькоТЖсУчетомОстатка") И ДополнительныеПараметры.ТолькоТЖсУчетомОстатка Тогда
			ПараметрыФормы.Вставить("ТолькоТЖсУчетомОстатка", ДополнительныеПараметры.ТолькоТЖсУчетомОстатка);
		КонецЕсли;
		Если ДополнительныеПараметры.Свойство("КлючУникальности") Тогда
			КлючУникальности = ДополнительныеПараметры.КлючУникальности;
		КонецЕсли;
		Если ДополнительныеПараметры.Свойство("Отбор") Тогда 
			ПараметрыФормы.Вставить("Отбор", ДополнительныеПараметры.Отбор);
		КонецЕсли;
	КонецЕсли;
		
	ОткрытьФорму("РегистрСведений.уатНоменклатураГСМ.ФормаСписка", ПараметрыФормы,,КлючУникальности,,, ПроцедураОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры // уатВыбратьГСМ 

// Возвращает форму списка ГСМ
Процедура СписокГСМдляТС(Организация, ТС, ГруппаГСМ, БезАналогов = Ложь, ТолькоТЖсУчетомОстатка = Ложь, ПроцедураОписаниеОповещения = Неопределено, ВводОстатков = Ложь) ЭКСПОРТ
	ПараметрыФормы = Новый Структура("ГруппаГСМ, ТС, Организация, БезАналогов, ТолькоТЖсУчетомОстатка", ГруппаГСМ, ТС, Организация, БезАналогов, ТолькоТЖсУчетомОстатка);
	Если ВводОстатков Тогда
		ПараметрыФормы.Вставить("ВводОстатков", Истина);
	КонецЕсли;
	ОткрытьФорму("ОбщаяФорма.уатСписокГСМ", ПараметрыФормы,,,,, ПроцедураОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры // уатСписокГСМдляТС

#КонецОбласти

#Область ПроцедурыФункцииРаботыСГрузами

// Выбор номенклатуры из регистра сведений НоменклатураГСМ
// Параметры: ГруппаГСМ
// Возвращаемое значение: Справочник-ссылка Номенклатура
Процедура ДиалогВыбораГруза(Элемент, Номенклатура, ВладелецФормы, СтандартнаяОбработка, ДопПараметры = Неопределено) ЭКСПОРТ
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("РежимВыбора, НачальноеЗначениеВыбора", Истина, Номенклатура);
	// установим необходимые отборы
	Если ТипЗнч(ДопПараметры) = Тип("Структура") И ДопПараметры.Свойство("ПараметрыОтбора") Тогда
		ПараметрыФормы.Вставить("Отбор", ДопПараметры.ПараметрыОтбора);
	КонецЕсли;
	ОткрытьФорму("РегистрСведений.уатНоменклатураГрузов.Форма.ФормаВыбора", ПараметрыФормы, ВладелецФормы);
КонецПроцедуры // уатДиалогВыбораГруза       

#КонецОбласти

#Область ПроцедурыФункцииРаботыССотрудниками

// Выбор сотрудника/водителя из спр. Сотрудники с помощью форм обработки уатСотрудники
// Параметры:
//	- Элемент, связанный с сотрудником
//	- ТекСотрудник, ссылка на данные сотрудника
//	- ПараметрыОтбора, структура отбора
//	- СтандартнаяОбработка, переданный параметр обработчика НачалоВыбора
//
Процедура ДиалогВыбораСотрудника(Элемент, ТекСотрудник, ПараметрыОтбора, СтандартнаяОбработка) ЭКСПОРТ
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("РежимВыбора, НачальноеЗначениеВыбора", Истина, ТекСотрудник);
	// установим необходимые отборы
	Если ТипЗнч(ПараметрыОтбора) = Тип("Структура") Тогда
		ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
	КонецЕсли;
	ОткрытьФорму("Справочник.Сотрудники.Форма.ФормаСписка", ПараметрыФормы, Элемент);
КонецПроцедуры

// Открытие формы элемента сотрудника/водителя из спр. Сотрудники с помощью формы обработки уатСотрудники
// Параметры:
//	- ТекСотрудник, ссылка на данные сотрудника
//	- СтандартнаяОбработка, переданный параметр обработчика НачалоВыбора
//
Процедура ОткрытьФормуСотрудника(ТекСотрудник, СтандартнаяОбработка) ЭКСПОРТ
	Если НЕ ЗначениеЗаполнено(ТекСотрудник) Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("Ключ", ТекСотрудник);
	Если ТипЗнч(ТекСотрудник) = Тип("СправочникСсылка.Сотрудники") Тогда
		ОткрытьФорму("Справочник.Сотрудники.Форма.ФормаЭлемента", ПараметрыФормы);
	ИначеЕсли ТипЗнч(ТекСотрудник) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		ОткрытьФорму("Справочник.ФизическиеЛица.Форма.ФормаЭлемента", ПараметрыФормы);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область Проверка_ИТС_Отраслевой

Функция ИТСОтраслевой_ПроверкаДоступностиСервисов() Экспорт
	флОК = уатЗащищенныеФункцииСервер.ЕстьПодпискаИТСОтраслевой();
	Если НЕ флОК Тогда
		ОткрытьФорму("ОбщаяФорма.уатПодпискаИТСОтраслевой");
	КонецЕсли;
	
	Возврат флОК;
КонецФункции

#КонецОбласти

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// Функция выполняет сложение времени представленного в разных типах
//
// Параметры:
//  Дата1         - первое время (чисто или дата)
//  Дата2         - второе время (чисто или дата)
//
// Возвращаемое значение:
//  Результат суммирования
//
Функция СложитьВремя(Знач Время1, Знач Время2) Экспорт
	
	Если ТипЗнч(Время1) = Тип("Число") И ТипЗнч(Время2) = Тип("Число") Тогда
		Время1Сек = Цел(Время1) * 60 * 60 + ((Время1 - Цел(Время1)) * 100 * 60);
		Время2Сек = Цел(Время2) * 60 * 60 + ((Время2 - Цел(Время2)) * 100 * 60);
		ВремяРезМин = (Время1Сек + Время2Сек) / 60;
		ВремяРезЧас = Цел(ВремяРезМин / 60);
		ВремяДоп = (ВремяРезМин - ВремяРезЧас * 60) / 100;
		
		Возврат ВремяРезЧас + ВремяДоп;
		
	ИначеЕсли ТипЗнч(Время1) = Тип("Дата") И ТипЗнч(Время2) = Тип("Дата") Тогда
		
		Возврат Время1 + Час(Время2) * 60 * 60 + Минута(Время2) * 60 + Секунда(Время2);
		
	Иначе
		Если ТипЗнч(Время1) = Тип("Число") Тогда
			мВремя1 = Время2;
			мВремя2 = Время1;
		Иначе
			мВремя1 = Время1;
			мВремя2 = Время2;
		КонецЕсли;
		
		мВремя = дата('00010101010101');
		МВремя = мВремя1 + Цел(мВремя2) * 60 * 60 + (Время2 - Цел(Время2)) * 100 * 60;
		
		Если ТипЗнч(Время1) = Тип("Число") Тогда
			Возврат Час(мВремя) + Минута(мВремя) / 100;
			
		Иначе
			Возврат мВремя;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

// Общая процедура проверки защиты при событии "При открытии" всех форм
//
// Параметры:
//  Отказ		 - 	 - 
//  Форма		 - 	 - 
//  ДопПараметры - 	 - 
//
Процедура уатФормаПриОткрытии(Отказ, Форма, ДопПараметры)
	
	Если ДопПараметры = Неопределено Тогда 
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	уатОбщегоНазначенияКлиент.уатИнициализацияСеансаКлиент(ДопПараметры);
	
	Если ТипЗнч(ДопПараметры) = Тип("Структура") И ДопПараметры.Свойство("Отказ") И ДопПараметры.Отказ Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Если Не Форма = Неопределено Тогда
		ФормаЭлементЗаписать = Форма.Элементы.Найти("ФормаЗаписать");
		Если Не ФормаЭлементЗаписать = Неопределено Тогда 
			ФормаЭлементЗаписать.Отображение = ОтображениеКнопки.Картинка;
		КонецЕсли;
		
		ФормаЭлементПровести = Форма.Элементы.Найти("ФормаПровести");
		Если Не ФормаЭлементПровести = Неопределено Тогда 
			ФормаЭлементПровести.Отображение = ОтображениеКнопки.Картинка;
		КонецЕсли;
		
		ФормаЭлементСоздатьНаОсновании = Форма.Элементы.Найти("ФормаСоздатьНаОсновании");
		Если Не ФормаЭлементСоздатьНаОсновании = Неопределено Тогда 
			ФормаЭлементСоздатьНаОсновании.Отображение = ОтображениеКнопки.Картинка;
			ФормаЭлементСоздатьНаОсновании.Картинка = БиблиотекаКартинок.уатПодменюВводаНаОсновании;
		КонецЕсли;
		
		Если ТипЗнч(ПользователиКлиент.АвторизованныйПользователь()) = Тип("СправочникСсылка.ВнешниеПользователи") Тогда
			ФормаЭлементИнтеграцияСДокументооборотом = Форма.Элементы.Найти("ПодменюСоздатьНаОснованииОбычное__ИнтеграцияС1СДокументооборотНачатьОбработку");
			Если Не ФормаЭлементИнтеграцияСДокументооборотом = Неопределено Тогда
				ФормаЭлементИнтеграцияСДокументооборотом.Видимость = Ложь;
			КонецЕсли;
			ФормаЭлементИнтеграцияСДокументооборотом = Форма.Элементы.Найти("ФормаИнтеграцияС1СДокументооборотНачатьОбработку");
			Если Не ФормаЭлементИнтеграцияСДокументооборотом = Неопределено Тогда
				ФормаЭлементИнтеграцияСДокументооборотом.Видимость = Ложь;
			КонецЕсли;
			ФормаЭлементИнтеграцияСДокументооборотом = Форма.Элементы.Найти("ФормаОбщаяКомандаИнтеграцияС1СДокументооборотНачатьОбработку");
			Если Не ФормаЭлементИнтеграцияСДокументооборотом = Неопределено Тогда
				ФормаЭлементИнтеграцияСДокументооборотом.Видимость = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
