
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ДополнительныеПараметры = Новый Структура("ФормаВладелец, МассивПропущенныхТС",
	ПараметрыВыполненияКоманды.Источник, Новый Массив);
	
	Обработчик = Новый ОписаниеОповещения("ЗагрузитьПоДаннымГИБДДЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ПараметрыОткрытияФормы = Новый Структура();
	ПараметрыОткрытияФормы.Вставить("Заголовок", Нстр("ru = 'Выберите ТС'; en = 'Select a vehicle'"));

	СтруктураОтбора = Новый Структура("ЛевоеЗначение,Использование,ВидСравнения,ПравоеЗначение");
	СтруктураОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("VIN");
	СтруктураОтбора.Использование  = Истина;
	СтруктураОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Заполнено;
	СтруктураОтбора.ПравоеЗначение = Неопределено;
	
	Отборы = Новый Массив();
	Отборы.Добавить(СтруктураОтбора);
	ПараметрыОткрытияФормы.Вставить("Отборы",       Отборы);
	ПараметрыОткрытияФормы.Вставить("КлючНастроек", "ГИБДД");

	ОткрытьФорму("Справочник.уатТС.Форма.ФормаЗаполнения", ПараметрыОткрытияФормы, ПараметрыВыполненияКоманды.Источник,,,,Обработчик);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗагрузитьПоДаннымГИБДДЗавершение(МассивТС, ДополнительныеПараметры) Экспорт
	
	Если МассивТС = Неопределено Тогда
		Возврат;
	КонецЕсли;
	

	ОписаниеОповещения = Новый ОписаниеОповещения("ПодтверждениеКапчи", ЭтотОбъект,
		Новый Структура("ФормаВладелец, МассивТС, МассивПропущенныхТС", 
		ДополнительныеПараметры.ФормаВладелец, МассивТС, ДополнительныеПараметры.МассивПропущенныхТС));
	ПараметрыОткрытия  = Новый Структура();
	
	ОткрытьФорму("Документ.уатДТП.Форма.ФормаКапчи", ПараметрыОткрытия,ЭтотОбъект,,,,ОписаниеОповещения);

КонецПроцедуры

&НаКлиенте
Процедура ПодтверждениеКапчи(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;

	Капча       = Новый Структура();
	Капча.Вставить("captchaToken", Результат.captchaToken);
	Капча.Вставить("captchaWord",  Результат.captchaWord);
	
	Загружено   = 0;
	ЗагрузитьПоДаннымГИБДДЗавершениеСервер(ДополнительныеПараметры.МассивТС, ДополнительныеПараметры.МассивПропущенныхТС,
		Капча, Загружено, ДополнительныеПараметры.ФормаВладелец);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПоДаннымГИБДДЗавершениеСервер(МассивТС, МассивПропущенныхТС, Капча, Загружено = 0, ФормаВладелец)
	
	ТекстОшибки = "";

	ДлительнаяОперация = ЗагрузитьПоДаннымГИБДДДлительнаяОперацияСервер(МассивТС, МассивПропущенныхТС, Капча, ТекстОшибки);
	
	НастройкиОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ФормаВладелец);
	НастройкиОжидания.ВыводитьОкноОжидания       = Истина;
	НастройкиОжидания.ВыводитьПрогрессВыполнения = Истина;
	
	Обработчик = Новый ОписаниеОповещения("ЗагрузитьПоДаннымГИБДДЗавершениеДлительнаяОперацияЗавершение", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Обработчик, НастройкиОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПоДаннымГИБДДЗавершениеДлительнаяОперацияЗавершение(Операция, ДополнительныеПараметры) Экспорт
	
	Если Операция = Неопределено Тогда
		
	Иначе
		Если Операция.Статус = "Выполнено" Тогда
			Если ЭтоАдресВременногоХранилища(Операция.АдресРезультата) Тогда
				Данные = ПолучитьИзВременногоХранилища(Операция.АдресРезультата);
				Если ТипЗнч(Данные) = Тип("Структура") Тогда
					Если Данные.Свойство("МассивТС") Тогда 
						Если ЗначениеЗаполнено(Данные.ТекстПредупреждения) Тогда
							ПоказатьПредупреждение(,Данные.ТекстПредупреждения);
						КонецЕсли;
						ОповеститьОбИзменении(Тип("ДокументСсылка.уатДТП")); 
						
						ФормаВладелец = ПолучитьФорму("Документ.уатДТП.Форма.ФормаСписка");  
						
						ДополнительныеПараметры = Новый Структура("ФормаВладелец, МассивПропущенныхТС",
							ФормаВладелец, Данные.МассивПропущенныхТС);
						ЗагрузитьПоДаннымГИБДДЗавершение(Данные.МассивТС, ДополнительныеПараметры);
					ИначеЕсли Данные.Свойство("ТекстПредупреждения") Тогда
						Если ЗначениеЗаполнено(Данные.ТекстПредупреждения) Тогда
							Оповещ = Новый ОписаниеОповещения("ПродолжитьЗагрузку", ЭтотОбъект, Данные.МассивПропущенныхТС);
							ПоказатьВопрос(Оповещ, Данные.ТекстПредупреждения, РежимДиалогаВопрос.ДаНетОтмена);
						КонецЕсли;
						ОповеститьОбИзменении(Тип("ДокументСсылка.уатДТП"));
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		Иначе
			ВызватьИсключение Операция.КраткоеПредставлениеОшибки;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьЗагрузку(Результат, МассивПропущенныхТС) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда 
		ФормаВладелец = ПолучитьФорму("Документ.уатДТП.Форма.ФормаСписка");  
		
		ДополнительныеПараметры = Новый Структура("ФормаВладелец, МассивПропущенныхТС",
		ФормаВладелец, Новый Массив);
		ЗагрузитьПоДаннымГИБДДЗавершение(МассивПропущенныхТС, ДополнительныеПараметры);
	КонецЕсли;
КонецПроцедуры  

&НаСервере
Функция ЗагрузитьПоДаннымГИБДДДлительнаяОперацияСервер(МассивТС, МассивПропущенныхТС, Капча, ТекстОшибки)
	
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Загрузка данных из ГИБДД'; en = 'Downloading data from the State Traffic Safety Inspectorate'");
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;

	ПараметрыПроцедуры = Новый Структура("МассивТС, МассивПропущенныхТС, Капча", МассивТС, МассивПропущенныхТС, Капча);
	Возврат ДлительныеОперации.ВыполнитьВФоне(
	"уатИнтеграции_проф.ГИБДД_СписокДТПДлительнаяОперация",
	ПараметрыПроцедуры,
	ПараметрыВыполнения);
	
КонецФункции

#КонецОбласти