
#Область ОбработчикиСобытий

// Процедура - обработчик события "ОбработкаЗаполнения".
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	уатОбщегоНазначенияСервер.Заполнить(ЭтотОбъект, ДанныеЗаполнения);

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.уатРеализацияУслуг") Тогда
		
		Дата = ТекущаяДата();
		Организация         = ДанныеЗаполнения.Организация;
		Контрагент          = ДанныеЗаполнения.Контрагент;
		ДоговорКонтрагента  = ДанныеЗаполнения.ДоговорКонтрагента;
		СуммаДокумента      = ДанныеЗаполнения.СуммаДокумента;
		УчитыватьНДС        = ДанныеЗаполнения.УчитыватьНДС; 
		СуммаВключаетНДС    = ДанныеЗаполнения.СуммаВключаетНДС;
		//СтавкаНДС           = ДанныеЗаполнения.СтавкаНДС;
		ОбъектСтроительства = ДанныеЗаполнения.ОбъектСтроительства;
		Комментарий         = "Заполнен на основании " + ДанныеЗаполнения;
		ДокументОснование   = ДанныеЗаполнения;
		ДатаНач 			= ДанныеЗаполнения.ДатаНач;
		ДатаКон				= ДанныеЗаполнения.ДатаКон;
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаполнения()

#КонецОбласти
