
#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Набор = РегистрыСведений.СтатусыОбработкиВидаБюджета.СоздатьНаборЗаписей();
	Набор.Отбор.ВидБюджета.Установить(Ссылка);
	Набор.Записать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Функция ОтсутствуетВДанныхЗаполнения(ДанныеЗаполнения, ИмяРеквизита)
	Перем Значение;
	
	Если ДанныеЗаполнения = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если Не ДанныеЗаполнения.Свойство(ИмяРеквизита, Значение)
		ИЛИ Значение = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Перем Значение;
	
	Если ОтсутствуетВДанныхЗаполнения(ДанныеЗаполнения, "Владелец") Тогда
		Владелец = Справочники.МоделиБюджетирования.МодельБюджетированияПоУмолчанию();
	КонецЕсли;
	
	Если Не ЭтоГруппа Тогда
		
		Если ОтсутствуетВДанныхЗаполнения(ДанныеЗаполнения, "Периодичность") Тогда
			Периодичность = Перечисления.Периодичность.Месяц;
		КонецЕсли;
		
		Если ОтсутствуетВДанныхЗаполнения(ДанныеЗаполнения, "СпособПланирования") Тогда
			СпособПланирования = Перечисления.СпособыСоставленияБюджетов.НаФиксированныйПериод;
		КонецЕсли;
		
		Если ОтсутствуетВДанныхЗаполнения(ДанныеЗаполнения, "ВариантРасположенияГраницыФактическихДанных") Тогда
			ВариантРасположенияГраницыФактическихДанных = Перечисления.ВариантыРасположенияГраницыФактическиДанных.ВнутриПериодаБюджета;
		КонецЕсли;
		
		Если ОтсутствуетВДанныхЗаполнения(ДанныеЗаполнения, "КоличествоПериодовСкользящегоБюджета") Тогда
			КоличествоПериодовСкользящегоБюджета = 1;
		КонецЕсли;
		
		Если ОтсутствуетВДанныхЗаполнения(ДанныеЗаполнения, "СмещениеГраницыФакта") Тогда
			СмещениеГраницыФакта = 1;
		КонецЕсли;
		
		Если ОтсутствуетВДанныхЗаполнения(ДанныеЗаполнения, "ПериодичностьГраницыФакта") Тогда
			ПериодичностьГраницыФакта = Перечисления.Периодичность.Месяц;
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
