
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекСовместимыйТип Из СовместимыеТипыТС Цикл 
		Если ТекСовместимыйТип.ТипТС = Ссылка Тогда 
			ТекстНСТР = НСтр("en='In line %1 specifies the type of the element.';ru='В строке %1 указан тип самого элемента.'");
			ТекстНСТР = СтрШаблон(ТекстНСТР, Формат(ТекСовместимыйТип.НомерСтроки, "ЧН=0; ЧГ=0"));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстНСТР,
				ЭтотОбъект, 
				"СовместимыеТипыТС["+(ТекСовместимыйТип.НомерСтроки-1)+"].ТипТС",
				, 
				Отказ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ДанныеЗаполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ДанныеЗаполнения.Свойство("ВидТС") И 
		ТипЗнч(ДанныеЗаполнения.ВидТС) = Тип("Массив") И
		(ДанныеЗаполнения.ВидТС[0] = Перечисления.уатВидыТС.Вагон Или
		ДанныеЗаполнения.ВидТС[0] = Перечисления.уатВидыТС.Локомотив) Тогда
		ВидТС = Перечисления.уатВидыТС.Вагон;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
