#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда    
		Возврат;
	КонецЕсли;

	СуммаДокумента = Удержания.Итог("Сумма");
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда    
		Возврат;
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		ЗаписатьФлагУдержанияВШтрафах();
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	// Инициализация дополнительных свойств для проведения документа.
    уатПроведение.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
    
    // Инициализация данных документа.
    Документы.уатНачислениеУдержаний.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
    // Подготовка наборов записей.
    уатПроведение.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
    
    // Отражение в разделах учета.
	уатПроведение.ОтразитьУдержания(ДополнительныеСвойства, Движения, Отказ);
	уатПроведение.ОтразитьДоходы(ДополнительныеСвойства, Движения, Отказ);

    // Запись наборов записей.
    уатПроведение.ЗаписатьНаборыЗаписей(ЭтотОбъект);
    
    // Контроль возникновения отрицательного остатка.
	Документы.уатНачислениеУдержаний.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ);
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Для Каждого ТекСтрока Из Удержания Цикл
		Если ТекСтрока.Удержание.СтатьяДоходов.Пустая() Тогда
			ТекстНСТР = СтрШаблон(НСтр("ru = 'Не заполнена статья доходов для удержания ""%2"" в строке %1.'; en = 'The income item for withholding ""%2"" in line %1 is not filled in.'"),
				Удержания.Индекс(ТекСтрока)+1, ТекСтрока.Удержание);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР,,,,Отказ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьФлагУдержанияВШтрафах()
	флУдержание = НЕ ПометкаУдаления; // при пометке на удаление флаг наоборот снимаем
	
	мсвШтрафы = Новый Массив;
	Для Каждого ТекСтрока Из Удержания Цикл
		Если ЗначениеЗаполнено(ТекСтрока.Основание) И мсвШтрафы.Найти(ТекСтрока.Основание) = Неопределено Тогда
			мсвШтрафы.Добавить(ТекСтрока.Основание);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ТекШтраф Из мсвШтрафы Цикл
		Если НЕ ТекШтраф.ПометкаУдаления И ТекШтраф.УчтенВУдержании <> флУдержание Тогда
			ТекШтрафОбъект = ТекШтраф.ПолучитьОбъект();
			ТекШтрафОбъект.УчтенВУдержании = флУдержание;
			Попытка
				ТекШтрафОбъект.Записать();
			Исключение
				ТекстНСТР = СтрШаблон(НСтр(
					"en = 'Failed to update the flag ""Accounted for withholding"" in the document ""%1"": %2.
                     |Remove the cause and update the flag manually in the Penalty form.'; ru = 'Не удалось обновить флаг ""Учтен в удержании"" в документе ""%1"": %2.
                     |Устраните причину и обновите флаг вручную в форме Штрафа.'"),
					ТекШтраф,
					КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР);
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти


#КонецЕсли