
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекОрганизация = уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(ПользователиКлиентСервер.АвторизованныйПользователь(), "ОсновнаяОрганизация");
	
	Если НЕ ЗначениеЗаполнено(Запись.Сотрудник) И Параметры.Свойство("Сотрудник") Тогда
		Запись.Сотрудник = Параметры.Сотрудник;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Запись.ТС) И Параметры.Свойство("ТС") Тогда
		Запись.ТС = Параметры.ТС;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
		УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СотрудникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Запись.ТС) Тогда
		ОргСотрудника = уатОбщегоНазначения.МестонахождениеТС(Запись.ТС, ТекущаяДата()).Организация;
	Иначе
		ОргСотрудника = ТекОрганизация;
	КонецЕсли;
	уатЗащищенныеФункцииКлиент.ДиалогВыбораСотрудника(Элемент, Запись.Сотрудник, Новый Структура("Организация", ОргСотрудника), СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СотрудникОткрытие(Элемент, СтандартнаяОбработка)
	уатЗащищенныеФункцииКлиент.ОткрытьФормуСотрудника(Запись.Сотрудник, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СотрудникАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	Если Ожидание = 0 Тогда //выбор из списка
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Запись.ТС) Тогда
		ОргСотрудника = уатОбщегоНазначения.МестонахождениеТС(Запись.ТС, ТекущаяДата()).Организация;
	Иначе
		ОргСотрудника = ТекОрганизация;
	КонецЕсли;
	СтруктураПараметров = Новый Структура("Организация, ДатаСреза", ОргСотрудника, ТекущаяДата());
	уатИнтерфейсВводаСотрудников.СотрудникАвтоПодборТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка, СтруктураПараметров);
КонецПроцедуры

&НаКлиенте
Процедура СотрудникОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Запись.ТС) Тогда
		ОргСотрудника = уатОбщегоНазначения.МестонахождениеТС(Запись.ТС, ТекущаяДата()).Организация;
	Иначе
		ОргСотрудника = ТекОрганизация;
	КонецЕсли;
	СтруктураПараметров = Новый Структура("Организация, ДатаСреза", ОргСотрудника, ТекущаяДата());
	уатИнтерфейсВводаСотрудников.СотрудникОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка, СтруктураПараметров);
КонецПроцедуры

&НаКлиенте
Процедура ТСНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтруктураОтбор = Новый Структура("Организация", ТекОрганизация);
	уатИнтерфейсВводаТС.РеквизитТСНачалоВыбора(Элемент, Запись.ТС, ДанныеВыбора, СтандартнаяОбработка, СтруктураОтбор);
КонецПроцедуры

&НаКлиенте
Процедура ТСАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	СтруктураОтбор = Новый Структура("Организация", ТекОрганизация);
	уатИнтерфейсВводаТС.РеквизитТСАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка, СтруктураОтбор);
КонецПроцедуры

&НаКлиенте
Процедура ТСОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	СтруктураОтбор = Новый Структура("Организация", ТекОрганизация);
	уатИнтерфейсВводаТС.РеквизитТСОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка, СтруктураОтбор);
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Запись.ЧленЭкипажа = Перечисления.уатЧленыЭкипажа.ОсновнойВодитель
		ИЛИ Запись.ЧленЭкипажа = Перечисления.уатЧленыЭкипажа.ОсновноеСопроводительноеЛицо Тогда
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	уатЭкипажТС.ТС КАК ТС
		|ИЗ
		|	РегистрСведений.уатЭкипажТС КАК уатЭкипажТС
		|ГДЕ
		|	уатЭкипажТС.ТС = &ТС
		|	И уатЭкипажТС.ЧленЭкипажа = &ЧленЭкипажа
		|	И уатЭкипажТС.Сотрудник <> &Сотрудник";
		Запрос.УстановитьПараметр("ТС", Запись.ТС);
		Запрос.УстановитьПараметр("ЧленЭкипажа", Запись.ЧленЭкипажа);
		Запрос.УстановитьПараметр("Сотрудник", Запись.Сотрудник);	
		
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			ТекстНСТР = НСтр("en='For vehicle ""%1"" a member of crew ""%2"" has been chosen already.';ru='Для ТС ""%1"" член экипажа ""%2"" уже был выбран.'");
			ТекстОшибки = СтрШаблон(ТекстНСТР, Запись.ТС, Запись.ЧленЭкипажа);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
