
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	уатЗащищенныеФункцииСервер.уатСправочникФормаСпискаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Маршрутизация.Видимость = уатОбщегоНазначенияПовтИсп.ВариантПоставкиКОРП();
	
	ПолучитьНастройкиКартографииМаршрутизации();
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	уатЗащищенныеФункцииКлиент.уатСправочникФормаСпискаПриОткрытии(Отказ, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПостроениеМаршрутов_ИспользованиеПриИзменении(Элемент)
	УстановитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура Геокодирование_ИспользованиеПриИзменении(Элемент)
	УстановитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ПодсказкиАдресов_ИспользованиеПриИзменении(Элемент)
	УстановитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура Картография_ИспользованиеПриИзменении(Элемент)
	УстановитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура Навигация_ИспользованиеПриИзменении(Элемент)
	УстановитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура Маршрутизация_ИспользованиеПриИзменении(Элемент)
	УстановитьВидимостьДоступность();
КонецПроцедуры


&НаКлиенте
Процедура Картография_УчетнаяЗаписьСоздание(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
 
	ЭлементыОтбора = Новый Структура("Наименование, ТипСервиса, ВнешняяСистема",
	Строка(ПредопределенноеЗначение("Перечисление.уатТипыГеосервисов.Картография")),
	ПредопределенноеЗначение("Перечисление.уатТипыГеосервисов.Картография"),
	ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.OSM")); 
	
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЭлементыОтбора);
	ОткрытьФорму("Справочник.уатУчетныеЗаписиСервисовГеоданных.Форма.ФормаЭлемента", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура Геокодирование_УчетнаяЗаписьСоздание(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; 
	
	ЭлементыОтбора = Новый Структура("Наименование,ТипСервиса,ВнешняяСистема",
	Строка(ПредопределенноеЗначение("Перечисление.уатТипыГеосервисов.Геокодирование")),
	ПредопределенноеЗначение("Перечисление.уатТипыГеосервисов.Геокодирование"),
	ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.OSM")); 
	
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЭлементыОтбора);
	ОткрытьФорму("Справочник.уатУчетныеЗаписиСервисовГеоданных.Форма.ФормаЭлемента", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура ПодсказкиАдресов_УчетнаяЗаписьСоздание(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
 
	ЭлементыОтбора = Новый Структура("Наименование,ТипСервиса,ВнешняяСистема",
	Строка(ПредопределенноеЗначение("Перечисление.уатТипыГеосервисов.ПодсказкиАдресов")),
	ПредопределенноеЗначение("Перечисление.уатТипыГеосервисов.ПодсказкиАдресов"),
	ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.OSM")); 
	
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЭлементыОтбора);
	ОткрытьФорму("Справочник.уатУчетныеЗаписиСервисовГеоданных.Форма.ФормаЭлемента", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура ПостроениеМаршрутов_УчетнаяЗаписьСоздание(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
 
	ЭлементыОтбора = Новый Структура("Наименование,ТипСервиса,ВнешняяСистема",
	Строка(ПредопределенноеЗначение("Перечисление.уатТипыГеосервисов.ПостроениеМаршрутов")),
	ПредопределенноеЗначение("Перечисление.уатТипыГеосервисов.ПостроениеМаршрутов"),
	ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.OSM")); 
	
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЭлементыОтбора);
	ОткрытьФорму("Справочник.уатУчетныеЗаписиСервисовГеоданных.Форма.ФормаЭлемента", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура ПостроениеМаршрутовЖД_УчетнаяЗаписьСоздание(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
 
	ЭлементыОтбора = Новый Структура("Наименование,ТипСервиса,ВнешняяСистема",
	Строка(ПредопределенноеЗначение("Перечисление.уатТипыГеосервисов.ПостроениеМаршрутовЖД")),
	ПредопределенноеЗначение("Перечисление.уатТипыГеосервисов.ПостроениеМаршрутовЖД"),
	ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.OSM")); 
	
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЭлементыОтбора);
	ОткрытьФорму("Справочник.уатУчетныеЗаписиСервисовГеоданных.Форма.ФормаЭлемента", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура Навигация_УчетнаяЗаписьСоздание(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
 
	ЭлементыОтбора = Новый Структура("Наименование,ТипСервиса,ВнешняяСистема", 
	Строка(ПредопределенноеЗначение("Перечисление.уатТипыГеосервисов.Навигация")),
	ПредопределенноеЗначение("Перечисление.уатТипыГеосервисов.Навигация"),
	ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.Яндекс")); 
	
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЭлементыОтбора);
	ОткрытьФорму("Справочник.уатУчетныеЗаписиСервисовГеоданных.Форма.ФормаЭлемента", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура Маршрутизация_УчетнаяЗаписьСоздание(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
 
	ЭлементыОтбора = Новый Структура("Наименование,ТипСервиса,ВнешняяСистема,ТипАвторизации",
	Строка(ПредопределенноеЗначение("Перечисление.уатТипыГеосервисов.Маршрутизация")),
	ПредопределенноеЗначение("Перечисление.уатТипыГеосервисов.Маршрутизация"),
	ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.Яндекс"),
	"OAuth-токен"); 
	
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЭлементыОтбора);
	ОткрытьФорму("Справочник.уатУчетныеЗаписиСервисовГеоданных.Форма.ФормаЭлемента", ПараметрыФормы);
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	СохранитьНастройкиКартографииМаршрутизации();
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	СохранитьНастройкиКартографииМаршрутизации();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПолучитьНастройкиКартографииМаршрутизации()
	
	СтруктураНастроек = уатЭлектронныеКартыСервер.ПолучитьНастройкиСервераКартографииМаршрутизации();
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, СтруктураНастроек);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиКартографииМаршрутизации()
	
	СтруктураНастроек = уатЭлектронныеКартыСервер.НастройкиСервераКартографииМаршрутизацииПоУмолчанию();
	ЗаполнитьЗначенияСвойств(СтруктураНастроек, ЭтотОбъект);
	уатЭлектронныеКартыСервер.СохранитьНастройкиСервераКартографииМаршрутизации(СтруктураНастроек);
		
	ОбновитьПовторноИспользуемыеЗначения();
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступность()
	
	Элементы.ГруппаКартография.Доступность              = Картография_Использование;
	Элементы.ГруппаГеокодирование.Доступность           = Геокодирование_Использование;
	Элементы.ГруппаПостроениеМаршрутов.Доступность      = ПостроениеМаршрутов_Использование;
	Элементы.ГруппаНавигация.Доступность                = Навигация_Использование;
	Элементы.ГруппаМаршрутизация.Доступность            = Маршрутизация_Использование;
	Элементы.ГруппаПостроениеМаршрутовЖД.Доступность    = ПостроениеМаршрутовЖД_Использование;
	
	Элементы.ПодсказкиАдресов_УчетнаяЗапись.Доступность              = ПодсказкиАдресов_Использование; 
	Элементы.ПодсказкиАдресов_СоздаватьПунктыВЗаказеНаТС.Доступность = ПодсказкиАдресов_Использование;

КонецПроцедуры

#КонецОбласти
