
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Объект.Сортировка = 100;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ПустаяСтрока(Объект.Идентификатор) Тогда
		ItobРаботаС_БСП_КлиентСервер.СообщитьПользователю(
						НСтр("ru = 'Не указан идентификатор!'; en = 'No identifier specified!'"), ,
						"Объект.Идентификатор", ,
						Отказ);
		Возврат;				
						
	ИначеЕсли Найти(Объект.Идентификатор," ")>0 
			ИЛИ Найти(Объект.Идентификатор,"\")>0
			ИЛИ Найти(Объект.Идентификатор,"/")>0 Тогда
		ItobРаботаС_БСП_КлиентСервер.СообщитьПользователю(
						НСтр("ru = 'Неверный идентификатор!'; en = 'Invalid identifier!'"), ,
						"Объект.Идентификатор", ,
						Отказ);					
	    Возврат;
		
	КонецЕсли;                          
	
	Если НЕ Объект.СлойПодложки.Пустая()
		 И Объект.СлойПодложки = Объект.Ссылка Тогда		
		 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Недопустимая настройка: указана подложка, совпадающая с самой географической картой",,,
														  "Объект.СлойПодложки",
														  Отказ);
	КонецЕсли;
	
КонецПроцедуры
	
#КонецОбласти 
