////////////////////////////////////////////////////////////////////////////////
// Управление автотранспортом.
// 
// Процедуры и функции общего назначения.
// 
// Содержит код, используемый в варианте поставке КОРП
///////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

#Область ОптимальноеПерестроениеЗаказов

Процедура ПредупредитьПользователяОПроблемахОптимизации(ПараметрыОптимизации, ОповещениеПриПродолжении, Отказ, ЗаданВопрос) Экспорт
	
	Если ПараметрыОптимизации.АлгоритмОптимальногоПерестроения = "Очередей" Тогда
		
		ЧислоЗаказовДляПредупреждения = 30;
		ЧислоЗаказовДляОтказа = 40;
		
		Если ПараметрыОптимизации.ДанныеПоЗаказам.КоличествоЗаказов > ЧислоЗаказовДляОтказа Тогда
			ТекстНСтр = НСтр("ru = 'Максимальное количество Заказов на ТС для оптимизации в Маршрутном листе - %1.
				|Количество Заказов на ТС в текущем документе: %2.
				|Алгоритм Очередей не может использоваться для решения данной задачи.
				|При таком объеме Заказов на ТС рекомендуется использовать более производительный алгоритм ""Rarus VRP"".
				|'");
			ТекстНСтр = СтрШаблон(ТекстНСтр, ЧислоЗаказовДляОтказа, ПараметрыОптимизации.ДанныеПоЗаказам.КоличествоЗаказов);
			ТекстСообщения = Новый ФорматированнаяСтрока(ТекстНСтр, СтрокаЗаявкаНаПодключение());
			Отказ = Истина;
			ПоказатьПредупреждение(, ТекстСообщения);
			Возврат;
		ИначеЕсли ПараметрыОптимизации.ДанныеПоЗаказам.КоличествоЗаказов > ЧислоЗаказовДляПредупреждения Тогда
			ТекстНСтр = НСтр("ru = 'В Маршрутном листе, который содержит более 30 Заказов на ТС, продолжительность оптимизации может превышать 5 минут.
				|При таком объеме Заказов на ТС рекомендуется использовать более производительный алгоритм ""Rarus VRP"".
				|'");
			ТекстВопроса = Новый ФорматированнаяСтрока(ТекстНСтр, СтрокаЗаявкаНаПодключение(), Символы.ПС, НСтр("ru = 'Продолжить оптимизацию?'; en = 'Continue optimization?'"));
			ЗаданВопрос = Истина;
			ПоказатьВопрос(ОповещениеПриПродолжении, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
			Возврат;
		КонецЕсли;
	ИначеЕсли ПараметрыОптимизации.АлгоритмОптимальногоПерестроения = "Яндекс"
		Или ПараметрыОптимизации.АлгоритмОптимальногоПерестроения = "RarusVRP" Тогда
		
		ОбщийВесГрузов = 0;
		ОбщийОбъемГрузов = 0;
		Для Каждого ТекЗаказ Из ПараметрыОптимизации.ДанныеПоЗаказам.Заказы Цикл 
			ОбщийВесГрузов = ОбщийВесГрузов + ТекЗаказ.ВесБрутто;
			ОбщийОбъемГрузов = ОбщийОбъемГрузов + ТекЗаказ.Объем;
		КонецЦикла;
		
		КоэффициентЗагрузкиКузоваПоВесу   = ПараметрыОптимизации.НастройкиМаршрутизации.Оптимизация_НастройкаПонижающийКоэффициентЗагрузкиКузоваПоВесу;
		КоэффициентЗагрузкиКузоваПоОбъему = ПараметрыОптимизации.НастройкиМаршрутизации.Оптимизация_НастройкаПонижающийКоэффициентЗагрузкиКузоваПоОбъему;
		Если ОбщийВесГрузов > ПараметрыОптимизации.ХарактеристикиСцепки.Грузоподъемность * КоэффициентЗагрузкиКузоваПоВесу / 100 Тогда
			ТекстНСтр = НСтр("ru='Суммарный вес грузов превышает грузоподъемность ТС с учетом коэффициента загрузки.
				|Возможно, часть грузов будет добавлена в конец маршрута без оптимизации.
				|'");
			ТекстВопроса = Новый ФорматированнаяСтрока(ТекстНСтр, НСтр("ru = 'Продолжить оптимизацию?'; en = 'Continue optimization?'"));
			ЗаданВопрос = Истина;
			ПоказатьВопрос(ОповещениеПриПродолжении, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
			Возврат;
		ИначеЕсли ОбщийОбъемГрузов > ПараметрыОптимизации.ХарактеристикиСцепки.ОбъемКузова * КоэффициентЗагрузкиКузоваПоОбъему / 100 Тогда
			ТекстНСтр = НСтр("ru='Суммарный объем грузов превышает грузоподъемность ТС с учетом коэффициента загрузки.
				|Возможно, часть грузов будет добавлена в конец маршрута без оптимизации.
				|'");
			ТекстВопроса = Новый ФорматированнаяСтрока(ТекстНСтр, НСтр("ru = 'Продолжить оптимизацию?'; en = 'Continue optimization?'"));
			ЗаданВопрос = Истина;
			ПоказатьВопрос(ОповещениеПриПродолжении, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция СтрокаЗаявкаНаПодключение() Экспорт
	
	СтрокаРезультат = Новый ФорматированнаяСтрока(
		НСтр("ru = 'Для получения тестового доступа необходимо отправить заявку по адресу '; en = 'To obtain test access, please send an application to the address'"),
		Новый ФорматированнаяСтрока("vrp@rarus.ru", Новый Шрифт(,,,,Истина), ОбщегоНазначенияВызовСервера.ЦветСтиля("ГиперссылкаЦвет")),
		НСтр("ru = ' из специальной формы. '; en = 'from a special form.'"),
		Новый ФорматированнаяСтрока("Отправить заявку сейчас",,,,
			"e1cib/command/РегистрСведений.пр_ОбращенияВСлужбуПоддержки.Команда.уатОтправитьЗаявкуНаПодключениеМаршрутизации")
	);
	
	Возврат СтрокаРезультат;
	
КонецФункции

#КонецОбласти

#КонецОбласти
