///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Вызывается в обработчике одноименного события формы отчета после выполнения кода формы.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма отчета.
//   Настройки - Структура - настройки создания формы отчета:
//     *Отказ - Булево - признак отказа от создания формы.
//     *СтандартнаяОбработка - Булево - признак выполнения стандартной (системной) обработки события.
//     *ВидимостьПоискаКонтрагентов - Булево - признак отображения поиска контрагентов.
//
// Пример:
// Настройки.ВидимостьПоискаКонтрагентов = Истина; // Для постоянного включения видимость поиска.
//
Процедура ПриСозданииНаСервере(Форма, Настройки) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти
