#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ДокументПоПисьму(Письмо) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Письмо", Письмо);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	GDS_СоответсвиеДокументовПисьмам.Документ КАК Документ
	|ИЗ
	|	РегистрСведений.GDS_СоответсвиеДокументовПисьмам КАК GDS_СоответсвиеДокументовПисьмам
	|ГДЕ
	|	GDS_СоответсвиеДокументовПисьмам.Письмо = &Письмо";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Документ;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Процедура ЗаписатьСоответсвие(Документ, Письмо, Успех = Ложь, ТекстОшибки = "", ЛогOCR = "", ДанныеOCRСтрока = "") Экспорт
	
	Запись = СоздатьМенеджерЗаписи();
	Запись.Документ = Документ;
	Запись.Письмо = Письмо;
	Запись.Успех = Успех;
	Запись.ТекстОшибки = ТекстОшибки;
	Запись.ЛогOCR = ЛогOCR;
	Запись.ДанныеOCRСтрока = ДанныеOCRСтрока;
	
	Запись.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
