////////////////////////////////////////////////////////////////////////////////
// Работа с БСП (вызов сервера)
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс
	
#Область ПодсистемаПечать 
	
// Возвращает макет печатной формы по полному пути к макету.
//
// Параметры:
//  ПолныйПутьКМакету - Строка - полный путь к макету в формате:
//								"Документ.<ИмяДокумента>.<ИмяМакета>"
//								"Обработка.<ИмяОбработки>.<ИмяМакета>"
//								"ОбщийМакет.<ИмяМакета>".
// Возвращаемое значение:
//   ТабличныйДокумент - для макета типа MXL.
//	 ДвоичныеДанные    - для макетов DOC и ODT.
//
Функция ПолучитьМакет(ПолныйПутьКМакету) Экспорт
	Возврат ItobРаботаС_БСП.ПолучитьМакет(ПолныйПутьКМакету);
КонецФункции

#КонецОбласти 
	
#Область ПодсистемаРаботаСПочтовымиСообщениями 
	
// Функция для получения системной учетной записи.
// 
// Возвращаемое значение:
//  СправочникСсылка.УчетныеЗаписиЭлектроннойПочты, Неопределено 
//
Функция СистемнаяУчетнаяЗапись() Экспорт;
	Результат = Неопределено;
	
	Если ВерсияБСП() >= 22500 Тогда
		// Подсистема СтандартныеПодсистемы.ОтправкаSMS 
		Если ItobВызовСервераПовтИсп.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСПочтовымиСообщениями") Тогда
			Результат = ПредопределенноеЗначение("Справочник.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты");
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;	
КонецФункции // СистемнаяУчетнаяЗапись()

#КонецОбласти

#Область РаботаВМоделиСервиса
	
// Возвращает признак работы в режиме разделения данных по областям
// (технически это признак условного разделения).
// 
// Возвращает Ложь, если конфигурация не может работать в режиме разделения данных
// (не содержит общих реквизитов, предназначенных для разделения данных).
//
// Возвращаемое значение:
//  Булево - Истина, если разделение включено.
//         - Ложь,   если разделение выключено или не поддерживается.
//
Функция РазделениеВключено() Экспорт
	Результат = Ложь;
	
	Если ВерсияБСП() >= 24283 Тогда
		// Подсистема СтандартныеПодсистемы.КонтактнаяИнформация 
		Если ItobВызовСервераПовтИсп.ПодсистемаСуществует("СтандартныеПодсистемы.БазоваяФункциональность") Тогда
			ОбщийМодуль = ОбщегоНазначения.ОбщийМодуль("ОбщегоНазначения");
			Результат = ОбщийМодуль.РазделениеВключено();
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;	
КонецФункции

// Возвращает признак возможности обращения к разделенным данным (которые входят в состав разделителей).
// Признак относится к сеансу, но может меняться во время работы сеанса, если разделение было включено
// в самом сеансе, поэтому проверку следует делать непосредственно перед обращением к разделенным данным.
// 
// Возвращает Истина, если конфигурация не может работать в режиме разделения данных
// (не содержит общих реквизитов, предназначенных для разделения данных).
//
// Возвращаемое значение:
//   Булево - Истина, если разделение не поддерживается, либо разделение выключено,
//                    либо разделение включено и разделители    установлены.
//          - Ложь,   если разделение включено и разделители не установлены.
//
Функция ДоступноИспользованиеРазделенныхДанных() Экспорт
	Результат = Истина;
	
	Если ВерсияБСП() >= 24283 Тогда
		// Подсистема СтандартныеПодсистемы.КонтактнаяИнформация 
		Если ItobВызовСервераПовтИсп.ПодсистемаСуществует("СтандартныеПодсистемы.БазоваяФункциональность") Тогда
			ОбщийМодуль = ОбщегоНазначения.ОбщийМодуль("ОбщегоНазначения");
			Результат = ОбщийМодуль.ДоступноИспользованиеРазделенныхДанных();
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;	
КонецФункции
	
#КонецОбласти 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция возвращает установленную версию Библиотеки стандартных подсистем.
// 
// Возвращаемое значение:
//  Число
//
Функция ВерсияБСП()
	Возврат ItobРаботаС_БСП_ВызовСервераПовтИсп.ВерсияБСП();
КонецФункции

#КонецОбласти
