
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТекстОшибки = "";
	СоздатьШаблонПоУмолчанию(ТекстОшибки);
	
	Если ТекстОшибки = "" Тогда 
		ПоказатьПредупреждение(, "Шаблон создан успешно.");
		
		Если ТипЗнч(ПараметрыВыполненияКоманды.Источник) = Тип("УправляемаяФорма") 
				И ПараметрыВыполненияКоманды.Источник.ИмяФормы = "Справочник.ШаблоныСообщений.Форма.ФормаСписка"
				И Не ПараметрыВыполненияКоманды.Источник.Элементы.Найти("Список") = Неопределено Тогда 
			ПараметрыВыполненияКоманды.Источник.Элементы.Список.Обновить();
		КонецЕсли;
	Иначе 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СоздатьШаблонПоУмолчанию(ТекстОшибки)
	
	ШаблонПисьма = Справочники.ШаблоныСообщений.СоздатьЭлемент();
	ШаблонПисьма.Наименование                           = "Шаблон для уведомления о расхождениях в Акте отгрузки";
	ШаблонПисьма.Назначение                             = "Акт отгрузки";
	ШаблонПисьма.ПолноеИмяТипаПараметраВводаНаОсновании = "Документ.уатАктОтгрузки_уэ";
	ШаблонПисьма.ПредназначенДляВводаНаОсновании        = Истина;
	ШаблонПисьма.ПредназначенДляЭлектронныхПисем        = Истина;
	ШаблонПисьма.ТемаПисьма                             = "Обнаружены расхождения между планом и фактом в Акте отгрузки № [уатАктОтгрузки_уэ.Номер] от [уатАктОтгрузки_уэ.Дата]";
	ШаблонПисьма.ТипТекстаПисьма                        = Перечисления.СпособыРедактированияЭлектронныхПисем.HTML;
	
	ШаблонПисьма.ТекстШаблонаПисьма = 
	"Добрый день!
	|
	|В Акте отгрузки [уатАктОтгрузки_уэ.Номер] от [уатАктОтгрузки_уэ.Дата] зафиксированы расхождения плановых и фактических параметров груза
	|
	|Пункт: [уатАктОтгрузки_уэ.Пункт.Наименование]
	|Водитель: [уатАктОтгрузки_уэ.Водитель1]
	|[уатАктОтгрузки_уэ.МаршрутныйЛист]
	|Грузоотправитель: [уатАктОтгрузки_уэ.ДанныеЗаказаНаТС.Грузоотправитель]
	|Грузополучатель: [уатАктОтгрузки_уэ.ДанныеЗаказаНаТС.Грузополучатель]
	|Начало отгрузки: [уатАктОтгрузки_уэ.НачалоОперации], окончание отгрузки: [уатАктОтгрузки_уэ.ОкончаниеОперации]
	|
	|Груз: [уатАктОтгрузки_уэ.ДанныеСтрокиТЧГрузы.ГрузовоеМесто] по Заказу на ТС [уатАктОтгрузки_уэ.ДанныеЗаказаНаТС.Номер] от [уатАктОтгрузки_уэ.ДанныеЗаказаНаТС.Дата]
	|Статус груза: [уатАктОтгрузки_уэ.ДанныеСтрокиТЧГрузы.Статус]
	|Состояние груза: [уатАктОтгрузки_уэ.ДанныеСтрокиТЧГрузы.Состояние]
	|
	|Количество план/факт: [уатАктОтгрузки_уэ.ДанныеСтрокиТЧГрузы.КоличествоПлан] / [уатАктОтгрузки_уэ.ДанныеСтрокиТЧГрузы.КоличествоФакт], [уатАктОтгрузки_уэ.ДанныеСтрокиТЧГрузы.ЕдиницаИзмерения]
	|Вес план / факт: [уатАктОтгрузки_уэ.ДанныеСтрокиТЧГрузы.ВесБруттоПлан] / [уатАктОтгрузки_уэ.ДанныеСтрокиТЧГрузы.ВесБруттоФакт]
	|Количество мест план/факт: [уатАктОтгрузки_уэ.ДанныеСтрокиТЧГрузы.КоличествоМестПлан] / [уатАктОтгрузки_уэ.ДанныеСтрокиТЧГрузы.КоличествоМестФакт]  
	|Объем план/факт: [уатАктОтгрузки_уэ.ДанныеСтрокиТЧГрузы.ОбъемПлан] / [уатАктОтгрузки_уэ.ДанныеСтрокиТЧГрузы.ОбъемФакт]";
		
	ШаблонПисьма.ТекстШаблонаПисьмаHTML = 
	"<html>
	|<head>
	|<meta http-equiv=""Content-Type"" content=""text/html; charset=utf-8"" />
	|<meta http-equiv=""X-UA-Compatible"" content=""IE=Edge"" />
	|<meta name=""format-detection"" content=""telephone=no"" />
	|<style type=""text/css"">
	|body{margin:0;padding:8px;}
	|p{line-height:1.15;margin:0;white-space:pre-wrap;}
	|ol,ul{margin-top:0;margin-bottom:0;}
	|img{border:none;}
	|li>p{display:inline;}
	|</style>
	|</head>
	|<body>
	|<p>Добрый день!</p>
	|<p><br></p>
	|<p>В Акте отгрузки [уатАктОтгрузки_уэ.Номер] от [уатАктОтгрузки_уэ.Дата] зафиксированы расхождения плановых и фактических параметров груза</p>
	|<p><br></p>
	|<p>Пункт: [уатАктОтгрузки_уэ.Пункт.Наименование]</p>
	|<p>Водитель: [уатАктОтгрузки_уэ.Водитель1]</p>
	|<p>[уатАктОтгрузки_уэ.МаршрутныйЛист]</p>
	|<p>Грузоотправитель: [уатАктОтгрузки_уэ.ДанныеЗаказаНаТС.Грузоотправитель]</p>
	|<p>Грузополучатель: [уатАктОтгрузки_уэ.ДанныеЗаказаНаТС.Грузополучатель]</p>
	|<p>Начало отгрузки: [уатАктОтгрузки_уэ.НачалоОперации], окончание отгрузки: [уатАктОтгрузки_уэ.ОкончаниеОперации]</p>
	|<p><br></p>
	|<p>Груз: [уатАктОтгрузки_уэ.ДанныеСтрокиТЧГрузы.ГрузовоеМесто] по Заказу на ТС [уатАктОтгрузки_уэ.ДанныеЗаказаНаТС.Номер] от [уатАктОтгрузки_уэ.ДанныеЗаказаНаТС.Дата]</p>
	|<p>Статус груза: [уатАктОтгрузки_уэ.ДанныеСтрокиТЧГрузы.Статус]</p>
	|<p>Состояние груза: [уатАктОтгрузки_уэ.ДанныеСтрокиТЧГрузы.Состояние]</p>
	|<p><br></p>
	|<p>Количество план/факт: [уатАктОтгрузки_уэ.ДанныеСтрокиТЧГрузы.КоличествоПлан] / [уатАктОтгрузки_уэ.ДанныеСтрокиТЧГрузы.КоличествоФакт], [уатАктОтгрузки_уэ.ДанныеСтрокиТЧГрузы.ЕдиницаИзмерения]</p>
	|<p>Вес план / факт: [уатАктОтгрузки_уэ.ДанныеСтрокиТЧГрузы.ВесБруттоПлан] / [уатАктОтгрузки_уэ.ДанныеСтрокиТЧГрузы.ВесБруттоФакт]</p>
	|<p>Количество мест план/факт: [уатАктОтгрузки_уэ.ДанныеСтрокиТЧГрузы.КоличествоМестПлан] / [уатАктОтгрузки_уэ.ДанныеСтрокиТЧГрузы.КоличествоМестФакт]</p>
	|<p>Объем план/факт: [уатАктОтгрузки_уэ.ДанныеСтрокиТЧГрузы.ОбъемПлан] / [уатАктОтгрузки_уэ.ДанныеСтрокиТЧГрузы.ОбъемФакт]</p>
	|</body>
	|</html>";
	
	ТекстHTML = ШаблонПисьма.ТекстШаблонаПисьмаHTML;
	
	Попытка
		ШаблонПисьма.Записать();
	Исключение
		ТекстОшибки = ИнформацияОбОшибке().Описание;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти
