
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОчисткаИстории(Команда)
	
	ОткрытьФорму(
		"Обработка.уатОчисткаИстории.Форма", 
		Новый Структура("флИсторияМестоположенияПоGPS", Истина),
		ЭтотОбъект,
		,
		,
		,
		Новый ОписаниеОповещения("ПослеОчисткиИстории", ЭтотОбъект), 
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
	);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеОчисткиИстории(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

#КонецОбласти
