
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	РежимОткрытия        = "РежимКарты_";
	РедактироватьМаршрут = Истина;
	Если ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.уатЗаказГрузоотправителя")Тогда
		РежимОткрытия = РежимОткрытия + "ЗаказГрузоотправителя";
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.уатМаршрутныйЛист")Тогда
		РежимОткрытия = РежимОткрытия + "МаршрутныйЛист";
		Если ПараметрыВыполненияКоманды.Источник.ИмяФормы = "Документ.уатМаршрутныйЛист.Форма.ФормаСписка" Тогда
			РедактироватьМаршрут = Ложь;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.уатПутевойЛист") Тогда
		РежимОткрытия = РежимОткрытия + "ПутевойЛист";
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.уатОтчетПоставщикаПЦ")Тогда
		РежимОткрытия = РежимОткрытия + "ОтчетПоставщикаПЦ";
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.уатПарковка")Тогда
		РежимОткрытия = РежимОткрытия + "Парковка";
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.уатШтраф")Тогда
		РежимОткрытия = РежимОткрытия + "Штраф";
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Контрагенты") Тогда
		РежимОткрытия = РежимОткрытия + "Контрагенты";
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.уатМаршруты") Тогда
		РежимОткрытия = РежимОткрытия + "Маршруты";
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.уатПунктыНазначения") Тогда
		РежимОткрытия = РежимОткрытия + "ПунктыНазначения";
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.уатТипыПунктов") Тогда
		РежимОткрытия = РежимОткрытия + "ТипыПунктов";
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.уатГеозоны_уэ") Тогда
		РежимОткрытия = РежимОткрытия + "Геозоны";
	ИначеЕсли уатОбщегоНазначенияПовтИсп.ВариантПоставкиКОРП()
		И ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.уатКластеры_уэ") Тогда
		РежимОткрытия = РежимОткрытия + "Кластеры"; 
	ИначеЕсли уатОбщегоНазначенияПовтИсп.ВариантПоставкиТакси()
		И ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.такЗаказТакси")Тогда
		РежимОткрытия = РежимОткрытия + "ЗаказТакси";
	ИначеЕсли уатОбщегоНазначенияПовтИсп.ВариантПоставкиТакси()
		И ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.такАрендаТС")Тогда
		РежимОткрытия = РежимОткрытия + "АрендаТС";
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("РежимОткрытия, ОбъектОснование, РедактироватьМаршрут",
		РежимОткрытия, ПараметрКоманды, РедактироватьМаршрут);
	уатЭлектронныеКартыКлиент.ОткрытьКартуИУстановитьРежим(ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти
