#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИсключаемыеФизическиеЛица.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ИсключаемыеФизическиеЛица.ДатаБлокировки КАК ДатаБлокировки,
	|	ИсключаемыеФизическиеЛица.Примечание КАК Примечание
	|ИЗ
	|	РегистрСведений.GDS_ПараметрыЗапретаДоступаУволеннымСотрудникамИсключаемыеФизическиеЛица КАК ИсключаемыеФизическиеЛица";
	
	ИсключаемыеФизическиеЛица.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	СохранитьНастройкиНаСервере();
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СохранитьНастройкиНаСервере()
	
	НаборЗаписей = РегистрыСведений.GDS_ПараметрыЗапретаДоступаУволеннымСотрудникамИсключаемыеФизическиеЛица.СоздатьНаборЗаписей();
	Для Каждого ДанныеФизическогоЛица Из ИсключаемыеФизическиеЛица Цикл 
		ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), ДанныеФизическогоЛица);
	КонецЦикла;
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти
