#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.Добавить(Перечисления.уатФормыОплаты.Наличные);
	ДанныеВыбора.Добавить(Перечисления.уатФормыОплаты.Безналичные);
	ДанныеВыбора.Добавить(Перечисления.уатФормыОплаты.ПлатежнаяКарта);
	Если уатОбщегоНазначенияПовтИсп.ВариантПоставкиТакси() 
		И Константы.такИспользоватьЗаказыТакси.Получить() = Истина Тогда
		ДанныеВыбора.Добавить(Перечисления.уатФормыОплаты.Агрегатор);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти