////////////////////////////////////////////////////////////////////////////////
// Методы для работы с ремонтными листами
//  
////////////////////////////////////////////////////////////////////////////////
#Область ПрограммныйИнтерфейс

Функция НоменклатураИспользуемаяВНесогласованныхРемЛистах(ТекущийРемЛист, СписокНоменклатуры, Склад) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ТекущийРемЛист", Документы.уатРемонтныйЛист.ПустаяСсылка());
	Запрос.УстановитьПараметр("СписокНоменклатуры", СписокНоменклатуры);
	Запрос.УстановитьПараметр("Склад", Склад);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	уатРемонтныйЛистМатериалы.Номенклатура КАК Номенклатура,
	|	СУММА(уатРемонтныйЛистМатериалы.Количество) КАК Количество
	|ИЗ
	|	Документ.уатРемонтныйЛист.Материалы КАК уатРемонтныйЛистМатериалы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияСогласованияВДокументообороте КАК СостоянияСогласованияВДокументообороте
	|		ПО уатРемонтныйЛистМатериалы.Ссылка = СостоянияСогласованияВДокументообороте.ИдентификаторОбъектаДО
	|ГДЕ
	|	НЕ уатРемонтныйЛистМатериалы.Ссылка.ПометкаУдаления
	|	И уатРемонтныйЛистМатериалы.Ссылка.GDS_СкладВБП = &Склад
	|	И уатРемонтныйЛистМатериалы.Номенклатура В(&СписокНоменклатуры)
	|	И уатРемонтныйЛистМатериалы.Ссылка <> &ТекущийРемЛист
	|	И (СостоянияСогласованияВДокументообороте.Состояние ЕСТЬ NULL
	|			ИЛИ СостоянияСогласованияВДокументообороте.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостоянияСогласованияВДокументообороте.Согласован))
	|
	|СГРУППИРОВАТЬ ПО
	|	уатРемонтныйЛистМатериалы.Номенклатура";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

