
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьСтруктуруПараметровAddPointIcon(Широта, Долгота, АдресНадпись = "",КластеризацияМаркеровНаКарте = Ложь, НомерИконки = "0", Картинка = "") Экспорт
	ПараметрыКоманды = Новый Структура();
	ПараметрыКоманды.Вставить("Широта",                       ?(ТипЗнч(Широта) = Тип("Число"), Формат(Широта, "ЧРД=.; ЧН=0.0000; ЧГ=0"), Широта));
	ПараметрыКоманды.Вставить("Долгота",                      ?(ТипЗнч(Долгота) = Тип("Число"), Формат(Долгота, "ЧРД=.; ЧН=0.0000; ЧГ=0"), Долгота));
	ПараметрыКоманды.Вставить("АдресНадпись",                 АдресНадпись);
	ПараметрыКоманды.Вставить("КластеризацияМаркеровНаКарте", ?(КластеризацияМаркеровНаКарте, "true", "false"));
	ПараметрыКоманды.Вставить("НомерИконки",                  Строка(НомерИконки));
	ПараметрыКоманды.Вставить("Картинка",                     Картинка);
	Возврат ПараметрыКоманды;
КонецФункции

#КонецОбласти

#КонецЕсли