#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// Позволяет указать объекты метаданных, для которых задана логика ограничения доступа к данным.
// В модулях менеджеров указанных списков размещается процедура обработчика, например:
//
// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтение
	|ГДЕ
	|	ЧтениеОбъектаРазрешено(СсылкаНаОбъект)
	|	И ЧтениеОбъектаРазрешено(РаспознанныйДокумент)
	|;
	|РазрешитьИзменениеЕслиРазрешеноЧтение
	|ГДЕ
	|	ИзменениеОбъектаРазрешено(СсылкаНаОбъект)
	|	И ИзменениеОбъектаРазрешено(РаспознанныйДокумент)";
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьСвязанныеДокументы(РаспознанныйДокумент, ВключатьПотенциальные = Ложь) Экспорт
	
	ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СвязанныеОбъектыРаспознаниеДокументов.СсылкаНаОбъект КАК СсылкаНаОбъект
		|ИЗ
		|	РегистрСведений.СвязанныеОбъектыРаспознаниеДокументов КАК СвязанныеОбъектыРаспознаниеДокументов
		|ГДЕ
		|	СвязанныеОбъектыРаспознаниеДокументов.РаспознанныйДокумент = &РаспознанныйДокумент
		|	И НЕ СвязанныеОбъектыРаспознаниеДокументов.ПотенциальныйКандидат";
	
	Если ВключатьПотенциальные Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "НЕ СвязанныеОбъектыРаспознаниеДокументов.ПотенциальныйКандидат", "ИСТИНА");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("РаспознанныйДокумент", РаспознанныйДокумент);
	
	Выборка = Запрос.Выполнить();
	Если Выборка.Пустой() Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	РезультатЗапроса = Выборка.Выгрузить();
	
	Возврат РезультатЗапроса.ВыгрузитьКолонку("СсылкаНаОбъект");
	
КонецФункции

Функция ВсеСвязанныеДокументы(РаспознанныйДокумент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СвязанныеОбъектыРаспознаниеДокументов.СсылкаНаОбъект КАК Ссылка,
		|	СвязанныеОбъектыРаспознаниеДокументов.ПотенциальныйКандидат КАК ПотенциальныйКандидат
		|ИЗ
		|	РегистрСведений.СвязанныеОбъектыРаспознаниеДокументов КАК СвязанныеОбъектыРаспознаниеДокументов
		|ГДЕ
		|	СвязанныеОбъектыРаспознаниеДокументов.РаспознанныйДокумент = &РаспознанныйДокумент
		|	И НЕ СвязанныеОбъектыРаспознаниеДокументов.СсылкаНаОбъект.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка";
	
	Запрос.УстановитьПараметр("РаспознанныйДокумент", РаспознанныйДокумент);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ЗаписатьЗначения(СозданныйДокумент, РаспознанныйДокумент, ПотенциальныйКандидат = Истина) Экспорт
	
	Запись = СоздатьМенеджерЗаписи();
	Запись.СсылкаНаОбъект = СозданныйДокумент;
	Запись.РаспознанныйДокумент = РаспознанныйДокумент;
	Запись.ПотенциальныйКандидат = ПотенциальныйКандидат;
	Запись.Записать();
	
КонецПроцедуры

Процедура УдалитьЗначения(СозданныйДокумент, РаспознанныйДокумент) Экспорт
	
	Запись = СоздатьМенеджерЗаписи();
	Запись.СсылкаНаОбъект = СозданныйДокумент;
	Запись.РаспознанныйДокумент = РаспознанныйДокумент;
	Запись.Удалить();
	
КонецПроцедуры

Функция РаспознанныеДокументыПоСвязанным(СвязанныеДокументы) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	СвязанныеОбъектыРаспознаниеДокументов.РаспознанныйДокумент КАК РаспознанныйДокумент
		|ИЗ
		|	РегистрСведений.СвязанныеОбъектыРаспознаниеДокументов КАК СвязанныеОбъектыРаспознаниеДокументов
		|ГДЕ
		|	СвязанныеОбъектыРаспознаниеДокументов.СсылкаНаОбъект В(&СвязанныеДокументы)";
	Запрос.УстановитьПараметр("СвязанныеДокументы", СвязанныеДокументы);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат.ВыгрузитьКолонку("РаспознанныйДокумент");
	
КонецФункции


#КонецОбласти

#КонецЕсли
