#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

	
#Область ПрограммныйИнтерфейс

// Задает настройки размещения вариантов отчетов в панели отчетов.
// См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//
// Параметры:
//   Настройки - Коллекция - Используется для описания настроек отчетов и вариантов
//       см. описание к ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//   НастройкиОтчета - СтрокаДереваЗначений - Настройки размещения всех вариантов отчета.
//       См. ""Реквизиты для изменения"" функции ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "Предоставленные и выставленные услуги");
	НастройкиВарианта.Описание = НСтр("en='Report provides information about provided and invoiced services.';ru='Отчет отображает информацию о предоставленных и выставленных услугах.'");
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "Невыставленные услуги");
	НастройкиВарианта.Описание = НСтр("en='Report provides information about unexpected services.';ru='Отчет отображает информацию о невыставленных услугах.'");
	
	Если Не уатОбщегоНазначенияПовтИсп.ВариантПоставкиСТД() Тогда
		НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "Услуги для внешнего пользователя");
		НастройкиВарианта.Описание = НСтр("en='Report provides information about provided and invoiced services.';
		|ru='Отчет отображает информацию о предоставленных и выставленных услугах с сокращенным списком отборов.'");
		НастройкиВарианта.Включен = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	уатЗащищенныеФункцииСервер.уатОтчетОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьПараметрДатаНачала(ПериодОтчета, ПериодНаДату, ВариантНевыставленныеУслуги) Экспорт
	
	Если ВариантНевыставленныеУслуги Тогда 
		Возврат '00010101'
	Иначе 
		Возврат ПериодОтчета.ДатаНачала;
	КонецЕсли;
	
КонецФункции // ПолучитьПараметрДатаНачала()

Функция ПолучитьПараметрДатаОкончания(ПериодОтчета, ПериодНаДату, ВариантНевыставленныеУслуги) Экспорт
	
	Если ВариантНевыставленныеУслуги Тогда 
		Возврат ПериодНаДату;
	Иначе 
		Возврат ПериодОтчета.ДатаОкончания;
	КонецЕсли;
	
КонецФункции // ПолучитьПараметрДатаОкончания()

#КонецОбласти


#КонецЕсли