////////////////////////////////////////////////////////////////////////////////
// Обмен данными события УАТ.
// Модуль содержит обработчики подписок событий механизма универсального обмена.
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Обработчик подписки на события "СинхронизацияДанныхЧерезУниверсальныйФорматРегистрация".
//
Процедура СинхронизацияДанныхЧерезУниверсальныйФорматРегистрацияПередЗаписью(Источник, Отказ) Экспорт
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписью(
		"СинхронизацияДанныхЧерезУниверсальныйФормат", 
		Источник, 
		Отказ
	);
	
КонецПроцедуры

// Обработчик подписки на события "СинхронизацияДанныхЧерезУниверсальныйФорматРегистрацияДокумента".
//
Процедура СинхронизацияДанныхЧерезУниверсальныйФорматРегистрацияДокументаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюДокумента(
		"СинхронизацияДанныхЧерезУниверсальныйФормат", 
		Источник, 
		Отказ, 
		РежимЗаписи, 
		РежимПроведения
	);
	
КонецПроцедуры

// Обработчик подписки на события "СинхронизацияДанныхЧерезУниверсальныйФорматРегистрацияНабора".
//
Процедура СинхронизацияДанныхЧерезУниверсальныйФорматРегистрацияНабораПередЗаписью(Источник, Отказ, Замещение) Экспорт
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюРегистра(
		"СинхронизацияДанныхЧерезУниверсальныйФормат",
		Источник,
		Отказ,
		Замещение
	);
	
КонецПроцедуры

// Обработчик подписки на события "СинхронизацияДанныхЧерезУниверсальныйФорматРегистрацияУдаления".
//
Процедура СинхронизацияДанныхЧерезУниверсальныйФорматРегистрацияУдаленияПередУдалением(Источник, Отказ) Экспорт
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередУдалением(
		"СинхронизацияДанныхЧерезУниверсальныйФормат", 
		Источник, 
		Отказ
	);
	
КонецПроцедуры

// Обработчик подписки на события "уатПолныйРегистрацияПередЗаписью".
//
Процедура уатПолныйРегистрацияПередЗаписью(Источник, Отказ) Экспорт
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписью(
		"уатПолный",
		Источник,
		Отказ
	);
	
КонецПроцедуры

// Обработчик подписки на события "уатПолныйРегистрацияДокументаПередЗаписью".
//
Процедура уатПолныйРегистрацияДокументаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюДокумента(
		"уатПолный",
		Источник,
		Отказ,
		РежимЗаписи,
		РежимПроведения
	);
	
КонецПроцедуры

// Обработчик подписки на события "уатПолныйРегистрацияНабораПередЗаписью".
//
Процедура уатПолныйРегистрацияНабораПередЗаписью(Источник, Отказ, Замещение) Экспорт
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюРегистра(
		"уатПолный",
		Источник,
		Отказ,
		Замещение
	);
	
КонецПроцедуры

// Обработчик подписки на события "уатПолныйРегистрацияНабораРасчетаПередЗаписью".
//
Процедура уатПолныйРегистрацияНабораРасчетаПередЗаписью(Источник, Отказ, Замещение, ТолькоЗапись, ЗаписьФактическогоПериодаДействия, ЗаписьПерерасчетов) Экспорт
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюРегистра(
		"уатПолный",
		Источник,
		Отказ,
		Замещение
	);
	
КонецПроцедуры

// Обработчик подписки на события "уатПолныйРегистрацияКонстантыПередЗаписью".
//
Процедура уатПолныйРегистрацияКонстантыПередЗаписью(Источник, Отказ) Экспорт
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюКонстанты(
		"уатПолный",
		Источник,
		Отказ
	);
	
КонецПроцедуры

// Обработчик подписки на события "уатПолныйРегистрацияУдаленияПередУдалением".
//
Процедура уатПолныйРегистрацияУдаленияПередУдалением(Источник, Отказ) Экспорт
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередУдалением(
		"уатПолный",
		Источник,
		Отказ
	);
	
КонецПроцедуры

#КонецОбласти
