
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1Сдокументооборотом
	
	Если Объект.Ссылка.Пустая() Тогда
		Если НЕ ЗначениеЗаполнено(Объект.ДатаОсмотра) Тогда
			Объект.ДатаОсмотра = ТекущаяДата();
		КонецЕсли;
	КонецЕсли;
	
	НайтиПредыдущийАктПриемаПередачи();
	
	ОбновитьПредыдущееСостояниеЭлементовПровекри();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбновитьЗаголовокПредыдущееСостояниеВТЧ();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1Сдокументооборотом
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1Сдокументооборотом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ОбновитьЗаголовокПредыдущееСостояниеВТЧ(ИмяТЧ = Неопределено)
	
	Если ИмяТЧ = Неопределено Тогда
		ОбновитьЗаголовокПредыдущееСостояниеВТЧ("ЭлементыПроверки");
		Возврат;
	КонецЕсли;
	
	ПредыдущаяДатаОсмотра = уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(ПредыдущийАктПриемаПередачи, "ДатаОсмотра");
	Элементы[ИмяТЧ + "Предыдущее"].Заголовок = "Предыдущий осмотр" + ?(ЗначениеЗаполнено(ПредыдущаяДатаОсмотра),
		" " + Формат(ПредыдущаяДатаОсмотра, "ДФ='dd.MM.yyyy HH:mm'"),  "");
	
КонецПроцедуры

&НаСервере
Процедура НайтиПредыдущийАктПриемаПередачи()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	GDS_АктПриемаПередачиТС.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.GDS_АктПриемаПередачиТС КАК GDS_АктПриемаПередачиТС
	|ГДЕ
	|	GDS_АктПриемаПередачиТС.ТС = &ТС
	|	И GDS_АктПриемаПередачиТС.Проведен
	|	И GDS_АктПриемаПередачиТС.ДатаОсмотра < &Период
	|
	|УПОРЯДОЧИТЬ ПО
	|	GDS_АктПриемаПередачиТС.ДатаОсмотра УБЫВ");
	Запрос.УстановитьПараметр("ТС", Объект.ТС);
	Запрос.УстановитьПараметр("Период", ?(ЗначениеЗаполнено(Объект.ДатаОсмотра), Объект.ДатаОсмотра, ТекущаяДата()));
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ПредыдущийАктПриемаПередачи = Выборка.Ссылка;
		Элементы.ПолеПредыдущийОсмотрНеВыполнялся.Видимость = Ложь;
		Элементы.ПредыдущийАктПриемаПередачи.Видимость = Истина;
		//Элементы.ДекорацияПредОсмотрНеВыполнялся.Видимость = Ложь;
	Иначе
		Элементы.ПолеПредыдущийОсмотрНеВыполнялся.Видимость = Истина;
		ПолеПредыдущийОсмотрНеВыполнялся = "Не выполнялся";
		Элементы.ПредыдущийАктПриемаПередачи.Видимость = Ложь;
		//Элементы.ДекорацияПредОсмотрНеВыполнялся.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПредыдущееСостояниеЭлементовПровекри()
	
	тблЭлементыПроверкиПред = ЭлементыПроверкиТС(ТСиПрицепыДокумента(), Объект.ДатаОсмотра-1);
		
	Для Каждого ТекСтрока Из Объект.ЭлементыПроверки Цикл
		мсвСтрокиПоиск = тблЭлементыПроверкиПред.НайтиСтроки(Новый Структура("ТС, ЭлементПроверки",
			ТекСтрока.ТС, ТекСтрока.ЭлементПроверки));
		Если мсвСтрокиПоиск.Количество() > 0 Тогда
			ТекСтрока.СостояниеПредыдущее           = мсвСтрокиПоиск[0].Состояние;
			ТекСтрока.НаличиеПроблемПредыдущее  = мсвСтрокиПоиск[0].НаличиеПроблем;
			ТекСтрока.ЗамечаниеПредыдущее  = мсвСтрокиПоиск[0].Замечания;
			
			//ТекСтрока.ХарактерПоврежденийПредыдущий = мсвСтрокиПоиск[0].ХарактерПовреждений;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Возвращает таблицу кузовных элементов ТС
//
Функция ЭлементыПроверкиТС(ТС, Период = Неопределено, ТолькоПоврежденные = Ложь)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	GDS_ЭлементыПроверкиСрезПоследних.ЭлементПроверки КАК ЭлементПроверки,
	|	GDS_ЭлементыПроверкиСрезПоследних.Состояние КАК Состояние,
	|	GDS_ЭлементыПроверкиСрезПоследних.НаличиеПроблем КАК НаличиеПроблем,
	|	GDS_ЭлементыПроверкиСрезПоследних.ТС КАК ТС,
	|	GDS_ЭлементыПроверкиСрезПоследних.Период КАК Период,
	|	GDS_ЭлементыПроверкиСрезПоследних.Замечания КАК Замечания
	|ИЗ
	|	РегистрСведений.GDS_ЭлементыПроверки.СрезПоследних(&Период, ТС = &ТС) КАК GDS_ЭлементыПроверкиСрезПоследних");
	Запрос.УстановитьПараметр("Период", ?(Период = Неопределено, ТекущаяДата(), Период));
	Запрос.УстановитьПараметр("ТС", ТС);
	Если ТипЗнч(ТС) = Тип("Массив") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТС = &ТС", "ТС В (&ТС)");
	КонецЕсли;
	Если ТолькоПоврежденные Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И уатКузовныеЭлементыТССрезПоследних.НаличиеПовреждений";
	КонецЕсли;
	РезультатТаблица = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатТаблица;
	
КонецФункции // уатКузовныеЭлементыТС

&НаСервере
Функция ТСиПрицепыДокумента()
	
	Возврат Документы.GDS_АктПриемаПередачиТС.ТСиПрицепыДокумента(Объект);
	
КонецФункции

#КонецОбласти
