#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
	Настройки.ПриПолученииСлужебныхРеквизитов = Ложь;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	// необходима для подключения внешних ПФ
	Заглушка = Истина;
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

// СтандартныеПодсистемы.УправлениеДоступом

// Позволяет переопределить ограничение, указанное в модуле менеджера объекта метаданных.
//
// Параметры:
//  Ограничение - Структура:
//    * Текст                             - Строка - ограничение доступа для пользователей.
//                                          Если пустая строка, значит, доступ разрешен.
//    * ТекстДляВнешнихПользователей      - Строка - ограничение доступа для внешних пользователей.
//                                          Если пустая строка, значит, доступ запрещен.
//    * ПоВладельцуБезЗаписиКлючейДоступа - Неопределено - определить автоматически.
//                                        - Булево - если Ложь, то всегда записывать ключи доступа,
//                                          если Истина, тогда не записывать ключи доступа,
//                                          а использовать ключи доступа владельца (требуется,
//                                          чтобы ограничение было строго по объекту-владельцу).
//   * ПоВладельцуБезЗаписиКлючейДоступаДляВнешнихПользователей - Неопределено, Булево - также
//                                          как у параметра ПоВладельцуБезЗаписиКлючейДоступа.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";
	
	Ограничение.ТекстДляВнешнихПользователей = Ограничение.Текст;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	ТаблицаРабочегоВремени = Новый ТаблицаЗначений;
	ТаблицаРабочегоВремени.Колонки.Добавить("Регистратор");
	ТаблицаРабочегоВремени.Колонки.Добавить("Период");
	ТаблицаРабочегоВремени.Колонки.Добавить("Сотрудник");
	ТаблицаРабочегоВремени.Колонки.Добавить("Организация");
	ТаблицаРабочегоВремени.Колонки.Добавить("ВидИспользованияРабочегоВремени");
	ТаблицаРабочегоВремени.Колонки.Добавить("ДатаРаботы");
	ТаблицаРабочегоВремени.Колонки.Добавить("Дней");
	ТаблицаРабочегоВремени.Колонки.Добавить("Время");
	ТаблицаРабочегоВремени.Колонки.Добавить("Смена");
	ТаблицаРабочегоВремени.Колонки.Добавить("ДокументКорректировки");
	
	Для Каждого ТекСтрока Из ДокументСсылка.ТабличнаяЧасть Цикл	
		Для ТекДата = 0 по ТекСтрока.Дней - 1 Цикл
			НовСтрока = ТаблицаРабочегоВремени.Добавить();
			НовСтрока.Регистратор                     = ДокументСсылка;
			НовСтрока.Период                          = ДокументСсылка.Дата;
			НовСтрока.Сотрудник                       = ДокументСсылка.Сотрудник;
			НовСтрока.Организация                     = ДокументСсылка.Организация;
			НовСтрока.ВидИспользованияРабочегоВремени = ТекСтрока.ВидИспользованияРабочегоВремени;
			НовСтрока.ДатаРаботы                      = ТекСтрока.ДатаНачала + ТекДата*уатОбщегоНазначения.уатВремяВСекунды(24);
			НовСтрока.Дней                            = 1;
			НовСтрока.Время                           = ?(ТекСтрока.Время = '00010101',
				24*3600, ТекСтрока.Время - НачалоДня(ТекСтрока.Время));
			НовСтрока.Смена                           = ТекСтрока.Смена;
			НовСтрока.ДокументКорректировки           = ДокументСсылка;
		КонецЦикла;     
	КонецЦикла;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРабочегоВремени", ТаблицаРабочегоВремени);
	
КонецПроцедуры

Процедура ВыполнитьКонтроль(ДокументСсылка, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли