
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Для Каждого Запись Из ЭтотОбъект Цикл 
		Для СчВнешний = 1 По 10 Цикл 
			Если Не ЗначениеЗаполнено(Запись["СпециальнаяРабота"+Формат(СчВнешний, "ЧГ=0")]) И ЗначениеЗаполнено(Запись["НормаНаСпециальнуюРаботу"+Формат(СчВнешний, "ЧГ=0")]) Тогда 
				ТекстНСТР = НСтр("en='Not specified special work %1';ru='Не указана специальная работа %1'");
				ТекстОшибки = СтрШаблон(ТекстНСТР, Формат(СчВнешний, "ЧГ=0"));
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,, "Запись.СпециальнаяРабота"+Формат(СчВнешний, "ЧГ=0"),, Отказ);
			КонецЕсли;
			
			Для СчВнутр = СчВнешний+1 По 10 Цикл 
				Если ЗначениеЗаполнено(Запись["СпециальнаяРабота"+Формат(СчВнешний, "ЧГ=0")]) И Запись["СпециальнаяРабота"+Формат(СчВнешний, "ЧГ=0")] = Запись["СпециальнаяРабота"+Формат(СчВнутр, "ЧГ=0")] Тогда 
					ТекстОшибки = НСтр("en='This special work has already been specified earlier.';ru='Данная специальная работа уже была указана ранее.'");
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,, "Запись.СпециальнаяРабота"+Формат(СчВнутр, "ЧГ=0"),, Отказ);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти