
#Область ОБработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("НеОткрыватьРедакторЦепочкиДокументов") Тогда
		НеОткрыватьРедакторЦепочкиДокументов = Параметры.НеОткрыватьРедакторЦепочкиДокументов;
	Иначе
		НеОткрыватьРедакторЦепочкиДокументов = Ложь;
		Элементы.НеОткрыватьРедакторЦепочкиДокументов.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьРедактор(Команда)
	Результат = Новый Структура();
	Результат.Вставить("НеОткрыватьРедакторЦепочкиДокументов", НеОткрыватьРедакторЦепочкиДокументов);
	Результат.Вставить("ОткрытьРедактор", Истина);
	Закрыть(Результат);
КонецПроцедуры

&НаКлиенте
Процедура НеОткрыватьРедактор(Команда)
	Результат = Новый Структура();
	Результат.Вставить("НеОткрыватьРедакторЦепочкиДокументов", НеОткрыватьРедакторЦепочкиДокументов);
	Результат.Вставить("ОткрытьРедактор", Ложь);
	Закрыть(Результат);
КонецПроцедуры

#КонецОбласти