
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗагрузитьНастройкиТерминала();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПрименитьНастройки(Команда)
	СохранитьНастройкиТерминала();
	Закрыть();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗагрузитьНастройкиТерминала()
	НастройкиТерминала = Константы.уатНастройкиТерминалаПЛ.Получить().Получить();
	Если НастройкиТерминала = Неопределено Тогда
		ТаймерРаботыСоСтраницей       = Дата(1,1,1,0,2,0);
		МаксимальноеКоличествоКопийПЛ = 3;
		Возврат;
	КонецЕсли;
	
	Если НастройкиТерминала.Свойство("Комментарий") Тогда
		Комментарий = НастройкиТерминала.Комментарий;
	КонецЕсли;
	Если НастройкиТерминала.Свойство("РазрешитьАвторизациюПоШтрихкоду") Тогда
		РазрешитьАвторизациюПоШтрихкоду = НастройкиТерминала.РазрешитьАвторизациюПоШтрихкоду;
	КонецЕсли;
	Если НастройкиТерминала.Свойство("МаксимальноеКоличествоКопийПЛ") Тогда
		МаксимальноеКоличествоКопийПЛ = НастройкиТерминала.МаксимальноеКоличествоКопийПЛ;
	Иначе
		МаксимальноеКоличествоКопийПЛ = 3;
	КонецЕсли;
	Если НастройкиТерминала.Свойство("ТаймерРаботыСоСтраницей") Тогда
		ТаймерРаботыСоСтраницей = НастройкиТерминала.ТаймерРаботыСоСтраницей;
	Иначе
		ТаймерРаботыСоСтраницей = Дата(1,1,1,0,2,0);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиТерминала()
	НастройкиТерминала = Новый Структура;
	НастройкиТерминала.Вставить("Комментарий", Комментарий);
	НастройкиТерминала.Вставить("ТаймерРаботыСоСтраницей", ТаймерРаботыСоСтраницей);
	НастройкиТерминала.Вставить("РазрешитьАвторизациюПоШтрихкоду", РазрешитьАвторизациюПоШтрихкоду);
	НастройкиТерминала.Вставить("МаксимальноеКоличествоКопийПЛ", МаксимальноеКоличествоКопийПЛ);
	Константы.уатНастройкиТерминалаПЛ.Установить(Новый ХранилищеЗначения(НастройкиТерминала, Новый СжатиеДанных(9)));
КонецПроцедуры

#КонецОбласти
