#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Процедура - обработчик события ПередЗаписью.
//
Процедура ПередЗаписью(Отказ)
	
	Файл = ХранилищеОбработки.Получить();
	Если Не Файл = Неопределено Тогда
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
		Файл.Записать(ИмяВременногоФайла);
		
		ХешСумма = ItobГеографическиеСервисыСлужебный.ХешСуммаФайла(ИмяВременногоФайла);
		
		УдалитьФайлы(ИмяВременногоФайла);
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти 

#КонецЕсли
