
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.ТС.ПринадлежностьТС = Перечисления.уатПринадлежностьТС.Собственное Тогда 
		Заголовок = "" + Параметры.ТС.Организация + "; " + Параметры.ПредставлениеТС;
	ИначеЕсли Параметры.ТС.ПринадлежностьТС = Перечисления.уатПринадлежностьТС.Привлеченное Тогда 
		Заголовок = "" + Параметры.ТС.ВладелецТС + "; " + Параметры.ПредставлениеТС;
	Иначе
		Заголовок = "" + Параметры.ПредставлениеТС;
	КонецЕсли;
	
	Для Каждого ТекСтрока Из Параметры.ДоходыПоЗаказу Цикл 
		НовСтрока = ДоходыПоЗаказу.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока, ТекСтрока);
	КонецЦикла;
	
	Если Параметры.РежимПодбораПоМаршрутномуЛисту Тогда
		ТекстНСТР = НСтр("en='Income on routing list';ru='Доходы по маршрутному листу'");
		Элементы.ГруппаДоходыПоЗаказу.Заголовок = ТекстНСТР + " - " + Формат(ДоходыПоЗаказу.Итог("Всего"), "ЧДЦ=2; ЧРД=,; ЧН=0,00; ЧГ=3,0") + " " + Параметры.Валюта;
	Иначе
		ТекстНСТР = НСтр("en='Income on order';ru='Доходы по заказу'");
		Элементы.ГруппаДоходыПоЗаказу.Заголовок = ТекстНСТР + " - " + Формат(ДоходыПоЗаказу.Итог("Всего"), "ЧДЦ=2; ЧРД=,; ЧН=0,00; ЧГ=3,0") + " " + Параметры.Валюта;
	КонецЕсли;
	
	Для Каждого ТекСтрока Из Параметры.ЗатратыПоЗаказу Цикл //для привлеченного ТС
		НовСтрока = РасходыПоЗаказу.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока, ТекСтрока);
		НовСтрока.ПараметрВыработки = ТекСтрока.ТарифТС.ПараметрВыработки;
	КонецЦикла;
	Для Каждого ТекСтрока Из Параметры.ЗатратыНаПеревозку Цикл //для собственного ТС
		НовСтрока = РасходыПоЗаказу.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока, ТекСтрока);
		НовСтрока.ТарифТС = ТекСтрока.Тариф;
	КонецЦикла;
	
	Если Параметры.РежимПодбораПоМаршрутномуЛисту Тогда
		ТекстНСТР = НСтр("en='Expenses on routing list';ru='Расходы по маршрутному листу'");
		Элементы.ГруппаРасходыПоЗаказу.Заголовок = ТекстНСТР + " - " + Формат(РасходыПоЗаказу.Итог("Всего"), "ЧДЦ=2; ЧРД=,; ЧН=0,00; ЧГ=3,0") + " " + Параметры.Валюта;
	Иначе
		ТекстНСТР = НСтр("en='Expenses on order';ru='Расходы по заказу'");
		Элементы.ГруппаРасходыПоЗаказу.Заголовок = ТекстНСТР + " - " + Формат(РасходыПоЗаказу.Итог("Всего"), "ЧДЦ=2; ЧРД=,; ЧН=0,00; ЧГ=3,0") + " " + Параметры.Валюта;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
