
#Область ПеременныеФормы

&НаКлиенте
Перем СтрокаПлатеж;
&НаКлиенте
Перем ОтветПередЗаписью;

#КонецОбласти


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	уатЗащищенныеФункцииСервер.уатДокументФормаЭлементаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, Объект, ЭтотОбъект, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	мВалютаРегламентированногоУчета = уатОбщегоНазначенияТиповые.ВалютаРегламентированногоУчета(Объект.Организация);
	
	ПараметрыЗначениеКопирования = Параметры.ЗначениеКопирования;
	уатОбщегоНазначенияСервер.НастроитьПолеПодразделение(Элементы.Подразделение, "Объект.Организация");
	
	МноговалютныйУчет = ПолучитьФункциональнуюОпцию("уатМноговалютныйУчет");
	РазнесениеПоЗаказам = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(Объект.Организация,
		ПланыВидовХарактеристик.уатПраваИНастройки.РазнесениеПлатежейПоЗаказам);
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	уатЗащищенныеФункцииКлиент.уатДокументФормаЭлементаПриОткрытии(Отказ, ЭтотОбъект, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если Объект.РасшифровкаПлатежа.Количество() = 0 Тогда
		НоваяСтрока = Объект.РасшифровкаПлатежа.Добавить();
		НоваяСтрока.СтавкаНДС =  уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(ПользователиКлиентСервер.АвторизованныйПользователь(), "ОсновнаяСтавкаНДС");
	КонецЕсли;
	
	Элементы.РасшифровкаПлатежа.ТекущаяСтрока = Объект.РасшифровкаПлатежа[0].ПолучитьИдентификатор();
	
	СтрокаПлатеж = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	
	УстановитьКурсДокумента();
	
	Если Параметры.Ключ.Пустая() Тогда // проверить объект на то, что он еще не внесен в ИБ
		
		Если Объект.РасшифровкаПлатежа.Количество()=0 Тогда
			СтрокаПлатеж = Объект.РасшифровкаПлатежа.Добавить();
		Иначе
			СтрокаПлатеж = Объект.РасшифровкаПлатежа[0];
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект.Касса) И ЗначениеЗаполнено(Объект.Организация) Тогда
			мКасса = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(Объект.Организация, "ОсновнаяКасса");
			
			Если мКасса <> Неопределено Тогда
				ВалютаДСКассы = уатОбщегоНазначенияТиповыеСервер.ПолучитьЗначениеРеквизита(мКасса, "ВалютаДенежныхСредств");
			Иначе
				ВалютаДСКассы = Неопределено;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(Объект.ВалютаДокумента) Тогда
				Объект.Касса = мКасса;
				Объект.ВалютаДокумента = ВалютаДСКассы;
			ИначеЕсли ВалютаДСКассы = Объект.ВалютаДокумента Тогда
				Объект.Касса = мКасса;
			КонецЕсли;
		КонецЕсли;
		
		Если ПараметрыЗначениеКопирования.Пустая() Тогда
			ЗаполнитьКонтрагента();
		Иначе
			УстановитьКурсДокумента();
		КонецЕсли;
		
	Иначе
		УстановитьКурсДокумента();
	КонецЕсли;
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.уатВидыОперацийПКО.ОплатаПокупателя") Тогда
		Элементы.ФормаОперацияОплатаПокупателя.Пометка = Истина;
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.уатВидыОперацийПКО.ПрочиеРасчетыСКонтрагентами") Тогда
		Элементы.ФормаОперацияПрочиеРасчетыСКонтрагентами.Пометка = Истина;
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.уатВидыОперацийПКО.ПриходДенежныхСредствПрочее") Тогда
		Элементы.ФормаОперацияПриходДенежныхСредствПрочее.Пометка = Истина;
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.уатВидыОперацийПКО.ВозвратОтПодотчетника") Тогда
		Элементы.ФормаОперацияВозвратОтПодотчетника.Пометка = Истина;
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.уатВидыОперацийПКО.ВозвратОтПоставщика") Тогда
		Элементы.ФормаОперацияВозвратОтПоставщика.Пометка = Истина;
	КонецЕсли;
	
	// Установить видимость реквизитов и заголовков колонок.
	Если Объект.РасшифровкаПлатежа.Количество()>1 Тогда
		СпособРедактирования = 1;
	Иначе
		СпособРедактирования = 0;
		ОтобразитьТЧЗаказыПоСтрокеРасшифровки();
	КонецЕсли;
	
	ВалютаВзаиморасчетовСтарая    = СтрокаПлатеж.ВалютаВзаиморасчетов;
	КурсВзаиморасчетовСтарая      = СтрокаПлатеж.КурсВзаиморасчетов;
	КратностьВзаиморасчетовСтарая = СтрокаПлатеж.КратностьВзаиморасчетов;
	
	УстановитьОграничениеТипаСделка();
	УстановитьВидимость();
	РассчитатьИтоги();

	Если Элементы.ГруппаРаспределениеПоЗаказам.Видимость И Объект.Заказы.Количество() > 0 Тогда
		Элементы.ГруппаРаспределениеПоЗаказам.Показать();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НЕ ОтветПередЗаписью
		И (ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Запись ИЛИ ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение)
		И Объект.РасшифровкаПлатежа.Итог("СуммаПлатежа") <> Объект.СуммаДокумента Тогда
		
		Отказ = Истина;
		
		ТекстНСТР = НСтр("en='Do not match document amount (%1) and its interpretation (%2). Recalculate the amount of document?""';ru='Не совпадают сумма документа (%1) и ее расшифровка (%2). Пересчитать сумму документа?""'");
		ТекстНСТР = СтрШаблон(ТекстНСТР, Объект.СуммаДокумента, Объект.РасшифровкаПлатежа.Итог("СуммаПлатежа"));
		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗаписьюЗавершение", ЭтотОбъект, Новый Структура("ПараметрыЗаписи", ПараметрыЗаписи)),
			ТекстНСТР, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписьюЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ОтветПередЗаписью = Истина;
		Объект.СуммаДокумента = Объект.РасшифровкаПлатежа.Итог("СуммаПлатежа");
		Записать(ДополнительныеПараметры.ПараметрыЗаписи);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если флВопросЗакрытиеФормы Тогда
		Отказ = Истина;
		Оповещ = Новый ОписаниеОповещения("ПередЗакрытиемВопрос", ЭтотОбъект);
		ПоказатьВопрос(Оповещ, "При проверке корректности заполнения документа возникли предупреждения!
			|Продолжить закрытие формы?", РежимДиалогаВопрос.ОКОтмена);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	УстановитьКурсДокумента();
	
	Для Каждого СтрокаПлатеж Из Объект.РасшифровкаПлатежа Цикл
		ПриИзмененииВалютыВзаиморасчетов(Ложь);
	КонецЦикла;
	СтрокаПлатеж = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	УстановитьФокус();
	
	РазнесениеПоЗаказамПред = РазнесениеПоЗаказам;
	РазнесениеПоЗаказам = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(Объект.Организация,
		"РазнесениеПлатежейПоЗаказам");
	Если РазнесениеПоЗаказам <> РазнесениеПоЗаказамПред Тогда
		Если НЕ РазнесениеПоЗаказам Тогда
			Объект.Заказы.Очистить();
		КонецЕсли;
	КонецЕсли;
	
	мВалютаРегламентированногоУчета = уатОбщегоНазначенияТиповые.ВалютаРегламентированногоУчета(Объект.Организация);
	УстановитьКурсДокумента();
	ОбновитьКурсКратностьВТЧ();
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура КассаПриИзменении(Элемент)
	
	ВалютаДенежныхСредствКассы = уатОбщегоНазначенияТиповыеСервер.ПолучитьЗначениеРеквизита(Объект.Касса, "ВалютаДенежныхСредств");
	СтараяВалюта = Объект.ВалютаДокумента;
	уатОбщегоНазначенияТиповые_проф.ПриИзмененииЗначенияКассыБанковскогоСчета(Объект.ВалютаДокумента, 
		КурсДокумента, КратностьДокумента, Объект.Дата, Объект.СуммаДокумента, ВалютаДенежныхСредствКассы,
		уатОбщегоНазначенияТиповыеКлиент.ДопПараметрыКурсаВалюты(Объект));
		
	ДопПараметрыКурсаВалютыДокумента = уатОбщегоНазначенияТиповыеКлиент.ДопПараметрыКурсаВалюты(Объект);
	
	Для Каждого Строка Из Объект.РасшифровкаПлатежа Цикл
		ВалютаВзаиморасчетов = уатОбщегоНазначенияТиповыеСервер.ПолучитьЗначениеРеквизита(Строка.ДоговорКонтрагента, "ВалютаВзаиморасчетов");
		
		Если ЗначениеЗаполнено(Строка.ВалютаВзаиморасчетов) Тогда
			ВалютаВзаиморасчетов = Строка.ВалютаВзаиморасчетов;
		Иначе
			ВалютаВзаиморасчетов = уатОбщегоНазначенияТиповыеСервер.ПолучитьЗначениеРеквизита(СтрокаПлатеж.ДоговорКонтрагента, "ВалютаВзаиморасчетов");
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ВалютаВзаиморасчетов) Тогда
			ВалютаВзаиморасчетов = СтараяВалюта;
		КонецЕсли;
				
		Если Объект.ВалютаДокумента <> СтараяВалюта Тогда
			ДатаКурса = ?(ЗначениеЗаполнено(Строка.ДатаКурса), Строка.ДатаКурса, Объект.Дата);
			Строка.СуммаПлатежа = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(Строка.СуммаПлатежа,
				СтараяВалюта, Объект.ВалютаДокумента, ДатаКурса, ДатаКурса,,,,
				ДопПараметрыКурсаВалютыДокумента);
		КонецЕсли;
		
		ПересчитатьСуммуНДС(Строка);
	КонецЦикла;
	
	УстановитьФокус();
	УстановитьВидимость();
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		Объект.Организация = уатОбщегоНазначенияТиповыеСервер.ПолучитьЗначениеРеквизита(Объект.Касса, "Владелец");
	КонецЕсли;
	
	Объект.СуммаДокумента = Объект.РасшифровкаПлатежа.Итог("СуммаПлатежа");
	РассчитатьИтоги();
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаДокументаПриИзменении(Элемент)
	
	Если ИнвертироватьСуммы Тогда
		РассчитатьСуммуПлатежа();
	Иначе
		Если Объект.РасшифровкаПлатежа.Количество()=1 Тогда
			СтрокаПлатеж.СуммаПлатежа = Объект.СуммаДокумента;
			РассчитатьСуммуВзаиморасчетовПоСуммеПлатежа(СтрокаПлатеж);
			ПересчитатьСуммуНДС(СтрокаПлатеж);
		КонецЕсли;
	КонецЕсли;
	
	ОтобразитьТекстПредупрежденияЗаказы();
	
КонецПроцедуры

&НаКлиенте
Процедура СпособРедактированияПриИзменении(Элемент)
	
	Если СпособРедактирования = 0 И Объект.РасшифровкаПлатежа.Количество() > 1 Тогда
		ТекстНСТР = НСтр("en='All lines of payment decryption except the first will be deleted. "
			"Do you want to continue?';ru='Все строки расшифровки платежа, кроме первой, будут удалены. "
			"Продолжить?'");
		
		ПоказатьВопрос(Новый ОписаниеОповещения("СпособРедактированияПриИзмененииЗавершение", ЭтотОбъект),
			ТекстНСТР, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да,);
		Возврат;
	Иначе
		Элементы.РасшифровкаПлатежа.ТекущаяСтрока = Объект.РасшифровкаПлатежа[0].ПолучитьИдентификатор();
		СтрокаПлатеж = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	КонецЕсли;
	
	СпособРедактированияПриИзмененииФрагмент();
КонецПроцедуры

&НаКлиенте
Процедура СпособРедактированияПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Ответ = РезультатВопроса;
    
    Если Ответ <> КодВозвратаДиалога.Да Тогда
        СпособРедактирования = 1;
        Возврат;
    КонецЕсли;
    
    Пока Объект.РасшифровкаПлатежа.Количество() > 1 Цикл
        СтрокаУдаления = Объект.РасшифровкаПлатежа[1];
        Объект.РасшифровкаПлатежа.Удалить(СтрокаУдаления);
    КонецЦикла;
    
    Элементы.РасшифровкаПлатежа.ТекущаяСтрока = Объект.РасшифровкаПлатежа[0].ПолучитьИдентификатор();
    СтрокаПлатеж = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	
	//СтрокаПлатеж.СуммаПлатежа = Объект.СуммаДокумента;
    
    ПересчитатьСуммуНДС(СтрокаПлатеж);
	Объект.СуммаДокумента = Объект.РасшифровкаПлатежа.Итог("СуммаПлатежа");
        
    СпособРедактированияПриИзмененииФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура СпособРедактированияПриИзмененииФрагмент()
    
	УстановитьОграничениеТипаСделка();
	УстановитьВидимость();
    РассчитатьИтоги();

КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	// проставим основной договор контрагента
	ПриИзмененииКонтрагента();
	УстановитьФокус();
	ПриИзмененииДоговора();
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаСуммаВзаиморасчетов1ПриИзменении(Элемент)
	РассчитатьСуммуПлатежаПоСуммеВзаиморасчетов(СтрокаПлатеж);
	ПересчитатьСуммуНДС(СтрокаПлатеж);
	Объект.СуммаДокумента = Объект.РасшифровкаПлатежа.Итог("СуммаПлатежа");
	РассчитатьИтоги();
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаКурсВзаиморасчетов1Нажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОбработатьИзмененияПоКнопкеЦеныИВалюты(Неопределено, СтрокаПлатеж.ВалютаВзаиморасчетов);
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормы_РасшифровкаПлатежа

&НаКлиенте
Процедура РасшифровкаПлатежаДоговорКонтрагентаПриИзменении(Элемент)
	
	ПриИзмененииДоговора();
	
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаДоговорКонтрагентаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Контрагент) Тогда 
		СтандартнаяОбработка = Ложь;
		
		Если СпособРедактирования = 0 Тогда 
			ПолеДанных = "Элементы.РасшифровкаПлатежа.ТекущиеДанные.ДоговорКонтрагента";
		Иначе 
			ТекСтрока = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
			Если Не ТекСтрока = Неопределено Тогда 
				ИндексСтроки = Объект.РасшифровкаПлатежа.НайтиПоИдентификатору(ТекСтрока.ПолучитьИдентификатор()).НомерСтроки-1;
				ПолеДанных = "Объект.РасшифровкаПлатежа["+Формат(ИндексСтроки,"ЧГ=0")+"].ДоговорКонтрагента";
			Иначе 
				ПолеДанных = "Объект.РасшифровкаПлатежа";
			КонецЕсли;
		КонецЕсли;
				
		ТекстНСТР = НСтр("en='Select a counterparty.';ru='Необходимо выбрать контрагента.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР,, ПолеДанных);
				
		Возврат;
	КонецЕсли;
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.уатВидыОперацийПКО.ПрочиеРасчетыСКонтрагентами") Тогда
		мВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.Прочее");
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.уатВидыОперацийПКО.ОплатаПокупателя") Тогда
		мВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПокупателем");
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.уатВидыОперацийПКО.ВозвратОтПоставщика") Тогда
		мВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком");
	КонецЕсли;
	
	уатОбщегоНазначенияТиповыеКлиент.уатНачалоВыбораЗначенияДоговораКонтрагента(Объект, ЭтотОбъект, Элемент, Объект.Контрагент, 
		Элементы.РасшифровкаПлатежа.ТекущиеДанные.ДоговорКонтрагента, мВидДоговора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорКонтрагентаСоздание(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВидДоговораДоступныеЗначения = Новый Массив;
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.уатВидыОперацийПКО.ПрочиеРасчетыСКонтрагентами") Тогда
		мВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.Прочее");
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.уатВидыОперацийПКО.ОплатаПокупателя") Тогда
		мВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПокупателем");
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.уатВидыОперацийПКО.ВозвратОтПоставщика") Тогда
		мВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком");
	КонецЕсли;
	ВидДоговораДоступныеЗначения.Добавить(мВидДоговора);
	
	ПараметрыФормы = Новый Структура();  
	ПараметрыФормы.Вставить("Владелец", Объект.Контрагент);
	ПараметрыФормы.Вставить("ВидДоговораДоступныеЗначения", ВидДоговораДоступныеЗначения);
	ОткрытьФорму("Справочник.ДоговорыКонтрагентов.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаСделкаПриИзменении(Элемент)
	
	СтрокаПлатеж.ДатаКурса = уатОбщегоНазначенияТиповые.ПолучитьДатуКурсаРасшифровкиПлатежа(
		Объект.Дата, СтрокаПлатеж.ДоговорКонтрагента, СтрокаПлатеж.Сделка);
		
	СтруктураКурсаВзаиморасчетов = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(
		СтрокаПлатеж.ВалютаВзаиморасчетов, СтрокаПлатеж.ДатаКурса,
		уатОбщегоНазначенияТиповыеКлиент.ДопПараметрыКурсаВалюты(Объект,, СтрокаПлатеж.ДатаКурса));
	СтрокаПлатеж.КурсВзаиморасчетов      = СтруктураКурсаВзаиморасчетов.Курс;
	СтрокаПлатеж.КратностьВзаиморасчетов = СтруктураКурсаВзаиморасчетов.Кратность;
	
	Если НЕ ЗначениеЗаполнено(СтрокаПлатеж.Сделка)
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.уатВидыОперацийПКО.ВозвратОтПоставщика") Тогда
		Возврат;
	КонецЕсли;
	
	Если МноговалютныйУчет И ТипЗнч(СтрокаПлатеж.Сделка) = Тип("ДокументСсылка.уатРеализацияУслуг")
		И ЗначениеЗаполнено(уатОбщегоНазначенияТиповыеСервер.ПолучитьЗначениеРеквизита(СтрокаПлатеж.Сделка, "ВалютаВзаиморасчетов")) Тогда
		
		ВалютаВзаиморасчетов = уатОбщегоНазначенияТиповыеСервер.ПолучитьЗначениеРеквизита(СтрокаПлатеж.Сделка, "ВалютаВзаиморасчетов");
		СуммаВзаиморасчетов  = уатОбщегоНазначенияТиповыеСервер.ПолучитьЗначениеРеквизита(СтрокаПлатеж.Сделка, "СуммаВзаиморасчетов");
	ИначеЕсли ТипЗнч(СтрокаПлатеж.Сделка) = Тип("ДокументСсылка.уатЗаказГрузоотправителя") Тогда
		ЗаполнитьСуммуОплатыПоЗаказу(СтрокаПлатеж.ДоговорКонтрагента, СтрокаПлатеж.Сделка, СуммаВзаиморасчетов, ВалютаВзаиморасчетов);	
	Иначе
		ВалютаВзаиморасчетов = уатОбщегоНазначенияТиповыеСервер.ПолучитьЗначениеРеквизита(СтрокаПлатеж.Сделка, "ВалютаДокумента");
		СуммаВзаиморасчетов  = уатОбщегоНазначенияТиповыеСервер.ПолучитьЗначениеРеквизита(СтрокаПлатеж.Сделка, "СуммаДокумента");
	КонецЕсли;
		
	СтрокаПлатеж.ВалютаВзаиморасчетов = ВалютаВзаиморасчетов;
	ПриИзмененииВалютыВзаиморасчетов();
	
	СтрокаПлатеж.СуммаВзаиморасчетов = СуммаВзаиморасчетов;
	РассчитатьСуммуПлатежаПоСуммеВзаиморасчетов(СтрокаПлатеж);
	ПересчитатьСуммуНДС(СтрокаПлатеж);
	Объект.СуммаДокумента = Объект.РасшифровкаПлатежа.Итог("СуммаПлатежа");
	
	ОтобразитьТЧЗаказыПоСтрокеРасшифровки(Истина);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСуммуОплатыПоЗаказу(ДоговорКонтрагента, ЗаказНаТС, СуммаВзаиморасчетов, ВалютаВзаиморасчетов)
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	уатВзаиморасчетыСКонтрагентамиОстатки.Валюта КАК Валюта,
	|	СУММА(уатВзаиморасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток) КАК СуммаВзаиморасчетовОстаток
	|ИЗ
	|	РегистрНакопления.уатВзаиморасчетыСКонтрагентами.Остатки(
	|			,
	|			ДоговорКонтрагента = &ДоговорКонтрагента
	|				И Сделка = &ЗаказНаТС) КАК уатВзаиморасчетыСКонтрагентамиОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	уатВзаиморасчетыСКонтрагентамиОстатки.Валюта");
	Запрос.УстановитьПараметр("ДоговорКонтрагента", ДоговорКонтрагента);
	Запрос.УстановитьПараметр("ЗаказНаТС", ЗаказНаТС);
	тблДолг = Запрос.Выполнить().Выгрузить();
	Если тблДолг.Количество() = 0 Тогда
		Возврат;
	ИначеЕсли НЕ ЗначениеЗаполнено(ВалютаВзаиморасчетов) Тогда
		СуммаВзаиморасчетов = тблДолг[0].СуммаВзаиморасчетовОстаток;
		ВалютаВзаиморасчетов = тблДолг[0].Валюта;
	Иначе
		СтрокаПоиск = тблДолг.Найти(ВалютаВзаиморасчетов, "Валюта");
		Если СтрокаПоиск = Неопределено Тогда
			СуммаВзаиморасчетов = тблДолг[0].СуммаВзаиморасчетовОстаток;
			ВалютаВзаиморасчетов = тблДолг[0].Валюта;
		Иначе
			СуммаВзаиморасчетов = СтрокаПоиск.СуммаВзаиморасчетовОстаток;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаСделкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	НачалоВыбораСделки(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаСтавкаНДСПриИзменении(Элемент)
	ПересчитатьСуммуНДС(СтрокаПлатеж);
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаСуммаПлатежаПриИзменении(Элемент)
	
	РассчитатьСуммуВзаиморасчетовПоСуммеПлатежа(СтрокаПлатеж);
	ПересчитатьСуммуНДС(СтрокаПлатеж);
	Объект.СуммаДокумента = Объект.РасшифровкаПлатежа.Итог("СуммаПлатежа");
		
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле = Элементы.РасшифровкаПлатежаКурсВзаиморасчетов Тогда
		СтандартнаяОбработка = Ложь;
		ОбработатьИзмененияПоКнопкеЦеныИВалюты(Неопределено, СтрокаПлатеж.ВалютаВзаиморасчетов);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаПриАктивизацииСтроки(Элемент)
	СтрокаПлатеж = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	ОтобразитьТЧЗаказыПоСтрокеРасшифровки();
	
	ВалютаВзаиморасчетовСтарая    = СтрокаПлатеж.ВалютаВзаиморасчетов;
	КурсВзаиморасчетовСтарая      = СтрокаПлатеж.КурсВзаиморасчетов;
	КратностьВзаиморасчетовСтарая = СтрокаПлатеж.КратностьВзаиморасчетов;
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаПередУдалением(Элемент, Отказ)
	Если Элемент.ВыделенныеСтроки.Количество() = Объект.РасшифровкаПлатежа.Количество() Тогда
		Отказ = Истина;
		Очистить(Неопределено);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаПриИзменении(Элемент)
	Объект.СуммаДокумента = Объект.РасшифровкаПлатежа.Итог("СуммаПлатежа");
	РассчитатьИтоги();
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаСуммаВзаиморасчетовПриИзменении(Элемент)
	
	РассчитатьСуммуПлатежаПоСуммеВзаиморасчетов(Элементы.РасшифровкаПлатежа.ТекущиеДанные);
	ПересчитатьСуммуНДС(СтрокаПлатеж);
	Объект.СуммаДокумента = Объект.РасшифровкаПлатежа.Итог("СуммаПлатежа");
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаВалютаВзаиморасчетовПриИзменении(Элемент)
	ПриИзмененииВалютыВзаиморасчетов();
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		ТекСтрока = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
		ТекСтрока.СтавкаНДС =
			уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(
			ПользователиКлиентСервер.АвторизованныйПользователь(), "ОсновнаяСтавкаНДС");
			
		Если РазнесениеПоЗаказам Тогда
			ТекСтрока.ID = Новый УникальныйИдентификатор;
		КонецЕсли;
		ТекСтрока.ДатаКурса = Объект.Дата;
	КонецЕсли;
		
	УстановитьОграничениеТипаСделка();
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ОтобразитьТЧЗаказыПоСтрокеРасшифровки(НЕ ОтменаРедактирования);
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаПослеУдаления(Элемент)
	// Нужно удалить все строки заказов, которые были связаны с расшифровкой до удаления, а теперь "висят" сами по себе.
	Сч = Объект.Заказы.Количество() - 1;
	Пока Сч >= 0 Цикл
		СтруктураПоиска = Новый Структура("ID", Объект.Заказы[Сч].ID);
		мсвСтрокиРасшифровкиПоID = Объект.РасшифровкаПлатежа.НайтиСтроки(СтруктураПоиска);
		Если мсвСтрокиРасшифровкиПоID.Количество() = 0 Тогда
			Объект.Заказы.Удалить(Сч);
		КонецЕсли;
		Сч = Сч - 1;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормы_Заказы

&НаКлиенте                                                         
Процедура ЗаказыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если РазнесениеПоЗаказам Тогда
		ТекСтрока = Элементы.Заказы.ТекущиеДанные;
		Если ПустаяСтрока(СтрокаПлатеж.ID) Тогда
			СтрокаПлатеж.ID = Новый УникальныйИдентификатор;
		КонецЕсли;
		ТекСтрока.ID = СтрокаПлатеж.ID;
	КонецЕсли;
	
	//// в новой строке сумма заполняется неразнесенным остатком
	//Если НоваяСтрока Тогда
	//	ОстатокСуммаПлатежа = СтрокаПлатеж.СуммаПлатежа;
	//	ОстатокСуммаВзаиморасчетов = СтрокаПлатеж.СуммаВзаиморасчетов;
	//	мсвСтрокЗаказы = Объект.Заказы.НайтиСтроки(Новый Структура("ID", СтрокаПлатеж.ID));
	//	Для Каждого ТекСтрокаЗаказ Из мсвСтрокЗаказы Цикл
	//		ОстатокСуммаПлатежа = ОстатокСуммаПлатежа - ТекСтрокаЗаказ.СуммаПлатежа;
	//		ОстатокСуммаВзаиморасчетов = ОстатокСуммаВзаиморасчетов - ТекСтрокаЗаказ.СуммаВзаиморасчетов;
	//	КонецЦикла;
	//	ТекСтрока.СуммаПлатежа = ОстатокСуммаПлатежа;
	//	ТекСтрока.СуммаВзаиморасчетов = ОстатокСуммаВзаиморасчетов;
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ОтобразитьТекстПредупрежденияЗаказы();
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыПослеУдаления(Элемент)
	ОтобразитьТекстПредупрежденияЗаказы();
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыСуммаПлатежаПриИзменении(Элемент)
	ТекСтрока = Элементы.Заказы.ТекущиеДанные;
	РассчитатьСуммуВзаиморасчетовПоСуммеПлатежа(ТекСтрока, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыСуммаВзаиморасчетовПриИзменении(Элемент)
	ТекСтрока = Элементы.Заказы.ТекущиеДанные;
	РассчитатьСуммуПлатежаПоСуммеВзаиморасчетов(ТекСтрока, Истина);
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ОперацияОплатаПокупателя(Команда)
	ВидОперацииПриИзменении(ПредопределенноеЗначение("Перечисление.уатВидыОперацийПКО.ОплатаПокупателя"));
КонецПроцедуры

&НаКлиенте
Процедура ОперацияПриходДенежныхСредствПрочее(Команда)
	ВидОперацииПриИзменении(ПредопределенноеЗначение("Перечисление.уатВидыОперацийПКО.ПриходДенежныхСредствПрочее"));
КонецПроцедуры

&НаКлиенте
Процедура ОперацияПрочиеРасчетыСКонтрагентами(Команда)
	ВидОперацииПриИзменении(ПредопределенноеЗначение("Перечисление.уатВидыОперацийПКО.ПрочиеРасчетыСКонтрагентами"));
КонецПроцедуры

&НаКлиенте
Процедура ОперацияВозвратОтПоставщика(Команда)
	ВидОперацииПриИзменении(ПредопределенноеЗначение("Перечисление.уатВидыОперацийПКО.ВозвратОтПоставщика"));
КонецПроцедуры

&НаКлиенте
Процедура ОперацияВозвратОтПодотчетника(Команда)
	ВидОперацииПриИзменении(ПредопределенноеЗначение("Перечисление.уатВидыОперацийПКО.ВозвратОтПодотчетника"));
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(ВидОперацииЗначение)
	Объект.ВидОперации = ВидОперацииЗначение;
	Объект.Контрагент = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
	
	Элементы.ФормаОперацияОплатаПокупателя.Пометка            = (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.уатВидыОперацийПКО.ОплатаПокупателя"));
	Элементы.ФормаОперацияПрочиеРасчетыСКонтрагентами.Пометка = (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.уатВидыОперацийПКО.ПрочиеРасчетыСКонтрагентами"));
	Элементы.ФормаОперацияПриходДенежныхСредствПрочее.Пометка = (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.уатВидыОперацийПКО.ПриходДенежныхСредствПрочее"));
	Элементы.ФормаОперацияВозвратОтПоставщика.Пометка         = (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.уатВидыОперацийПКО.ВозвратОтПоставщика"));
	Элементы.ФормаОперацияВозвратОтПодотчетника.Пометка       = (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.уатВидыОперацийПКО.ВозвратОтПодотчетника"));
	
	Объект.РасшифровкаПлатежа.Очистить();
	СтрокаПлатеж = Объект.РасшифровкаПлатежа.Добавить();
	СтрокаПлатеж.СуммаПлатежа = Объект.СуммаДокумента;
	СтрокаПлатеж.ДатаКурса = Объект.Дата;
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.уатВидыОперацийПКО.ОплатаПокупателя")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.уатВидыОперацийПКО.ПрочиеРасчетыСКонтрагентами")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.уатВидыОперацийПКО.ВозвратОтПоставщика") Тогда
		СтрокаПлатеж.СтавкаНДС =  уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(ПользователиКлиентСервер.АвторизованныйПользователь(), "ОсновнаяСтавкаНДС");
		ПересчитатьСуммуНДС(СтрокаПлатеж);
	КонецЕсли;
	
	СпособРедактирования = 0;
	
	УстановитьФокус();
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ПодборВРасшифровку(Команда)
	ПодборПоЗадолженности(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПодборДоговор(Команда)
	ПодборПоЗадолженности(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПодборПоЗадолженности(флБезРазбиения)
	Если Не ЗначениеЗаполнено(Объект.Контрагент) Тогда
		ТекстНСТР = НСтр("en='You must specify the counterparty'; ru='Необходимо указать контрагента'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР,, "Объект.Контрагент");
		Возврат;
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ДокументСсылка",              Объект.Ссылка);
	СтруктураПараметров.Вставить("КурсДокумента",               КурсДокумента);
	СтруктураПараметров.Вставить("КратностьДокумента",          КратностьДокумента);
	СтруктураПараметров.Вставить("Контрагент",                  Объект.Контрагент);
	СтруктураПараметров.Вставить("БанковскийСчетКасса",         Объект.Касса);
	СтруктураПараметров.Вставить("Организация",                 Объект.Организация);
	СтруктураПараметров.Вставить("ВалютаДокумента",             Объект.ВалютаДокумента);
	СтруктураПараметров.Вставить("ДатаДок",                     Объект.Дата);
	СтруктураПараметров.Вставить("СуммаДляПодбора",             Объект.СуммаДокумента);
	СтруктураПараметров.Вставить("ПлатежПоСуммеВзаиморасчетов", Истина);
	СтруктураПараметров.Вставить("ЕстьПодбор",                  Истина);
	СтруктураПараметров.Вставить("ЗакрыватьПриВыборе",          флБезРазбиения);
	СтруктураПараметров.Вставить("ВидОперацииВозврат",          Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.уатВидыОперацийПКО.ВозвратОтПоставщика"));
	СтруктураПараметров.Вставить("ТипЗадолженности",            ?(СтруктураПараметров.ВидОперацииВозврат, "<0", ">0"));
	
	мсвСтрокРасшифровка = Новый Массив;
	Для Каждого ТекСтрока Из Объект.РасшифровкаПлатежа Цикл
		ТекВедениеВзаиморасчетов = уатОбщегоНазначенияТиповыеСервер.ПолучитьЗначениеРеквизита(ТекСтрока.ДоговорКонтрагента, "ВедениеВзаиморасчетов");
		Если НЕ ЗначениеЗаполнено(ТекСтрока.ДоговорКонтрагента)
			ИЛИ ТекСтрока.СуммаПлатежа = 0
			ИЛИ (ТекВедениеВзаиморасчетов = ПредопределенноеЗначение("Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоНакладным")
			ИЛИ ТекВедениеВзаиморасчетов = ПредопределенноеЗначение("Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам")
			ИЛИ ТекВедениеВзаиморасчетов = ПредопределенноеЗначение("Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказамНаТС"))
			И НЕ ЗначениеЗаполнено(ТекСтрока.Сделка) Тогда
			Продолжить;
		КонецЕсли;
		
		НовСтрока = Новый Структура("ДоговорКонтрагента, КурсВзаиморасчетов, КратностьВзаиморасчетов, СуммаВзаиморасчетов, СуммаПлатежа, Сделка, СтавкаНДС, СуммаНДС");
		ЗаполнитьЗначенияСвойств(НовСтрока, ТекСтрока);
		НовСтрока.Вставить("Валюта", ТекСтрока.ВалютаВзаиморасчетов);
		мсвСтрокРасшифровка.Добавить(НовСтрока);
	КонецЦикла;
	СтруктураПараметров.Вставить("РасшифровкаПлатежа", мсвСтрокРасшифровка);
	
	мсвСтрокЗаказы = Новый Массив;
	Для Каждого ТекСтрокаЗаказ Из Объект.Заказы Цикл
		мсвТекСтрока = Объект.РасшифровкаПлатежа.НайтиСтроки(Новый Структура("ID", ТекСтрокаЗаказ.ID));
		Если мсвТекСтрока.Количество() > 0 Тогда
			НовСтрока = Новый Структура("ЗаказНаТС, СуммаПлатежа, СуммаВзаиморасчетов");
			ЗаполнитьЗначенияСвойств(НовСтрока, ТекСтрокаЗаказ);
			НовСтрока.Вставить("ДоговорКонтрагента", мсвТекСтрока[0].ДоговорКонтрагента);
			НовСтрока.Вставить("Сделка", мсвТекСтрока[0].Сделка);
			НовСтрока.Вставить("Валюта", мсвТекСтрока[0].ВалютаВзаиморасчетов);
			мсвСтрокЗаказы.Добавить(НовСтрока);
		КонецЕсли;
	КонецЦикла;
	СтруктураПараметров.Вставить("Заказы", мсвСтрокЗаказы);
	
	ОповещОЗакрытии = Новый ОписаниеОповещения("ПодборПоЗадолженностиЗавершение", ЭтотОбъект);
	ОткрытьФорму("Обработка.уатПодборПараметровРасшифровкиПлатежа.Форма.ФормаПодбораЗадолженностей", СтруктураПараметров, ЭтотОбъект,,,, ОповещОЗакрытии);
КонецПроцедуры

&НаКлиенте
Процедура ПодборПоЗадолженностиЗавершение(Результат, ДопПараметры) Экспорт
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Объект.РасшифровкаПлатежа.Очистить();
	НДСПоУмолчанию = уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(
		ПользователиКлиентСервер.АвторизованныйПользователь(), "ОсновнаяСтавкаНДС");
		
	Для Каждого СтруктураСтроки Из Результат.РасшифровкаПлатежа Цикл
		СтрокаРасшифровка                         = Объект.РасшифровкаПлатежа.Добавить();
		СтрокаРасшифровка.ДоговорКонтрагента      = СтруктураСтроки.ДоговорКонтрагента;
		СтрокаРасшифровка.Сделка                  = СтруктураСтроки.Сделка;
		СтрокаРасшифровка.СуммаПлатежа            = СтруктураСтроки.СуммаПлатежа;
		СтрокаРасшифровка.СуммаВзаиморасчетов     = СтруктураСтроки.СуммаВзаиморасчетов;
		СтрокаРасшифровка.ВалютаВзаиморасчетов    = СтруктураСтроки.ВалютаВзаиморасчетов;
		СтрокаРасшифровка.КурсВзаиморасчетов      = СтруктураСтроки.КурсВзаиморасчетов;
		СтрокаРасшифровка.КратностьВзаиморасчетов = СтруктураСтроки.КратностьВзаиморасчетов;
		СтрокаРасшифровка.ДатаКурса = уатОбщегоНазначенияТиповые.ПолучитьДатуКурсаРасшифровкиПлатежа(
			Объект.Дата, СтрокаРасшифровка.ДоговорКонтрагента, СтрокаРасшифровка.Сделка);
		СтрокаРасшифровка.СтавкаНДС               = НДСПоУмолчанию;
		ПересчитатьСуммуНДС(СтрокаРасшифровка);
		
		Если РазнесениеПоЗаказам Тогда
			СтрокаРасшифровка.ID = Новый УникальныйИдентификатор;
			Для Каждого СтруктураСтрокиЗаказ Из Результат.ЗаказыНаТС Цикл
				Если СтруктураСтрокиЗаказ.ДоговорКонтрагента = СтруктураСтроки.ДоговорКонтрагента
					И СтруктураСтрокиЗаказ.Сделка = СтруктураСтроки.Сделка
					И СтруктураСтрокиЗаказ.ВалютаВзаиморасчетов = СтруктураСтроки.ВалютаВзаиморасчетов Тогда
					СтрокаЗаказ                     = Объект.Заказы.Добавить();
					СтрокаЗаказ.ID                  = СтрокаРасшифровка.ID;
					СтрокаЗаказ.ЗаказНаТС           = СтруктураСтрокиЗаказ.ЗаказНаТС;
					СтрокаЗаказ.СуммаПлатежа        = СтруктураСтрокиЗаказ.СуммаПлатежа;
					СтрокаЗаказ.СуммаВзаиморасчетов = СтруктураСтрокиЗаказ.СуммаВзаиморасчетов;
				КонецЕсли;	
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Если Объект.РасшифровкаПлатежа.Количество() = 0 Тогда
		СтрокаПлатеж = Объект.РасшифровкаПлатежа.Добавить();
	Иначе
		СтрокаПлатеж = Объект.РасшифровкаПлатежа[0];
	КонецЕсли;
	
	Если Объект.РасшифровкаПлатежа.Количество() > 1 Тогда
		СпособРедактирования = 1;
	Иначе
		СпособРедактирования = 0;
	КонецЕсли;
	
	Объект.СуммаДокумента = Объект.РасшифровкаПлатежа.Итог("СуммаПлатежа");
	РассчитатьИтоги();
	
	УстановитьФокус();
	//СтрокаПлатеж = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	
	УстановитьВидимость();
	УстановитьОграничениеТипаСделка();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСтавкуНДС(Команда)
	Если Объект.РасшифровкаПлатежа.Количество() = 0 Тогда
		ТекстПредупреждения = НСтр("ru = 'В табличной части ""Расшифровка платежа"" не введено ни одной строки.';
									|en = 'No lines entered in the Item list.'");
		ПоказатьПредупреждение(, ТекстПредупреждения);
		Возврат;
	КонецЕсли;
	СписокСтавокНДС = ЗаполнитьСписокЗначенийСтавкиНДСНаСервере();
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьСтавкуНДСЗавершение", ЭтотОбъект);
	СписокСтавокНДС.ПоказатьВыборЭлемента(ОписаниеОповещения, "Ставки НДС");
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	Если Объект.РасшифровкаПлатежа.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекстНСТР = НСтр("en='Clean provided services?';ru='Очистить расшифровку платежа?'");
	ПоказатьВопрос(Новый ОписаниеОповещения("ОчиститьТЧ", ЭтотОбъект),
		ТекстНСТР, РежимДиалогаВопрос.ОКОтмена);
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// Рассчитывает новый курс документа при смене даты
//
&НаКлиенте
Процедура УстановитьКурсДокумента()
	
	СтруктураКурсаВалютаДокумента = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(Объект.ВалютаДокумента,
		Объект.Дата, уатОбщегоНазначенияТиповыеКлиент.ДопПараметрыКурсаВалюты(Объект));
		
	КурсДокумента        = СтруктураКурсаВалютаДокумента.Курс;
	КратностьДокумента   = СтруктураКурсаВалютаДокумента.Кратность;
	
КонецПроцедуры // УстановитьКурсДокумента()

// Проверяет установленные курсы валют документа перед пересчетом сумм
// Нулевые курсы устанавливаются в 1
//
&НаКлиенте
Процедура ПроверкаКурсовВалют(СтрокаПлатеж) 
	
	КурсДокумента      = ?(КурсДокумента=0,1, КурсДокумента);
	КратностьДокумента = ?(КратностьДокумента=0,1, КратностьДокумента);
	
	Если Не СтрокаПлатеж = Неопределено Тогда
		СтрокаПлатеж.КурсВзаиморасчетов      = ?(СтрокаПлатеж.КурсВзаиморасчетов=0,1,СтрокаПлатеж.КурсВзаиморасчетов);
		СтрокаПлатеж.КратностьВзаиморасчетов = ?(СтрокаПлатеж.КратностьВзаиморасчетов=0,1,СтрокаПлатеж.КратностьВзаиморасчетов);
	КонецЕсли;
	
КонецПроцедуры // ПроверкаКурсовВалют()

// Возвращает фокус на строку ТЧ "Расшифровка платежа" при его потере в режиме редактирования
// одиночного платежа.
&НаКлиенте
Процедура УстановитьФокус()
	
	Если Элементы.РасшифровкаПлатежа.ТекущаяСтрока = Неопределено Тогда
		Элементы.РасшифровкаПлатежа.ТекущаяСтрока = СтрокаПлатеж.ПолучитьИдентификатор();
	КонецЕсли;
	Если СпособРедактирования = 0 Тогда 
		Элементы.РасшифровкаПлатежа.ТекущаяСтрока = СтрокаПлатеж.ПолучитьИдентификатор();
	КонецЕсли;
	
КонецПроцедуры // УстановитьФокус()

// Пересчитывает сумму НДС
//
// Параметры:
//  Нет.
//
&НаКлиенте
Процедура ПересчитатьСуммуНДС(ТекСтрока) 
	
	ЗначениеСтавкиНДС = уатОбщегоНазначенияТиповые.уатПолучитьСтавкуНДС(ТекСтрока.СтавкаНДС);
	
	Если МноговалютныйУчет
		И (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.уатВидыОперацийПКО.ОплатаПокупателя")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.уатВидыОперацийПКО.ВозвратОтПоставщика")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.уатВидыОперацийПКО.ПрочиеРасчетыСКонтрагентами")) Тогда
		
		ТекСтрока.СуммаНДС = ТекСтрока.СуммаВзаиморасчетов * ЗначениеСтавкиНДС / (100 + ЗначениеСтавкиНДС);
	Иначе
		ТекСтрока.СуммаНДС = ТекСтрока.СуммаПлатежа * ЗначениеСтавкиНДС / (100 + ЗначениеСтавкиНДС);
	КонецЕсли;
	
КонецПроцедуры // ПересчитатьСуммуНДС()

// Процедура устанавливает видимость для тех колонок в табличной части 
// "Товары", видимость которых определяется реквизитами документа.
//
// Параметры:
//  Нет.
//
&НаКлиенте
Процедура УстановитьВидимость()
	
	Элементы.РасшифровкаПлатежаСтавкаНДС1.Доступность = Истина;
	Элементы.СпособРедактирования.Видимость           = Ложь;
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.уатВидыОперацийПКО.ОплатаПокупателя")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.уатВидыОперацийПКО.ПрочиеРасчетыСКонтрагентами")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.уатВидыОперацийПКО.ВозвратОтПоставщика") Тогда
		
		Элементы.ГруппаВидыОпераций.ТекущаяСтраница = Элементы.ГруппаВидыОпераций.ПодчиненныеЭлементы.ГруппаПКО;
		Если Булево(СпособРедактирования) Тогда
			Элементы.ГруппаПлатежей.ТекущаяСтраница = Элементы.ГруппаПлатежей.ПодчиненныеЭлементы.ГруппаПоНесколькимСделкам;
			Элементы.РасшифровкаПлатежа.Высота = 0;
			Элементы.РасшифровкаПлатежа.РастягиватьПоВертикали = Истина;
		Иначе
			Элементы.ГруппаПлатежей.ТекущаяСтраница = Элементы.ГруппаПлатежей.ПодчиненныеЭлементы.ГруппаПоОднойСделке;
			Элементы.РасшифровкаПлатежа.Высота = 1;
			Элементы.РасшифровкаПлатежа.РастягиватьПоВертикали = Ложь;
		КонецЕсли;
		
		Элементы.ГруппаРасшифровкаПлатежа.Заголовок = НСтр("en='Decoding of payment';ru='Расшифровка платежа'");
		Элементы.РасшифровкаПлатежаСделка.Видимость = Истина;
		Элементы.РасшифровкаПлатежаСделка1.Доступность = Истина;
		Элементы.РасшифровкаПлатежаСделка1.Видимость   = Истина;
		Элементы.ГруппаДоговор.Видимость = Истина;
		Элементы.РасшифровкаПлатежаДоговорКонтрагента.Видимость = Истина;
		Элементы.ГруппаСуммаВзаиморасчетов.Видимость = Истина;
		Элементы.РасшифровкаПлатежаГруппаСумма.Видимость = Истина;
		Элементы.ДекорацияСтавкаНДС1.Ширина = 10;
				
		Элементы.СпособРедактирования.Видимость = Истина;
		
		Элементы.РасшифровкаПлатежаСделка1.Доступность =
			(Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.уатВидыОперацийПКО.ОплатаПокупателя")
			ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.уатВидыОперацийПКО.ВозвратОтПоставщика"));
		Элементы.РасшифровкаПлатежаСделка.Доступность  = Элементы.РасшифровкаПлатежаСделка1.Доступность;
		Элементы.Контрагент.Видимость = Истина;
		Элементы.ПодотчетноеЛицо.Видимость = Ложь;
		
		Элементы.РасшифровкаПлатежаПодборВРасшифровку.Видимость = Истина;
		
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.уатВидыОперацийПКО.ВозвратОтПодотчетника") Тогда
		Элементы.ГруппаВидыОпераций.ТекущаяСтраница = Элементы.ГруппаВидыОпераций.ПодчиненныеЭлементы.ГруппаПКО;
		Если Булево(СпособРедактирования) Тогда
			Элементы.ГруппаПлатежей.ТекущаяСтраница = Элементы.ГруппаПлатежей.ПодчиненныеЭлементы.ГруппаПоНесколькимСделкам;
			Элементы.РасшифровкаПлатежа.Высота = 0;
			Элементы.РасшифровкаПлатежа.РастягиватьПоВертикали = Истина;
		Иначе
			Элементы.ГруппаПлатежей.ТекущаяСтраница = Элементы.ГруппаПлатежей.ПодчиненныеЭлементы.ГруппаПоОднойСделке;
			Элементы.РасшифровкаПлатежа.Высота = 1;
			Элементы.РасшифровкаПлатежа.РастягиватьПоВертикали = Ложь;
		КонецЕсли;
		Элементы.ГруппаРасшифровкаПлатежа.Заголовок = НСтр("en='Decryption of return';ru='Расшифровка возврата'");
		Элементы.РасшифровкаПлатежаСделка.Видимость = Ложь;
		Элементы.РасшифровкаПлатежаСделка1.Видимость = Ложь;
		Элементы.ГруппаДоговор.Видимость = Ложь;
		Элементы.РасшифровкаПлатежаДоговорКонтрагента.Видимость = Ложь;
		Элементы.ГруппаСуммаВзаиморасчетов.Видимость = Ложь;
		Элементы.РасшифровкаПлатежаГруппаСумма.Видимость = Ложь;
		Элементы.ДекорацияСтавкаНДС1.Ширина = 0;
		
		Элементы.СпособРедактирования.Видимость = Истина;
		Элементы.Контрагент.Видимость = Ложь;
		Элементы.ПодотчетноеЛицо.Видимость = Истина;
		
		Элементы.РасшифровкаПлатежаПодборВРасшифровку.Видимость = Ложь;
		
	Иначе
		Элементы.ГруппаВидыОпераций.ТекущаяСтраница = Элементы.ГруппаВидыОпераций.ПодчиненныеЭлементы.ГруппаПрочее;
		Элементы.СпособРедактирования.Видимость = Ложь;
		Элементы.Контрагент.Видимость = Истина;
		Элементы.ПодотчетноеЛицо.Видимость = Ложь;
		
		Элементы.РасшифровкаПлатежаПодборВРасшифровку.Видимость = Истина;
		
		Элементы.ГруппаСуммаВзаиморасчетов.Видимость = Ложь;
		Элементы.РасшифровкаПлатежаГруппаСумма.Видимость = Ложь;
		
	КонецЕсли;
	
	Если СпособРедактирования = 0 Тогда
		Платеж = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
		Если Платеж <> Неопределено Тогда
			ВедениеВзаиморасчетов = уатОбщегоНазначенияТиповыеСервер.ПолучитьЗначениеРеквизита(Платеж.ДоговорКонтрагента, "ВедениеВзаиморасчетов");
			Если (ВедениеВзаиморасчетов = ПредопределенноеЗначение("Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам")
				ИЛИ ВедениеВзаиморасчетов = ПредопределенноеЗначение("Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоНакладным")
				ИЛИ ВедениеВзаиморасчетов = ПредопределенноеЗначение("Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказамНаТС")) Тогда
				
				Элементы.РасшифровкаПлатежаСделка1.АвтоОтметкаНезаполненного = Истина;
			Иначе
				Элементы.РасшифровкаПлатежаСделка1.ОтметкаНезаполненного = Ложь;
				Элементы.РасшифровкаПлатежаСделка1.АвтоОтметкаНезаполненного = Ложь;
			КонецЕсли;
		Иначе
			Элементы.РасшифровкаПлатежаСделка1.ОтметкаНезаполненного = Ложь;
			Элементы.РасшифровкаПлатежаСделка1.АвтоОтметкаНезаполненного = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	//ВалютаДенежныхСредств = уатОбщегоНазначенияТиповыеСервер.ПолучитьЗначениеРеквизита(Объект.Касса, "ВалютаДенежныхСредств");
	ВалютаДенежныхСредств = Объект.ВалютаДокумента;
	Элементы.РасшифровкаПлатежаСуммаПлатежа.Заголовок = НСтр("en='Sum';ru='Сумма'") + " (" + ВалютаДенежныхСредств + ")";
	//Элементы.РасшифровкаПлатежаСуммаНДС.Заголовок = "Сумма НДС" + " (" + ВалютаДенежныхСредств + ")";
	//Элементы.РасшифровкаПлатежаСуммаНДС1.Заголовок = "Сумма НДС" + " (" + ВалютаДенежныхСредств + ")";
	
	ИнвертироватьСуммы = (СпособРедактирования = 0 И уатОбщегоНазначения_проф.ЕстьРасчетыСКонтрагентами(Объект.ВидОперации));
	
	Элементы.РасшифровкаПлатежаВалютаВзаиморасчетов.ТолькоПросмотр = НЕ МноговалютныйУчет;
	Элементы.РасшифровкаПлатежаВалютаВзаиморасчетов1.ТолькоПросмотр = НЕ МноговалютныйУчет;
	Элементы.ГруппаРаспределениеПоЗаказам.Видимость = РазнесениеПоЗаказам
		И (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.уатВидыОперацийПКО.ОплатаПокупателя")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.уатВидыОперацийПКО.ВозвратОтПоставщика"));
	
КонецПроцедуры // УстановитьВидимость()

// Процедура рассчитывает сумму платежа по сумме взаиморасчетов.
//
&НаКлиенте
Процедура РассчитатьСуммуПлатежа()
	
	ПроверкаКурсовВалют(СтрокаПлатеж);
	
	ВалютаВзаиморасчетов = уатОбщегоНазначенияТиповыеСервер.ПолучитьЗначениеРеквизита(СтрокаПлатеж.ДоговорКонтрагента, "ВалютаВзаиморасчетов");
	
	Если ВалютаВзаиморасчетов <> Объект.ВалютаДокумента Тогда
		СтрокаПлатеж.СуммаПлатежа = 0;
	КонецЕсли;
		
	Если Объект.РасшифровкаПлатежа.Количество()=1 Тогда
		СтрокаПлатеж.СуммаПлатежа = Объект.СуммаДокумента;
	КонецЕсли;
	
	РассчитатьСуммуВзаиморасчетовПоСуммеПлатежа(СтрокаПлатеж);
	ПересчитатьСуммуНДС(СтрокаПлатеж);
		
КонецПроцедуры // РассчитатьСуммуПлатежа()

&НаКлиенте
Процедура РассчитатьИтоги()
	УстановитьКурсДокумента();
	Элементы.РасшифровкаПлатежаСуммаПлатежа.ТекстПодвала = Формат(Объект.СуммаДокумента,"ЧЦ=12; ЧДЦ=2") + " " + Строка(Объект.ВалютаДокумента);
	
	Если МноговалютныйУчет Тогда
		ИтогНДС = 0;
		ДопПараметрыКурсаВалюты = уатОбщегоНазначенияТиповыеКлиент.ДопПараметрыКурсаВалюты(Объект);
					
		Для Каждого ТекСтрока Из Объект.РасшифровкаПлатежа Цикл
			Если ТекСтрока.ВалютаВзаиморасчетов = Объект.ВалютаДокумента Тогда
				ИтогНДС = ИтогНДС + ТекСтрока.СуммаНДС;
			Иначе
				ДатаКурса = ?(ЗначениеЗаполнено(ТекСтрока.ДатаКурса), ТекСтрока.ДатаКурса, Объект.Дата);
				ИтогНДС = ИтогНДС + уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.СуммаНДС,
					ТекСтрока.ВалютаВзаиморасчетов,    Объект.ВалютаДокумента,
					ТекСтрока.КурсВзаиморасчетов,      ДатаКурса,
					ТекСтрока.КратностьВзаиморасчетов, ,,
					уатОбщегоНазначенияТиповыеКлиент.ДопПараметрыКурсаВалюты(Объект,, ДатаКурса));
			КонецЕсли;
		КонецЦикла;
	Иначе
		ИтогНДС = Объект.РасшифровкаПлатежа.Итог("СуммаНДС");
	КонецЕсли;
	Элементы.РасшифровкаПлатежаСуммаНДС.ТекстПодвала = Формат(ИтогНДС, "ЧЦ=12; ЧДЦ=2") + " " + Строка(Объект.ВалютаДокумента);
КонецПроцедуры

// Процедура выполняет необходимые действия при изменении договора взаиморасчетов
// с контрагентом.
//
&НаКлиенте
Процедура ПриИзмененииДоговора()
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		Объект.Организация = уатОбщегоНазначенияТиповыеСервер.ПолучитьЗначениеРеквизита(СтрокаПлатеж.ДоговорКонтрагента, "Организация");
	КонецЕсли;
	
	СтрокаПлатеж.Сделка = Неопределено;
	РасшифровкаПлатежаСделкаПриИзменении(Неопределено);
	
	Если уатОбщегоНазначенияТиповыеСервер.ПолучитьЗначениеРеквизита(СтрокаПлатеж.ДоговорКонтрагента, "ВедениеВзаиморасчетов")
		= ПредопределенноеЗначение("Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом") Тогда
		
		СтрокаПлатеж.ВалютаВзаиморасчетов = уатОбщегоНазначенияТиповыеСервер.ПолучитьЗначениеРеквизита(СтрокаПлатеж.ДоговорКонтрагента, "ВалютаВзаиморасчетов");
		
	КонецЕсли;
	
	ПриИзмененииВалютыВзаиморасчетов();
	
	Если Не ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Объект.Контрагент = уатОбщегоНазначенияТиповыеСервер.ПолучитьЗначениеРеквизита(СтрокаПлатеж.ДоговорКонтрагента, "Владелец");
	КонецЕсли;
	
	ОтобразитьТЧЗаказыПоСтрокеРасшифровки(Истина);
	УстановитьОграничениеТипаСделка();
	УстановитьВидимость();
		
КонецПроцедуры // ПриИзмененииДоговора()

&НаКлиенте
Процедура ПриИзмененииКонтрагента()
	
	ВосстанавливатьРеквизиты = (Объект.РасшифровкаПлатежа.Количество() = 1);
	СтараяСтавкаНДС = СтрокаПлатеж.СтавкаНДС;
	
	Объект.РасшифровкаПлатежа.Очистить();
	СтрокаПлатеж = Объект.РасшифровкаПлатежа.Добавить();
	
	Если Не ЗначениеЗаполнено(Объект.Контрагент) Тогда
		
		СтрокаПлатеж.ДоговорКонтрагента = Неопределено;
		
	Иначе
		
		СписокДоговоров = Новый СписокЗначений;
		Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.уатВидыОперацийПКО.ПрочиеРасчетыСКонтрагентами") Тогда
			СписокДоговоров.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.Прочее"));
		ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.уатВидыОперацийПКО.ОплатаПокупателя") Тогда
			СписокДоговоров.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПокупателем"));
		КонецЕсли;
		
		СтруктураПараметровДляПолученияДоговора = Новый Структура;
		СтруктураПараметровДляПолученияДоговора.Вставить("СписокДопустимыхВидовДоговоров", СписокДоговоров);
		СтруктураПараметровДляПолученияДоговора.Вставить("ВалютаВзаиморасчетовДоговора",Объект.ВалютаДокумента);

		СтрокаПлатеж.ДоговорКонтрагента = уатОбщегоНазначенияТиповыеСервер.уатПолучитьДоговорПоОрганизацииИКонтрагенту(Объект.Организация, 
			Объект.Контрагент, СтруктураПараметровДляПолученияДоговора);
		
	КонецЕсли;
	
	СтрокаПлатеж.СуммаПлатежа = Объект.СуммаДокумента;
	
	Если ВосстанавливатьРеквизиты Тогда
		СтрокаПлатеж.СтавкаНДС = СтараяСтавкаНДС;
		ПересчитатьСуммуНДС(СтрокаПлатеж);
	КонецЕсли;
	
	Если ТипЗнч(Объект.Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
		
		КонтрагентНаименованиеПолное = уатОбщегоНазначенияТиповыеСервер.ПолучитьЗначениеРеквизита(Объект.Контрагент, "НаименованиеПолное");
		КонтрагентНаименование       = уатОбщегоНазначенияТиповыеСервер.ПолучитьЗначениеРеквизита(Объект.Контрагент, "Наименование");
		Объект.ПринятоОт = ?(ПустаяСтрока(КонтрагентНаименованиеПолное), КонтрагентНаименование, КонтрагентНаименованиеПолное);
		
	КонецЕсли;
	
КонецПроцедуры // ПриИзмененииКонтрагента

&НаКлиенте
Процедура ПриИзмененииВалютыВзаиморасчетов(флТолькоИзменение = Истина)
	Если флТолькоИзменение
		И СтрокаПлатеж.ВалютаВзаиморасчетов    = ВалютаВзаиморасчетовСтарая
		И СтрокаПлатеж.КурсВзаиморасчетов      = КурсВзаиморасчетовСтарая
		И СтрокаПлатеж.КратностьВзаиморасчетов = КратностьВзаиморасчетовСтарая Тогда
		Возврат;
	КонецЕсли;
	
	ДатаКурса = ?(ЗначениеЗаполнено(СтрокаПлатеж.ДатаКурса), СтрокаПлатеж.ДатаКурса, Объект.Дата);
	СтруктураКурсаВзаиморасчетов = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(
		СтрокаПлатеж.ВалютаВзаиморасчетов, ДатаКурса,
		уатОбщегоНазначенияТиповыеКлиент.ДопПараметрыКурсаВалюты(Объект));
		
	СтрокаПлатеж.КурсВзаиморасчетов      = СтруктураКурсаВзаиморасчетов.Курс;
	СтрокаПлатеж.КратностьВзаиморасчетов = СтруктураКурсаВзаиморасчетов.Кратность;
	
	СтрокаПлатеж.СуммаВзаиморасчетов = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(
		СтрокаПлатеж.СуммаВзаиморасчетов,
		ВалютаВзаиморасчетовСтарая,    СтрокаПлатеж.ВалютаВзаиморасчетов,
		КурсВзаиморасчетовСтарая,      СтрокаПлатеж.КурсВзаиморасчетов,
		КратностьВзаиморасчетовСтарая, СтрокаПлатеж.КратностьВзаиморасчетов);
		
	РасшифровкаПлатежаСуммаВзаиморасчетов1ПриИзменении(Неопределено);
		
	ВалютаВзаиморасчетовСтарая    = СтрокаПлатеж.ВалютаВзаиморасчетов;
	КурсВзаиморасчетовСтарая      = СтрокаПлатеж.КурсВзаиморасчетов;
	КратностьВзаиморасчетовСтарая = СтрокаПлатеж.КратностьВзаиморасчетов;
КонецПроцедуры

&НаКлиенте
Процедура НачалоВыбораСделки(Элемент, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(СтрокаПлатеж.ДоговорКонтрагента) Тогда 
		СтандартнаяОбработка = Ложь;
		
		Если СпособРедактирования = 0 Тогда 
			ПолеДанных = "Элементы.РасшифровкаПлатежа.ТекущиеДанные.Сделка";
		Иначе 
			ТекСтрока = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
			Если Не ТекСтрока = Неопределено Тогда 
				ИндексСтроки = Объект.РасшифровкаПлатежа.НайтиПоИдентификатору(ТекСтрока.ПолучитьИдентификатор()).НомерСтроки-1;
				ПолеДанных = "Объект.РасшифровкаПлатежа["+Формат(ИндексСтроки,"ЧГ=0")+"].Сделка";
			Иначе 
				ПолеДанных = "Объект.РасшифровкаПлатежа";
			КонецЕсли;
		КонецЕсли;
		
		ТекстНСТР = НСтр("en='You must select the contract of counterparty.';ru='Необходимо выбрать договор контрагента.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР,, ПолеДанных);
		
		Возврат;
	КонецЕсли;
	
	// Тип выбираемого значения зависит от договора.
	ВидДоговораКонтрагента = уатОбщегоНазначенияТиповыеСервер.ПолучитьЗначениеРеквизита(СтрокаПлатеж.ДоговорКонтрагента, "ВидДоговора");
	Если ВидДоговораКонтрагента = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.Прочее") Тогда
		СтандартнаяОбработка = Ложь;
		ТекстНСТР = НСтр("en='Under contracts with  type ""other"", there are no payments on deals!';ru='По договорам с видом ""Прочее"" не ведутся взаиморасчеты по сделкам!'");
		ПоказатьПредупреждение(Неопределено, ТекстНСТР);
		Возврат;
	КонецЕсли;
	
	//СтандартнаяОбработка = Ложь;
	//
	//ФормаВыбора = ПолучитьФорму("Документ.уатСчетНаОплатуПокупателю.ФормаВыбора",, Элемент);
	//ЭлементОтбора                  = ФормаВыбора.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ЭлементОтбора.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("ДоговорКонтрагента");
	//ЭлементОтбора.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
	//ЭлементОтбора.ПравоеЗначение   = СтрокаПлатеж.ДоговорКонтрагента;
	//ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	//ЭлементОтбора.Использование    = Истина;
	//
	//ФормаВыбора.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОграничениеТипаСделка()
	ВедениеВзаиморасчетов = уатОбщегоНазначенияТиповыеСервер.ПолучитьЗначениеРеквизита(СтрокаПлатеж.ДоговорКонтрагента, "ВедениеВзаиморасчетов");
	Если ВедениеВзаиморасчетов = ПредопределенноеЗначение("Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоНакладным") Тогда
		Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.уатВидыОперацийПКО.ВозвратОтПоставщика") Тогда
			Элементы.РасшифровкаПлатежаСделка.ОграничениеТипа  = Новый ОписаниеТипов("ДокументСсылка.уатПоступлениеТоваровУслуг, ДокументСсылка.уатРемонтныйЛист");
			Элементы.РасшифровкаПлатежаСделка1.ОграничениеТипа = Новый ОписаниеТипов("ДокументСсылка.уатПоступлениеТоваровУслуг, ДокументСсылка.уатРемонтныйЛист");
		Иначе
			Элементы.РасшифровкаПлатежаСделка.ОграничениеТипа  = Новый ОписаниеТипов("ДокументСсылка.уатРеализацияУслуг");
			Элементы.РасшифровкаПлатежаСделка1.ОграничениеТипа = Новый ОписаниеТипов("ДокументСсылка.уатРеализацияУслуг");
		КонецЕсли;
		
		мсвПараметрыВыбора = Новый Массив;
		мсвПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.ДоговорКонтрагента", СтрокаПлатеж.ДоговорКонтрагента));
		Элементы.РасшифровкаПлатежаСделка.ПараметрыВыбора = Новый ФиксированныйМассив(мсвПараметрыВыбора);
		Элементы.РасшифровкаПлатежаСделка1.ПараметрыВыбора = Новый ФиксированныйМассив(мсвПараметрыВыбора);
		
		Элементы.РасшифровкаПлатежаСделка.ТолькоПросмотр = Ложь;
		Элементы.РасшифровкаПлатежаСделка1.ТолькоПросмотр = Ложь;
		
	ИначеЕсли ВедениеВзаиморасчетов = ПредопределенноеЗначение("Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам") Тогда
		Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.уатВидыОперацийПКО.ВозвратОтПоставщика") Тогда
			Элементы.РасшифровкаПлатежаСделка.ОграничениеТипа  = Новый ОписаниеТипов("ДокументСсылка.уатСчетНаОплатуПоставщика");
			Элементы.РасшифровкаПлатежаСделка1.ОграничениеТипа = Новый ОписаниеТипов("ДокументСсылка.уатСчетНаОплатуПоставщика");
		Иначе
			Элементы.РасшифровкаПлатежаСделка.ОграничениеТипа  = Новый ОписаниеТипов("ДокументСсылка.уатСчетНаОплатуПокупателю");
			Элементы.РасшифровкаПлатежаСделка1.ОграничениеТипа = Новый ОписаниеТипов("ДокументСсылка.уатСчетНаОплатуПокупателю");
		КонецЕсли;
				
		мсвПараметрыВыбора = Новый Массив;
		мсвПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.ДоговорКонтрагента", СтрокаПлатеж.ДоговорКонтрагента));
		Элементы.РасшифровкаПлатежаСделка.ПараметрыВыбора = Новый ФиксированныйМассив(мсвПараметрыВыбора);
		Элементы.РасшифровкаПлатежаСделка1.ПараметрыВыбора = Новый ФиксированныйМассив(мсвПараметрыВыбора);
		
		Элементы.РасшифровкаПлатежаСделка.ТолькоПросмотр = Ложь;
		Элементы.РасшифровкаПлатежаСделка1.ТолькоПросмотр = Ложь;
		
	ИначеЕсли ВедениеВзаиморасчетов = ПредопределенноеЗначение("Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказамНаТС") Тогда
		Элементы.РасшифровкаПлатежаСделка.ОграничениеТипа = Новый ОписаниеТипов("ДокументСсылка.уатЗаказГрузоотправителя");
		Элементы.РасшифровкаПлатежаСделка1.ОграничениеТипа = Новый ОписаниеТипов("ДокументСсылка.уатЗаказГрузоотправителя");
		
		мсвЗаказыДляОтбора = уатОбщегоНазначения_проф.ПолучитьЗаказыПоДоговору(СтрокаПлатеж.ДоговорКонтрагента, Истина);
		
		мсвПараметрыВыбора = Новый Массив;
		мсвПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", мсвЗаказыДляОтбора));
		Элементы.РасшифровкаПлатежаСделка.ПараметрыВыбора = Новый ФиксированныйМассив(мсвПараметрыВыбора);
		Элементы.РасшифровкаПлатежаСделка1.ПараметрыВыбора = Новый ФиксированныйМассив(мсвПараметрыВыбора);
		
		Элементы.РасшифровкаПлатежаСделка.ТолькоПросмотр = Ложь;
		Элементы.РасшифровкаПлатежаСделка1.ТолькоПросмотр = Ложь;
		
	ИначеЕсли уатОбщегоНазначенияПовтИсп.ВариантПоставкиТакси()
		И ВедениеВзаиморасчетов = ПредопределенноеЗначение("Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоДокументуАрендаТС") Тогда
		
		Элементы.РасшифровкаПлатежаСделка.ОграничениеТипа = Новый ОписаниеТипов("ДокументСсылка.такАрендаТС");
		Элементы.РасшифровкаПлатежаСделка1.ОграничениеТипа = Новый ОписаниеТипов("ДокументСсылка.такАрендаТС");
		
		мсвЗаказыДляОтбора = уатОбщегоНазначения_проф.ПолучитьЗаказыПоДоговору(СтрокаПлатеж.ДоговорКонтрагента, Истина);
		
		мсвПараметрыВыбора = Новый Массив;
		мсвПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", мсвЗаказыДляОтбора));
		Элементы.РасшифровкаПлатежаСделка.ПараметрыВыбора = Новый ФиксированныйМассив(мсвПараметрыВыбора);
		Элементы.РасшифровкаПлатежаСделка1.ПараметрыВыбора = Новый ФиксированныйМассив(мсвПараметрыВыбора);
		
		Элементы.РасшифровкаПлатежаСделка.ТолькоПросмотр = Ложь;
		Элементы.РасшифровкаПлатежаСделка1.ТолькоПросмотр = Ложь;
		
	Иначе
		Элементы.РасшифровкаПлатежаСделка.ОграничениеТипа = Новый ОписаниеТипов("Неопределено");
		Элементы.РасшифровкаПлатежаСделка1.ОграничениеТипа = Новый ОписаниеТипов("Неопределено");
		
		мсвПараметрыВыбора = Новый Массив;
		мсвПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.ДоговорКонтрагента", СтрокаПлатеж.ДоговорКонтрагента));
		Элементы.РасшифровкаПлатежаСделка.ПараметрыВыбора = Новый ФиксированныйМассив(мсвПараметрыВыбора);
		Элементы.РасшифровкаПлатежаСделка1.ПараметрыВыбора = Новый ФиксированныйМассив(мсвПараметрыВыбора);
		
		Элементы.РасшифровкаПлатежаСделка.ТолькоПросмотр = Истина;
		Элементы.РасшифровкаПлатежаСделка1.ТолькоПросмотр = Истина;
		
	КонецЕсли;
КонецПроцедуры

// Процедура выполняет заполнение реквизита Контрагент значением по умолчанию.
//
&НаКлиенте
Процедура ЗаполнитьКонтрагента()
	
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Возврат;
	КонецЕсли;
	СписокЗначений = Новый СписокЗначений;
	ВремКонтрагент = Неопределено;
	
	Если Не ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Объект.Контрагент = ВремКонтрагент;
		
		// проставим основной договор контрагента
		ПриИзмененииКонтрагента();
		ПриИзмененииДоговора();
		УстановитьФокус();
		
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьКонтрагента()

&НаКлиенте
Процедура ПередЗакрытиемВопрос(Результат, ДопПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.ОК Тогда
		флВопросЗакрытиеФормы = Ложь;
		Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуПлатежаПоСуммеВзаиморасчетов(ТекСтрока, флТЧЗаказы = Ложь)
	Если флТЧЗаказы = Истина Тогда
		мсвСтрокиРасшифровки = Объект.РасшифровкаПлатежа.НайтиСтроки(Новый Структура("ID", СтрокаПлатеж.ID));
		Если мсвСтрокиРасшифровки.Количество() = 0 Тогда
			ТекВалютаВзаиморасчетов    = ПредопределенноеЗначение("Справочник.Валюты.ПустаяСсылка");
			ТекКурсВзаиморасчетов      = 1;
			ТекКратностьВзаиморасчетов = 1;
		Иначе
			ТекВалютаВзаиморасчетов    = мсвСтрокиРасшифровки[0].ВалютаВзаиморасчетов;
			ТекКурсВзаиморасчетов      = мсвСтрокиРасшифровки[0].КурсВзаиморасчетов;
			ТекКратностьВзаиморасчетов = мсвСтрокиРасшифровки[0].КратностьВзаиморасчетов;
		КонецЕсли;
	Иначе
		ТекВалютаВзаиморасчетов    = ТекСтрока.ВалютаВзаиморасчетов;
		ТекКурсВзаиморасчетов      = ТекСтрока.КурсВзаиморасчетов;
		ТекКратностьВзаиморасчетов = ТекСтрока.КратностьВзаиморасчетов;
	КонецЕсли;
	
	Если ТекВалютаВзаиморасчетов = Объект.ВалютаДокумента Тогда
		ТекСтрока.СуммаПлатежа = ТекСтрока.СуммаВзаиморасчетов;
	Иначе
		ДатаКурса = ?(ЗначениеЗаполнено(ТекСтрока.ДатаКурса), ТекСтрока.ДатаКурса, Объект.Дата);
		ТекСтрока.СуммаПлатежа = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.СуммаВзаиморасчетов,
			ТекВалютаВзаиморасчетов, Объект.ВалютаДокумента,
			ТекКурсВзаиморасчетов, ДатаКурса, ТекКратностьВзаиморасчетов,,,
			уатОбщегоНазначенияТиповыеКлиент.ДопПараметрыКурсаВалюты(Объект,, ДатаКурса));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуВзаиморасчетовПоСуммеПлатежа(ТекСтрока, флТЧЗаказы = Ложь)
	Если флТЧЗаказы = Истина Тогда
		мсвСтрокиРасшифровки = Объект.РасшифровкаПлатежа.НайтиСтроки(Новый Структура("ID", СтрокаПлатеж.ID));
		Если мсвСтрокиРасшифровки.Количество() = 0 Тогда
			ТекВалютаВзаиморасчетов    = ПредопределенноеЗначение("Справочник.Валюты.ПустаяСсылка");
			ТекКурсВзаиморасчетов      = 1;
			ТекКратностьВзаиморасчетов = 1;
		Иначе
			ТекВалютаВзаиморасчетов    = мсвСтрокиРасшифровки[0].ВалютаВзаиморасчетов;
			ТекКурсВзаиморасчетов      = мсвСтрокиРасшифровки[0].КурсВзаиморасчетов;
			ТекКратностьВзаиморасчетов = мсвСтрокиРасшифровки[0].КратностьВзаиморасчетов;
		КонецЕсли;
	Иначе
		ТекВалютаВзаиморасчетов    = ТекСтрока.ВалютаВзаиморасчетов;
		ТекКурсВзаиморасчетов      = ТекСтрока.КурсВзаиморасчетов;
		ТекКратностьВзаиморасчетов = ТекСтрока.КратностьВзаиморасчетов;
	КонецЕсли;
	
	Если ТекВалютаВзаиморасчетов = Объект.ВалютаДокумента Тогда
		ТекСтрока.СуммаВзаиморасчетов = ТекСтрока.СуммаПлатежа;
	Иначе
		ДатаКурса = ?(ЗначениеЗаполнено(ТекСтрока.ДатаКурса), ТекСтрока.ДатаКурса, Объект.Дата);
		ТекСтрока.СуммаВзаиморасчетов = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.СуммаПлатежа,
			Объект.ВалютаДокумента, ТекВалютаВзаиморасчетов,
			ДатаКурса, ТекКурсВзаиморасчетов,, ТекКратностьВзаиморасчетов,,
			уатОбщегоНазначенияТиповыеКлиент.ДопПараметрыКурсаВалюты(Объект,, ДатаКурса));
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЗаполнитьСписокЗначенийСтавкиНДСНаСервере()
	Возврат Перечисления.СтавкиНДС.ПолучитьДанныеВыбора(Новый Структура());
КонецФункции

&НаКлиенте
Процедура ЗаполнитьСтавкуНДСЗавершение(Результат, ДопПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Для каждого ТекСтрока Из Объект.РасшифровкаПлатежа Цикл
		ТекСтрока.СтавкаНДС = Результат.Значение.Значение;
		
		ПересчитатьСуммуНДС(ТекСтрока);
	КонецЦикла;
	РассчитатьИтоги();
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТЧ(Результат, ДопПараметры) Экспорт
	Если Результат = Неопределено ИЛИ Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат = КодВозвратаДиалога.ОК Тогда
		Пока Объект.РасшифровкаПлатежа.Количество() > 1 Цикл
			Объект.РасшифровкаПлатежа.Удалить(Объект.РасшифровкаПлатежа.Количество()-1);
		КонецЦикла;
		Объект.РасшифровкаПлатежа[0].ДоговорКонтрагента = Неопределено;
		Объект.РасшифровкаПлатежа[0].Сделка = Неопределено;
		Объект.РасшифровкаПлатежа[0].ВалютаВзаиморасчетов = Неопределено;
		Объект.РасшифровкаПлатежа[0].КурсВзаиморасчетов = 1;
		Объект.РасшифровкаПлатежа[0].КратностьВзаиморасчетов = 1;
		Объект.РасшифровкаПлатежа[0].СуммаПлатежа = 0;
		Объект.РасшифровкаПлатежа[0].СуммаВзаиморасчетов = 0;
		Объект.РасшифровкаПлатежа[0].СуммаНДС = 0;
		Объект.РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств = Неопределено;
		СтрокаПлатеж = Объект.РасшифровкаПлатежа[0];
		
		Объект.Заказы.Очистить();
		
		РассчитатьИтоги();
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьТЧЗаказыПоСтрокеРасшифровки(флПриИзменении = Ложь)
	Если РазнесениеПоЗаказам И СтрокаПлатеж <> Неопределено Тогда
		Элементы.Заказы.ОтборСтрок = Новый ФиксированнаяСтруктура("ID", СтрокаПлатеж.ID);
		
		мсвЗаказыВСделке = уатОбщегоНазначения_проф.ПолучитьЗаказыВСделке(СтрокаПлатеж.Сделка);
		Элементы.ЗаказыЗаказНаТС.СписокВыбора.ЗагрузитьЗначения(мсвЗаказыВСделке);
		Если флПриИзменении Тогда
			мсвСтрокиУдалить = Новый Массив;
			Сч = Объект.Заказы.Количество()-1;
			Пока Сч >= 0 Цикл
				ТекСтрокаЗаказ = Объект.Заказы[Сч];
				Если ТекСтрокаЗаказ.ID = СтрокаПлатеж.ID И мсвЗаказыВСделке.Найти(ТекСтрокаЗаказ.ЗаказНаТС) = Неопределено Тогда
					Объект.Заказы.Удалить(Сч);
				КонецЕсли;
				Сч = Сч - 1;
			КонецЦикла;
		КонецЕсли;
		
		Элементы.Заказы.Доступность = (ВидВзаиморасчетовПоСчетамНакладным(СтрокаПлатеж) И мсвЗаказыВСделке.Количество() > 0);
		ОтобразитьТекстПредупрежденияЗаказы();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ВидВзаиморасчетовПоСчетамНакладным(ТекСтрока)
	ВидВзаиморасчетов = уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(ТекСтрока.ДоговорКонтрагента, "ВедениеВзаиморасчетов");
	ВидВзаиморасчетовПоСчетамНакладным =
		(ВидВзаиморасчетов = ПредопределенноеЗначение("Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам")
		ИЛИ ВидВзаиморасчетов = ПредопределенноеЗначение("Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоНакладным"));
		
	Возврат ВидВзаиморасчетовПоСчетамНакладным;
КонецФункции

&НаКлиенте
Процедура ОтобразитьТекстПредупрежденияЗаказы()
	ТекстЗаголовка = "Разнесение по заказам";
	ТекстПредупреждения = "";
	
	Если ВидВзаиморасчетовПоСчетамНакладным(СтрокаПлатеж) Тогда
		Если ЗначениеЗаполнено(СтрокаПлатеж.Сделка) Тогда
			ТекстЗаголовка = ТекстЗаголовка + ПредставлениеСделкиДляЗаголовкаРазнесенияПоЗаказам(СтрокаПлатеж.Сделка);
			
			мсвСтрокЗаказы = Объект.Заказы.НайтиСтроки(Новый Структура("ID", СтрокаПлатеж.ID));
			Если мсвСтрокЗаказы.Количество() = 0 Тогда
				ТекстЗаголовка = ТекстЗаголовка + " (Не заполнено)";
			Иначе
				ТекстЗаголовка = ТекстЗаголовка + СтрШаблон(" (%1)", мсвСтрокЗаказы.Количество());
				
				ИтогЗаказыСуммаПлатежа = 0;
				Для Каждого ТекСтрокаЗаказ Из мсвСтрокЗаказы Цикл
					ИтогЗаказыСуммаПлатежа = ИтогЗаказыСуммаПлатежа + ТекСтрокаЗаказ.СуммаПлатежа;
				КонецЦикла;
				Если ИтогЗаказыСуммаПлатежа < СтрокаПлатеж.СуммаПлатежа Тогда
					//ТекстПредупреждения = "Разнесенная сумма меньше суммы платежа. Остаток разнесения не будет учитан в расчетах по заказам.";
					ТекстПредупреждения = СтрШаблон("Разнесено %1 из %2 %3. Остаток платежа будет отнесен на сделку в целом.",
						ИтогЗаказыСуммаПлатежа, СтрокаПлатеж.СуммаПлатежа, Объект.ВалютаДокумента);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	Иначе
		ТекстЗаголовка = ТекстЗаголовка + " (недоступно)";
		ТекстПредупреждения = "Разнесение доступно при ведении взаиморасчетов ""По счетам"" или ""По накладным"" по заказам, указанным в сделке.";
	КонецЕсли;
	
	Элементы.ДекорацияРазнесениеДоступно.Заголовок = ТекстПредупреждения;
	Элементы.ДекорацияРазнесениеДоступно.Видимость = НЕ ПустаяСтрока(ТекстПредупреждения);
	
	Элементы.ГруппаРаспределениеПоЗаказам.Заголовок = ТекстЗаголовка;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПредставлениеСделкиДляЗаголовкаРазнесенияПоЗаказам(Сделка)
	Возврат СтрШаблон(" для сделки %1 №%2", Сделка.Метаданные().Синоним, Сделка.Номер);
КонецФункции

&НаСервере
Процедура ОбновитьКурсКратностьВТЧ()
	Для Каждого ТекСтрока Из Объект.РасшифровкаПлатежа Цикл
		СтруктураКурсаВзаиморасчетов = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(ТекСтрока.ВалютаВзаиморасчетов,
			?(ЗначениеЗаполнено(ТекСтрока.ДатаКурса), ТекСтрока.ДатаКурса, Объект.Дата), Объект);
		ТекСтрока.КурсВзаиморасчетов      = СтруктураКурсаВзаиморасчетов.Курс;
		ТекСтрока.КратностьВзаиморасчетов = СтруктураКурсаВзаиморасчетов.Кратность;
	КонецЦикла;
КонецПроцедуры

// Процедура выполняет пересчет в табличной части документа после изменений 
// в форме "Цены и валюта".Выполняется пересчет колонок: цена, скидка, сумма,
// сумма НДС, всего.
//
&НаКлиенте
Процедура ОбработатьИзмененияПоКнопкеЦеныИВалюты(Знач Оповещение, Знач ВалютаРасчетовПередИзменением, ПересчитатьЦены = Ложь)
	
	// 1. Формируем структуру параметров для заполнения формы "Цены и Валюта".
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ВалютаРасчетов",		 СтрокаПлатеж.ВалютаВзаиморасчетов);
	СтруктураПараметров.Вставить("КурсРасчетов",         СтрокаПлатеж.КурсВзаиморасчетов);
	СтруктураПараметров.Вставить("КратностьРасчетов",    СтрокаПлатеж.КратностьВзаиморасчетов);
	СтруктураПараметров.Вставить("ДатаКурса",            СтрокаПлатеж.ДатаКурса);
	СтруктураПараметров.Вставить("СуммаВзаиморасчетов",  СтрокаПлатеж.СуммаВзаиморасчетов);
	СтруктураПараметров.Вставить("ДатаКурса",            ?(ЗначениеЗаполнено(СтрокаПлатеж.ДатаКурса),
		СтрокаПлатеж.ДатаКурса, Объект.Дата));
	СтруктураПараметров.Вставить("Контрагент",			 Объект.Контрагент);
	СтруктураПараметров.Вставить("Договор",				 СтрокаПлатеж.ДоговорКонтрагента);
	СтруктураПараметров.Вставить("Организация",			 Объект.Организация);
	СтруктураПараметров.Вставить("ДатаДокумента",		 Объект.Дата);
	СтруктураПараметров.Вставить("ПерезаполнитьЦены",	 Ложь);
	СтруктураПараметров.Вставить("ПересчитатьЦены",		 ПересчитатьЦены);
	СтруктураПараметров.Вставить("БылиВнесеныИзменения", Ложь);
	СтруктураПараметров.Вставить("ДопПараметрыКурсаВалюты", уатОбщегоНазначенияТиповыеКлиент.ДопПараметрыКурсаВалюты(
		Объект,, СтрокаПлатеж.ДатаКурса));
		
	ОткрытьФорму("ОбщаяФорма.ФормаЦеныИВалюта", СтруктураПараметров,,,,,
		Новый ОписаниеОповещения("ОбработатьИзмененияПоКнопкеЦеныИВалютыЗавершение", ЭтотОбъект,
		Новый Структура("ВалютаРасчетовПередИзменением, Оповещение", СтрокаПлатеж.ВалютаВзаиморасчетов, Оповещение)),
		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры // ОбработатьИзмененияПоКнопкеЦеныИВалюты()

&НаКлиенте
Процедура ОбработатьИзмененияПоКнопкеЦеныИВалютыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
    ВалютаРасчетовПередИзменением = ДополнительныеПараметры.ВалютаРасчетовПередИзменением;
    Оповещение                    = ДополнительныеПараметры.Оповещение;
	СтруктураЦеныИВалюта          = Результат;
    
    // 3. Перезаполняем табличную часть "Номенклатура", если были внесены изменения в форме "Цены и Валюта".
    Если ТипЗнч(СтруктураЦеныИВалюта) = Тип("Структура") Тогда
		ДопПараметры = Новый Структура("ПредКурс, ПредКратность, Курс, Кратность, ПредДатаКурса",
			СтрокаПлатеж.КурсВзаиморасчетов, СтрокаПлатеж.КратностьВзаиморасчетов, СтруктураЦеныИВалюта.КурсРасчетов,
			СтруктураЦеныИВалюта.КратностьРасчетов, СтрокаПлатеж.ДатаКурса);
		
		Если СтруктураЦеныИВалюта.Свойство("ВалютаРасчетов") И СтруктураЦеныИВалюта.Свойство("КурсРасчетов")
			И СтруктураЦеныИВалюта.Свойство("КратностьРасчетов") И СтруктураЦеныИВалюта.Свойство("ДатаКурса") Тогда
			
            СтрокаПлатеж.КурсВзаиморасчетов      = СтруктураЦеныИВалюта.КурсРасчетов;
            СтрокаПлатеж.КратностьВзаиморасчетов = СтруктураЦеныИВалюта.КратностьРасчетов;
			СтрокаПлатеж.ВалютаВзаиморасчетов    = СтруктураЦеныИВалюта.ВалютаРасчетов;
			СтрокаПлатеж.ДатаКурса               = СтруктураЦеныИВалюта.ДатаКурса;
        КонецЕсли;
		
		// Пересчитываем суммы по курсу.
		ДатаКурса = ?(ЗначениеЗаполнено(СтрокаПлатеж.ДатаКурса), СтрокаПлатеж.ДатаКурса, Объект.Дата);
		СтрокаПлатеж.СуммаВзаиморасчетов = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(
			СтрокаПлатеж.СуммаВзаиморасчетов,
			ВалютаРасчетовПередИзменением, СтрокаПлатеж.ВалютаВзаиморасчетов,
			ДопПараметры.ПредКурс,         СтрокаПлатеж.КурсВзаиморасчетов,
			ДопПараметры.ПредКратность,    СтрокаПлатеж.КратностьВзаиморасчетов,,
			уатОбщегоНазначенияТиповыеКлиент.ДопПараметрыКурсаВалюты(Объект,, ДатаКурса));
			
		РасшифровкаПлатежаСуммаВзаиморасчетов1ПриИзменении(Неопределено);
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры // ОбработатьИзмененияПоКнопкеЦеныИВалюты()

#КонецОбласти


#Область ИсполняемаяЧастьМодуля

ОтветПередЗаписью = Ложь;

#КонецОбласти
