
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если Не ЗавершениеРаботы Тогда
		ПриЗакрытииНаСервере();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьПервоначальнуюНастройку(Команда)
	ПараметрыФормы = Новый Структура("ПервоначальнаяНастройка", Истина);
	ОткрытьФорму("Обработка.уатУстановкаПравИНастроек.Форма.Форма", ПараметрыФормы);
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриЗакрытииНаСервере()
	Если ПервоначальнаяНастройкаВыполнена = Истина Тогда
		ПользовательСсылка = ПользователиКлиентСервер.АвторизованныйПользователь();
		ИдентификаторПользователяИБ = ПользовательСсылка.ИдентификаторПользователяИБ;
		ХранилищеОбщихНастроек.Сохранить("ПервыйЗапускВыполнен_" + ИдентификаторПользователяИБ,, Истина);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
